{"candidates": ["Vietnam's early elimination in the Asian Cup due to a penalty shot by Indonesia.", "Midfielder Nguyen Thanh Binh's mistake led to a penalty for Indonesia.", "Asanwi Mangkualam converted the penalty to get Indonesia ahead.", "Vietnam missed their star Nguyen Dinh Bac due to injury.", "Indonesia's strong physical play and pressing from the start.", "Goalkeeper Filip Nguyen saved a shot on target in the first minute.", "Vietnam made two substitutions in the second half but lacked accuracy in their shots.", "A first-half goal from the penalty spot earned Indonesia a highly-anticipated victory against Vietnam.", "Asnawi Mangkualam broke the deadlock from the penalty spot in the 42nd minute.", "Le Pham Thanh Long received a second yellow card for fouling Marselino Ferdinan and was subsequently sent off in stoppage time.", "Asnawi Mangkualam scored a penalty in the 42nd minute.", "Lê Pham Thành Long received a yellow card in the 90'+1' minute.", "Match ended with Indonesia defeating Vietnam 1-0.", "Indonesia wins by the minimum to Vietnam.", "The referee adds 10 minutes to the match.", "Struick hits the goal but the ball crashes against the crossbar.", "Sulaeman shoots but the ball goes too wide and misses a clear chance for Indonesia.", "Jenner's cross-shot rolls just wide of the post.", "GOOOOOOOOOL FOR INDONESIA! Bahar heads the ball into the net, they are winning near the end of the first half.", "Nguyen Binh Thanh's header from inside the area goes wide.", "Phan Tuan Tài makes an extraordinary sweep and prevents the first goal from being scored.", "Nguyen Thai Son takes the free kick but the goalkeeper clears it with his fists, ending the danger for Indonesia.", "Jordi Amat's shot goes over the crossbar, Indonesia was close.", "Asnawi Mangkualam scored the match's only goal from a penalty kick in the 42nd minute.", "Vietnam defender Le Pham Thanh Long received a second yellow card followed by a red card.", "Indonesia's goalkeeper Hernando Arri was named Player of the Match for his excellent performance.", "Indonesia earned their first points in the competition by converting a decisive penalty versus Vietnam.", "Indonesia opened the match with ferocious aggression, dominating the early stages of play.", "An early chance was thwarted by the referee as he accidentally obstructed Marselino Ferdinan’s dribble towards goal.", "Justin Hubner unleashed an impressive long throw in the 12th minute, forcing a save from Vietnam’s Nguyen.", "Indonesia were awarded a crucial penalty ahead of half time after a clumsy challenge in the box from Vietnam.", "Indonesia captain Asnawi Bahar scored the penalty, smashing it into the top left corner.", "Vietnam opted for a double substitution at half time, introducing Van Khang Khuat and Le Pham Thanh.", "Vietnam forced a great save from Indonesia’s Sutaryadi in the second half.", "Vietnam’s best opportunity came early after the break, as Van Tung Nguyen failed to convert a point-blank finish.", "Indonesian Captain Bahar was forced off the pitch in the 56th minute due to an injury.", "Vietnam’s Le Pham Thanh received a red card in the 90th minute for a sliding challenge on Ferdinan."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37]}
{"candidates": ["Mangkualam scored a penalty in the 42nd minute.", "Arhan received a yellow card in the 80th minute.", "Thanh Long Le scored in the 83rd and 90+1 minutes.", "Sayuri received a yellow card in the 90+10 minute."], "ranking": [3, 4, 1, 2]}
{"candidates": ["Vietnam placed higher on world ranking, but Indonesia had better physique and squad value.", "Vietnam’s head coach Philippe Troussier had envisioned the match as a ‘balanced battle’ during the pre-match press conference.", "In a couple of moments we will start with Vietnam vs Indonesia, a match corresponding to the group stage of the Asia Cup at the Abdullah bin Khalifa Stadium.", "This is the roster that sends the Indonesian national team to the field to look for the three points against Vietnam with the illusion of getting the victory.", "This is the roster that sends the Vietnam national team to the field to look for the three points against Indonesia with the illusion of getting the victory.", "Vietnam and Indonesia have met on a total of 27 occasions (8 wins for Vietnam, 11 draws, 8 wins for Indonesia) where the scales are all square. In goal scoring history, Vietnam has the edge with 34 goals scored to Indonesia's 31. Their last duel dates back to an international friendly in January 2023 where Vietnam beat Indonesia 2-0.", "The Vietnamese player to watch for this match will be Nguyễn Tuấn Anh, the attacking midfielder has become an important piece in the tactical scheme of his team as he is in charge of generating spaces and distributing the ball for his teammates.", "The Indonesian player to watch for this match will be Rachmat Irianto, the attacking midfielder has become an important piece in the tactical scheme of his team as he is in charge of generating spaces and distributing the ball for his teammates."], "ranking": [6, 5, 2, 4, 4, 8, 7, 3]}
{"candidates": ["Coach Philippe Troussier expressed disappointment about the defeat.", "Troussier respected the referee's decision and boosted Binh's morale during the break.", "Troussier praised his team's fight until the last second despite the loss.", "Vietnam will continue to fight for three points in their last game against Iraq.", "Vietnamese players expressed disappointment following a 0-1 loss to Indonesia.", "Vietnam descended to the bottom with zero points after two games, becoming the first team to be eliminated from the tournament.", "Indonesia defender Walsh said: 'Its a massive win for us, for all the effort we’ve put in the last couple of months and even the last couple of years. It’s positive for us, an amazing feeling to have three points in the bag.'", "Walsh commented on facing Japan next week: 'Lets just enjoy this moment! It’s a massive three points for us in this Asia cup with a tough group. Anything is possible, we go with a good feeling toward the match with Japan. They are an amazing team but we can try to do something and it will be a great experience for us.'"], "ranking": [6, 4, 5, 3, 2, 8, 1, 7]}
{"candidates": ["Indonesia's victory propelled them to third place in Group D, securing their first three points.", "Vietnam had lost 2-4 to Japan on January 14.", "Iraq are leading Group D after beating Japan 2-1 earlier on the same day.", "Indonesia got their first win against Vietnam at the national team level since 2016.", "Indonesia will play Japan in the final group-stage matchday next Wednesday while Vietnam will face Iraq.", "Match took place at Abdullah bin Khalifa Stadium in Doha, Qatar.", "Attendance for the match was 7,253 spectators.", "The match kicks off, Vietnam and Indonesia play date 2 of the group stage.", "The Vietnam vs Indonesia match will be played at Abdullah bin Khalifa Stadium, in Doha, Qatar. The kick-off is scheduled at 9:30 am ET."], "ranking": [4, 2, 3, 1, 5, 8, 7, 6, 9]}
{"candidates": ["Vietnam lost their opening fixture 4-2 to Japan.", "Indonesia lost their opening fixture 3-1 to Iraq.", "Vietnam has a history of advancing despite losing initial group stage matches, as seen in 2019.", "Indonesia has historically struggled in the Asian Cup, losing their second match in each of their previous four group stage campaigns.", "Vietnam has not won in their last three matches in all competitions.", "Indonesia has been defensively weak, conceding multiple goals in three of their previous four matches."], "ranking": [5, 4, 2, 1, 6, 3]}
{"candidates": ["Vietnam's captain Do Hung Dung is one cap away from 40.", "Pratama Arhan made his 40th appearance for Indonesia in their opener.", "Nguyen Dinh Bac and Pham Tuan Hai scored for Vietnam in their match against Japan."], "ranking": [2, 1, 3]}
{"candidates": ["Patson Daka scored a late equaliser to salvage a 1-1 draw for 10-man Zambia.", "Simon Msuva's 11th minute strike handed Tanzania the lead.", "Patson Daka scored a late equaliser to salvage a 1-1 draw for 10-man Zambia.", "Simon Msuva’s 11th minute strike handed Tanzania the lead.", "Daka’s explosive header in the 88th minute ensured a share of the spoils.", "Zambia were held to a 1-1 draw with Tanzania in their Africa Cup of Nations Group F match on Sunday evening.", "Patson Daka scored a late equaliser to salvage a 1-1 draw for 10-man Zambia.", "Simon Msuva scored an early goal for Tanzania in the 11th minute.", "Rodrick Kabwe scored for Zambia in the 44th minute."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9]}
{"candidates": ["Kings Kangwa scored from 25 yards in the match against Congo DR.", "Tanzania's Adel Amrouche was suspended for eight matches after making insulting remarks about Morocco.", "Novatus Miroshi was sent off in the final 20 minutes against Morocco."], "ranking": [2, 1, 3]}
{"candidates": ["Troubled Tanzania lock horns with Zambia in a fixture they must at least get a point to avoid early exit from the ongoing 2023 Africa Cup of Nations.", "The Taifa Stars lost their opening game 3-0 to Morocco and got their youngster Novatus Miroshi sent off later in the second half.", "In the aftermath, their coach Adel Amrouche was suspended for eight matches by CAF for his anti-Morocco comments which prompted the TFF to sack him.", "This leaves the East African side without a head coach ahead of this clash and the suspension of Amrouche came with a $10,000 fine for the federation.", "Meanwhile, Zambia who drew 1-1 with DR Congo will fancy their chances against the Taifa Stars as they aim to end a winless run in the Afcon since 2012 when they won the title."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Tanzania were denied a first win at the African Cup of Nations courtesy of Zambia's late equaliser."], "ranking": [1]}
{"candidates": ["Sunday's results left Morocco top with four points, the Congolese and Zambians on two points and Tanzania bottom on one, after two games each.", "Tanzania had failed to win on their previous finals appearances in 1980 and 2019 and were not given much chance at the tournament in the Ivory Coast, especially after coach Adel Amrouche was handed an eight-match suspension on Friday.", "Sunday’s results left Morocco top with four points, the Congolese and Zambians on two points and Tanzania bottom on one, after two games each.", "Tanzania had failed to win on their previous finals appearances in 1980 and 2019 and were not given much chance at the tournament in the Ivory Coast, especially after coach Adel Amrouche was handed an eight-match suspension on Friday.", "Zambia are winless in the Afcon finals since 2012 when they won the trophy under Renard Herve. (D6, L1)", "Taifa Stars are still looking for their first win at the Afcon finals with this being their third time to play at the tournament.", "Defeat against Chipolopolo will mean four straight defeats for the Taifa Stars at the Afcon.", "The Taifa Stars failed to score in any of their three recent losses, and haven’t netted more than a single goal in any of their last 13 matches!", "Zambia failed to score in only one of their last nine meetings with Tanzania.", "The match ended with a 1-1 draw.", "Zambia played with 10 men."], "ranking": [10, 8, 10, 8, 6, 5, 4, 3, 2, 1, 9]}
{"candidates": ["Netherlands’ Donyell Malen’s own goal after five minutes 48 seconds was the earliest in UEFA European Championship history.", "Marcel Sabitzer became the first Austrian to play 10 matches at the UEFA European Championship, scoring his first goal in the competition from his 22nd shot.", "Austria scored their sixth goal at Euro 2024, their most in any edition of the UEFA European Championship and their most in a major tournament (World Cup/Euros) since the 1978 World Cup (7)."], "ranking": [1, 3, 2]}
{"candidates": ["Few gave Austria much hope before the match, but they remarkably progressed to the knockout stages as Group D winners.", "Austria held key midfielders Christoph Baumgartner and Konrad Laimer back for fear of suspension.", "Ralf Rangnick emphasized Austria's chances of beating any team if they made it through the group stage."], "ranking": [1, 3, 2]}
{"candidates": ["Playing their final Group F fixture on Tuesday evening, the Netherlands are within a point of guaranteeing progress to Euro 2024's knockout stages.", "Back-up striker Brian Brobbey has now recovered from a hamstring injury sustained in training last week.", "Both Brobbey and Wout Weghorst will be hoping to displace Memphis Depay up front, following the latter's underwhelming displays so far.", "Head coach Ronald Koeman may opt for continuity in the final third, with Depay spearheading a 4-2-3-1 formation.", "Cody Gakpo, Xavi Simons, and either Jeremie Frimpong or Donyell Malen are expected to provide support from behind.", "Tijjani Reijnders is set to keep his place in midfield, though Jerdy Schouten and Joey Veerman could be paired if Koeman moves Reijnders further forward.", "Virgil van Dijk will join Nathan Ake, Stefan de Vrij, and Denzel Dumfries in the Dutch back four unless changes are made.", "Bart Verbruggen has established himself as the Netherlands' number one goalkeeper, starting nine of the last ten matches and keeping six clean sheets.", "Austria aimed to end a 34-year losing streak against Netherlands", "Austria had lost their last seven encounters with Netherlands", "Netherlands had scored at least twice in their last seven matches against Austria", "Netherlands were looking to extend their unbeaten record in group-stage fixtures at major tournaments to 12 matches"], "ranking": [12, 9, 8, 7, 6, 5, 4, 3, 2, 11, 10, 1]}
{"candidates": ["Ralf Rangnick praised his team's energy and performance.", "Ronald Koeman expressed regret over the Netherlands' poor opening spell.", "Ralf Rangnick’s men finish top of Group D at Euro 2024 after a fine win on Matchday 3.", "Ronald Koeman's Netherlands team looked like lots of spare parts haphazardly thrown together rather than a cohesive team.", "Austria's high-octane, eye-catching football caught the imagination of neutrals and has yielded results.", "Austria look capable of troubling anyone in the knockout stages.", "Ronald Koeman criticized his team's lack of control and aggression.", "Ralf Rangnick praised his team's performance and the depth of his squad.", "Austria now faces the second-placed team from Group F.", "The Netherlands have qualified for the knockout stages as a best third-placed side and will face England if the Three Lions top Group C.", "Ronald Koeman was helpless to prevent Austria's early dominance.", "Ralf Rangnick's young, hungry side stormed past the Dutch to secure top spot in Group D.", "Austria’s performances suggest that for the United players, disrespecting Rangnick was a defense-mechanism.", "Austria's victory means they finished top of Group D.", "Depay is closing in on the Netherlands' goal record.", "Austria will face the runners up in Group F in the next round.", "The Netherlands could face England in the last 16 if England wins Group C.", "Austria's performance has marked them as dark horses in the tournament.", "Marcel Sabitzer expressed his satisfaction with the team's performance, stating, 'When you win like that, win the group, score the winning goal, it doesn't get any better than that.'", "Dutch captain Virgil van Dijk described the match as 'a very bad match, in all respects,' and criticized the team's weak start in possession and duels."], "ranking": [14, 10, 6, 18, 12, 11, 9, 8, 16, 15, 7, 2, 5, 1, 17, 13, 4, 3, 19, 20]}
{"candidates": ["Austria topped Group D, with the Netherlands finishing third.", "Austria will face the runners-up from Group F in the knockout stage.", "Patrick Wimmer will miss the next round due to a booking.", "Austria have reached the knockout stages in their last two appearances at the UEFA European Championships.", "Austria have won consecutive UEFA European Championship games for the first time.", "Netherlands lost their first group stage game at the UEFA European Championships since 2012.", "Austria ended a run of seven consecutive defeats to the Netherlands in all competitions.", "Austria will play the runners-up from Group F in the last 16.", "Netherlands are guaranteed a place in the knockout stage despite finishing third in their group.", "Austria's counter-pressing strategy was highly effective.", "Netherlands manager Ronald Koeman made a substitution after just 35 minutes to change the dynamics of the game.", "Austria's victory marks their first win against Netherlands since May 1990.", "The result means France, Portugal, Germany, and Spain are all now in one side of the knock-out draw.", "The match saw the seventh own goal of the tournament, which is on course to match the Euro 2020 haul of 11.", "Marcel Sabitzer was awarded UEFA's Player of the Match.", "Austria's place as Group D winners was confirmed after France drew 1-1 with Poland.", "The match was described as a rollercoaster and potentially the game of the tournament so far.", "Austria's aggressive and hard-running approach propelled them into the round of 16 of the European Championship.", "Austria topped Group D with six points, one ahead of second-placed France and two ahead of the Netherlands.", "The Dutch advanced as one of the four best third-place finishers despite the loss."], "ranking": [17, 14, 10, 16, 13, 12, 1, 15, 8, 6, 9, 2, 5, 11, 4, 7, 3, 18, 19, 20]}
{"candidates": ["Memphis Depay is now just four goals off the all-time scoring record for the Netherlands with 46 goals.", "Ralf Rangnick made four changes to the starting lineup, including resting key players Christoph Baumgartner and Konrad Laimer."], "ranking": [1, 2]}
{"candidates": ["Zimbabwe climbed to the top of Group J in the 2025 Africa Cup of Nations Qualifiers after claiming a 1-0 victory over Namibia.", "The match’s only goal came in the first half when Zimbabwe was awarded a penalty on the hour-mark after Jordan Zemura was fouled inside the box.", "Khama Billiat converted the penalty, although his weak effort appeared saveable by Namibia goalkeeper Edward Maova.", "Namibia pressed forward in the second half in search of an equaliser, but Zimbabwe goalkeeper Washington Arubi made several saves to preserve the lead.", "Khama Billiat converted a penalty in the first half to help Zimbabwe beat Namibia 1-0.", "The penalty was awarded after Jordan Zemura was fouled inside the box.", "Namibia had a chance to equalize but hit the upright.", "Daniel Msendami almost doubled the lead for Zimbabwe but also hit the upright.", "Douglas Mapfumo's shot was saved by the Namibian goalkeeper in the final stages of the match.", "Khama Billiat scored the winning goal for Zimbabwe with a penalty in the 34th minute.", "Kennedy Amutenya of Namibia hit the woodwork with a close-range header from a corner.", "Prins Tjiueza of Namibia hit the woodwork with a left-footed strike from the middle of the goal area.", "Zimbabwe scored the winning goal through Khama Billiat in the 34th minute from the penalty spot.", "Zimbabwe Warriors defeated Namibia 1-0 in the 2025 Afcon Qualifier match held at Orlando stadium in South Africa.", "Khama Billiat scored the winning penalty for Zimbabwe in the 34th minute.", "Edward Maova made three saves for Namibia but could not stop the penalty.", "Namibia hit the woodwork multiple times but failed to score.", "Washington Arubi made five saves to keep a clean sheet for Zimbabwe."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]}
{"candidates": ["Katua scored in the 24th minute for Namibia.", "Kalula scored in the 86th minute for Zimbabwe.", "Billiat scored a penalty in the 34th minute for Zimbabwe.", "Hachiro received a red card in the 88th minute."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Namibia has requested that the match against Zimbabwe be played behind closed doors at the Orlando Stadium in Johannesburg due to financial challenges.", "The Zimbabwe Football Association (ZIFA) spokesperson Mike Madoda confirmed that no fans will be allowed for either team.", "This decision could be a strategic ploy by Namibia to hinder the Warriors from receiving overwhelming support from millions of Zimbabweans residing in South Africa.", "A similar tactic was employed by Bafana Bafana in June when they hosted their World Cup qualifier against Zimbabwe in Bloemfontein."], "ranking": [3, 2, 1, 4]}
{"candidates": ["Namibia were forced to move their home games to South Africa due to unsuitable stadiums in Windhoek.", "The match will be played behind closed doors at the request of Namibia.", "Namibia's participation in the next edition of the Africa Cup of Nations is in serious jeopardy unless they can turn their form around.", "Namibia have beaten Zimbabwe in six straight encounters prior to this match.", "Zimbabwe have had a mixed return to international football since their ban imposed by FIFA was lifted last year.", "Zimbabwe will enter this match seeking to avoid a fourth consecutive outing without a victory.", "Michael Nees will need to address Zimbabwe's lack of attacking output.", "Zimbabwe's new boss has 10 players in his squad that have either previously played or currently apply their trade in the South African PSL.", "Namibia set for crucial 2025 Africa Cup of Nations (AFCON) Group J qualifying matches against Zimbabwe on October 10 and October 14, 2024.", "Namibia looks to review their chances against Zimbabwe after losing their opening two matches against Cameroon and Kenya.", "Both matches against Zimbabwe will take place in South Africa on neutral ground and are expected to be closely contested due to the rivalry between the two nations.", "Namibia’s squad and tactics are crucial as they aim to qualify for AFCON 2025.", "The team will train in South Africa to refine their strategy and prepare for the challenges ahead.", "Victory against Zimbabwe could propel Namibia into a strong position, while defeat would jeopardize their chances.", "Namibia must win at least one of this month’s ties to revive their qualification hopes.", "The Brave Warriors of Namibia are gearing up for a pivotal moment in their AFCON 2025 qualifying campaign, as they get set to take on the Warriors of Zimbabwe in back-to-back fixtures on Thursday 10 and Monday 14 October.", "Head coach Collin Benjamin has unveiled his final squad for these crucial encounters, set to be held at the Orlando Stadium in South Africa.", "Vitapi Ngaruka makes his return to the national team, while Rivaldo Prins, Petrus Kamati and Mbakondja Tjahikika have also been included for their first call-ups in the qualifiers.", "Reflecting on the squad, Benjamin emphasized the significance of these matches: 'The games against Zimbabwe are make-or-break for us. We need to approach them with the same intensity and focus as we did in previous matches against Cameroon and Kenya. Every player will need to give their best as we aim to bring home positive results.'", "Namibia’s qualification hopes have been thrown into uncertainty following their 2-1 'home' defeat against Kenya at the Orlando Stadium in Soweto, South Africa, earlier in September.", "With only two nations from each qualifying group securing a spot in the continental showpiece, Namibia will have to dig deep and muster all their strength and determination to turn their fortunes around."], "ranking": [14, 18, 2, 5, 12, 7, 11, 15, 9, 16, 10, 13, 8, 6, 4, 3, 1, 17, 19, 20, 21]}
{"candidates": ["The victory sees Zimbabwe move to the top of Group J with five points, one point ahead of Kenya and Cameroon, who are both on four points.", "Namibia suffered their third consecutive loss in the group.", "The two teams will face off again on Monday at the same venue in South Africa, with the return fixture expected to attract a larger crowd.", "Michael Nees celebrated his first win as Zimbabwe's coach following his appointment in September.", "Despite the win, Zimbabwe's performance was not convincing as they struggled with ball possession and creativity.", "This marks the Warriors' first win after opening with two consecutive goalless draws last month.", "Collin Benjamin praised his team's spirited performance despite the loss.", "Michael Nees guided Zimbabwe to their first three points of the campaign and top place in the points table."], "ranking": [5, 2, 8, 6, 3, 4, 7, 1]}
{"candidates": ["The game was played at Orlando Stadium in Johannesburg, South Africa, as both Zimbabwe and Namibia’s home stadiums had been condemned by the Confederation of African Football (CAF).", "The match was played at an empty Orlando Stadium in Soweto, Johannesburg, South Africa.", "With the victory, Zimbabwe now tops Group J with five points, ahead of Kenya and Cameroon.", "Zimbabwe has taken the lead in Group J of the African Cup of Nations qualifiers for Morocco next year on five points after securing a 1-0 victory over Namibia.", "This victory places Namibia at the bottom of the group after losing their first two matches against Cameroon and Kenya.", "Zimbabwe currently holds the top position in Group J until the outcome of the match between Kenya and Cameroon, which will take place at the Japoma Stadium in Douala on Friday.", "Both Zimbabwe and Namibia will face each other again in a few days in South Africa on neutral ground.", "This upcoming match is expected to be closely contested due to the rivalry between the two nations.", "Namibia must win at least to revive their qualification hopes.", "Zimbabwe extends their unbeaten run in the African Cup of Nations 2025 qualifiers."], "ranking": [6, 5, 8, 9, 4, 7, 3, 2, 1, 10]}
{"candidates": ["Namibia have called up several players who are currently based in South Africa for this month's qualifiers.", "Zimbabwe's skipper Marvelous Nakamba has returned to the national squad after recovering from a knee injury and subsequent surgery.", "Khama Billiat made his return from international retirement last month."], "ranking": [2, 1, 3]}
{"candidates": ["Wales managed to hold on through extra-time in a competitive match for the first time in their history."], "ranking": [1]}
{"candidates": ["Kieffer Moore was a consistent threat in the air and was denied a couple of times from the goalkeeping heroics of Wojciech Szczesny.", "Ben Davies had a goal disallowed on the stroke of half-time through a marginal offside.", "Poland, led by Lewandowski, scored a perfect five in the penalty shootout.", "Daniel James' penalty was saved by Wojciech Szczesny, sending Poland to Euro 2024.", "Chris Mepham was sent off for a second bookable offence in the final seconds of the match.", "Daniel James missed the crucial penalty in the shootout to hand Poland victory.", "Chris Mepham was sent off for a second yellow card in the final seconds of extra-time.", "Wojciech Szczesny made a key save to deny Kieffer Moore and stopped Daniel James' penalty.", "Poland won 5-4 on penalties to secure a place at the Euro 2024 finals.", "Robert Lewandowski set the tone with the first spot-kick, sending Danny Ward the wrong way.", "Krzysztof Piatek fired in Poland’s last penalty before Daniel James’s penalty was repelled.", "Chris Mepham picked up his second yellow card and left the field to a hero’s ovation.", "Ben Davies had a first-half headed goal disallowed for offside.", "Wojciech Szczesny made an outstanding left-hand save from Kieffer Moore’s effort.", "Jakub Piotrowski went close for Poland with a curling shot from the edge of the box in extra time.", "Connor Roberts left the field in tears due to an injury.", "Wales' Euro 2024 qualification hopes were ended in a penalty shootout 5-4 against Poland following a goalless draw.", "Daniel James' penalty was saved in the bottom left corner, leading to Poland's victory.", "Wales lost a penalty shootout 5-4 against Poland following a goalless draw.", "Chris Mepham was sent off in added time of extra time for a second yellow card.", "Ben Davies' goal was disallowed by VAR for offside.", "Kieffer Moore had a looping header well saved by Szczesny.", "Jakub Piotrowski shot just over the bar in extra time.", "Robert Lewandowski scored the first penalty for Poland.", "Sebastian Szymanski, Przemyslaw Frankowski, Nicola Zalewski, and Krzysztof Piatek scored penalties for Poland.", "Ben Davies, Kieffer Moore, Harry Wilson, and Neco Williams scored penalties for Wales.", "Szczesny saved James' penalty to secure Poland's victory.", "Dan James' penalty was saved in the shootout, resulting in Wales' Euro 2024 hopes ending.", "Wales had a goal ruled out during the match.", "Chris Mepham was sent off in the dying moments of extra time for his second yellow card.", "Ben Davies thought he had headed Wales in front before the break, but VAR ruled out his goal.", "The match ended 0-0 after 120 minutes and was decided by penalties, with Poland winning 5-4."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32]}
{"candidates": ["James (55'), Mepham (98'), Mepham (120+1')", "Piotrowski (50'), Zalewski (72')", "Poland win 5-4 on penalties"], "ranking": [2, 3, 1]}
{"candidates": ["Wales manager Page said 'there's nerves' ahead of the Euro 2024 qualifier against Poland.", "Rob Page admitted it would have been foolish not to practise penalties.", "Michal Probierz, the Poland manager, emphasized that finals and playoffs aren’t played, they’re won.", "Rob Page was adamant that Wales would not have any kind of inferiority complex against Poland.", "Wales are now unbeaten in seven – only once have they recorded a longer streak without defeat under Rob Page (nine games between September 2021 and March 2022 – W4 D5).", "Robert Lewandowski has been directly involved in 24 goals in his last 27 appearances for Poland (16 goals, eight assists), although he’s not scored in any of his three games against Wales to date.", "Wales have only lost one of their last 15 Euro qualifiers played at the Cardiff City Stadium (W10 D4).", "Poland have lost three of their four Euro qualifier matches played away from home since the start of 2023 (W1).", "Robert Lewandowski has not scored in any of his three previous games against Wales.", "Harry Wilson has six goal involvements in nine Euro 2024 qualifying appearances (three goals, three assists) – the most of any Welsh player in the qualifiers."], "ranking": [8, 6, 9, 5, 2, 1, 4, 7, 10, 3]}
{"candidates": ["Wales are 90 minutes away from Euro 2024 and must face Poland in the Path A play-off final at the Cardiff City Stadium on Tuesday night.", "David Brooks set Wales on the path to a 4-1 victory in the semi-finals against Finland with a third-minute goal.", "Neco Williams and Brennan Johnson scored for Wales, with Dan James adding a late fourth goal.", "Poland thrashed 10-man Estonia 5-1 in their semi-final.", "Keeping Robert Lewandowski quiet will be Wales's primary aim.", "Wales face Poland in the play-off final for a place at this summer's Euros.", "Robert Lewandowski remains Poland's biggest threat to Wales qualifying.", "Rhys Ifans provided motivation for the Wales team.", "Robert Lewandowski has scored 82 goals for Poland.", "Manager Rob Page declared they have planned for Lewandowski.", "Lewandowski did not score in Poland's 5-1 win over Estonia in the play-off semi-final.", "Lewandowski has scored 23 goals this season for Barcelona, including three for his country.", "Wales' home record reads two defeats in 23 matches.", "The match-up between Lewandowski and Chris Mepham is crucial.", "Nathan Ampadu and Jordan James brought strength to Wales' defensive midfield.", "Harry Wilson emphasized the importance of stopping Lewandowski.", "Poland has elite players like Jakub Kiwior and Piotr Zielinski.", "Aston Villa right-back Matty Cash might be unavailable due to injury.", "Both Wales and Poland have faced uncertainty in their qualification campaigns.", "Wales had back-to-back defeats against Armenia and Turkey.", "Poland's defeat in Moldova was a national humiliation.", "Wales' last win over Poland was in March 1973.", "Page has had Wales FA staff surveying possible Euros bases.", "Wales would face France, Austria, and Netherlands in Group D if they qualify.", "Page is deliberating over whether to start with Brooks or Kieffer Moore.", "With a spot in Euro 2024 Group D on the line, Wales and Poland square off at the Cardiff City Stadium on Tuesday, in the final of qualifying playoff Path A.", "Rob Page's men made light work of semi-final foes Finland in a 4-1 crushing, while their visitors barely broke a sweat in their most recent tie either, smashing Estonia 5-1.", "Wales enter Tuesday's tantalising final on a seven-match unbeaten run across all competitions and have scored in each of their last six contests.", "Poland also arrive in Wales with a respectable unbeaten run to protect, having avoided defeat in their five games under Probierz so far."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]}
{"candidates": ["Wales manager Rob Page commented, 'It’s a cruel game, that’s what I’ve said to the players, one kick away from qualifying. It hurts. I thought we were the better team, my message to the players at half-time was we are the better team, we will win this game.'", "Wales captain Ben Davies said, 'It’s a difficult one to take, we put everything into the game but in the end it wasn’t to be.'", "Former Wales midfielder Joe Allen said, 'It’s disappointing not to go to Germany but I’m so proud of the boys in what they’ve done over the last two years. The future is a bright one for Wales, after this summer focus will turn to the World Cup campaign.'", "Wojciech Szczesny's performance will be remembered for his save from James, making him the toast of Poland.", "Daniel James' missed penalty will live in infamy within Welsh football for days, weeks, and potentially even years to come.", "Rob Page expressed his disappointment, describing the loss as a 'horrible way to go out'.", "Wales’s players were distraught, with their dream of reaching a third straight European Championship ended in the cruellest of circumstances.", "Michal Probierz remains unbeaten since replacing Fernando Santos as Poland's manager.", "Wales manager reflected on the Euro 2024 qualifying exit, describing it as 'a horrible way to go out'.", "Wales manager Rob Page reflected on the defeat, stating it was a cruel game and praised his team's performance.", "Poland manager Michal Probierz emphasized the importance of playing their own game and focusing on qualification.", "Dan James experienced agony after missing the decisive penalty.", "Rob Page's future as Wales manager is uncertain after failing to qualify for Euro 2024.", "Wales FA chief executive Noel Mooney indicated that Page's future was dependent on qualification."], "ranking": [5, 8, 10, 3, 1, 6, 2, 12, 9, 7, 4, 11, 13, 14]}
{"candidates": ["Poland will join France, the Netherlands, and Austria in Group D at Euro 2024.", "Wales will play against Slovakia on June 9 but have no summer tournament to look forward to."], "ranking": [2, 1]}
{"candidates": ["Wales v Poland will take place on Tuesday 26th March 2024.", "The match will kick off at 7:45pm.", "Fans can watch the game on Viaplay Sports 1 and S4C.", "Viaplay customers can live stream the game on various devices, while the game is also available online via BBC iPlayer or S4C.", "The match can be listened to on BBC Radio 5 Live."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Craig Bellamy began his Wales managerial career with a goalless 0-0 draw against Turkiye at The Cardiff City Stadium.", "Türkiye forward Baris Alper Yilmaz was shown a second yellow card in the 63rd minute following a late challenge on Neco Williams.", "Despite their dominance and man advantage, Wales were unable to find a winning goal as they began their Nations League campaign with a point.", "25' K. Yildiz (TUR) received a yellow card.", "28' H. Wilson (WAL) received a yellow card.", "29' B. Johnson (WAL) received a yellow card.", "31' B. Yilmaz (TUR) received a yellow card.", "39' K. Ayhan (TUR) received a yellow card.", "60' Z. Celik (TUR) received a yellow card.", "62' B. Yilmaz (TUR) received a red card.", "64' H. Calhanoglu substituted in for O. Kokcu.", "66' C. Soyuncu (TUR) received a yellow card.", "72' K. Moore substituted in for A. Ramsey.", "72' L. Koumas substituted in for S. Thomas.", "77' K. Akturkoglu substituted in for K. Yildiz.", "77' O. Yokuslu substituted in for I. Yuksek.", "88' O. Cooper substituted in for J. James.", "90' I. Kahveci substituted in for A. Guler.", "Burak Yilmaz was sent off in the 62nd minute.", "Baris Yilmaz collected a second yellow card and Turkey went down to 10 men.", "Sorba Thomas broke through the lines and perfectly lobbed the goalkeeper only to be ruled offside.", "Aaron Ramsey nodded a chance over the top.", "Joe Rodon failed to convert from close range.", "Wales' Ben Davies attempts an acrobatic shot past Turkey's Abdulkerim Bardakci.", "FULL TIME: Wales 0-0 Turkey", "A huge chance for Wales to nick it, as substitute Lewis Koumas jigs his way down the left and pulls back for Brennan Johnson, who spins on the spot only for his effort to get deflected wide.", "The ten men nearly take the lead with four minutes remaining! A corner fizzed in from the left. Abdülkerim Bardakcı meets it with a powerful downward header but Danny Ward handles confidently on his goalline.", "Kieffer Moore is fine to continue, but he’s all bandaged up having had his forehead cut open.", "RED CARD: Barış Alper Yılmaz (Turkey). Yılmaz was slightly unfortunate to get booked in the first half after a 50-50 kerfuffle with Joe Rodon. But he knows he’s on a booking, and going in late on Neco Williams isn’t the wisest move. Studs on top of boot. An argument that it could be a red by itself, though it’s probably more like an orange. But a second yellow is enough to send him packing.", "Aaron Ramsey misses his third good chance of the evening, heading Harry Wilson’s cross over the bar from 12 yards.", "Harry Wilson pearls a rising screamer that only just flies wide of the top-right corner.", "Connor Roberts curls a sensational ball in from the right. It drops to Joe Rodon, six yards out and all alone. He’s been played onside, and has to score, but leans back and shanks his sidefooted effort yards over the bar.", "Sorba Thomas had a goal disallowed for offside.", "Baris Yilmaz received a second yellow card and was sent off, reducing Turkey to 10 men."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]}
{"candidates": ["Craig Bellamy's first match in charge of the Welsh national team.", "Turkey reached the quarter-finals of Euro 2024 and are in very fine form.", "Craig Bellamy emphasized the importance of controlling possession and playing with high intensity.", "The new Wales boss Craig Bellamy speaks to S4C. “Sorba Thomas has energy and aggressiveness with pressing but also runs in behind … he deserves his place … there’s been a lot of work this week … it was definitely needed … the exciting part is to see how it comes out today … the combinations and the links … the understanding between the players … see how far they’ve come in such a short place of time.”", "Craig Bellamy took charge of his first match as head coach of the Welsh national team.", "Turkey reached the quarter-finals of Euro 2024 and are in fine form.", "Craig Bellamy emphasized a new progressive style of play for Wales."], "ranking": [4, 2, 5, 1, 3, 6, 7]}
{"candidates": ["Bellamy's era as Wales boss begins with a draw as 10-player Turkey hold on.", "Craig Bellamy praised his team's performance, noting the flair and style they displayed.", "Tom Lockyer commented that the first half was the best Welsh performance he had seen in a long time.", "Bellamy has Wales playing exciting football.", "'This is worst we're going to be,' says Bellamy after Wales draw with Turkey", "Craig Bellamy's debut as head coach was marked by a promising performance despite the goalless draw.", "Welsh fans were encouraged by the team's exciting football under Bellamy."], "ranking": [3, 5, 2, 6, 1, 4, 7]}
{"candidates": ["The match was held at Cardiff City Stadium with an attendance of 28,625.", "The match was played at the Cardiff City Stadium.", "Heavy rain affected the game in the second half.", "The rain’s pelting down in Cardiff.", "During the break in Cardiff, the big screen paid tribute to former Bluebirds defender Sol Bamba, who recently passed. Warm applause all around the ground.", "The match was held at Cardiff City Stadium.", "Aaron Ramsey and Ethan Ampadu were key players for Wales.", "The match ended in a 0-0 draw."], "ranking": [8, 7, 5, 6, 1, 4, 2, 3]}
{"candidates": ["The game will be televised live to all UK viewers on SC4.", "Wales' Dan James is out injured, and Ipswich pair Wes Burns and Nathan Broadhead are both unavailable.", "18-year-old Lewis Koumas may make his first start for Wales.", "Turkey's Ferdi Kadıoğlu is unavailable due to a delayed transfer to Brighton & Hove Albion, and Ahmetcan Kaplan is also unavailable.", "Bertug Yildirim and Merih Demiral will miss out due to suspensions carried over from Euro 2024.", "The match will take place at Cardiff City Stadium, Cardiff.", "Kick-off time is 6:45 PM GMT.", "Wales and Turkey have been frequent opponents over the years.", "The last outing between the two sides occurred in late 2023 at the Euro Qualifiers, ending in a 1-1 draw.", "Wales will be hungry to take revenge against Turkey on their home soil."], "ranking": [9, 7, 5, 6, 8, 10, 10, 4, 3, 1]}
{"candidates": ["Craig Bellamy has confirmed that Aaron Ramsey will be included in his squad and will serve as the captain.", "Wales will have to deal with the absence of Daniel James due to a hamstring injury.", "Vincenzo Montella is expected to continue with his hybrid 5-4-1 system for Turkey.", "Baris Yilmaz will lead the line for Turkey, supported by Kenan Yildiz and Arda Guler.", "Set-pieces will be a great weapon for Turkey against Wales due to their superior physicality.", "Predicted Line-ups: Wales (3-5-2): Ward; Rodon, Cabango, Davies; Roberts, James, Ampadu, Williams; Wilson, Johnson; Matondo. Turkey (5-4-1): Günok; Muldur, Ayhan, Akaydin, Demiral, Kadioglu; Guler, Ozcan, Calhanoglu, Yildiz; Yilmaz.", "Key Players to Watch: Arda Guler (Turkey) and Mert Günok (Turkey).", "Predicted Score: Wales 1-3 Turkey."], "ranking": [5, 4, 3, 6, 2, 1, 7, 8]}
{"candidates": ["Tjipenandjambi Karuuombe scored for Namibia in the 8th minute.", "Sackor scored for Liberia in the 65th minute.", "Petrus scored for Namibia in the 73rd minute."], "ranking": [2, 3, 1]}
{"candidates": ["The first match in a jam-packed week of CAF World Cup qualifiers will see Namibia taking on Liberia at Orlando Stadium in Johannesburg.", "The group winners will qualify for the 2026 World Cup finals, while the second-placed side will enter a playoff round for a place at the inter-confederation tournament.", "Namibia are one of 17 sides whose home games scheduled in the World Cup qualifiers this week were forced to use alternate venues due to their own grounds failing to meet the required standards.", "Namibia are looking to secure their first World Cup qualification after reaching their first-ever knockout stage in an Africa Cup of Nations competition earlier this year.", "Liberia enter this match in third place in the group standings with three points.", "Namibia are now ranked 46 places above Liberia according to FIFA world rankings, but Liberia have never lost to Namibia, winning one and drawing one of their past two encounters.", "Namibia will go up against Liberia at the Orlando Stadium in Johannesburg.", "Namibia made history by reaching the knockout stage of the Africa Cup of Nations for the first time earlier this year.", "Namibia hopes to secure their maiden World Cup qualification."], "ranking": [8, 5, 4, 2, 6, 3, 9, 1, 7]}
{"candidates": ["Namibia were awarded a 3-0 victory after FIFA ruled Equatorial Guinea's striker Emilio Nsue was ineligible to play in his country's first two qualifiers.", "Liberia were also awarded a 3-0 victory despite losing 1-0 to Equatorial Guinea back in November last year."], "ranking": [1, 2]}
{"candidates": ["Tunisia earned a goalless draw away to Namibia.", "Namibia had the ball in the net after 14 minutes when Deon Hotto's free kick was spilt by Tunisia goalkeeper Bechir Said and bundled in by centre back Charles Hambira, but the goal was disallowed for a foul."], "ranking": [2, 1]}
{"candidates": ["Namibia and Tunisia played out a 0-0 draw at Orlando Stadium on June 9, 2024.", "Kamberipa received a yellow card in the 50th minute.", "Kazapua received a yellow card in the 72nd minute."], "ranking": [1, 2, 3]}
{"candidates": ["The journey to the 2026 World Cup brings us a thrilling Group H qualifier as Namibia takes on Tunisia.", "Namibia, currently second in Group H, will host the group leaders Tunisia at the Orlando Stadium.", "The Brave Warriors are looking to overturn a 1-1 draw against Liberia, while Tunisia aims to maintain their perfect record after a 1-0 victory over Equatorial Guinea.", "This match could potentially decide the fate of Group H, making it a must-watch for football enthusiasts.", "The head-to-head record between Namibia and Tunisia is evenly matched, with each team having one win apiece from their two encounters.", "Their last meeting was a surprising 1-0 victory for Namibia, which adds an extra layer of intrigue to this upcoming match.", "Tunisia, with their unbeaten run and solid defense, are the favorites to win.", "However, Namibia’s resilience and home advantage could play a crucial role.", "The prediction is a tightly contested match, with Tunisia likely edging out Namibia with a scoreline of 1-0."], "ranking": [6, 5, 8, 9, 3, 7, 4, 2, 1]}
{"candidates": ["Brave Warriors Head Coach, Collin Benjamin upped the Warriors’ tempo as the Senior Men’s National team continued their preparations for the upcoming 2026 FIFA World Cup Qualifiers against Liberia and Tunisia.", "Namibia will host Liberia on 5 June at the Orlando Stadium followed by their second encounter against Tunisia on 9 June 2024.", "Warriors Head Coach, Benjamin says it has been a competitive camp in Johannesburg, with great display of skill and dedication from the players.", "Namibia played to a one all draw against Lesotho in a preparatory match on Saturday.", "Blue Waters, Forward, Erastus Kalula who scored the goal for Namibia on his national team debut was excited on playing in the Warriors attire for the first time.", "Namibia aimed to continue their undefeated start to World Cup qualifying when they hosted Tunisia.", "Both sides were neck-and-neck in Group H, with Namibia looking to leapfrog Tunisia with a win.", "Namibia had previously defeated Tunisia in the Africa Cup of Nations, marking their first win in the continental competition.", "Tunisia aimed to maintain their 100% record in the qualifying series."], "ranking": [8, 2, 5, 4, 6, 3, 1, 9, 7]}
{"candidates": ["The match ended in a 0-0 draw, reflecting both teams' recent struggles in front of goal.", "Tunisia continued their sequence of clean sheets in Group H."], "ranking": [2, 1]}
{"candidates": ["Tunisia stayed top of their group despite a goalless draw away against Namibia.", "Tunisia had been upset by Namibia at January's Africa Cup of Nations and came close to losing again in the match played in Soweto, South Africa, because Namibia do not have a suitable home venue.", "Tunisia have a two-point lead in Group H over Namibia with Liberia a further point back in third place."], "ranking": [2, 1, 3]}
{"candidates": ["The match was held at Orlando Stadium in Johannesburg.", "Tunisia's caretaker manager Montasser Louhichi had yet to see his team concede since taking charge."], "ranking": [2, 1]}
{"candidates": ["Muhammad Ali’s only goal in injury time helped Iraq stun Vietnam 1-0 in a Group F match of the second qualification round of the 2026 FIFA World Cup at Hanoi’s My Dinh National Stadium on November 21 evening.", "Vietnamese goalkeeper Dang Van Lam worked rather hard to either save the ball or repel the shots due to home defenders’ mistakes.", "When the match seemed to end up in a 0-0 draw, the visiting team surprisingly opened the score with Mohammad Ali’s header in the injury time.", "Vietnam defeated Iraq 1-0 on November 21, 2023, in a World Cup qualification match.", "Goalkeeper Dang Van Lam made three important saves in the first half and two more in the second half.", "Iraq scored the winning goal in the last seconds of the match with Mohanad Ali's header."], "ranking": [1, 5, 2, 6, 4, 3]}
{"candidates": ["Vietnam and Iraq got three points each in their first opening matches several days ago. They are expected to progress to the third qualifying round, and their clash at My Dinh National Stadium in Hanoi on November 21 evening would determine the group F winners.", "Head coach Philippe Troussier has promised that his team will be out to make things difficult for Iraq.", "Vietnam will take on Iraq in their second game of Group F of the second round qualifiers of the FIFA World Cup 2026 at the My Dinh National Stadium.", "Troussier stated that his goal is to adjust accordingly to make things difficult for Iraq.", "Troussier acknowledged that Iraq is currently in the top 5 or 6 in Asia and is rated higher than the Vietnam team.", "Vietnam started their campaign in Group F with a 2-0 win over the Philippines in Manila.", "Iraq smashed Indonesia 5-1 at home in Basra.", "A win for either side will see the winner wresting control of the leadership of the group.", "Midfielder Nguyen Thai Son mentioned that the advantage for Vietnam is playing at home with the support of their fans."], "ranking": [8, 5, 3, 4, 2, 6, 9, 1, 7]}
{"candidates": ["After the match, Troussier praised Vietnamese players for their courage throughout the match, but regretted that Vietnam lost to the visiting West Asian team in the last minute of injury time.", "Dang Van Lam expressed regret over the last-minute loss but emphasized the team's determination to correct mistakes and come back stronger.", "Captain Que Ngoc Hai acknowledged the defeat but highlighted the positive aspects, such as the performance of young players and the team's overall effort."], "ranking": [2, 3, 1]}
{"candidates": ["FPT Play holds the broadcasting rights for Vietnam's home matches in the second round of the 2026 World Cup qualifiers.", "VTV will also broadcast Vietnam's home matches in the second round of the 2026 World Cup qualifiers."], "ranking": [2, 1]}
{"candidates": ["Harry Wilson became the first player since Gareth Bale at Euro 2016 to score in three consecutive games for Wales.", "Harry Wilson is the first Welshman to score in three successive games for his country since Gareth Bale at Euro 2016."], "ranking": [1, 2]}
{"candidates": ["Harry Wilson scored the only goal of the game from the penalty spot.", "Montenegro substitute Andrija Radulovic hit the woodwork.", "Wes Burns headed Wilson’s cross wide from close range.", "Wilson’s rising effort was pushed away and a sliding Mark Harris narrowly failed to meet Neco Williams’ low cross.", "Wilson’s lofted pass found Liam Cullen’s run from deep, but Cullen's effort cleared the bar.", "David Brooks’ strike from 30 yards was pushed wide.", "Vladimir Jovovic misread Wilson’s turn and connected with him enough to persuade referee Filip Glova to point to the spot.", "Wilson sent Nikic the wrong way from the penalty spot.", "Andrija Radulovic cut inside Ben Davies and unleashed a swerving 20-yard effort that rebounded off the crossbar.", "Nikic was robbed by Brooks, who chose to pass not shoot, and Burns fired over on the angle.", "Harry Wilson converted a penalty to secure a 1-0 victory for Wales over Montenegro.", "Harry Wilson drew the penalty when he was clipped by Vladimir Jovovic just inside the area.", "Substitute Andrija Radulovic hammered a long-range rocket off the crossbar for Montenegro.", "Nathan Broadhead squandered a late chance to double Wales' lead when he got his feet caught up trying to go around the keeper."], "ranking": [11, 9, 5, 7, 6, 8, 10, 4, 12, 3, 1, 2, 13, 14]}
{"candidates": ["Harry Wilson scored a penalty in the 36th minute to secure a 1-0 victory for Wales.", "Jovetic, Vukcevic, Bakic, and Sipcic received yellow cards during the match."], "ranking": [1, 2]}
{"candidates": ["Craig Bellamy emphasized the importance of developing a squad for next year’s World Cup qualifiers."], "ranking": [1]}
{"candidates": ["Wales will be looking to complete the double over Montenegro in Monday's UEFA Nations League clash at the Cardiff City Stadium.", "Craig Bellamy earned his first win as Dragons boss in last month's reverse fixture following a lightning start by his side.", "Wales had failed to score in their previous four games, but raced into a two-goal lead within three minutes thanks to Kieffer Moore's strike and Harry Wilson's long-range screamer.", "Bellamy's side were made to work for the three points in dreadful conditions as Montenegro's Driton Camaj hit a late consolation to set up a tense finale, but they held on and are in with a shot at promotion to League A at the halfway stage of this season's Nations League.", "A second victory against Montenegro would boost Wales' hopes of topping Group B4, and Tottenham hotshot Brennan Johnson will be key if he can transfer his form at domestic level to the international scene.", "Wales were intent on claiming maximum points to continue their UEFA Nations League campaign.", "Montenegro were yet to pick up a point and seemed relegation bound.", "Wales had previously drawn with Iceland, maintaining their unbeaten start to Group 4.", "Craig Bellamy replaced Rob Page as Wales' manager in September."], "ranking": [3, 6, 1, 2, 4, 8, 9, 5, 7]}
{"candidates": ["Craig Bellamy praised Harry Wilson's performance and expressed optimism for the final two matches in their Nations League group.", "Wales forward Harry Wilson was rewarded for a fine all-round performance.", "Craig Bellamy extended his unbeaten start as Wales' new manager."], "ranking": [2, 3, 1]}
{"candidates": ["Craig Bellamy praised his team's performance despite missing key players due to suspensions and injuries.", "Montenegro's coach Robert Prosinecki faced pressure to avoid relegation to League C."], "ranking": [1, 2]}
{"candidates": ["Despite making seven changes from the 2-2 draw in Iceland, Wales’ new-look team were fluent throughout the first half.", "Joe Allen ended his international retirement to link up again with Wales for this double-header.", "Wales are second in Group B4 with eight points after four matches, trailing Turkey by two points.", "Montenegro are bottom without a point.", "Top spot in the group will be on the line when Wales travel to Turkey on Nov. 16 after the first meeting of the two teams last month ended in a 0-0 draw in Cardiff."], "ranking": [3, 5, 2, 1, 4]}
{"candidates": ["Wales' Nations League form included draws and a win, while Montenegro had suffered five consecutive defeats.", "Montenegro's captain Stevan Jovetic was close to becoming his country's record caps-holder."], "ranking": [2, 1]}
{"candidates": ["Hakim Ziyech scored the opening goal for Morocco in the 37th minute.", "Achraf Hakimi scored the second goal for Morocco in the 81st minute."], "ranking": [1, 2]}
{"candidates": ["The match between Zambia and Morocco is scheduled for Wednesday, January 24, 2024, at 21:00 and will be broadcast on beIN Sports.", "Morocco, with 4 points, is leading their group and has already qualified for the next round.", "Zambia, currently tied for second place with DR Congo, needs a win to secure their spot in the round of 16.", "Morocco aims to secure the top spot in their group to face a potentially easier opponent in the next round.", "Morocco had a strong start with a 3-0 victory against Tanzania but drew 1-1 with DR Congo.", "Zambia has drawn both of their matches so far, 1-1 against DR Congo and 1-1 against Tanzania.", "Probable lineups for Zambia: Mulenga – Mwape, Sunzu, Musonda, Chapeshi – Kapumbu – L. Banda, E. Banda, Kangwa, Sakala – Dakar.", "Probable lineups for Morocco: Bounou – Hakimi, Aguerd, Saïss, Chibi – Amrabat, Ounahi, Amallah – Ziyech, En-Nesyri, Boufal.", "The match is a crucial finale to Group F in the Africa Cup of Nations, with qualification for the round of 16 at stake.", "Zambia is returning to the AFCON stage after a three-edition absence and is still chasing their first win since their 2012 triumph.", "Zambia faces a win-or-bust scenario against Morocco, having only beaten Morocco once in six meetings.", "Morocco is widely tipped as the tournament's strongest contenders and is targeting their second AFCON title in history.", "Zambia coach Avram Grant says his team holds no fear of Morocco ahead of their 2023 Africa Cup of Nations Group F match.", "Zambia will be without defender Roderick Kabwe due to suspension, while Kelvin Kapumbu could lose his starting spot after an indifferent showing against Tanzania.", "Morocco have no reported injury issues but could shuffle up their line-up with the likes of Ayoub El Kaabi or Azzedine Ounahi.", "Zambia: Patson Daka scored the key goal against Tanzania and will be itching to prove himself against Morocco.", "Morocco: Youssef En-Nesyri endured a frustrating match against DR Congo and will want to make amends by finding the back of the net against Zambia.", "In head-to-head stats, Zambia and Morocco have met in 18 matches. The Atlas Lions have claimed 10 wins compared to six for Chipolopolo, while two games have been drawn. The teams’ most recent clash was in the quarterfinals of the 2021 African Nations Championship (Chan), with Morocco winning 3-1."], "ranking": [15, 12, 10, 11, 9, 8, 5, 6, 14, 13, 7, 4, 3, 2, 1, 16, 17, 18]}
{"candidates": ["The Royal Moroccan Football Federation said they will appeal the suspension of coach Walid Regragui, calling it an 'incomprehensible decision'.", "Avram Grant praised the quality, passion, and desire shown by the Copper Bullets.", "Avram Grant mentioned that Zambia now turns to the FIFA World Cup qualifiers, where a rematch with Morocco awaits in June.", "The Royal Moroccan Football Federation said they will appeal the suspension of coach Walid Regragui, calling it an 'incomprehensible decision'."], "ranking": [4, 2, 3, 1]}
{"candidates": ["Morocco were playing their 73rd match and Zambia their 70th in the Africa Cup of Nations, but this was only the third time they have met.", "The match was held at the Stade Laurent Pokou in San Pedro, named after deceased Ivorian football legend Laurent Pokou.", "Ivory Coast sneaked into the last-16, sparking celebrations in the Laurent Pokou Stadium.", "The game had very few chances for the 12,847 crowd at the Amadou Gon Coulibaly Stadium.", "Morocco's win allowed hosts Côte d'Ivoire to scrape into the last 16.", "Morocco will face South Africa in the round of 16.", "Zambia survived a number of scares before finally falling behind after 38 minutes."], "ranking": [5, 2, 6, 1, 7, 4, 3]}
{"candidates": ["Rob Page emphasized the importance of bringing their A-game and maintaining their values to achieve success.", "Finland coach Markku Kanerva acknowledged Wales' strong performance in the campaign, highlighting their victory over Croatia.", "Teemu Pukki remains Finland's main marksman at the age of 33, now playing for Minnesota United in Major League Soccer.", "Rob Page's side aimed for a third consecutive run at European glory.", "Wales needed to navigate Finland at Cardiff City Stadium ahead of a potential spot in the final against either Poland or Estonia.", "Teemu Pukki described the match against Wales as one of the biggest games in Finnish football history.", "Pukki mentioned that Finland played Wales in the Nations League a couple of years ago and lost both games, but they were very close.", "Pukki emphasized that Finland wants to win this game to bring themselves to another final and that it is their last chance.", "Pukki highlighted that while Wales has more players in the Premier League, Finland has been doing really well over the last four years."], "ranking": [6, 8, 4, 9, 5, 2, 7, 1, 3]}
{"candidates": ["Wales are the only Home Nation in contention this week as they duel Finland for a place in the Euro 2024 Path A final, where they would face the winner of Poland v Estonia."], "ranking": [1]}
{"candidates": ["At the final whistle there was a warm outpouring of applause, a communal acknowledgment of a job well done.", "Rob Page, the Wales manager, was at pains to say the next few days are tantamount to the half-time interval.", "Neco Williams commented on the performance, stating it was a great performance and they have one huge game to go against Poland.", "Wales will face Poland in the play-off final for a place at Euro 2024.", "Rob Page commented on the team's strong start and emphasized the importance of the upcoming game against Poland.", "Neco Williams expressed satisfaction with the team's performance but noted the disappointment of conceding a goal.", "Wales will face Poland next week for a place in the Euro 2024 finals.", "Manager Rob Page praised the team's performance and highlighted Dan James' contribution on his 50th cap.", "Wales is on the cusp of reaching their third successive Euros and first since Gareth Bale's retirement."], "ranking": [8, 5, 6, 3, 4, 7, 2, 9, 1]}
{"candidates": ["Wales have now won each of their last three playoffs in Cardiff.", "If Wales beat Poland in the final on Tuesday, they will secure a place at the Euro 2024 finals in Germany.", "Robert Lewandowski was not on the scoresheet in Poland's semi-final against Estonia.", "Wales beat Finland 4-1 in the Euro 2024 play-off semi-finals.", "Wales will face Poland in the play-off final for a spot in the Euros.", "Finland's last outing was against San Marino, and they made several changes for this match.", "Wales and Finland have met 15 times historically, with Wales winning six times and Finland four times.", "Wales will play Poland in Cardiff for a place in the Euro 2024 finals.", "Finland had hoped to qualify for their second major tournament after Euro 2020."], "ranking": [3, 2, 9, 1, 5, 8, 6, 4, 7]}
