{"candidates": ["Jamaica scored their first-ever Copa America goal in their eighth match in the tournament."], "ranking": [1]}
{"candidates": ["Ecuador went ahead in the 13th minute via a Jamaica own goal, when Piero Hincapie's cross from the left was deflected off Kasey Palmer's shin into the net.", "The South Americans doubled the lead via a Kendry Paez penalty kick just before the interval after a handball by Gregory Leigh.", "Alan Minda killed off the contest in the 91st minute with a goal from a classic counter-attack.", "Jamaica halved the deficit shortly after halftime, scoring their first-ever Copa America goal following a corner. Ethan Pinnock's effort was blocked by the Ecuador defence but the rebound fell to Michail Antonio, who rifled the ball into the net.", "They thought they had earned a penalty themselves in the 73rd minute when referee Cristian Garay was sent to the monitor to check for a possible handball by Alan Franco, but the referee decided not to award a spot kick.", "Ecuador went ahead in the 13th minute via a Jamaica own goal.", "Kendry Paez scored a penalty kick just before the interval after a handball by Gregory Leigh.", "Alan Minda scored in the 91st minute with a goal from a classic counter-attack.", "Michail Antonio scored Jamaica's first-ever Copa America goal shortly after halftime.", "Referee Cristian Garay checked for a possible handball by Alan Franco in the 73rd minute but decided not to award a penalty.", "Ecuador went ahead in the 13th minute via a Jamaica own goal, when Piero Hincapie's cross from the left was deflected off Kasey Palmer's shin into the net.", "Kendry Paez scored a penalty kick just before the interval after a handball by Gregory Leigh.", "Alan Minda scored in the 91st minute with a goal from a classic counter-attack.", "Michail Antonio scored Jamaica's first-ever Copa América goal following a corner.", "Piero Hincapié scored in the 13th minute for Ecuador.", "Kendry Páez scored a penalty in the 45'+4' minute for Ecuador.", "Michail Antonio scored in the 54th minute for Jamaica.", "Alan Minda scored in the 90'+1' minute for Ecuador."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]}
{"candidates": ["Kasey Palmer scored in the 13th minute for Jamaica.", "Kendry Páez scored in the 45'+4' minute for Ecuador.", "M. Antonio scored in the 54th minute for Jamaica.", "A. Minda scored in the 90'+1' minute for Ecuador.", "Palmer scored for Ecuador in the 13th minute", "Paez scored a penalty for Ecuador in the 45+4th minute", "Minda scored for Ecuador in the 90+1st minute", "Antonio scored for Jamaica in the 54th minute", "Lowe received a yellow card in the 39th minute", "Hector received a yellow card in the 49th minute", "Latibeaudiere received a yellow card in the 80th minute", "Anderson received a yellow card in the 90+4th minute"], "ranking": [12, 3, 4, 2, 11, 1, 5, 6, 9, 8, 10, 7]}
{"candidates": ["Ecuador is favored to win with a 65.4% chance based on the moneyline.", "Ecuador has scored one goal in one game in this tournament, while Jamaica has allowed one goal in one game.", "In international matches over the past two years, Ecuador scored 20 goals (1.3 per game) and Jamaica allowed 22 goals (1.2 per game).", "Jamaica has not scored yet in this tournament, while Ecuador has allowed two goals (two per game).", "In international matches over the past two years, Jamaica scored 29 goals (1.5 per game) and Ecuador allowed 15 goals (0.9 per game).", "Ecuador has been outscored 2-1 in the Copa America, with a -1 goal differential, which is ninth in the tournament.", "Jamaica has been outscored 1-0 in the Copa America, with a -1 goal differential, which is ninth in the tournament.", "Jeremy Sarmiento has one goal for Ecuador in Copa America.", "Leon Bailey finished with 10 goals and 10 assists in 36 matches for Aston Villa in the Premier League last season.", "Michail Antonio racked up six goals and three assists in 26 Premier League matches last season for West Ham United.", "Bobby Reid's club numbers last season were six goals and two assists in 38 matches for Fulham in the Premier League.", "Shamar Nicholson finished with four goals and three assists in 28 appearances for Clermont Foot 63 in Ligue 1 last season."], "ranking": [10, 8, 5, 7, 4, 3, 2, 9, 1, 6, 11, 12]}
{"candidates": ["Ecuador and Jamaica are seeking their first points at the 2024 Copa America", "Ecuador lost 2-1 to Venezuela in their opener", "Jamaica was narrowly defeated 1-0 by Mexico", "Ecuador played a man short for over an hour in their previous match due to a VAR red card decision", "Jamaica has not collected a single point in seven all-time Copa America affairs"], "ranking": [3, 2, 4, 1, 5]}
{"candidates": ["Victory gave Ecuador, who were beaten by Venezuela in their Group B opener, their first points of the tournament, moving them level on three each with Mexico and Venezuela.", "Jamaica lost their opener to Mexico and must now win their final group game against Venezuela to have any hope of advancing. They will be knocked out irrespective of that result if Mexico and Venezuela draw when they play later on Wednesday.", "Ecuador kept their hopes of qualifying for the Copa América quarterfinals alive with a 3-1 win over Jamaica.", "Victory gave Ecuador their first points of the tournament and leaves it level with Mexico.", "Jamaica is now eliminated following Venezuela's win on Wednesday night.", "Ecuador kept their hopes of qualifying for the Copa America quarter-finals alive with a 3-1 win over Jamaica.", "The result left Jamaica on the brink of elimination."], "ranking": [3, 6, 1, 5, 2, 1, 4]}
{"candidates": ["They thought they had earned a penalty themselves in the 73rd minute when referee Cristian Garay was sent to the monitor to check for a possible handball by Alan Franco, but the referee decided not to award a spot kick.", "The match was held at Allegiant Stadium in Las Vegas, Nevada, USA.", "Attendance for the match was 24,074."], "ranking": [2, 3, 1]}
{"candidates": ["Ecuador will be without their team captain, Enner Valencia, due to a red card", "Jeremy Sarmiento and Kendry Paez are on a yellow card and in danger of missing their final group fixture with a caution in this match", "Jahmali Waite started for Jamaica in place of injured captain Andre Blake", "Shamar Nicholson can surpass Walter Boyd for sixth in all-time goals for Jamaica"], "ranking": [2, 4, 3, 1]}
{"candidates": ["DR Congo knocked Egypt out of the AFCON with an 8-7 win on penalties after the teams finished 1-1 after extra time.", "Egypt goalkeeper Mohamed Abou Gabal struck the crossbar with his spot kick before Lionel Mpasi stepped up to send Congo into the quarterfinals.", "Mostafa Mohamed equalized from the spot in first-half stoppage time.", "Egypt finished the game with 10 players when defender Mohamed Hamdy was sent off in the first period of extra time with his second yellow card for a late challenge on Simon Banza."], "ranking": [1, 2, 4, 3]}
{"candidates": ["Mohamed scored a penalty at 45+1'", "Elia scored at 37'", "Hamdy received a red card at 97'", "Congo DR won 8-7 on penalties", "D.R. Congo have sent Egypt home after 120 minutes of drama and 18 penalty kicks, with Egypt goalkeeper Gabaski missing the all-important penalty."], "ranking": [3, 2, 4, 1, 5]}
{"candidates": ["Experts predicted a close match with Egypt expected to progress", "Egypt's history in AFCON knockout ties often going to penalties", "Congo DR's resilience and strategy to keep the match level", "It is around 10 minutes before Egypt (without Salah) take on DR Congo in the Africa Cup of Nations."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Denmark and Switzerland begin preparations for the upcoming Euro 2024 when they lock horns in a friendly at Parken Stadium on Saturday.", "Denmark have been drawn in Group C of the upcoming European Championship alongside Serbia, Slovenia and 2020 beaten finalists England.", "Switzerland will take on Hungary, Scotland and Germany in Group A of the Euros later in June.", "Denmark head into the weekend as the more in-form side and are predicted to win the match."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Enis Bardhi scored on a penalty kick for North Macedonia.", "Viljormur Davidsen scored on a penalty kick for Faroe Islands.", "Bardur Reynatrod made 3 saves for Faroe Islands.", "Darko Churlinov had 1 shot on goal for North Macedonia.", "A. Iljazovski (MKD) received a yellow card at 8'.", "V. Davidsen scored on a penalty kick at 9'.", "S. Chukwudi (FRO) received a yellow card at 13'.", "N. Serafimov (MKD) received a yellow card at 17'.", "J. Edmundsson (FRO) received a yellow card at 45+2'.", "H. Askham substituted in for S. Chukwudi at 45'.", "E. Bardhi scored on a penalty kick at 49'.", "A. Justinussen substituted in for J. Edmundsson at 66'.", "M. Mikkelsen substituted in for R. Joensen at 66'.", "M. Ilievski substituted in for D. Churlinov at 77'.", "P. Knudsen substituted in for S. Vatnhamar at 84'.", "I. Alimi (MKD) received a yellow card at 90+3'.", "Watch a game of two penalties, as the League C points were shared in Torshavn.", "V. Davidsen scored a penalty for Faroe Islands at 10 minutes.", "E. Bardhi scored a penalty for North Macedonia at 50 minutes.", "S. Chukwudi received a yellow card at 14 minutes.", "J. Edmundsson received a yellow card at 45+3 minutes.", "A. Iljazovski received a yellow card at 9 minutes.", "N. Serafimov received a yellow card at 18 minutes.", "I. Alimi received a yellow card at 90+4 minutes.", "S. Chukwudi was substituted by H. Askham at 47 minutes.", "J. Edmundsson was substituted by A. Justinussen at 67 minutes.", "R. Shaki Joensen was substituted by M. Mikkelsen at 67 minutes.", "G. Vatnhamar was substituted by P. Knudsen at 85 minutes.", "M. Olsen was substituted by P. Johannesen at 85 minutes.", "D. Mitrovski was substituted by L. Qamili at 47 minutes.", "A. Iljazovski was substituted by E. Alioski at 47 minutes.", "D. Churlinov was substituted by M. Ilievski at 78 minutes.", "V Davidsen scored a penalty in the 9th minute for Faroe Islands.", "E Bardhi scored a penalty in the 49th minute for North Macedonia.", "Viljormur Davidsen scored a penalty in the 9th minute for Faroe Islands.", "Enis Bardhi scored a penalty in the 49th minute for North Macedonia."], "ranking": [17, 18, 5, 4, 10, 19, 11, 12, 13, 6, 20, 7, 8, 9, 14, 1, 21, 22, 15, 16, 23, 24, 25, 26, 27, 28, 29, 30, 2, 3, 31, 32, 33, 34, 35, 36]}
{"candidates": ["Davidsen scored a penalty in the 9th minute for Faroe Islands.", "Chukwudi scored in the 13th minute for North Macedonia.", "Simun Edmundsson received a yellow card in the 45+2 minute.", "Ericsson received a yellow card in the 84th minute.", "Bardhi scored a penalty in the 49th minute for North Macedonia.", "Iljazovski received a yellow card in the 8th minute.", "Serafimov received a yellow card in the 17th minute.", "Alimi received a yellow card in the 90+3 minute."], "ranking": [1, 2, 5, 7, 3, 4, 6, 8]}
{"candidates": ["The Faroe Islands will face North Macedonia at the Tórsvøllur on Saturday in the opening game of their 2024-25 UEFA Nations League campaign.", "The home side enjoyed a positive Nations League campaign in 2022, shaking off their slow start to the tournament before embarking on a strong finish to their group-stage run which included a shock 2-1 victory over group winners Turkey.", "North Macedonia have also endured a difficult run of results in recent games and will hope they can find better luck elsewhere this weekend.", "The visitors will be targeting a winning start to their Nations League campaign this weekend before returning to home soil, where they will face Armenia next week."], "ranking": [4, 1, 3, 2]}
{"candidates": ["Saturday's game will mark just the second meeting between the Faroe Islands and North Macedonia.", "The two sides faced off for the first-ever time in a friendly clash last March which the visitors won 1-0 via a late strike from Girona striker Bojan Miovski.", "The hosts have managed just two clean sheets in their last 22 games across all competitions.", "The Lions were ranked 72nd in the latest FIFA rankings and now sit 66 places above their weekend opponents.", "The match ended in a 1-1 draw.", "The attendance for the match was 2,057.", "The match was held at Tórsvøllur in Tórshavn.", "The attendance for the match was 2,057 spectators."], "ranking": [5, 2, 4, 3, 1, 7, 8, 6]}
{"candidates": ["Ecuador won the match 1-0 against Chile.", "Angel Mena scored the only goal for Ecuador.", "Chile made offensive changes with the introduction of Felipe Loyola.", "Ecuador made changes to freshen up the team and slow down the clock.", "Mena scored the only goal of the match in the 21st minute.", "Pulgar received a yellow card in the 44th minute.", "Echeverria received a yellow card in the 62nd minute.", "Torres and Preciado were also notable players in the match."], "ranking": [1, 2, 5, 6, 3, 7, 8, 4]}
{"candidates": ["Ecuador won 1-0 against Chile.", "Mena scored the only goal of the match in the 21st minute.", "Torres and Preciado received yellow cards in the 36th and 61st minutes respectively.", "Pulgar and Echeverria received yellow cards in the 44th and 62nd minutes respectively."], "ranking": [1, 2, 3, 4]}
{"candidates": ["The outcome of the match could significantly impact the teams' positions in the FIFA rankings and their seeding in the Copa América 2024.", "Both teams need a win to improve their standings in the World Cup qualifiers."], "ranking": [1, 2]}
{"candidates": ["It's the first time Ireland have come from behind to win a game since 2012 when they beat Kazakhstan.", "This 2-1 win over Finland in Helsinki is the first time Ireland have fought back from conceding first to win a competitive game since beating Kazakhstan in October 2013.", "This is the first away victory in this competition since it began six years ago.", "This was the first time since 2011 that Ireland has come from behind to win away from home."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Robbie Brady scored a late winning goal for Ireland.", "Liam Scales scored his first goal for Ireland with a header.", "Nathan Collins made a mistake leading to Finland's goal by Joel Pohjanpalo.", "Robbie Brady provided an assist for Liam Scales' goal.", "Festy Ebosele's play led to Robbie Brady's winning goal.", "Finland's Kallman nearly scored with a header that went just past the post.", "Ireland's goal by Evan Ferguson was disallowed for offside.", "Joel Pohjanpalo scored for Finland in the 17th minute.", "Liam Scales scored for Republic of Ireland in the 57th minute.", "Robbie Brady scored for Republic of Ireland in the 88th minute.", "Adam Idah's shot was saved in the 90'+2' minute.", "Robbie Brady scored an 88th-minute winner following a stunning assist from substitute Festy Ebosele.", "Liam Scales scored his first goal for Ireland to cancel out Joel Pohjanpalo’s opener.", "Joel Pohjanpalo capitalized on a disastrous Nathan Collins under hit back pass to score for Finland.", "Evan Ferguson’s goal was disallowed when a free kick from Brady went out of play and couldn’t be kept in by Collins.", "Evan Ferguson returns to lead the line for Ireland.", "Finn Azaz makes his competitive debut for the Republic of Ireland.", "Nathan Collins mishits a back-pass leading to Joel Pohjanpalo's goal for Finland.", "Ireland's disallowed goal due to offside after a VAR check.", "Liam Scales scores a header to equalize for Ireland.", "Robbie Brady scores the winning goal for Ireland in the 88th minute.", "Robbie Brady scored a late winner in the 88th minute to secure a 2-1 victory for the Republic of Ireland.", "Liam Scales scored his first international goal to equalize for Ireland in the 57th minute.", "Joel Pohjanpalo scored for Finland in the 17th minute.", "Robbie Brady had a goal disallowed due to the ball going out of play."], "ranking": [1, 5, 3, 7, 2, 18, 19, 15, 14, 20, 11, 4, 6, 8, 16, 21, 9, 10, 12, 13, 17, 22, 23, 24, 25]}
{"candidates": ["Pohjanpalo scored for Finland in the 17th minute", "Scales scored for Republic of Ireland in the 57th minute", "Brady scored for Republic of Ireland in the 88th minute"], "ranking": [1, 2, 3]}
{"candidates": ["Ireland manager Heimir Hallgrímsson and captain Nathan Collins are beginning their international partnership with this match.", "Ireland is experiencing one of the grimmest periods in its football history, with a downward spiral of results.", "Ireland has lost eight of their last 10 competitive matches, with no goals scored and seven conceded in the last three.", "Nathan Collins expressed frustration with the team's recent performance and emphasized the desire to win and qualify for tournaments.", "Ireland's squad is valued significantly higher than Finland's, but Finland's experience and home advantage could be decisive.", "Finland manager Markku Kanerva will be without injured midfielder Kaan Kairinen, but captain Lucas Hradecky will lead the team.", "Teemu Pukki, despite a hamstring issue, is a key player for Finland with 42 goals from 123 caps.", "Hallgrímsson acknowledged the tactical and hard-working nature of the Finnish team.", "Heimir Hallgrímsson emphasized the importance of confidence and building on training improvements.", "Ireland's lineup included Kelleher, O'Shea, Collins, Scales, Brady, Azaz, Cullen, Knight, Ogbene, Ferguson, and Szmodics.", "Finland's lineup included Hradecky, Ståhl, Ivanov, Hoskonen, Galvez, Schüller, Walta, Kamara, Lod, Keskinen, and Pohjanpalo.", "Part of Ireland’s game plan was to lure the home side out close to the defensive third and then win possession to counter in the areas left exposed by a pair of full backs who ventured forward.", "Heimir Halgrímsson seeks his first win in charge of Ireland.", "Finn Azaz will make his competitive debut for the Republic of Ireland.", "Evan Ferguson returns to lead the line up front.", "Josh Cullen returns after injury.", "Liam Scales replaces Andrew Omobamidele in the defense.", "Robbie Brady's presence suggests a back five formation.", "Only 15,000 tickets sold for a 36,000-capacity stadium.", "1,100 Irish fans present at the Olympic Stadium in Helsinki."], "ranking": [5, 2, 1, 4, 6, 8, 3, 10, 9, 14, 15, 7, 11, 12, 13, 16, 17, 18, 19, 20]}
{"candidates": ["Heimir Hallgrímsson expressed satisfaction with the team's performance and confidence boost.", "Robbie Brady highlighted the hard work of the team and praised Liam Scales and Festy Ebosele's contributions.", "Heimir Hallgrímsson described the win as a crucial step to allay fears of relegation and halt the 'downward spiral' since he took over.", "Hallgrímsson emphasized the need to'stop the bleeding' and backed up the positive talk and belief in what he can do.", "Ireland comes from behind to earn three points in Helsinki.", "Heimir Halgrímsson is off the mark with his first win as Ireland's manager."], "ranking": [4, 3, 2, 5, 1, 6]}
{"candidates": ["Jude Bellingham scored England's first shot on target in a knockout game at a major tournament since the 1986 World Cup quarter-final."], "ranking": [1]}
{"candidates": ["Ivan Schranz scored the opening goal for Slovakia in the 25th minute.", "Phil Foden's goal was ruled offside early in the second half.", "Declan Rice hit the post in the 81st minute.", "Jude Bellingham scored an overhead kick in the 95th minute to take the game to extra time.", "Harry Kane headed home the winning goal in the first minute of extra time.", "Jordan Pickford and England's defense held steadfast to hold on to the lead.", "Slovakia almost knotted things up in the first half of extra time with a well-placed cross.", "Ivan Toney played a beautiful cross to Harry Kane, who scored to give England a 2-1 lead.", "Jude Bellingham scored a bicycle kick in stoppage time to send the match into extra time.", "Ivan Schranz scored in the 25th minute to give Slovakia a 1-0 lead.", "Jude Bellingham scored a dramatic overhead kick in stoppage time to equalize for England.", "Harry Kane scored the winning goal in extra time with a header from an Ivan Toney assist.", "Ivan Schranz scored for Slovakia midway through the first half.", "Jude Bellingham scored a stunning 95th-minute equaliser with a bicycle kick.", "Harry Kane scored the early extra-time winner to secure a 2-1 victory for England.", "Ivan Schranz scored for Slovakia in the 25th minute.", "Phil Foden's goal was disallowed for offside shortly after the break.", "Declan Rice hit the post late in the game.", "Jude Bellingham scored a sublime overhead kick equalizer in the final minutes of the match.", "Harry Kane scored in the 91st minute.", "Ivan Schranz scored for Slovakia in the 25th minute.", "Tomás Suslov (Slovakia) was shown the yellow card in the 120'+2' minute."], "ranking": [10, 16, 18, 1, 2, 14, 15, 3, 11, 12, 4, 13, 5, 6, 7, 8, 9, 17, 19, 20, 21, 22]}
{"candidates": ["Bellingham scored in the 90+5' minute", "Kane scored in the 91' minute", "Schranz scored in the 25' minute", "Guehi received a yellow card in the 3' minute", "Mainoo received a yellow card in the 7' minute", "Bellingham received a yellow card in the 17' minute", "Kucka received a yellow card in the 13' minute", "Skriniar received a yellow card in the 45+1' minute", "Pekarik received a yellow card in the 77' minute", "Vavro received a yellow card in the 108' minute", "Gyomber received a yellow card in the 114' minute", "Suslov received a yellow card in the 120+1' minute", "Jude Bellingham scored in the 90+5 minute", "Harry Kane scored in the 91st minute", "Schranz scored for Slovakia in the 25th minute", "Kucka received a yellow card in the 13th minute", "Skriniar received a yellow card in the 45+1 minute", "Pekarik received a yellow card in the 77th minute", "Vavro received a yellow card in the 108th minute", "Gyomber received a yellow card in the 114th minute", "Suslov received a yellow card in the 120+1 minute"], "ranking": [1, 2, 3, 14, 15, 16, 17, 18, 19, 20, 21, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]}
{"candidates": ["England was the No. 9 team in Alexi Lalas' latest power rankings and the lone favorite to win it all at +350."], "ranking": [1]}
{"candidates": ["Gareth Southgate's tactical decisions were questioned despite the win.", "England's performance was criticized for lacking tempo and creativity.", "Southgate's job was potentially saved by Jude Bellingham's goal.", "England will need to improve significantly against Switzerland in the quarter-final.", "Gareth Southgate praised Jude Bellingham for his game-changing moment.", "Southgate will bring up his 100th game as England’s manager when his side faces Switzerland in the quarter-finals.", "England fans celebrated Jude Bellingham's late equaliser at Wembley.", "England will face Switzerland in the quarterfinals in Duesseldorf on July 6.", "England needs to improve their performance against Switzerland, who outplayed defending champions Italy in the last-16.", "Craig Burley commented that England have been 'garbage' at Euro 2024.", "Mark Ogden mentioned that Gareth Southgate might have been thinking about resigning during the match against Slovakia.", "England fans celebrated Jude Bellingham's late bicycle kick against Slovakia."], "ranking": [7, 5, 3, 9, 2, 11, 1, 10, 8, 4, 6, 12]}
{"candidates": ["The theme from The Great Escape was played during extra time.", "England's first half performance was compared to their worst in the tournament so far.", "Marc Guéhi will be suspended for the next match against Switzerland due to receiving his second yellow card of the tournament.", "England fans celebrated wildly after the goals against Slovakia.", "The match was held at VELTINS-Arena in Gelsenkirchen, Germany.", "Attendance for the match was 47,244.", "England secured a place in the Euro 2024 quarterfinals.", "The match took place at VELTINS-Arena in Gelsenkirchen, Germany with an attendance of 47,244."], "ranking": [8, 5, 4, 2, 7, 6, 1, 3]}
{"candidates": ["Gordon suffered a heavy fall following a high-speed electric bike accident but is fit to feature against Slovakia", "It remains to be seen whether left-back Luke Shaw, who has not played since February due to a muscle injury, will be ready to be involved against Slovakia"], "ranking": [2, 1]}
{"candidates": ["Gabriel Dadzie scored Djibouti's first goal in the qualifiers through a penalty.", "Mohamed Aden scored for Djibouti in the 25th minute.", "Wondimu Dibaba scored for Ethiopia in the 31st minute.", "Mouktar Youssouf scored for Djibouti in injury time (90+4')."], "ranking": [1, 2, 3, 4]}
{"candidates": ["England lost the last game before a full tournament for just the second time in their history, and the first since 1954.", "This is the first time since 1968 that England have lost their final match before a major international tournament.", "England set an unwanted record going back 70 years against Iceland.", "England went 1-0 down in three consecutive Wembley games for the first time since November 1954."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Dagur Thorsteinsson scored the only goal of the match in the 12th minute.", "Ingi Ingason received a yellow card in the 45+1 minute.", "Arnar Haraldsson received a yellow card in the 79th minute.", "Finnsson received a yellow card in the 81st minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Gareth Southgate named his 26-man squad on Thursday, creating anticipation ahead of the match.", "The match was England's final warm-up game ahead of Euro 2024.", "Gareth Southgate emphasized the importance of being better without the ball and showing more composure with the ball.", "Southgate mentioned that many players needed the game to manage their minutes and get back into the rhythm of playing.", "Southgate confident England will be better against Serbia.", "England are my favourites to win Euro 2024 - but they've left their best goalkeeper at home, writes Graeme Souness.", "Wayne Rooney and Joe Cole name the two players they feel should have been on the plane.", "Gareth Southgate explains why selection news came ahead of deadline.", "Gareth Southgate’s starting lineup for the opening group game against Serbia seems written in stone, except for one position — the third midfield spot.", "The two main contenders to partner Declan Rice in the deeper lying roles seem to be Conor Gallagher and Kobbie Mainoo."], "ranking": [8, 6, 5, 4, 3, 1, 2, 7, 9, 10]}
{"candidates": ["Gareth Southgate named his final 26-man squad for Euro 2024, omitting Jack Grealish and Harry Maguire, which caused shockwaves within the England camp.", "Southgate emphasized the importance of team spirit and togetherness, which has been a core part of the England camp's culture.", "Southgate's decision to leave out Grealish was partly to avoid public clamour for his selection and media scrutiny.", "There were concerns about missing Grealish's creativity, especially with the omission of James Maddison.", "Southgate's squad includes uncapped players like Adam Wharton and Eberechi Eze, and both Ollie Watkins and Ivan Toney were selected to provide different attacking options.", "Southgate's decision to leave out Maguire was due to his complicated recovery from a calf injury.", "Southgate highlighted the need for a veteran presence in defense, selecting Lewis Dunk despite his injury concerns.", "Southgate's squad selection aimed to bring hunger and competitiveness to the team, starting with the friendly against Iceland.", "Gareth Southgate explained his decision to omit Jack Grealish from the England squad for Euro 2024, citing the stronger performances of other players in the squad.", "Southgate mentioned that all players took the news respectfully and acknowledged their self-belief and mindset.", "Southgate highlighted that the attacking areas of the squad are blessed with a lot of options, and the decision to leave out Grealish and Maddison was tough but necessary.", "England's Euro 2024 hopefuls have one final chance to impress Gareth Southgate in this friendly encounter.", "England made hard work of their clash with Bosnia-Herzegovina but still ran out 3-0 winners.", "Iceland has not been in action since their Euros dreams were dashed by Ukraine in March.", "Some players' efforts on June 7 may be futile against Iceland as Gareth Southgate announced his final 26-man selection on Thursday, axing seven players from his selection.", "England manager Gareth Southgate should be boosted by a handful of returning players for Friday's international friendly against Iceland at Wembley.", "The Three Lions' final tune-up fixture before Euro 2024 comes four days after a 3-0 win over Bosnia-Herzegovina at St James' Park, where nine troops were missing for various reasons.", "Harry Maguire, Anthony Gordon and Luke Shaw all sat out the contest due to injury, and while the latter two are in the final Euros squad, the former is one of seven players omitted from the final 26.", "Bukayo Saka and John Stones should be fine after precautionary rests, while Jude Bellingham, Phil Foden, Kyle Walker and Kobbie Mainoo are back from their Champions League and FA Cup final commitments.", "With Southgate surely wanting to test out his favoured Euros XI, Stones and Walker should both start in the backline with Jordan Pickford and Kieran Trippier, still operating as a makeshift left-back.", "Marc Guehi should once again benefit from Maguire's absence, especially as Lewis Dunk has also picked up an injury and Jarrad Branthwaite has failed to make the Euros selection.", "As Trent Alexander-Arnold excelled in his midfield slot against Bosnia, the Liverpool man is in no position to be dropped, so Conor Gallagher should be sacrificed as Declan Rice returns to the engine room.", "While Cole Palmer and Eberechi Eze both enjoyed successful Euro 2024 auditions at St James' Park, Foden and Bellingham's returns should see them cut from the ranks for Friday's game, where Saka and Harry Kane - who scored as a substitute on Monday after a back issue - should also form a first-choice offensive quartet."], "ranking": [1, 5, 3, 4, 6, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]}
{"candidates": ["Declan Rice expressed his disappointment over the omission of his close friends Jack Grealish and James Maddison, but emphasized the team's focus on unity and success.", "Southgate acknowledged the difficulty of his decisions but stressed the importance of bonding as a group for tournament success."], "ranking": [2, 1]}
{"candidates": ["The match marked a famous Wembley win for Iceland, adding to their notable victory against England at Euro 2016.", "A young Iceland fan was shown holding up the 1-0 scoreline with his fingers while grinning wide from ear to ear.", "England outshot Iceland 13 to eight, but Iceland recorded four shots on goal to just one for the hosts.", "The match was held at Wembley Stadium with an attendance of 81,410.", "The referee for the match was Davide Massa.", "Weather or pitch conditions were not mentioned as affecting the game.", "Historical comparisons or records beyond match performance were not mentioned.", "Notable head-to-head statistics or unique cultural aspects were not mentioned.", "England will face Serbia in their opening Group C match in Gelsenkirchen next Sunday.", "Iceland did not qualify for the Euros, having been beaten by Ukraine in their playoff final in March.", "The match attendance was 81,410.", "England's defensive issues were highlighted, particularly the lack of intensity in pressing and the disjointed nature of their play.", "Concerns were raised about England's defense, especially with the absence of Harry Maguire and Jarrad Branthwaite.", "England's attacking talent was noted, but the performance did not justify their status as one of the favorites to win Euro 2024."], "ranking": [1, 5, 3, 12, 14, 13, 11, 10, 8, 9, 12, 2, 4, 6]}
{"candidates": ["Southgate's decision to include Luke Shaw despite his long-term injury was described as a calculated risk.", "Southgate's selection of Dean Henderson as the third-choice goalkeeper was based on his match sharpness.", "Southgate's squad selection process involved speaking to players individually, particularly those who did not make the final cut."], "ranking": [2, 3, 1]}
{"candidates": ["England only managed one shot on target in the entire contest.", "Southgate will have concerns over the fitness of centre back John Stones, who was replaced at half-time after appearing to roll his ankle in the first minute.", "England will fly to Germany on June 10 for Euro 2024.", "England's first game at Euro 2024 is against Serbia on June 16.", "Gareth Southgate draws level with Sir Bobby Robson in terms of matches in charge of the senior England side.", "England's cancelled post-match send-off.", "England face a defensive nightmare for Euro 2024 as John Stones is seen with medical staff in the tunnel."], "ranking": [5, 3, 7, 6, 2, 4, 1]}
{"candidates": ["Estonia lost 0-1 to Slovakia in their UEFA Nations League match on September 5, 2024.", "Tomáš Suslov scored the only goal of the match in the 70th minute.", "Estonian goalkeeper Karl Jakob Hein made strong saves early in the game.", "David Hancko and Ondrej Duda both struck the woodwork for Slovakia.", "Ioan Yakovlev's attempt at goal in the 88th minute was cleared by Slovakia captain Milan Škriniar."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Tamm scored for Estonia in the 38th minute.", "Robert Shein scored for Estonia in the 90th minute.", "Suslov scored for Slovakia in the 70th minute.", "Obert received a yellow card in the 28th minute.", "Bozenik received a yellow card in the 55th minute.", "Vavro received a yellow card in the 87th minute.", "Dubravka received a yellow card in the 90+5th minute.", "Calzona received a yellow card in the 90+6th minute.", "Hancko received a yellow card in the 90+5th minute."], "ranking": [5, 2, 3, 8, 7, 6, 9, 4, 1]}
{"candidates": ["Newly-crowned Baltic Cup champions Estonia kickoff their 2024 UEFA Nations League campaign on Thursday when they play host to Slovakia at the A. Le Coq Arena.", "This will be the first meeting between the sides since they faced off in the FIFA World Cup qualifiers back in 2005, when Francesco Calzona’s men won both home and away clashes in Group 3.", "Estonia clinched the 2024 Baltic Cup crown in June, when they defeated Lithuania on penalties in the final to make it five title triumphs in the competition.", "Estonia now head into the UEFA Nations League, where they clinched promotion from League D in 2022 after picking up four wins from four matches to finish first in the standings.", "Slovakia suffered a round-of-16 exit from the 2024 European Championship last time out when they were beaten 2-1 by England in extra time.", "Slovakia will look to improve on their underwhelming Nations League performance from 2022, when they finished third in the League C table, six points off first-placed Kazakhstan in the promotion spot.", "This will be the third-ever meeting between Estonia and Slovakia, with Calzona’s men picking up two wins from their previous two encounters in the World Cup qualifiers back in 2005.", "Estonia are on a run of four straight wins in the UEFA Nations League, scoring 10 goals and conceding twice since losing 2-0 against Cyprus in March 2022.", "Slovakia have won just one of their last five Nations League games while losing three and picking up one draw since June 2022.", "Following their Baltic Cup triumph, Estonia will head into Thursday’s clash with confidence as they look to begin their Nations League campaign on a positive note.", "Calzona’s side boast the firepower needed to get the job done and we predict they will make it three straight wins over the hosts."], "ranking": [8, 5, 10, 6, 9, 4, 3, 1, 7, 2, 11]}
{"candidates": ["Both Estonia and Slovakia aim to commence their schedules on a positive note.", "Estonia have indulged in four friendly fixtures during the 2024 international calendar.", "Slovakia are still reeling from Euro 2024 heartbreak.", "Estonia are aiming to get off to a strong start in this season's UEFA Nations League, when they face Slovakia at the A. Le Coq Stadium in Tallinn on Thursday evening (September 5).", "Estonia will definitely be without Rasmus Peetson on Thursday, after the FCI Levadia Tallinn midfielder pulled out of the Slovakia match due to illness."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Estonian head coach Jürgen Henn expressed disappointment but praised his team's defensive efforts.", "Henn highlighted the need for more decisiveness and directness in the penalty area.", "Henn was pleased with the team's adaptation to Slovakia's play style.", "Estonian goalkeeper Karl Jakob Hein acknowledged Slovakia's quality and reflected on the team's resilience."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Trent Alexander-Arnold scored a stunning free-kick in a 3-1 win over Finland.", "Jack Grealish opened the scoring in the first-half with a low finish into the bottom corner after a flicked pass from Angel Gomes.", "Fredrik Jensen missed a crucial chance to equalize for Finland early in the second half.", "Declan Rice finished well as he burst into the six-yard box to get on the end of Ollie Watkins’ low ball into the middle.", "Arttu Hoskonen scored a consolation goal for Finland with a header from a corner.", "Trent Alexander-Arnold scored a stunning free-kick to double England's lead.", "Jack Grealish opened the scoring for England in the first half.", "Declan Rice added a third goal for England on the counter-attack.", "Arttu Hoskonen scored a late goal for Finland from a corner.", "Fredrik Jensen missed a golden chance to equalize for Finland.", "Jack Grealish got England on the board just past the quarter-hour mark.", "Trent Alexander-Arnold scored by way of a great free kick.", "Declan Rice chipped in with a goal to make sure of the win.", "Arttu Hoskonen got a late consolation goal for Finland.", "Trent Alexander-Arnold scored a sumptuous free kick from a position to the left of centre, making it 2-0 for England.", "Jack Grealish opened the scoring with a cool finish after a lovely flick from Angel Gomes.", "Declan Rice scored the third goal from a cross by Ollie Watkins.", "Arttu Hoskonen scored a late consolation goal for Finland, heading home from a corner.", "Trent Alexander-Arnold scored a stunning free-kick from the left side of the box to make it 2-0 for England.", "Jack Grealish opened the scoring for England with a cool finish after a lovely flick from Angel Gomes.", "Declan Rice scored the third goal for England from a cross by substitute Ollie Watkins.", "Arttu Hoskonen scored a late consolation goal for Finland, heading home from a corner.", "Jack Grealish opened the scoring in the 18th minute with his fourth England goal.", "Trent Alexander-Arnold bent a free kick from 20 metres over the wall into the top corner in the 74th minute.", "Declan Rice tapped home substitute Ollie Watkins' cross 10 minutes later after making a bursting run from midfield.", "Arttu Hoskonen pulled one back for Finland with an 87th minute header from a corner.", "Jack Grealish netted the opener before Trent Alexander-Arnold bagged the second and Declan Rice the third.", "Fredrik Jensen missed a glorious chance to level the score for Finland.", "Trent Alexander-Arnold scored an exceptional free-kick to double England's lead.", "Ollie Watkins' surging run set up Declan Rice to make it three for England.", "Arttu Hoskonen scored a late consolation goal for Finland from a corner."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]}
{"candidates": ["Jack Grealish scored in the 18th minute.", "Trent Alexander-Arnold scored in the 74th minute.", "Declan Rice scored in the 84th minute.", "Hoskonen scored for Finland in the 87th minute.", "Jack Grealish scored in the 18th minute", "Alexander-Arnold scored in the 74th minute", "Rice scored in the 84th minute", "Hoskonen scored in the 87th minute"], "ranking": [8, 7, 6, 5, 8, 7, 6, 5]}
{"candidates": ["Lee Carsley emphasized the need for a reaction from England after their defeat to Greece.", "Jack Grealish revealed a £500 bet with Trent Alexander-Arnold over the free-kick.", "Manager Lee Carsley opted for a more coherent formation, helped in part by the return of striker Harry Kane.", "Noni Madueke came on for Cole Palmer midway through the second half.", "Levi Colwill was an unused substitute.", "Lee Carsley needed a win to stabilize his position after the defeat against Greece and the uncertainty around his longer-term role within the England setup.", "The match was expected to be more conventional in style, especially with Harry Kane back from injury to play as the No 9."], "ranking": [6, 4, 5, 2, 1, 3, 7]}
{"candidates": ["England are bidding to bounce back to winning ways when they travel to Helsinki to face Finland in the UEFA Nations League.", "The Three Lions' hopes of sealing a return to League A by winning Group B2 are in the balance following the shock 2-1 defeat to Greece at Wembley on Thursday.", "Lee Carsley's decision to start without a striker in the absence of the injured Harry Kane backfired, and it now seems highly unlikely the interim boss will be given the full-time gig as Gareth Southgate's successor.", "Kane could return to the starting XI, and he has fond memories of facing Finland after bagging a second-half brace on his 100th England appearance in last month's reverse fixture.", "The Three Lions are the heavy favourites to claim all three points, as Finland have lost all three of their Nations League games and prop up the table.", "Lee Carsley intends to return to a more familiar system against Finland in the Nations League on Sunday.", "Carsley went with an attacking 4-2-4 system against Greece, which struggled for cohesion and defensive security.", "Harry Kane missed the match against Greece due to a minor groin problem but is hoping to return in Helsinki.", "Carsley emphasized the need for a reaction against Finland after the defeat to Greece.", "Carsley plans to make changes to his starting XI against Finland, with Kyle Walker and Marc Guéhi in contention to return.", "Kane trained on Friday, and some players expect him to feature in Helsinki.", "England are facing a nervous wait over two of their most integral attackers ahead of Sunday's UEFA Nations League clash with Finland in Helsinki.", "Captain Harry Kane missed the previous match with a knock sustained while on duty for Bayern Munich.", "Arsenal winger Bukayo Saka was brought off early in the second half with a leg issue, likely a hamstring problem.", "Jack Grealish also has a fitness problem, so Jude Bellingham, Anthony Gordon, and Cole Palmer could hold their places.", "Carsley may bring in either Ollie Watkins or Dominic Solanke if Kane is not fit enough to start.", "Conor Gallagher in midfield would offer a stable presence alongside Declan Rice.", "John Stones may cede his place to Marc Guehi, while Kyle Walker could be a straight swap for Trent Alexander-Arnold on the right.", "Lee Carsley's England are under enormous pressure to respond after a defeat by Greece", "England lost 2-1 to Greece, while Finland lost by the same scoreline to the Republic of Ireland", "England are three points behind Greece in League B Group 2", "Finland have not kept a clean sheet in any of their last eight matches across all competitions", "Harry Kane is a massive doubt for the match due to injury", "Bukayo Saka is likely to be absent due to a hamstring injury", "Finland's Kaan Kairinen withdrew from the squad due to injury"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["England bounced back from their shock defeat to Greece.", "Lee Carsley made six changes after the Wembley defeat.", "Concerns remain about England's defense despite the win.", "Lee Carsley expressed happiness with the team's performance and their response to the previous defeat.", "Jack Grealish dismissed criticism of interim boss Lee Carsley and praised his management.", "Declan Rice expressed delight for Lee Carsley and emphasized the team's positive response.", "Lee Carsley appeared to withdraw himself from consideration for the job full-time after the Greece defeat, but he now has three wins from his four games in charge.", "Lee Carsley has shown a willingness to try some new things and has a personal connection with all the young players from his time as under-21 coach.", "Lee Carsley needed this win to return to the tranquil progress of his first camp in September after the mayhem of the Wembley defeat against Greece.", "The match was a return to a more conventional style for England, especially with Harry Kane back from injury to play as the number 9.", "Jack Grealish has enjoyed playing under Lee Carsley, scoring in his third start under him.", "Lee Carsley is likely to return to his old job with the under-21s at the end of his interim tenure in November.", "The match was seen as a return to the tranquil progress of Carsley's first camp in September.", "England's interim manager Lee Carsley made six changes from the shambolic 2-1 defeat by Greece at Wembley.", "Carsley has faced scrutiny since the loss, his first since Gareth Southgate stood down as England manager after Euro 2024.", "Sunday's win kept alive England's hopes of automatic promotion to League A of the Nations League after they were relegated last time out.", "They need to finish top of the group to automatically secure a berth in the competition's highest section, which likely means a victory when they play Greece again in Athens on Nov. 14.", "Finland will regret missing chances when England led 1-0, including two from Fredrik Jensen who fired just wide in the first-half and missed a sitter early in the second.", "Lee Carsley's side responded to their defeat against Greece with a solid win against Finland.", "England's victory boosts their automatic promotion hopes from League B Group 2.", "The match highlighted England's defensive troubles and reliance on Finland's poor finishing.", "Trent Alexander-Arnold's performance was commendable despite playing out of position."], "ranking": [10, 14, 18, 12, 6, 8, 4, 16, 2, 11, 15, 13, 5, 3, 9, 1, 7, 20, 19, 17, 21, 22]}
{"candidates": ["Carsley took responsibility for the defeat to Greece, acknowledging that the tactical plan was a backfire.", "Carsley expressed his belief in the team despite the setback and emphasized the importance of leading by example.", "Carsley mentioned that the performance against Greece has changed the narrative around his potential permanent appointment as England manager."], "ranking": [2, 3, 1]}
{"candidates": ["Lee Carsley mentioned that the England job deserves a world-class coach who has won trophies.", "Roy Keane and Ian Wright provided contrasting opinions on Trent Alexander-Arnold's defensive abilities and England's transition vulnerabilities.", "The match was held at the Helsinki Olympic Stadium, which hosted the 1952 Olympics.", "Attendance for the match was 32,411.", "The match was held at the Helsinki Olympic Stadium.", "England went level on points with Greece but trailed on goal difference."], "ranking": [5, 2, 4, 6, 3, 1]}
{"candidates": ["Finland are currently on a one-way street back down to League C", "Finland have shipped multiple goals in six of their last seven games"], "ranking": [2, 1]}
{"candidates": ["Lewandowski is only the third player to score in four successive EUROs (2012, 2016, 2020, 2024) after Luka Modrić and Cristiano Ronaldo (five).", "Antoine Griezmann came on to make his 33rd appearance in a major finals, surpassing Lilian Thuram's France record.", "N'Golo Kanté has never lost a match in regulation time at a major finals, his run of 18 games (W12 D6) a record for a European player.", "Kylian Mbappé scored his first European Championship goal and the first goal by a French player at Euro 2024.", "Kylian Mbappé scored his first-ever goal at a European Championship.", "Olivier Giroud made his 33rd appearance at a major tournament for France, setting a new record that surpasses the previous record-holder Lilian Thuram.", "Kylian Mbappé scored his first-ever goal at a European Championship.", "Robert Lewandowski became just the third player to score in four different editions of the UEFA European Championship after Cristiano Ronaldo and Luka Modric.", "Lewandowski is the only player to score at each of the last four Euros (2012, 2016, 2020, 2024).", "France had 55 touches in Poland’s penalty area in this match – only England against Denmark in Euro 2020 (56) has a side had more touches in the opposition box on record (since 1980) in a game at the UEFA European Championship.", "N’Golo Kanté has lost none of his 11 games at the UEFA European Championship (W6 D5), the joint most appearances made by a player in the tournament's history without ever ending on the losing side (level with Spain’s Xavi – W8 D3).", "Antoine Griezmann made his 33rd appearance for France at a major international tournament (Euros/World Cup), with only goalkeeper Hugo Lloris (35) playing more games for Les Bleus in the two competitions combined."], "ranking": [5, 8, 2, 10, 11, 9, 11, 4, 1, 6, 3, 7]}
{"candidates": ["Kylian Mbappe scored a penalty in the 56th minute.", "Robert Lewandowski scored a penalty in the 79th minute.", "Rabiot received a yellow card in the 43rd minute.", "Zalewski received a yellow card in the 24th minute.", "Probierz received a yellow card in the 53rd minute.", "Dawidowicz received a yellow card in the 89th minute.", "Swiderski received a yellow card in the 90+2 minute.", "Mbappe scored a penalty in the 56th minute.", "Lewandowski scored a penalty in the 79th minute.", "Rabiot received a yellow card in the 43rd minute.", "Zalewski received a yellow card in the 24th minute.", "Probierz received a yellow card in the 53rd minute.", "Dawidowicz received a yellow card in the 89th minute.", "Swiderski received a yellow card in the 90+2 minute."], "ranking": [1, 2, 5, 6, 7, 8, 9, 1, 2, 5, 6, 7, 8, 9]}
{"candidates": ["France were favorites at the outset of the tournament.", "France manager Didier Deschamps was described as a professor by Poland's manager Michal Probierz.", "Antoine Griezmann was left out of the starting XI, with Bradley Barcola getting his first start for France.", "Robert Lewandowski returned to the stadium where he made his name with Borussia Dortmund.", "The match was held at the BVB Stadion Dortmund.", "France needed a win to secure a more favorable position in the tournament draw.", "Kylian Mbappé returned ahead of schedule to lead the line for France despite suffering a broken nose against Austria.", "France needed to win the game to have any chance of finishing top of Group D."], "ranking": [5, 3, 4, 6, 8, 2, 1, 7]}
{"candidates": ["Łukasz Skorupski, Poland goalkeeper: 'I always want to be ready. I haven't had many chances with the team despite being in the Poland camp for many years. I think I showed today that if [Wojciech] Szczęsny decides to retire I'm ready to be No1. I learnt I was playing two days ago in training. The coach asked me if I was ready... and I told him that I am. I think I repaid his faith in me.'", "Didier Deschamps, France coach: 'I'm not disappointed at all. Of course we wanted top spot but who was just here? [Skorupski]. He was excellent, he made a lot of saves; you have to give credit to the goalkeeper. You can have two chances and score two. You can have seven as we did today and not score. I'd be more worried if there were no chances.'", "Michał Probierz, Poland coach: 'I would like to thank the fans for turning out today despite us being eliminated. We fought until the end, and we had some really good spells – that's how I want to play football going forward. I want to thank the players for their commitment – it's a shame we couldn't qualify. It's a pity we have to leave.'", "Deschamps expressed that the aim was to take first place but acknowledged the team's performance and chances created.", "Deschamps mentioned the need to be more effective despite the opposing goalkeeper's fine saves.", "Deschamps had no complaints about the legitimacy of Lewandowski’s second penalty effort.", "Deschamps grew irked as his side struggled to breach Poland's defense.", "France will now head to Duesseldorf for a last-16 tie against the runners-up in Group E.", "France is now on the same side of the draw as Portugal, Spain, and Germany.", "Poland had already been eliminated before this game but managed to rescue some pride with the draw.", "France could only come second in Group D after a 1-1 draw with Poland in Dortmund.", "Poland fans warmly applauded their team's effort.", "French fans were unhappy with finishing second in the group.", "Didier Deschamps showed belief in his team's football despite not topping the group.", "France's failure to hold onto their lead means they are now in the same side of the draw as hosts Germany, Spain, and Portugal.", "France settled for second place in Group D, while Poland finished fourth.", "France finished second in Group D and will face the runners-up from Group E in Düsseldorf.", "France are now on the same side of the draw as Spain, Portugal, and Germany.", "France failed to win their final group stage match at a major tournament for the ninth consecutive tournament.", "France have plenty of questions to answer and improvements to make if they are to go deep in the tournament.", "Poland were already eliminated from the tournament and played with the shackles off."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]}
{"candidates": ["The match ended in a 1-1 draw.", "France have reached four tournament finals since 2006, winning the 2018 World Cup and finishing as runners-up in the other three competitions.", "Poland are bidding to avoid losing every game in a European Championship group stage for the first time in their history.", "N’Golo Kante has two player-of-the-match awards already at Euro 2024, despite not having played a competitive match for France in two years before this tournament.", "France hasn’t lost any of its eight group games at European Championships under Didier Deschamps.", "With 47 goals for France, Mbappé is four goals away from tying with Thierry Henry in the list of all-time top scorers for the national team.", "Poland has failed to advance from the group stage in four of its last five appearances at the European Championship.", "Lewandowski has 82 goals in 151 appearances for Poland."], "ranking": [5, 2, 6, 1, 3, 4, 7, 8]}
{"candidates": ["Kylian Mbappé scored once and added two assists in France's 3-0 win over Luxembourg.", "Randal Kolo Muani scored the first goal for France with a header from a precise Mbappé pass.", "Jonathan Clauss scored the second goal with a thunderous strike from outside the box, assisted by Mbappé.", "Mbappé sealed the win with a low, first-time shot in the 85th minute.", "Goalkeeper Anthony Moris denied Mbappé from close range before the half-hour mark.", "Bradley Barcola made his France debut and assisted Mbappé's goal.", "Kylian Mbappé scored a goal in the 85th minute.", "Randal Kolo Muani scored a header in the 43rd minute.", "Jonathan Clauss scored a goal in the 70th minute.", "Kylian Mbappé scored once and added two assists in his first outing since his move to Real Madrid was announced, as France strolled to a comfortable 3-0 win over Luxembourg in a pre-Euro 2024 friendly in Metz on Wednesday.", "Randal Kolo Muani scored the first goal for France at the 43rd minute.", "Jonathan Clauss scored the second goal for France at the 70th minute.", "Kylian Mbappé scored the third goal for France at the 85th minute.", "Kylian Mbappe scored but missed several chances, including a potential hat-trick.", "Randal Kolo Muani opened the scoring with a header just before half-time.", "Jonathan Clauss scored a stunning goal from the edge of the box.", "Luxembourg hit the bar late in the game, nearly scoring.", "Kylian Mbappe scored late on from a Bradley Barcola cross.", "Kylian Mbappe was involved in all three of France’s goals against Luxembourg, contributing to a 3-0 win.", "Mbappe assisted the first goal by chipping the ball for Kolo Muani to head home.", "Mbappe's off-the-ball run created space for Jonathan Clauss to score the second goal.", "Mbappe scored the third goal, marking his 19th goal in 19 international games."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]}
{"candidates": ["France won 3-0 against Luxembourg with goals from Kolo (43'), Clauss (70'), and Mbappe (85').", "Kolo scored in the 43rd minute", "Clauss scored in the 70th minute", "Mbappe scored in the 85th minute"], "ranking": [1, 2, 3, 4]}
{"candidates": ["Kylian Mbappe expressed his happiness and relief after signing a five-year contract with Real Madrid, which he believes will positively impact his performance.", "Mbappe emphasized the importance of getting back into shape and preparing for the Euros.", "France manager Didier Deschamps highlighted the importance of Mbappe's leadership and the flexibility of the attacking line."], "ranking": [2, 3, 1]}
{"candidates": ["Kylian Mbappé celebrated his move to Real Madrid in style in France's win over Luxembourg.", "Manager Didier Deschamps praised Mbappé as a formidable leader and highlighted his performance despite not playing much recently.", "Bradley Barcola expressed pride and happiness in making his debut and contributing to the win.", "Didier Deschamps praised Kylian Mbappé, calling him a great leader and emphasizing the need for him to be at his best.", "Deschamps also praised N'Golo Kante for his solid performance, stating 'He did himself proud.'", "Didier Deschamps expressed concern over the team's blunt performance, especially in the first half, and acknowledged the need for improvement as Euro 2024 approaches.", "Didier Deschamps described Mbappe as a 'fantastic leader' and was satisfied with his performance.", "Mbappe reflected on his past experiences, stating that the Euros are more complicated than the World Cup and that he has everything to prove in this tournament."], "ranking": [5, 3, 6, 2, 4, 8, 1, 7]}
{"candidates": ["France dominated the match, pinning Luxembourg back inside their own half for large chunks of the opening 45 minutes.", "Luxembourg missed out on their first-ever major tournament with a 2-0 loss to Georgia in their Euro 2024 qualification playoff semi-final.", "France play Canada on Sunday in Bordeaux in their last warm-up match before Euro 2024 starts on June 14.", "France face Austria on June 17, the Netherlands on June 21, and Poland on June 25 in Euro 2024.", "The match was held at Saint-Symphorien Stadium in Longeville-les-Metz, eastern France.", "France received hearty support at the match.", "President Emmanuel Macron visited the French squad before their training session, with Mbappe standing in the front row."], "ranking": [1, 3, 5, 6, 7, 2, 4]}
{"candidates": ["The match was held at Stade Saint-Symphorien", "France won 3-0 against Luxembourg"], "ranking": [2, 1]}
{"candidates": ["Venezuela recorded their first victory against Ecuador at a Copa America since 2011."], "ranking": [1]}
{"candidates": ["Kendry Paez played a key role in the pivotal moment of Ecuador’s 2-1 defeat to Venezuela.", "Enner Valencia received a red card after a VAR check for a chest-high kick.", "Jeremy Sarmiento opened the scoring for Ecuador with a well-taken finish on 39 minutes.", "Venezuela's Jhonder Cádiz and Eduard Bello scored after half-time substitutions.", "Enner Valencia was sent off in the 22nd minute for a high boot.", "Jeremy Sarmiento scored just before halftime to put Ecuador in front.", "Jhonder Cadiz scored in the 64th minute to level the scores for Venezuela.", "Eduard Bello scored the winning goal for Venezuela in the 74th minute.", "Enner Valencia was sent off for a lunge on Jose Martinez.", "Jeremy Sarmiento scored for Ecuador with a low shot.", "Jhonder Cadiz scored for Venezuela from Salomon Rondon’s layoff.", "Eduard Bello scored the winning goal for Venezuela by smashing home a rebound.", "Venezuela struck twice in the space of 10 minutes in the second half to come from behind and earn a 2-1 victory over Ecuador.", "Enner Valencia scored in the 22nd minute for Ecuador.", "Jeremy Sarmiento scored in the 40th minute for Ecuador.", "Jhonder Cádiz scored in the 64th minute for Venezuela.", "Eduard Bello scored in the 74th minute for Venezuela."], "ranking": [13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 15, 14, 16, 17]}
{"candidates": ["We are predicting Ecuador to win, with a 50.0% chance of winning this match, based on the moneyline.", "In the past two years, Ecuador scored 19 goals in 15 matches, and Venezuela conceded eight in 13 matches.", "Venezuela has scored 12 goals in 13 games the past two years. On the flip side, Ecuador has conceded 13 goals in 15 games.", "Ecuador posted a positive goal differential during that time span, at +6.", "Venezuela's goal differential in that time was positive, +4.", "Ecuador and Venezuela are set to clash in the Copa America 2024 at Levi’s Stadium, with Ecuador entering as the favorite.", "Ecuador’s “La Tri” will be looking to build on their recent victories over Bolivia and Honduras.", "Veteran striker Enner Valencia is expected to lead Ecuador’s attack, while forward Kevin Rodriguez’s return from injury means he will also be part of the lineup.", "Another key player for Felix Sanchez’s team is Bayer Leverkusen left-back Piero Hincapie.", "Venezuelan football icon Salomon Rondon is likely to return to the starting lineup after scoring as a substitute in the last friendly match.", "The previous meeting between the two teams in the 2021 Copa America ended in a 2-2 draw.", "Ranked 30th in the latest FIFA rankings, Ecuador has scored 19 goals in 15 matches over the past two years, while conceding 13.", "Venezuela, ranked 54th, has scored 12 goals in 13 matches during the same period, while allowing in 8.", "Statistically, the odds favor Ecuador, with the moneyline odds at +100 for an Ecuador win, +225 for a draw, and +330 for a Venezuela victory.", "The over/under for total goals is set at 1.5, with the over at -210 and the under at +165."], "ranking": [10, 8, 7, 5, 4, 3, 12, 9, 6, 11, 2, 1, 14, 13, 15]}
{"candidates": ["Both Ecuador and Venezuela will be bidding to get their respective 2024 Copa America campaigns off to positive starts when they lock horns at the competition on Saturday.", "Ecuador will be bidding to progress past the group stage of the Copa America for their second tournament in a row.", "Ecuador have never won the Copa America, but they have finished fourth on two previous occasions - in 1959 and 1993.", "Ecuador will enter this match off the back of successive wins, beating Bolivia and Honduras in their friendlies earlier this month.", "Sanchez's side have made a positive start to their 2026 World Cup qualification section, collecting eight points from six matches.", "Venezuela have not actually been in action since a goalless draw with Guatemala at the end of March.", "Fernando Batista's side were last victorious against Chile in October 2023.", "Venezuela have also made a solid start to their 2026 World Cup qualification campaign, sitting fourth, one point and one spot above Ecuador.", "There has not been much to choose between these two sides in their recent meetings, with both winning one of their last six matches, and the other four games ending in draws.", "The two teams last locked horns in a 2026 World Cup qualifier in November 2023, with the score finishing level, but Ecuador did beat Venezuela 1-0 at the end of 2021.", "Ecuador and Venezuela appear ready for a fight in the Copa America 2024 Group B.", "Ecuador will be led by Spanish manager Felix Sanchez, who took over the team in March 2023.", "Key players for Ecuador include Moises Caicedo from Chelsea and Pervis Estupinan from Brighton.", "Venezuela, under Argentine coach Fernando Batista, has been undefeated since the first round of World Cup qualifiers.", "Key figures for Venezuela include Girona midfielder Yangel Herrera, captain Tomas Rincon, and all-time leading goal scorer Salomon Rondon."], "ranking": [10, 8, 6, 5, 4, 3, 2, 9, 7, 1, 12, 11, 14, 13, 15]}
{"candidates": ["Kendry Paez showed his frustration as he narrowly missed the net after a shot on goal.", "Paez was energetic and proactive despite Ecuador being a man down.", "Venezuela's coach Fernando Batista made key substitutions that changed the game.", "Venezuela's win gives them a fantastic platform to attempt to reach the knockout stages.", "Ecuador have not won their opening game at a Copa America since 1993.", "Enner Valencia is likely to be suspended for the remaining two group-stage games, which may affect Ecuador's chances."], "ranking": [4, 2, 5, 1, 6, 3]}
{"candidates": ["The match was played in hot conditions at Levi’s Stadium in San Jose, California.", "Kendry Paez is considered one of the most exciting teenagers in world football.", "Paez will join Chelsea in May 2025 after turning 18.", "Ecuador played most of the match with 10 men after Enner Valencia's red card.", "The match was held at Levi's Stadium in Santa Clara, California.", "Attendance for the match was 29,864.", "This is just the third time Venezuela have begun the tournament with a victory, having also done so in 2015 and 2016.", "It's Venezuela's ninth win in 71 matches at Copa America all-time.", "The match was held at Levi's Stadium in Santa Clara, California, USA.", "Attendance for the match was 29,864.", "Ecuador had 34.1% possession while Venezuela had 65.9% possession.", "Ecuador had 4 shots on goal while Venezuela had 5 shots on goal."], "ranking": [12, 5, 6, 3, 11, 10, 2, 4, 9, 8, 1, 7]}
{"candidates": ["The match between Ecuador and Venezuela is scheduled for 22/06/2024 at Levi’s Stadium in Santa Clara, CA."], "ranking": [1]}
{"candidates": ["France became the first European team to ever reach the quarter-finals of a major international tournament having only scored via own goals or penalties.", "Aged 37 years and 68 days, Belgium’s Jan Vertonghen became the oldest ever player to score an own goal at the UEFA European Championship.", "France midfielder N’Golo Kante has now played the outright most matches in European Championship history without ever ending on the losing side (P12 W7 D5)."], "ranking": [2, 3, 1]}
{"candidates": ["Jan Vertonghen's late own goal took France into the quarter-finals of Euro 2024.", "Substitute Randal Kolo Muani's shot deflected off Vertonghen to score the only goal of the match.", "Theo Hernandez made a brilliant saving block to deny Yannick Carrasco.", "Mike Maignan made crucial saves to deny Romelu Lukaku and Kevin De Bruyne.", "France won 1-0 against Belgium in the Euro 2024 round of 16.", "Randal Kolo Muani scored the only goal of the match.", "Kevin De Bruyne had a chance towards the end but couldn't score.", "Belgium's defensive play was a surprise to France.", "France reached the quarter-finals of Euro 2024 after edging past Belgium in a scrappy and tight contest in Dusseldorf.", "Jules Kounde gave the ball to N’Golo Kante, Kante slipped Randal Kolo Muani into the box, Kolo Muani’s shot hit Jan Vertonghen, the ball deflected past Koen Casteels and crossed the line.", "Romelu Lukaku spun into the 18-yard area and forced a save from Mike Maignan at the near post.", "Kevin De Bruyne came close with a blazing effort from range only for Maignan to keep him out.", "Theo Hernandez made a notable tackle on Yannick Carrasco.", "Randal Kolo Muani released a shot at the end of a fluent passing move that took a healthy piece of Vertonghen’s knee to beat Koen Casteels in the Belgian goal.", "Kolo Muani's shot was deflected by Jan Vertonghen, resulting in an own goal that sent France to the quarter-final.", "France defender Jules Koundé was named Player of the Match for his strong defense and contributions to attacking areas.", "Belgium's Mangala received a yellow card in the 90+2 minute.", "Belgium's Vertonghen received a yellow card in the 75th minute.", "France's Griezmann received a yellow card in the 24th minute.", "France's Tchouameni received a yellow card in the 14th minute.", "Randal Kolo Muani's mishit shot was deflected into the goal by Jan Vertonghen, resulting in France's 1-0 victory over Belgium.", "Theo Hernandez made a notable tackle on Yannick Carrasco.", "Mike Maignan made a strong save against a long shot from Kevin De Bruyne.", "Substitute Randal Kolo Muani's shot forced an own goal five minutes from time to give France a 1-0 win over Belgium.", "Aurélien Tchouaméni forced Koen Casteels into his first save of the day soon after the break.", "Theo Hernández made a brilliant tackle to stop Yannick Carrasco from scoring.", "Romelu Lukaku and Kevin De Bruyne brought good saves from Mike Maignan.", "Théo Hernández made a brilliant last-ditch tackle to prevent Yannick Carrasco from scoring.", "Randal Kolo Muani's shot deflected off Jan Vertonghen to score the only goal of the match in the 85th minute.", "Romelu Lukaku and Kevin De Bruyne forced Mike Maignan into action with their shots."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]}
{"candidates": ["France won 1-0 against Belgium in the Euro 2024 Round of 16.", "Vertonghen scored an own goal in the 85th minute.", "Tchouameni, Griezmann, and Rabiot had notable performances.", "Vertonghen and Tedesco received yellow cards in the 76th minute.", "Mangala received a yellow card in the 90+3 minute."], "ranking": [3, 2, 4, 1, 5]}
{"candidates": ["France remains on course to become European champions for the third time.", "Belgium bow out after what will go down as a disappointing tournament for them.", "France coach Didier Deschamps praised the team's performance and emphasized the importance of reaching the quarter-finals.", "Randal Kolo Muani expressed joy over the win and mentioned his coach's advice to bring energy and speed.", "Belgian captain Kevin De Bruyne expressed disappointment over the loss and mentioned the team's efforts.", "Belgium coach Domenico Tedesco stated that they will analyze the games and the tournament in a few weeks.", "France's Jules Kounde, the player of the match, highlighted the team's comprehensive game and his competitive spirit.", "Belgian goalkeeper Koen Casteels described the tournament as middling and expressed disappointment.", "Roy Keane reacted to Belgium’s Euro 2024 exit, stating, 'It’s tough on them. I think France were the better team. Obviously, the quality wasn’t really there. It wasn’t a surprise that it was an own goal that settled the game. You also need a bit of luck. France kept a clean sheet and when you do that, you will always have a chance.'", "Didier Deschamps emphasized the importance of the victory despite the lackluster performance.", "The match was compared to the 2018 World Cup semi-final where Belgium also struggled against France's defense.", "The article reflects on France's ability to win despite not playing attractively, likening them to Germany in the 1980s and 1990s.", "Kevin De Bruyne called a reporter's question about his side's golden generation'stupid' after Belgium's defeat.", "Kolo Muani said after the match, 'I got lucky [on the goal]. The coach had told me to bring my energy... to bring danger with my speed.'", "France coach Didier Deschamps said, 'It's beautiful. It was tight, but we enjoyed possession and we had more opportunities.'", "Deschamps added, 'We did a lot of good things. We have to savour it, it's quite an achievement. We're in the quarterfinals, they're going home.'", "Didier Deschamps' men continue to struggle in the final third despite their victory.", "Belgium manager Domenico Tedesco became the 11th different Italian to take charge of a knockout stage game at the UEFA European Championship."], "ranking": [14, 12, 10, 11, 13, 15, 9, 8, 1, 7, 6, 5, 4, 3, 2, 16, 17, 18]}
{"candidates": ["France are yet to score from open play in four matches at the tournament.", "France has conceded only one goal, from a penalty, so far in the tournament.", "France will now meet the winner of Monday's match between Portugal and Slovenia in the quarterfinals in Hamburg on Friday.", "The match was held at Merkur Spiel-Arena in Düsseldorf, Germany with an attendance of 46,810.", "France have won all five of their meetings with Belgium at major international tournaments, the joint-best 100% win rate one European nation has against another across the two competitions combined.", "France have reached the quarter-finals at the UEFA European Championship for a sixth time, level with Spain and Portugal.", "Belgium have now failed to score in five of their last six games at major international tournaments despite having a combined 59 attempts on goal and posting an xG of 6.85 across those five goalless matches.", "France have scored three goals at Euro 2024, with two of those being own goals and the other coming from the penalty spot.", "There have been five instances in UEFA European Championship history of a side winning a game 1-0 courtesy of an own goal, with France accounting for three of those."], "ranking": [5, 3, 9, 8, 1, 2, 4, 6, 7]}
{"candidates": ["Aurélien Tchouaméni made 21-line-breaking passes in this match, with 15 of those occurring in the final third; both the most by a French player in a match at Euro 2024 so far."], "ranking": [1]}
{"candidates": ["Christian Eriksen scored a stunning late winner to give Denmark a 2-1 victory over Sweden.", "Pierre-Emile Højbjerg scored the opening goal for Denmark in the 2nd minute.", "Alexander Isak equalized for Sweden in the 9th minute.", "Christian Eriksen scored a stunning late winner to give Denmark a 2-1 victory over Sweden.", "Pierre-Emile Højbjerg scored the opening goal for Denmark in the 2nd minute.", "Alexander Isak equalized for Sweden in the 9th minute.", "Christian Eriksen scored and assisted a goal for Denmark in the win.", "Pierre-Emile Højbjerg scored the opening goal for Denmark in the first 90 seconds.", "Alexander Isak scored for Sweden after a loose ball fell to him.", "Christian Eriksen scored the winning goal for Denmark in the dying moments of the match.", "Christian Eriksen scored a stunning late winner to give Denmark a 2-1 victory over Sweden.", "Eriksen found Pierre-Emile Hojbjerg at the near post for an easy finish in the first minute.", "Alexander Isak scored for Sweden seven minutes after Denmark's first goal.", "Eriksen's curling, dipping strike in the 86th minute secured the win for Denmark."], "ranking": [1, 5, 6, 1, 5, 6, 3, 4, 7, 2, 1, 8, 9, 10]}
{"candidates": ["Hojbjerg scored in the 2nd minute", "Isak scored in the 9th minute", "Eriksen scored in the 86th minute", "Isak received a yellow card in the 38th minute", "Cajuste received a yellow card in the 90+2 minute"], "ranking": [3, 2, 1, 5, 4]}
{"candidates": ["Sweden's Danish coach Jon Dahl Tomasson was inducted into the Danish football Hall Of Fame ahead of kickoff.", "Denmark will entertain Sweden at Parken in a friendly on Wednesday.", "The hosts play Norway in another friendly later this week before heading to Germany for UEFA Euro 2024.", "The visitors have not qualified for the competition and will conclude the ongoing international break with a friendly against Serbia later this week.", "The hosts are unbeaten in their two games in 2024, with a win and a draw to their name, keeping two clean sheets.", "In their previous outing, they overcame the Faroe Islands 2-0 in March.", "They have been drawn alongside England, Slovakia, and Serbia in a tricky Group C at the UEFA Euro 2024.", "The visitors have seen conclusive results in three friendlies this year, with two wins and a defeat.", "In their previous outing, they defeated Albania 1-0 at home in March.", "The neighbors have a long-standing rivalry and have met 107 times in all competitions.", "The visitors lead 46-41 in wins and 20 games have ended in draws.", "The hosts are unbeaten in their last three meetings against the visitors, keeping two clean sheets.", "Seven of the last nine meetings between the two teams have produced under 2.5 goals, with seven clean sheets for the hosts.", "Sweden have won 12 of their last 13 friendlies, keeping five clean sheets.", "Denmark have suffered just one loss in their last 10 games in all competitions, recording seven wins.", "The hosts are unbeaten in their last four friendlies against the visitors, recording three wins.", "The hosts are unbeaten in their last nine home games in all competitions, keeping six clean sheets.", "Denmark are unbeaten at home in friendlies since 2015, keeping 11 consecutive clean sheets.", "Blågult have won three of their last four games in all competitions, scoring seven goals.", "Sweden have just one win in their last nine meetings against the hosts, scoring just three goals."], "ranking": [18, 20, 19, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17]}
{"candidates": ["Denmark is preparing for Euro 2024 and will compete in Group C against Slovenia, Serbia, and England.", "Sweden missed out on a spot at the Euros and will look to disrupt Denmark’s preparations.", "Sweden's new manager, Jon Dahl Tomasson, is the first-ever non-Swede to take charge of the team.", "Rasmus Hojlund and Alexander Isak are highlighted as key players to watch.", "Denmark has been in good form with a record of W-D-L-W-W in their last five matches.", "Sweden has been inconsistent with a record of W-L-W-W-L in their last five matches.", "Betting tips favor Denmark to win, with odds of 1.90 for a Denmark win, 3.40 for a draw, and 3.85 for a Sweden win.", "The most common result of matches between Denmark and Sweden is 1-0, with three matches ending with this result.", "Denmark scores an average of 2 goals at home, while Sweden scores an average of 1.6 goals away.", "Denmark is preparing for Euro 2024, while Sweden did not qualify", "Denmark has not conceded a goal in a home friendly for almost seven years", "Sweden's new coach Jon Dahl Tomasson is the first non-Swede to manage the team", "Sweden's Alexander Isak is expected to lead the attack"], "ranking": [12, 9, 8, 7, 6, 5, 4, 3, 2, 11, 1, 10, 13]}
{"candidates": ["Denmark coach Kasper Hjulmand gave credit to Tomasson for his work with Sweden.", "Hjulmand mentioned that Denmark gave away too many turnovers in the first half.", "Christian Eriksen expressed happiness for his assist for the opening goal and mentioned it created calm in the team.", "Christian Eriksen's performance cemented his spot as Denmark's most potent creative force ahead of the Euro 2024 tournament.", "Denmark continued their preparation for EURO 2024 with a pulsating 2-1 win against rivals Sweden.", "Denmark will hope to add another morale-boosting victory before the Euros as they host Norway on Saturday.", "Sweden’s summer ends after their game at home to Serbia.", "Denmark coach Kasper Hjulmand gave credit to Sweden's coach Jon Dahl Tomasson for his work with the team.", "Hjulmand mentioned that Denmark gave away too many turnovers in the first half.", "Eriksen expressed happiness for assisting the opening goal and scoring the winner.", "Eriksen acknowledged the importance of scoring from a set piece to create calm in the team."], "ranking": [8, 6, 5, 2, 1, 9, 10, 7, 6, 3, 4]}
{"candidates": ["The match was a pre-Euro 2024 friendly held at a sold-out Parken stadium in Copenhagen.", "Denmark will face Slovenia, England, and Serbia in Group C of Euro 2024.", "The match was a lively pre-Euro 2024 friendly held at a sold-out Parken stadium in Copenhagen, Denmark.", "Attendance for the match was 35,522.", "Denmark marked a 14th win in 16 games at home.", "Flashscore Man of the Match: Christian Eriksen (Denmark).", "Sweden's Danish coach Jon Dahl Tomasson was inducted into the Danish football Hall Of Fame ahead of kickoff."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The match will be held at Parken Stadium.", "Kick-off times are 10:30 PM (IST), 05:00 PM (GMT), and 12:30 PM (EST).", "The match will be telecasted on Sony Sports Network and Sony Liv in India, Premier Sports 2 in the UK, and ESPN and FOX Sports in the USA.", "Denmark has no injury concerns, while Victor Gyokeres is out due to injury for Sweden.", "Head-to-head record: Denmark has won 41 matches, Sweden has won 46 matches, and there have been 20 draws in their 107 encounters.", "The match was held at Parken Stadium in Copenhagen", "Denmark's last exhibition defeat at home was in 2015 to France"], "ranking": [6, 7, 5, 4, 2, 3, 1]}
{"candidates": ["It was England’s first loss to Greece, which is ranked No. 48 in the world ranking, in 10 matches between the teams.", "Greece recorded their first victory over England.", "The result marks England’s first competitive loss at Wembley in four years, and their first ever defeat to Greece.", "Greece beat England for the first time in their history.", "Greece scored at Wembley for the first time in their history.", "Vangelis Pavlidis' brace made history for Greece against England, marking Greece's first-ever win over England."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Vangelis Pavlidis scored the opener for Greece at Wembley Stadium in the 49th minute.", "Jude Bellingham equalized for England in the 87th minute.", "Vangelis Pavlidis scored Greece’s winner in the fourth minute of stoppage time.", "Greece had three goals disallowed in the game.", "There was a period of silence in tribute to George Baldock ahead of the game, with players wearing black armbands.", "Evangelos Pavlidis scored the opening goal for Greece in the 49th minute.", "Jude Bellingham equalized for England with a side-footed curler.", "Evangelos Pavlidis scored the last-gasp winner for Greece in stoppage time.", "Three Greece goals were disallowed for offside.", "Jordan Pickford made a crucial error leading to a near goal for Greece, saved by Levi Colwill.", "Ollie Watkins and Dominic Solanke were brought on as substitutes to change England's formation.", "Vangelis Pavlidis scored deep in second-half stoppage time to condemn England to a 2-1 UEFA Nations League defeat to Greece at Wembley.", "Pavlidis slammed home his second of the game after scrappy defending in the England penalty area in the 94th minute.", "England thought they had snatched a draw when Jude Bellingham lashed in an equaliser with three minutes of normal time remaining.", "Pavlidis dribbled his way through four defenders before bending a neat finish beyond Pickford for Greece’s first goal at Wembley.", "Bellingham’s powerful long-range finish appeared to have dragged England out of the mud, yet Greece had other ideas, and after some terrible defending from stand-in captain John Stones and his Manchester City team-mate Rico Lewis, Pavlidis drilled in a deserved winner for the visitors.", "Vangelis Pavlidis scored twice to secure Greece's victory.", "Jude Bellingham scored for England to level the match at 1-1.", "Vangelis Pavlidis scored the winning goal in injury time (90+4).", "England had a goal disallowed for offside.", "England's Levi Colwill made an acrobatic goal-line clearance to prevent a goal.", "England's Bukayo Saka was substituted due to injury.", "Vangelis Pavlidis scored the first goal for Greece in the 49th minute.", "Jude Bellingham equalized for England in the 87th minute.", "Vangelis Pavlidis scored the winning goal for Greece in the fourth minute of stoppage time.", "Greece had three goals ruled out for offside.", "Levi Colwill made a brilliant goalline clearance to prevent a goal after a mistake by Jordan Pickford."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Lee Carsley fielded a team without a recognized striker in the absence of injured captain Harry Kane.", "Cole Palmer started a competitive international for the first time for England and was deployed in central midfield.", "Lee Carsley opted for an attacking lineup with Jude Bellingham, Phil Foden, and Cole Palmer in central areas, and Bukayo Saka and Anthony Gordon on the wings.", "Carsley emphasized an aggressive approach, focusing on asking questions of the opposition.", "England set up with what appeared to be an ultra-attacking XI against Greece on Thursday night at Wembley.", "Carsley went with an experimental starting XI in the absence of Harry Kane, choosing to start Anthony Gordon, Bukayo Saka, Cole Palmer, Phil Foden and Bellingham, but not playing a recognised forward despite having Ollie Watkins and Dominic Solanke in reserve.", "England Interim manager Lee Carsley was hopeful to return as U21s coach if not offered a permanent job with the men's team.", "There was a minute's silence held before kickoff for Greece's former international George Baldock who died this week.", "Lee Carsley fielded an ultra-attacking line-up including Cole Palmer, Jude Bellingham, and Phil Foden."], "ranking": [6, 4, 8, 3, 9, 7, 2, 1, 5]}
{"candidates": ["Greece’s players celebrated one of their most famous wins by gathering together and holding up the No. 2 jersey of George Baldock, who was found dead in his Athens home on Wednesday at age 31.", "The match was marked by fluidity in England's lineup, with Trent Alexander-Arnold stepping up into midfield from right-back.", "England struggled with cohesion and were vulnerable to Greece's counter-attacks.", "It was an emotional, historic night for Greece, and one that will live long in the memory.", "Pavlidis dedicated his first goal to his former national team-mate George Baldock, who passed away in Athens on Wednesday.", "Greece's players were visibly emotional, dedicating their victory to their late teammate George Baldock.", "England's new system and strategy did not work as planned, leading to their defeat.", "The match took place at Wembley Stadium with an attendance of 79,012.", "England's first defeat under Lee Carsley left them second in the Nations League Group B2 with six points, while Greece topped the table with nine points."], "ranking": [1, 5, 7, 2, 3, 4, 6, 9, 8]}
{"candidates": ["Harry Kane celebrated his 100th England appearance", "David Beckham's 2001 free kick is a standout moment in previous meetings between England and Greece", "England have never lost to Greece in nine previous meetings, winning seven of them.", "This will be the first match between England and Greece in 18 years.", "The game will be broadcast live in the UK on ITV1, with live streaming available via the ITVX app.", "The game will be broadcast live in the UK on ITV1, with live streaming available via the ITVX app."], "ranking": [2, 4, 1, 3, 6, 5]}
{"candidates": ["Ticket prices for England vs Greece vary depending on the seating category and age.", "The highest price in the general category is £80, while the cheapest seat is £35.", "The prices for adults and children aged 16 and below in the family encloser are £25 and £12.50, respectively.", "Students, OAPSs and U16s are eligible for a £10 discount.", "There are only a limited number of England vs Greece tickets in the level two category, with prices ranging between £95 and £120.", "Members of the England Supporters Travel Club and My England Football pay a special price of £25 for the clash with Greece.", "Travel club members who have booked seats in Wembley's other areas ahead of this clash with Greece will receive £5 off for seniors and £2.50 for juniors.", "The first phase of ticket sales for this match began on 13 August 2024 and will conclude on 21 August, targeting the England Supporters Travel Club.", "The second phase of the sales for England vs Greece tickets will commence on 22 August and run through to 27 August 2024, targeting My England Football Club members.", "The general public sale for tickets to England vs Greece is scheduled for 28th August 2024, starting at noon.", "Greece supporters travelling to England to watch this clash with the Three Lions on 10 October 2024 can visit the official Wembley site for directions on how to book seats.", "Hospitality tickets for England vs Greece will give you a great view of the pitch, access to VIP lounges and an executive dining experience.", "Hospitality pricing for England vs Greece tickets varies depending on your seating location and the services provided.", "Hospitality packages include Inner Circle (£2,640), Center Circle (£5,046), Booby Moore (£9,030), One Twenty (£13,002), and Number Nine (£6,342).", "Private box hospitality packages are fully booked.", "England vs Greece tickets will be dispatched within the last week before England hosts Greece at Wembley on 10 October 2024.", "Disabled persons who wish to make reservations for England vs Greece should contact Wembley Stadium using the number available on the official stadium website.", "Wembley Stadium is most conveniently accessed via public transport, including train, bus, tube, rail, or pedestrian routes.", "Wembley Stadium is served by three stations: Wembley Park Station, Wembley Stadium Station, and National Express.", "If driving to Wembley on October 10, 2024, please use the stadium parking lot and reserve your parking space via wembleyofficialparking.com.", "Brent Council will fine illegally parked vehicles on matchday and, in the worst-case scenario, tow them away."], "ranking": [21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["England needed a strong performance to reinvigorate their fans after lackluster matches against Serbia and Denmark.", "In today’s preamble it was suggested that for Croatia to qualify they needed: Portugal to beat Georgia, Turkey to beat Czech Republic, England to beat Slovenia by three or more goals, Denmark to beat Serbia.", "All the noises from the England camp suggest that it will be Conor Gallagher that replaces Trent Alexander-Arnold in midfield against Slovenia.", "Declan Rice played with Gallagher in the youth teams at Chelsea before moving to West Ham. Rice said: 'I have played with Gallagher at academy level, played against him at Palace and Chelsea. He is a team-mate I would love to have on my team, he works his socks off, you feel so secure and safe in there with him.'"], "ranking": [2, 4, 3, 1]}
{"candidates": ["Gareth Southgate will be under more scrutiny as England scored just two goals in three group games.", "Slovenia's disciplined and diligent performance ensured their place in the knockout rounds.", "England's last-16 opponents are yet to be confirmed, with the Netherlands a possibility.", "England are now on the opposite side of the draw to Germany, Spain, Portugal, and France, so cannot meet any of those sides until the final.", "Gallagher was removed at the break for Kobbie Mainoo, showing Southgate's displeasure at his latest midfield combination.", "Palmer, like Mainoo, was bright off the bench and may now be in contention to start a knockout game on Sunday.", "England fans booed the team at halftime and again at the end of the match due to the lack of quality and penetration.", "Gareth Southgate faced criticism from fans, with some calling for his resignation despite England topping Group C.", "England qualified on top of Group C and will face a third-place finisher in the last 16, with potential opponents including the Netherlands, Romania, Belgium, Slovakia, or Ukraine.", "Slovenia celebrated their qualification to the last 16 in stark contrast to the disappointment of England's fans."], "ranking": [8, 6, 4, 3, 5, 7, 10, 9, 2, 1]}
{"candidates": ["The match was held at RheinEnergieSTADION in Köln, Germany with an attendance of 41,536.", "The match ended with England having 73.4% possession and Slovenia 26.6%.", "England had 4 shots on goal compared to Slovenia's 1.", "England topped Group C at Euro 2024 after a goalless draw with Slovenia.", "The introduction of Kobbie Mainoo at the interval brought a little more speed to England's passing.", "Slovenia dug in for the draw towards the end, rather than pushing for a first-ever win at a European Championship.", "Phil Foden demonstrated his value to the team with his movement.", "Player ratings for England: Pickford 6, Walker 5, Stones 6, Guehi 6, Trippier 5, Rice 5, Gallagher 4, Saka 4, Bellingham 4, Foden 7, Kane 5. Subs: Mainoo 7, Palmer 6, Alexander-Arnold n/a, Gordon n/a.", "Player ratings for Slovenia: Oblak 7, Karnicnik 7, Drkusic 6, Bijol 7, Janza 7, Stojanovic 6, Cerin 6, Elsnik 5, Mlakar 5, Sporar 6, Sesko 6. Subs: Ilicic 5, Celar n/a, Stankovic n/a, Balkovec.", "The atmosphere among the 18,000 England fans was intense, with continuous singing and support despite the team's struggles.", "England's defensive performance was solid, preventing Slovenia from creating significant chances.", "UK police have said there were no arrests and no reports of disorder last night, as 10,000 England fans descended on the centre of Cologne before the Slovenia game.", "The UK Football Policing Unit said this experience was 'indicative of what we have seen across Germany so far, with the vast majority of England fans behaving extremely well.'"], "ranking": [13, 10, 9, 8, 12, 7, 6, 5, 4, 3, 2, 1, 11]}
{"candidates": ["England and Slovenia's inaugural battle came in a 2009 friendly at Wembley - a game that Kek was also in charge of the visitors for during his first spell as head coach - but Defoe and Frank Lampard ensured that his London stopover would be a miserable one.", "The game will take place in Cologne, but ITV have based their matchday coverage in Berlin, outside the Brandenburg Gate.", "Pougatch had been in Stuttgart to watch Scotland's defeat to Hungary.", "Pougatch ran into serious difficulties with his train delayed leaving Stuttgart, then being forced to stop to recharge its battery and then eventually terminating early in Leipzig.", "Pougatch decided to switch to a car to get him to Berlin, comparing his journey to Britain's own dreadful trains."], "ranking": [1, 3, 4, 5, 2]}
{"candidates": ["The game’s turning point came in the 65th minute when DR Congo’s Yoane Wissa scored from the penalty spot to give his team a 2-1 lead.", "Arthur Masuaku scored in the 82nd minute to secure a 3-1 victory for DR Congo.", "Chancel Mbemba equalized for DR Congo in the 27th minute after Guinea's Mohamed Bayo scored a penalty in the 21st minute.", "Arthur Masuaku scored an excellent free-kick as DR Congo beat Guinea 3-1.", "Mohamed Bayo scored a penalty to put Guinea in front.", "Chancel Mbemba equalised for DR Congo.", "Yoane Wissa put DR Congo ahead with a penalty.", "Arthur Masuaku made it 3-1 in the 82nd minute with a free-kick from a difficult angle.", "Chancel Mbemba scored in the 27th minute.", "Yoane Wissa scored a penalty in the 65th minute.", "Arthur Masuaku scored in the 82nd minute.", "Mohamed Bayo scored a penalty in the 21st minute.", "DR Congo sealed their place in the Africa Cup of Nations semi-finals after a 3-1 victory over Guinea.", "Guinea were awarded a contentious penalty following Chancel Mbemba’s push on Mohamed Bayo.", "Mohamed Bayo scored the penalty to give Guinea the lead.", "Chancel Mbemba scored a swift response for DR Congo seven minutes later.", "Yoane Wissa scored a penalty to give DR Congo a narrow advantage.", "Arthur Masuaku scored a long-range free-kick to secure the victory for DR Congo."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]}
{"candidates": ["Mpasi Nzau became a hero for DR Congo after converting a penalty with a clinical finish to send DR Congo to the quarterfinals.", "DR Congo defeated Egypt in a dramatic penalty shootout following a 1-1 tightly contested round of 16 match.", "Meschak Elia scored for DR Congo in the 37th minute.", "Egypt equalized in the first minute of additional time before the break following a VAR review, resulting in a penalty converted by Mostafa Mohamed.", "Both teams missed one penalty each before scoring six consecutive penalty kicks.", "Egypt’s keeper Gabaski struck against the crossbar, leading to DR Congo's victory.", "Mbemba scored in the 27th minute", "Wissa scored a penalty in the 65th minute", "Masuaku scored in the 82nd minute", "Masuaku received a yellow card in the 37th minute", "Bayo scored a penalty in the 21st minute", "Diawara received a yellow card in the 64th minute", "Conte received a yellow card in the 79th minute"], "ranking": [1, 2, 6, 5, 3, 4, 8, 9, 10, 11, 7, 12, 13]}
{"candidates": ["Congo DR have made it to the Africa Cup of Nations quarter-finals without winning a game in regulation time", "The Leopards eliminated seven-time winners Egypt in the round of 16", "Guinea ended a losing run in the competition's first knockout by defeating Equatorial Guinea", "DRC are yet to win a game in Cote d'Ivoire", "The Leopards seek their first knockout stage victory since a quarter-final 4-2 win over Congo at the 2015 Cup of Nations", "Guinea progressed to the knockout rounds as the competition's best third-placed side", "Guinea aim to be productive in the final third to avoid exiting in the quarters"], "ranking": [2, 1, 5, 7, 3, 4, 6]}
{"candidates": ["The DR Congo players and coaching staff celebrated wildly as they secured their place in the semi-finals.", "Arthur Masuaku's goal was his third for his country in 26 caps.", "The Democratic Republic of Congo came from a goal behind to beat Guinea 3-1 in their Africa Cup of Nations quarter-final.", "DR Congo booked their spot in the last four of the competition for the first time since 2015.", "Flashscore Man of the Match: Arthur Masuaku (DR Congo)."], "ranking": [1, 5, 2, 3, 4]}
{"candidates": ["DR Congo sealed its ticket to the Africa Cup of Nations (AFCON) semi-finals with a 3-1 victory against Guinea.", "The match began as a closely contested battle but saw DR Congo pull away with late goals.", "DR Congo is set to face host Ivory Coast or Mali in the semifinals on Wednesday next week.", "DR Congo finished in second place in Group F, taking three points from their three group stage fixtures.", "DR Congo beat Egypt on penalties in the round of 16.", "The match was held at the Alassane Ouattara Olympic Stadium.", "Attendance for the match was 33,278."], "ranking": [1, 3, 4, 5, 2, 6, 7]}
{"candidates": ["Olivier Giroud scored his 57th international goal, extending his record as France's all-time leading marksman."], "ranking": [1]}
{"candidates": ["Alexis Sanchez will become the all-time record cap holder for the Chile national team if he appears in this encounter, taking him onto 162 caps."], "ranking": [1]}
{"candidates": ["France was down 1-0 to Chile, but Les Bleus quickly turned the situation around, scoring two unanswered goals.", "Randal Kolo Muani scored the second goal to give France a 2-1 lead, converting a pass from AC Milan’s Theo Hernandez for a header goal.", "Randal Kolo Muani scored one and assisted another as France celebrated a 3-2 friendly victory over Chile.", "Marcelino Nunez scored the opening goal for Chile.", "Youssouf Fofana scored the equalizer for France with a deflected effort.", "Theo Hernandez assisted Randal Kolo Muani's goal.", "Eduardo Vargas hit the post with a free header for Chile.", "Randal Kolo Muani assisted Olivier Giroud for his 57th France goal.", "Dario Osorio scored a long-range goal for Chile.", "France recovered from an early goal by Marcelino Nunez to win 3-2.", "Youssouf Fofana scored the equalizer for France with a deflected shot.", "Randal Kolo Muani headed in a cross by Theo Hernández to put France ahead.", "Olivier Giroud scored the third goal for France after a setup by Kolo Muani.", "Dario Osorio scored a late goal for Chile."], "ranking": [7, 4, 2, 12, 9, 11, 14, 3, 13, 8, 10, 5, 6, 1]}
{"candidates": ["France won 3-2 against Chile with goals from Fofana (18'), Kolo (25'), and Giroud (72').", "Chile's goals were scored by Nunez (6') and Osorio (82').", "France defeated Chile 3-2 with goals from Fofana (18'), Kolo (25'), and Giroud (72').", "Chile's goals were scored by Nunez (6') and Osorio (82')."], "ranking": [1, 4, 2, 3]}
{"candidates": ["Didier Deschamps is expected to make numerous changes to his France side ahead of the match against Chile.", "Kylian Mbappe was among the starters against Germany and should keep his place.", "Brice Samba had an excellent game in goal against Germany, but Mike Maignan is likely to start against Chile.", "The entire back four could change with William Saliba and Ibrahima Konate likely to start as central defenders.", "Theo Hernandez could replace his brother Lucas Hernandez at full-back.", "Olivier Giroud remains in good form for Milan and could start against Chile.", "Young Paris Saint-Germain midfielder Warren Zaire-Emery may keep his place in the starting lineup.", "Antoine Griezmann is absent due to injury, ending his 84-game streak with the French side.", "Kingsley Coman and Boubacar Kamara are also absent with injury.", "France will look to recover from Saturday's defeat to Germany when they welcome Chile to the Stade Velodrome.", "Chile will look to spring another surprise after a fine result of their own over the weekend.", "Antoine Griezmann was a late casualty from the squad after picking up a recurrence of a previous injury, ending his incredible 84-game streak in the France side.", "Kingsley Coman and Boubacar Kamara are also absent from the squad with injury, while Khephren Thuram has dropped down to the Under-21s.", "There are likely to be many changes to the France team, as Deschamps experimented with the side against Germany, but Kylian Mbappe may be one of the few players to keep his place.", "William Saliba, Olivier Giroud and Theo Hernandez are all possible candidates to come in.", "Alexis Sanchez will become the all-time record cap holder for the Chile national team if he appears in this encounter.", "At 34, Eduardo Vargas is still going strong in the Chile side, despite limited game time at Atletico Mineiro.", "Victor Davila had a fine game against Albania, which could see Ben Brereton Diaz remain on the bench here.", "Erick Pulgar, Diego Valdes and Guillermo Maripan are among the long list of late withdrawals for Chile."], "ranking": [15, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 14, 13, 16, 17, 18, 19]}
{"candidates": ["Didier Deschamps will be considering Randal Kolo Muani's performance for the Euro 2024 squad.", "The result eased doubts surrounding the French team after their loss to Germany.", "The match served as preparation for France ahead of the European Championship in June and July.", "Chile is building up to the Copa America in the USA in June."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Jonathan Clauss and Eduardo Camavinga were forced off injured in the first half.", "France appeared at risk of losing consecutive games for the first time since June 2015."], "ranking": [2, 1]}
{"candidates": ["France's defeat to Germany was their first home defeat in almost two years.", "Chile thumped in-form Albania 3-0 under new manager Ricardo Gareca."], "ranking": [2, 1]}
{"candidates": ["Emilio Nsue, at the age of 34, scored five goals in the group stages and became the oldest player to score five or more goals in an AFCON.", "Jose Machin became one of only three players to provide an assist in three consecutive AFCON matches, joining Yaya Toure and Martin Hongla."], "ranking": [1, 2]}
{"candidates": ["Mohamed Bayo scored a last-gasp winner to send Guinea into the last eight of the Africa Cup of Nations with a 1-0 win over 10-man Equatorial Guinea.", "Emilio Nsue missed a penalty for Equatorial Guinea after a lengthy VAR check.", "Federico Bikoro was shown a red card for a high-footed challenge on Mohamed Bayo.", "Guinea’s Mohamed Bayo scored the winning goal with a header from the center of the box to the bottom right corner, assisted by Ibrahim Diakite.", "Equatorial Guinea’s Féderico Bikoro was shown a red card in the 55th minute, leaving Equatorial Guinea at a numerical disadvantage.", "Emilio Nsue of Equatorial Guinea missed a penalty opportunity in the 69th minute, hitting the right post with a right-footed shot.", "Mohamed Bayo scored a last-minute goal in the eighth minute of stoppage time to secure a 1-0 victory for Guinea.", "Equatorial Guinea missed a penalty after Iban Salvador was fouled in the penalty area.", "Federico Bikoro of Equatorial Guinea was sent off in the 55th minute for a high-foot tackle on Mohamed Bayo."], "ranking": [1, 5, 3, 2, 4, 6, 8, 7, 9]}
{"candidates": ["Bikoro scored in the 55th minute for Equatorial Guinea.", "Bayo scored in the 90+8th minute for Guinea.", "Jeanvier received a yellow card in the 41st minute."], "ranking": [2, 1, 3]}
{"candidates": ["Equatorial Guinea are expected to stick to their aggressive style of play backed by an unflagging physicality and stamina.", "Equatorial Guinea are a free-scoring side, boasting the highest number of goals so far – nine.", "Guinea booked their place in the round of 16 as one of the four best third-placed teams.", "Guinea opened their campaign with an inspiring 1-1 draw against Cameroon but suffered a 2-0 setback in their follow-up game against title holders Senegal.", "Guinea are in search of their first title, with their best record being a runners-up spot in the 1976 edition.", "Equatorial Guinea striking star Emilio Nsue is currently the tournament’s top scorer with five goals.", "Guinea’s defense has come under fire for poor coordination. Coach Kaba Diawara has promised to fix the holes ahead of this meeting.", "Equatorial Guinea are favored to come out on top based on individualities."], "ranking": [6, 2, 5, 4, 3, 1, 7, 8]}
{"candidates": ["Experts predicted Equatorial Guinea to win based on their impressive group stage performance.", "Equatorial Guinea defied pre-tournament odds to win Group A.", "Guinea secured a spot in the round of 16 as one of the top four best-ranked third-placed teams."], "ranking": [2, 1, 3]}
{"candidates": ["Guinea ended a long sequence of losing in the AFCON knockout stages.", "Equatorial Guinea's fairytale run ended after finishing ahead of hosts Ivory Coast and Nigeria in Group A."], "ranking": [1, 2]}
{"candidates": ["The match ended with Guinea winning 1-0 against Equatorial Guinea.", "Equatorial Guinea's journey in the tournament ended in the round of 16."], "ranking": [1, 2]}
{"candidates": ["Equatorial Guinea are unbeaten in their last 10 matches, recording six wins and four draws.", "Equatorial Guinea boast four Afcon participations as opposed to 14 for Guinea.", "Equatorial Guinea’s best Afcon record remains a fourth place achieved in the 2015 edition.", "Guinea have suffered three defeats in their last 10 matches in all competitions.", "Equatorial Guinea have won thrice and drawn twice in their last five matches while Guinea have won twice, drawn once and lost twice.", "The match took place at Alassane Ouattara Olympic Stadium with an attendance of 36,340.", "Guinea will meet the winner of the Democratic Republic of Congo vs Egypt match in the quarterfinals."], "ranking": [1, 5, 3, 4, 2, 7, 6]}
{"candidates": ["This match marked the first time that Guinea faced Equatorial Guinea.", "The match took place at Stade Olympique Alassane Ouattara in Abidjan."], "ranking": [1, 2]}
{"candidates": ["Sports Mole predicted a 2-0 win for Armenia", "Armenia had won two of their last three games in all competitions", "Faroe Islands' offensive record in recent matches was poor", "Midfielder Eduard Spertsyan will miss the UEFA Nations League match between Armenia and Faroe Islands due to a slight injury.", "This will be the first meeting between the two nations."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Faroe Islands are last in their four-team group with one point from two games, while Armenia are second with three points.", "Faroe Islands lost 1-0 against Latvia in their last Nations League match.", "Faroe Islands drew 1-1 with North Macedonia in their first game of the 2024-25 tournament.", "Faroe Islands finished third in their group in the 2022-23 Nations League with eight points from six games.", "Faroe Islands have lost 12, drawn two, and won just one of their last 15 fixtures.", "Faroe Islands have lost four and drawn one of their last five home games.", "Armenia lost 2-0 against North Macedonia in their last match despite having a player advantage for the second half.", "Armenia were relegated from League B to League C in the 2022-23 Nations League.", "Armenia's coach Oleksandr Petrakov was appointed in January 2023.", "Armenia have won two of their three most recent matches.", "Armenia have lost their last six away fixtures.", "The highly anticipated match between Faroe Islands and Armenia is set to take place soon, stirring excitement among football fans and enthusiasts.", "Faroe Islands, known for their determined and resilient playing style, have shown great progress in recent years.", "Armenia boasts a talented squad, including several star players who possess remarkable technical skills and exceptional goal-scoring abilities.", "This match between Faroe Islands and Armenia is anticipated to be intense and competitive, with both teams eager to secure a victory."], "ranking": [12, 9, 8, 7, 5, 4, 11, 6, 10, 3, 15, 14, 13, 2, 1]}
{"candidates": ["The match took place at Tórsvøllur in Tórshavn, Faroe Islands.", "Attendance for the match was 1,852.", "Faroe Islands had 42.5% possession while Armenia had 57.5%.", "Faroe Islands had 4 shots on goal compared to Armenia's 6.", "Faroe Islands had 9 shot attempts while Armenia had 20.", "Faroe Islands received 1 yellow card, and Armenia received 3.", "Faroe Islands had 4 corner kicks, and Armenia had 9.", "Faroe Islands made 4 saves, and Armenia made 2."], "ranking": [8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Albert Gronbaek scored in the 36th minute for Denmark.", "Poulsen scored in the 61st minute for Denmark.", "Andersen received a yellow card in the 51st minute.", "Kristansen received a yellow card in the 59th minute.", "Lukic received a yellow card in the 70th minute.", "Pavlovic received a yellow card in the 72nd minute.", "Mitrovic received a yellow card in the 71st minute."], "ranking": [1, 2, 5, 6, 4, 3, 7]}
{"candidates": ["Denmark are under new management after the departure of Kasper Hjulmand following their last-16 exit to Germany at Euro 2024.", "Lars Knudsen is currently in caretaker charge for Denmark.", "Denmark beat Euro quarter-finalists Switzerland 2-0 on Thursday night.", "Serbia's 0-0 draw with Spain on the opening night benefits Denmark.", "Serbia have stuck with manager Dragan Stojkovic despite a poor showing at the Euros.", "Dinamarca e Sérvia se enfrentam neste domingo (8), às 13h, no Parken Stadium.", "A Nations League retorna com um confronto importante no Grupo A4 neste domingo, 8 de setembro de 2024.", "Dinamarca e Sérvia se enfrentam às 13h (horário de Brasília), no Parken Stadium, em Copenhague, pela segunda rodada da competição.", "Os torcedores poderão acompanhar a partida através das transmissões do Disney+ Premium, SporTV.", "O duelo coloca frente a frente as equipes comandadas pelos técnicos Morten Wieghorst, da Dinamarca, e Dragan Stojkovic, da Sérvia.", "A Dinamarca chega para este jogo em ótima fase na competição, ocupando a liderança do Grupo A4 com 3 pontos, fruto de uma vitória na rodada anterior.", "Os dinamarqueses marcaram 2 gols e não sofreram nenhum, demonstrando solidez defensiva.", "Já a Sérvia ocupa a terceira posição do grupo, com 1 ponto conquistado em um empate.", "Denmark will look to build on a 2-0 win over Switzerland when they take on Serbia in a highly-anticipated UEFA Nations League game.", "Lecce defender Patrick Dorgu is pushing for a rare start after scoring the opener against Switzerland.", "The Serbs did remarkably well to hold star-studded Spain to a goalless draw in their opener despite the absence of key players like Dusan Tadic, Sergej Milinkovic-Savic, Aleksandar Mitrovic, and Dusan Vlahovic.", "Dragan Stojkovic is unlikely to make changes to the team that faced Spain in Belgrade."], "ranking": [14, 10, 12, 15, 11, 16, 7, 8, 9, 13, 5, 6, 4, 3, 2, 1, 17]}
{"candidates": ["The match was held at Telia Parken with an attendance of 34,902 spectators.", "Denmark's victory marks their fourth win in five head-to-heads against Serbia.", "Denmark is now atop Group A4, five points above European champions Spain after two match days.", "Denmark had 54.1% possession while Serbia had 45.9%.", "Denmark had 3 shots on goal compared to Serbia's 2.", "Denmark had 8 corner kicks while Serbia had 3.", "The match was held at Parken in Copenhagen, Denmark with an attendance of 34,902."], "ranking": [7, 3, 1, 5, 4, 2, 6]}
{"candidates": ["Emilio Nsue’s second hat-trick in international football helped Equatorial Guinea register their first-ever H2H victory over Guinea-Bissau.", "Emilio Nsue scored the first Afcon treble since 2008."], "ranking": [1, 2]}
{"candidates": ["Emilio Nsue scored a hat-trick for Equatorial Guinea with goals in the 21st, 51st, and 64th minutes.", "Josete Miranda scored for Equatorial Guinea in the 47th minute.", "Esteban Orozco scored an own goal for Guinea-Bissau in the 1st half.", "Jefferson Encada scored for Guinea-Bissau in the 95th minute.", "VAR was used to confirm Jefferson Encada's goal for Guinea-Bissau.", "Luis Asue (Equatorial Guinea) received a yellow card.", "Saul Coco (Equatorial Guinea) received a yellow card and conceded a penalty.", "Emilio Nsue scored a hat-trick, including an expertly-taken one-on-one finish and a clinical strike past Djoco.", "Josete Miranda came close to doubling Equatorial Guinea’s lead but was denied by the crossbar.", "An own goal from Esteban Orozco brought Guinea-Bissau back to a level playing field.", "VAR overturned a penalty decision against Equatorial Guinea, which was initially given for a clumsy challenge from Saúl Coco on Franculino Djú.", "Miranda volleyed Equatorial Guinea back ahead shortly after the restart.", "Nsue slotted home his second goal from the back post courtesy of Basilio Ndong’s delivery.", "Nsue completed his hat-trick with another one-on-one strike past Djoco.", "Zé Turbo fired in a late consolation goal for Guinea-Bissau in second-half stoppage-time.", "Emilio Nsue scored a hat-trick as Equatorial Guinea closed in on the knockout stages of the 2023 Africa Cup of Nations by thrashing Guinea-Bissau.", "Esteban Orozco's own goal sent the sides in level at half-time.", "Josete Miranda's strike restored Equatorial Guinea's lead early in the second half.", "Ze Turbo netted a consolation for Guinea-Bissau in stoppage time.", "Emilio Nsue scored a hat-trick for Equatorial Guinea with goals in the 21st, 51st, and 61st minutes.", "Jorge Miranda Boacho scored for Equatorial Guinea in the 46th minute.", "Emilio Obiang Obono scored an own goal for Guinea-Bissau in the 37th minute.", "Jorginho Correia scored for Guinea-Bissau in the 93rd minute.", "Emilio Nsue scored a hat-trick for Equatorial Guinea with goals in the 21st, 51st, and 61st minutes.", "José Miranda scored for Equatorial Guinea in the 46th minute.", "Esteban Orozco scored an own goal for Equatorial Guinea in the 37th minute.", "Zé Turbo scored for Guinea-Bissau in the 90+3rd minute."], "ranking": [1, 5, 4, 7, 10, 14, 16, 2, 11, 6, 9, 8, 13, 3, 15, 12, 18, 20, 17, 19, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Equatorial Guinea played out a 1-1 stalemate against Nigeria in their curtain-raiser.", "Iban Salvador scored for Equatorial Guinea in the 36th minute against Nigeria.", "Victor Osimhen equalized for Nigeria shortly after Salvador's goal.", "Guinea-Bissau lost 2-0 to Ivory Coast in their opening match.", "Seko Fofana and Jean-Philippe Krasso scored for Ivory Coast against Guinea-Bissau."], "ranking": [3, 2, 4, 1, 5]}
{"candidates": ["This is predicted to be a close game by the Opta supercomputer, with Equatorial Guinea (39.4%) edging the pre-match simulations ahead of Guinea-Bissau (33.8%).", "This will be the first encounter between Equatorial Guinea and Guinea-Bissau at the CAF Africa Cup of Nations.", "Equatorial Guinea and Guinea-Bissau last met in March 2022, in Portugal. The friendly ended 3-0 to Guinea-Bissau.", "Following their 1-1 draw against Nigeria, Equatorial Guinea could go unbeaten in their opening two games of an Africa Cup of Nations for the third time out of four participations.", "Equatorial Guinea have scored in each of their last two games at the Africa Cup of Nations and are looking to do so in three consecutive matches in the competition for the very first time.", "After their 2-0 defeat to Ivory Coast in the opening game, Guinea-Bissau could lose both of their opening two matches of an Africa Cup of Nations tournament for the first time.", "Guinea-Bissau remain winless in 10 AFCON games (D3 L7).", "Equatorial Guinea are unbeaten in their last three group stage games at the Africa Cup of Nations (W2 D1).", "Guinea-Bissau have had 88 shots and gone 797 minutes at the Africa Cup of Nations without scoring a goal, since Piqueti’s 13th-minute strike against Cameroon in January 2017.", "Against Nigeria, Iban Salvador became the first Equatorial Guinea player to either score or assist in three different Africa Cup of Nations editions.", "As well as creating a game-high four chances, no Guinea-Bissau player completed more passes ending in the final third (7), won more duels (6), or was fouled (3) more than Alfa Semedo against Ivory Coast in the opening game of this year’s AFCON.", "Equatorial Guinea came into the match with an 11-game unbeaten run.", "Guinea-Bissau was looking for its first win in the history of the Africa Cup of Nations.", "Equatorial Guinea's probable line-up included Owono, Akapo, Anieboh, Orozco, Ndong, Ganet, Bikoro, Miranda, Machin, Salvador, and Nsue.", "Guinea-Bissau's probable line-up included Mendes, Cande, Sori Mané, Djaló, Carlos Mané, Semedo, Cassama, Rodrigues, Quizera, Gano, and Balde.", "Before the tournament, this match was seen as a straight duel to avoid last place in Group A."], "ranking": [10, 14, 15, 6, 3, 7, 12, 5, 9, 2, 11, 1, 13, 8, 4, 16]}
{"candidates": ["Equatorial Guinea beat Guinea-Bissau 4-2 in the second round of the African Cup of Nations.", "Emilio Nsue is the all-time leading scorer for Equatorial Guinea with 17 goals.", "Guinea-Bissau has yet to win a match in the Africa Cup of Nations.", "This comprehensive victory for Equatorial Guinea provisionally lifts them above Ivory Coast to the top of Group A.", "Guinea-Bissau now have it all to do if they want to qualify for the knockout stages, as even a victory in their last group game might ultimately end up not being enough.", "The result sends Equatorial Guinea top of Group A on four points before hosts Ivory Coast face Nigeria (17:00 GMT) and puts Juan Micha's side on the brink of a place in the last 16 following their 1:1 draw against Nigeria on Sunday."], "ranking": [2, 5, 6, 1, 4, 3]}
{"candidates": ["The match took place at the Alassane Ouattara Olympic Stadium in Abidjan, Ivory Coast.", "The match had 8 minutes of extra time.", "The match was streamed on Bandplay.", "The match took place at the Olympic Stadium of Ebimpé.", "Both sets of supporters showcased impressive dance moves in the stands during halftime.", "The match was part of the Africa Cup of Nations Group A.", "The match took place at Stade Olympique Alassane Ouattara.", "The attendance for the match was 13,888.", "The match was held at Stade Olympique Alassane Ouattara with an attendance of 13,888."], "ranking": [8, 6, 5, 4, 3, 2, 1, 7, 9]}
{"candidates": ["Yves Bissouma scored in the 7th minute to give Mali a 1-0 victory over Eswatini.", "Yves Bissouma scored the winning goal for Mali in the seventh minute after a defensive blunder by Eswatini.", "Moussa Djenepo from Mali had to be replaced by Camara after a heavy collision with Mpendulo Tfomo from Eswatini in the 12th minute.", "Adama Malouda Traore missed a chance for Mali in the 28th minute with a shot over the bar.", "Salim Diakite's low cross in the 36th minute went through Mamadou Doumbia, who could not reach the ball with the goalkeeper already out of his line.", "Mohamed Camara wasted a chance for Mali with a weak shot from outside the box.", "Yves Bissouma missed an opportunity to set up a second goal for Mali in the 55th minute.", "Adama Malouda had another chance in the 62nd minute but his shot went wide of the right post.", "Adama Malouda Traoré had another chance, but his shot went wide of the right post.", "Yves Bissouma had a great chance, but he was slow to pass the ball.", "Mali continues to press forward to increase its lead.", "The first half ends with Mali's 1-0 partial victory over Eswatini.", "Mali's number 12, Mohamed Camara, missed an opportunity where he could have advanced further into the six-yard box.", "Mali missed the second goal from a low cross by number 21, Salim Diakite, where number 9, Mamadou Doumbia, could not reach the ball.", "Adama Malouda Traoré misses another chance for Mali, as his shot goes over the goal.", "Mali tries to advance a lot on the flanks, but lacks the final touch.", "First change for Mali: Out: Djenepo, In: Camara.", "Heavy collision between number 19, Mali Moussa Djenepo, and number 12, Mpendulo Tfomo, from Eswatini.", "Eswatini takes the first shot, but it goes wide of Mali's goal.", "Gooooool for Mali: Eswatini's poor kick-off, the defender is robbed of the ball and the number 10, Yves Bissouma, takes advantage to make it 1-0."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]}
{"candidates": ["Yves Bissouma salvaged a point for Mali with a goal after his side had fallen behind to a Geny Catamo strike.", "Y. Bissouma scored the only goal of the match at the 7th minute.", "Amady Camara was substituted by M. Djenepo at the 18th minute.", "Sékou Koïta was substituted by M. Doumbia at the 65th minute.", "M. Sangaré was substituted by Y. Bissouma at the 65th minute."], "ranking": [1, 2, 5, 4, 3]}
{"candidates": ["Eswatini come into this game on the back of a 1-0 defeat away to Guinea-Bissau in their first AFCON qualifier.", "Eswatini's new head coach Zdravko Logarusic replaced Dominic Kunene in August.", "Mali's new head coach Tom Saintfiet replaced Eric Chelle in August.", "Mali are considered favourites to top Group I for the AFCON qualifiers."], "ranking": [2, 3, 3, 1]}
{"candidates": ["Mali gets a good away win on the other hand Eswatini stays at the bottom of the table."], "ranking": [1]}
{"candidates": ["The match was held at Mbombela Stadium in Nelspruit, South Africa, with an attendance of 406 spectators."], "ranking": [1]}
{"candidates": ["Florian Wirtz scored the second-fastest goal ever in international football within seven seconds.", "Wirtz's goal is the fastest in German international history.", "Florian Wirtz scored Germany's fastest international goal after seven seconds.", "Florian Wirtz scored Germany's fastest international goal after seven seconds.", "Toni Kroos played a vertical ball into Florian Wirtz, who scored within seven seconds of kick-off.", "Florian Wirtz scored the fastest-ever goal for Germany seven seconds into the game against France."], "ranking": [6, 2, 3, 5, 4, 1]}
{"candidates": ["Florian Wirtz scored a long-range goal within seven seconds after receiving a pass from Toni Kroos.", "Toni Kroos registered an assist in his first international match since Euro 2020.", "Kai Havertz added to Germany's lead in the second half.", "Florian Wirtz scored Germany's fastest international goal after seven seconds.", "Kylian Mbappé forced a fine save from Germany's Marc-André ter Stegen in the 26th minute.", "Kai Havertz scored Germany's second goal early in the second half.", "Florian Wirtz grabbed his first international goal with a strike that will go down in the history books as his Germany side beat France 2-0.", "Wirtz stunned the crowd in Lyon to give Germany the lead on the cusp of seven seconds.", "Kai Havertz wrapped up the encounter just after half-time in an impressive display by the Euro 2024 hosts.", "Jamal Musiala found Kai Havertz with a long pass, and Havertz slotted the visitors into a two-goal lead.", "France nearly halved the deficit in the 88th minute when Mittelstädt mistimed a clearance onto his own arm, but Antonio Rüdiger was on hand to hack the ball off the line and VAR adjudged the handball inside the box to be unintentional.", "Florian Wirtz scored Germany's fastest international goal after seven seconds.", "Kai Havertz scored the second goal for Germany at the 49th minute.", "Niclas Füllkrug won a free kick for Germany in the 90'+3' minute.", "Florian Wirtz scored the opening goal for Germany within seven seconds of kick-off.", "Kai Havertz scored Germany's second goal after a brilliant setup by Jamal Musiala.", "Brice Samba made three crucial saves towards the end of the match to restrict the damage to just two goals.", "Florian Wirtz scored Germany's fastest-ever goal seven seconds into the game.", "Kai Havertz made it 2-0 after the break.", "Antonio Rüdiger produced a late goalline clearance.", "Marc-André ter Stegen denied Kylian Mbappé in a one-on-one situation."], "ranking": [1, 5, 10, 2, 14, 11, 3, 4, 9, 8, 16, 6, 15, 7, 18, 12, 13, 19, 20, 17, 21]}
{"candidates": ["Wirtz scored in the 1st minute for Germany.", "Havertz scored in the 49th minute for Germany.", "Mbappe scored in the 68th minute for France.", "Rabiot scored in the 73rd minute for France.", "Nagelsmann received a yellow card in the 60th minute.", "Andrich received a yellow card in the 68th minute.", "Kai Havertz scored the opening goal for Germany in the 1st minute.", "Florian Wirtz scored for Germany in the 49th minute.", "Julian Nagelsmann made a tactical substitution in the 60th minute.", "Adrien Rabiot scored for France in the 73rd minute."], "ranking": [7, 6, 5, 4, 10, 9, 1, 2, 8, 3]}
{"candidates": ["Germany coach Julian Nagelsmann was desperate for a good start to the year ahead of the tournament on home soil in June.", "This was Didier Deschamps' 150th game managing Les Bleus.", "France's penultimate match before this summer’s Euros.", "Toni Kroos returned from international retirement for the upcoming European Championship."], "ranking": [3, 2, 4, 1]}
{"candidates": ["France is hosting Germany at the Groupama Stadium for an international friendly.", "This match represents both teams' first match of the year as Euro 2024 preparations heat up.", "France came through their Euro 2024 qualifying group with seven wins and one draw.", "Germany has been devoid of competitive action since exiting the World Cup in 2022 and has engaged solely in friendly matches during 2023.", "Julian Nagelsmann is the current coach of Germany, having taken over after Hansi Flick was sacked.", "Julian Nagelsmann confirmed that Kai Havertz would start as a striker against France.", "Nagelsmann praised Havertz's development under Mikel Arteta at Arsenal.", "Nagelsmann revealed that Maximilian Mittelstadt would earn his first international cap at left-back.", "Nagelsmann confirmed that Manuel Neuer would be Germany's number-one goalkeeper for Euro 2024 despite his recent injury."], "ranking": [6, 5, 8, 7, 4, 3, 2, 9, 1]}
{"candidates": ["Germany's Nagelsmann expressed satisfaction with the team's performance and the confidence boost from the game.", "France coach Didier Deschamps acknowledged the team's poor performance and took responsibility for the loss.", "France coach Didier Deschamps rang the changes on the hour mark but without Antoine Griezmann, the hosts lacked a cutting edge despite the presence of star striker Kylian Mbappé.", "Julian Nagelsmann's charges looked the more likely to score the next goal, with only fine saves by Samba denying debutant Maximilian Mittelstädt and Thomas Müller.", "Germany earned a confidence-boosting 2-0 friendly victory over France.", "This was Germany's first win in their last four games.", "Boos rang around the stadium at full-time, indicating dissatisfaction with France's performance.", "Aurélien Tchouaméni analyzed France’s defeat, stating 'We were outclassed in every department'.", "The German national team raised hopes that they can excel on home ground at Euro 2024.", "France were whistled derisively by the home fans at full time.", "It was Germany’s second consecutive victory over France, giving Julian Nagelsmann a timely boost."], "ranking": [8, 6, 5, 9, 2, 10, 7, 3, 4, 1, 11]}
{"candidates": ["The match was held at Groupama Stadium in Lyon, France, with an attendance of 56,000.", "This was Didier Deschamps' 150th game in charge of the French national team.", "The match was held at Groupama Stadium in Lyon, France.", "Attendance for the match was 56,000.", "Fans at the Groupama Stadium in Lyon chanted for changes during the second half.", "Germany's Max Mittelstädt tested Brice Samba with a shot destined for the bottom corner.", "Stuttgart’s Maximilian Mittelstädt started at left-back on his debut.", "Bayer Leverkusen’s Robert Andrich impressed in just his second cap.", "Germany showed bite and commitment as the visitors bossed the opening 20 minutes."], "ranking": [8, 2, 9, 7, 5, 4, 3, 6, 1]}
{"candidates": ["Antoine Griezmann has pulled out of the France squad due to an ankle injury, ending his streak of 84 consecutive appearances for France.", "Manuel Neuer is sidelined due to an adductor injury and is a doubt for his side's Champions League quarter-final with Arsenal.", "Toni Kroos is back in the national team setup for the first time since Euro 2020 and is in line to win his 107th cap for Germany."], "ranking": [2, 3, 1]}
{"candidates": ["Christian Eriksen won his 133rd cap, a record for a male Danish player.", "Christian Eriksen set a record for most appearances for Denmark with his 133rd international game.", "Christian Eriksen, whose 133rd cap made him the most capped Danish player of all time.", "Christian Eriksen was making a record 133rd appearance for his country.", "Denmark have drawn all three of their group games for the first time ever at a major tournament (World Cup & Euros).", "Serbia's total haul of six shots on target at Euro 2024 is their lowest-ever figure as an independent nation at a major tournament (World Cup & Euros since 2006).", "Christian Eriksen created the most chances ever by a Danish player at a major tournament on record (World Cup & Euros since 1980) with a total of 13 at Euro 2024."], "ranking": [1, 2, 3, 4, 5, 6, 7]}
{"candidates": ["Kasper Hjulmand expressed a good feeling about the upcoming game against Germany.", "Kasper Hjulmand expressed happiness about advancing to the knockout stage and acknowledged areas for improvement in attack.", "Dragan Stojkovic expressed disappointment over Serbia's failure to advance but praised his team's effort.", "Danish keeper Kasper Schmeichel expressed confidence about their chances against Germany in the round of 16.", "Aleksandar Mitrovic expressed disappointment over Serbia's failure to create enough chances and their emotional drain after the match.", "Christian Eriksen reflected on his record-breaking 133rd cap and the surreal feeling of achieving it.", "Denmark progresses to the knockout round of Euro 2024.", "Serbia is eliminated from the tournament with two points from three matches.", "Denmark will face Germany in the next round.", "Serbia coach Dragan Stojkovic expressed disappointment, saying, 'We’re disappointed because of the result. We haven’t been able to make the step that was lacking.'", "Stojkovic also reflected positively, 'We have to be very proud. Serbia showed themselves positively in a very even group.'", "Denmark coach Kasper Hjulmand reflected on the draw, stating that although they miss winning, they are happy to progress to the next stage.", "Denmark have qualified for the knockout stages of a UEFA European Championship on three of their last four attempts (reaching the quarter-finals in 2004 and the semi-finals in 2020).", "Serbia are now without a victory in their last eight major tournament matches (Euros/World Cup – D3 L5), since a 1-0 win over Costa Rica at the 2018 World Cup, their joint longest winless run at major tournaments (also a run of eight as Yugoslavia between 1974 and 1982)."], "ranking": [10, 6, 8, 9, 7, 1, 12, 13, 11, 5, 4, 3, 2, 14]}
{"candidates": ["Trezeguet scored in the 32nd minute to give Egypt a 1-0 lead.", "A. Manula scored an own goal in the 73rd minute, resulting in a 2-0 victory for Egypt.", "Trézéguet scored a goal for Egypt in the 32nd minute with a right-footed shot from the center of the box, assisted by Mohamed Salah.", "Aishi Manula of Tanzania scored an own goal in the 73rd minute, making the score Egypt 2, Tanzania 0.", "Mohamed Salah missed a penalty in the 73rd minute, hitting the bar with a left-footed shot.", "Haji Mnoga of Tanzania received a yellow card for a bad foul in the 65th minute.", "Mahmoud Hassan ‘Trezeguet’ gave the hosts the lead after 33 minutes.", "Mohamed Salah sealed the victory with a second-half penalty, capitalising on a foul on Omar Marmoush in the box.", "Trezeguet scored in the 32nd minute for Egypt.", "A Manula scored an own goal in the 73rd minute, giving Egypt a 2-0 lead.", "M. Salah scored a penalty at the 73rd minute.", "M. Trézéguet scored at the 32nd minute with an assist from M. Salah.", "Substitution at 78': A. Gabr in, O. Kamal out.", "Substitution at 78': Kahraba in, M. Mohamed out.", "Substitution at 62': N. Miroshi in, F. Salum out.", "Substitution at 61': Zizo in, E. Ashour out.", "Substitution at 61': O. Marmoush in, M. Trézéguet out.", "Substitution at 52': D. Kibu in, M. Samatta out.", "Substitution at 46': M. Sagaf in, M. Yahya out.", "Substitution at 46': C. M'Mombwa in, B. Starkie out.", "Substitution at 46': T. Allarakhia in, S. Msuva out.", "Substitution at 46': H. Mnoga in, H. M. Mkami out.", "Substitution at 46': H. Fathi in, M. Attia out.", "Substitution at 46': M. Hamdi in, A. Aboul-Fetouh out."], "ranking": [3, 2, 1, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Mbwana Samatta said that playing against one of the African giants was a valuable experience and the perfect build-up before facing Morocco on January 17.", "Samatta shared the lessons learned from facing Egypt, stating that playing against them has helped the team pick up some lessons to work on going into the Afcon.", "Taifa Stars head coach Adel Amrouche echoed Samatta’s sentiments, saying that the team has prepared well in Egypt and is heading to the Afcon not just to participate but to compete.", "Amrouche declared that there is no easy game in the competition, and the team needs to fight in all matches."], "ranking": [3, 2, 1, 4]}
{"candidates": ["The match took place at Cairo International Stadium with an attendance of 1,700 spectators.", "The match ended with a final score of Egypt 2, Tanzania 0.", "The match was held at Cairo International Stadium with an attendance of 1,700 spectators."], "ranking": [3, 1, 2]}
{"candidates": ["Bradley Barcola netted his nation’s fastest-ever goal just 13 seconds into their Nations League match against Italy."], "ranking": [1]}
{"candidates": ["France defeated Belgium 2-0 with goals from Kolo in the 29th minute and Dembele in the 57th minute.", "Kone and Digne received yellow cards for France in the 4th and 8th minutes respectively.", "Openda and Tielemans received yellow cards for Belgium in the 8th and 38th minutes respectively."], "ranking": [1, 2, 3]}
{"candidates": ["France’s national football team will lock horns with the Belgium national football team in the group-stage clash of the Nations League campaign at the Parc Olympique Lyonnais.", "France had a disappointing start to the Nations League campaign and will hope to find better luck on Monday.", "Despite reaching the semi-finals of Euro 2024, France’s national football team were awful to watch as the level of performance that the squad displayed was shameful as a collective.", "The two-time world champions will be determined to bounce back on Monday on home soil.", "This will be Didier Deschamps’ seventh major tournament as manager of the French side.", "Belgium’s national football team also had an underwhelming UEFA Euro campaign this summer but have started the Nations League on a strong note.", "Belgium are coming off a comfortable 3-1 win over Israel in their opening game of the competition.", "Belgium have lost each of their last three meetings with Les Blues in all competitions.", "Real Madrid players Aurelien Tchouameni and Ferland Mendy withdrew from the French squad due to their respective injuries.", "Bayern winger Michael Olise had a debut to forget in his first international game against Italy.", "Defender Loïc Badé’ who received his first senior call-up has sustained knee injury and has returned to his club Sevilla.", "Belgium’s record goalscorer Romelu Lukaku is a notable absentee from the squad.", "Arsenal forward Leandro Trossard missed out of the competition despite being a regular in the Euro 2024.", "Lois Openda is expected to lead the attack and will be supported by the electric Jermey Doku.", "France’s national football team are favourites for this tie despite failing to bounce back from their disastrous Euro 2024 campaign.", "France reached the semi-finals of Euro 2024 eventually slumping to a 2-1 loss at the hands of eventual winners Spain.", "Les Blues are coming off a 3-1 loss at home to Italy despite taking the lead in their Nations League opener.", "Belgium’s national football team secured a 3-1 win over Israel as Kevin de Bruyne’s double helped the side to a perfect start to the Nations League campaign.", "The Red Devils got a comfortable victory against Israel and would be hoping to continue with this momentum on Monday night.", "Belgium aimed for back-to-back wins in the UEFA Nations League.", "Belgium's head coach Domenico Tedesco named a side without Thibaut Courtois and Romelu Lukaku.", "Kevin De Bruyne and Jeremy Doku were expected to support the central striker for Belgium.", "Lois Openda was expected to start as the central striker for Belgium.", "Maxim De Cuyper was expected to start at left-back for Belgium.", "Experts predict a win probability of 35% for France, 30% for Belgium, and 35% for a draw.", "France must avoid falling further behind in Group 2 standings to advance to the quarterfinal stage.", "Belgium aims to exact revenge on France for their disappointing exit from Euro 2024."], "ranking": [14, 20, 1, 5, 18, 12, 7, 16, 24, 22, 25, 11, 15, 9, 21, 4, 6, 13, 8, 10, 19, 2, 3, 17, 23, 26, 27]}
{"candidates": ["Didier Deschamps eased the pressure with a win over Belgium.", "Belgium started well but lacked ideas after France opened the scoring.", "Kevin De Bruyne tried to get things going for Belgium but they were hardly a threat in the second half.", "N'Golo Kante was instrumental in France gaining control and played a role in both goals.", "France rebounded from their loss to Italy with a shutout victory over Belgium.", "Kevin De Bruyne appeared frustrated during the match.", "Didier Deschamps expressed relief and happiness with the team's reaction and performance against Belgium after a disappointing loss to Italy.", "Deschamps acknowledged that while the performance against Belgium was good, it does not mean everything is now wonderful or fixed."], "ranking": [5, 3, 2, 1, 6, 8, 4, 7]}
{"candidates": ["The match was held at Groupama Stadium in Lyon, France, with an attendance of 42,358.", "France had 46.5% possession while Belgium had 53.5%.", "France had 9 shots on goal compared to Belgium's 4.", "France made 4 saves while Belgium made 7.", "The match was a repeat of the Euro 2024 last-16 tie which France won 1-0 in Duesseldorf.", "France made eight changes to their lineup, including dropping captain Kylian Mbappe.", "Belgium was captained by Kevin De Bruyne.", "France and Belgium both have three points in Group A2, while Italy leads with six points."], "ranking": [8, 5, 4, 6, 3, 1, 2, 7]}
{"candidates": ["The two sides have faced off only 76 times in the past, with Belgium winning 30 of those games.", "France have won only 27 ties between both sides, whereas the remaining 19 games ended in a draw.", "France 1-0 Belgium – UEFA European Championship – July 01, 2024", "Belgium 2-3 France – UEFA Nations League – October 07, 2021", "France 1-0 Belgium – FIFA World Cup – July 10, 2018", "France 3-4 Belgium – International Friendly – June 07, 2015", "Belgium 0-0 France – International Friendly – August 14, 2013"], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Kylian Mbappe’s first game at the international level as a Real Madrid player ended in a disappointing 3-1 loss at home to Italy.", "The Frenchman has struggled to find his feet in La Liga as a return of three goals in five games is not what was expected of the Frenchman.", "The former PSG man is just one goal short of taking his international tally to 50.", "Belgium captain Kevin de Bruyne netted a brace to lead Belgium to a 3-1 win over Israel in their opening game of the Nations League.", "The veteran midfielder’s performance against Israel showcased his importance and leadership on the pitch."], "ranking": [3, 5, 2, 1, 4]}
{"candidates": ["Christian Eriksen tied his country's all-time record by making his 132nd international appearance.", "Harry Kane has now scored more goals at major tournaments than any other England player with 13.", "Harry Kane is now level with Michael Owen and Wayne Rooney as the players to score for England at the most major tournaments, with four apiece.", "Christian Eriksen became the oldest player with at least four chances created in consecutive European Championship games since Andrea Pirlo in 2012.", "Harry Kane became the third player to score at four different major international tournaments for England, along with Michael Owen and Wayne Rooney.", "Harry Kane’s opener was his fifth goal at the UEFA European Championship, becoming the first England player and eighth player overall to score 5+ goals at both the men’s FIFA World Cup and UEFA European Championship.", "Denmark’s leveller was England’s eighth goal conceded from outside the box at the UEFA European Championship. No side has conceded more on record in the history of the competition (since 1980, Portugal also 8).", "Morten Hjulmand’s equaliser was his first goal for Denmark (9th appearance). It was also Denmark’s ninth goal from outside the box at the UEFA European Championship, with only three teams netting more on record (since 1980 – Germany 15, Netherlands 12, France 11)."], "ranking": [3, 6, 5, 2, 4, 1, 7, 8]}
{"candidates": ["Harry Kane scored an early goal for England.", "Morten Hjulmand equalized for Denmark with a stunning strike.", "Phil Foden hit the post with a 20-yard drive.", "Andreas Christensen missed a great chance to secure a winner for Denmark.", "Pierre-Emile Hojbjerg's effort curled just wide of Jordan Pickford's far post.", "Harry Kane scored his first goal of the tournament after 18 minutes.", "Morten Hjulmand equalized for Denmark with a superb shot from outside the area on 34 minutes.", "Phil Foden hit the post with a left-foot effort from the edge of the area.", "Trent Alexander-Arnold was removed early in the second half and replaced by Conor Gallagher.", "Foden was substituted for Jarrod Bowen, Bukayo Saka was replaced by Eberechi Eze, and Harry Kane was substituted for Ollie Watkins.", "Ollie Watkins had a shot blocked by Kasper Schmeichel after running onto a through ball from Jude Bellingham.", "Mikkel Damsgaard's long-range effort was parried by Jordan Pickford.", "Pierre-Emile Hojbjerg's shot caused trouble for Jordan Pickford due to the poor surface conditions.", "Harry Kane gave England the lead in the 18th minute.", "Morten Hjulmand leveled for Denmark in the 34th minute with a powerful low shot from long distance.", "Gareth Southgate made a triple substitution with 25 minutes to play.", "The Frankfurt pitch caused problems for players, including an injury scare for Kyle Walker.", "England led early but was left hanging on for a 1-1 draw at the Waldstadion in Frankfurt.", "Denmark played better despite the draw.", "Harry Kane scored in the 18th minute with a left-footed shot from close range.", "Morten Hjulmand equalized for Denmark in the 34th minute with a long-range shot that ricocheted off the left post and into the net.", "Phil Foden hit the post in the second half.", "Harry Kane scored for England in the 18th minute.", "M. Hjulmand scored a wonder goal for Denmark in the 34th minute.", "Pierre-Emile Højbjerg was named the official player of the match for his defensive and attacking contributions.", "Harry Kane opens the scoring for England from close range in the 18th minute.", "Morten Hjulmand’s scorching 30-yard drive just after the half-hour secures a draw for Denmark.", "Phil Foden hits the post in the second half.", "Kyle Walker slips twice in the early running, rolling his ankle on the second occasion but continues after changing his boots.", "Conor Gallagher is introduced for Trent Alexander-Arnold on 54 minutes.", "Phil Foden almost scores with a rasping low drive from distance that rattles the upright.", "Ollie Watkins forces a save from Kasper Schmeichel after a pass from Jude Bellingham.", "Marc Guéhi makes a crucial tackle after being dispossessed by Alexander Bah.", "Kyle Walker charged forward after Jude Bellingham’s overhit pass down the right wing and caught Denmark left-back Victor Kristiansen by surprise, nicking the ball and running clear into the box. Walker cut the ball back and, via a couple of deflections, found Harry Kane, who slotted into the corner of the net.", "Harry Kane played a blind pass across the pitch inside his own half, which Kristensen collected. He found Morten Hjulmand, who fizzed an unstoppable effort from way outside the box low, and off the inside of the post into the net.", "Pierre-Emile Højbjerg forced Jordan Pickford into a save low down at his near post, and on another occasion, he flashed a fierce effort just wide of the post. Substitute Mikkel Damsgaard also drew a save from Pickford."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]}
{"candidates": ["Prince William posted a pre-game message on his official account on X saying 'May the best team win.'", "George Russell, Mercedes driver, expressed confidence in England's ability to win Euro 2024 before the match.", "Manager Gareth Southgate chose to ignore the clamour to ring the changes and instead named an unchanged starting XI for just a fifth time in his 97th game in charge of England."], "ranking": [3, 2, 1]}
{"candidates": ["England is gearing up for Euro 2024 with a lot of optimism, thanks to a talented squad and impressive showings in recent international tournaments.", "Key players such as Harry Kane, Bukayo Saka, and Jude Bellingham are anticipated to have crucial roles in England’s campaign.", "England has a win probability of 55%, whereas Denmark has a win probability of 20%."], "ranking": [2, 1, 3]}
{"candidates": ["Gareth Southgate admitted England need improvement after the draw with Denmark.", "England remain in control of Group C, topping the table on four points.", "Pierre-Emile Hojbjerg was named Player of the Match for his outstanding performance.", "The outcome will raise further questions about Gareth Southgate's approach, particularly the lack of fluidity between Phil Foden and Jude Bellingham.", "The reaction from England's public and press is unlikely to be positive, indicating that Southgate and his team have work to do.", "Gareth Southgate admitted England are struggling to cope with the pressure after the draw with Denmark.", "Harry Kane admitted England are struggling with and without the ball.", "Gary Neville highlighted the problem with Declan Rice's positioning and suggested Southgate could learn from Mikel Arteta's handling of Rice at Arsenal.", "Ben Stokes defended the England team against negative pundits after the draw.", "Both teams are in contention to advance to the knockout round at Euro 2024 in Germany.", "Harry Kane acknowledged the team's need for improvement and anticipated disappointment back home.", "Pierre-Emile Hojbjerg expressed frustration at not securing a win despite his man of the match award.", "Kieran Trippier emphasized the need for the team to stay together and improve.", "Christian Eriksen felt Denmark should have won the game and emphasized the need to win against Serbia.", "Gareth Southgate discussed the need for fresh legs and the experimental role of Trent Alexander-Arnold.", "Harry Kane acknowledged England's struggles with and without the ball and the need to improve pressure and ball retention.", "Kyle Walker highlighted the importance of managing the game in tournament football and acknowledged the need for improvement.", "Gareth Southgate has been managing Harry Kane's playing time to keep him fresh for knockout stages, inspired by France's management of Griezmann in the 2018 World Cup.", "Gareth Southgate accepts blame for England draw and admits ‘level has to be higher’.", "England lacked structure and progressive patterns in midfield, with all three of Southgate’s starters – Trent Alexander-Arnold, Declan Rice and Jude Bellingham – enduring difficult games.", "Southgate raised eyebrows when he withdrew his front three of Bukayo Saka, Harry Kane and Phil Foden on 70 minutes.", "England looked edgy, the pressure weighing heavily.", "Denmark good value for the draw, which they secured with Morten Hjulmand’s goal.", "England gained a point that puts them in a strong position to win the group, but they will want to leave this desperate performance behind them. There’ll need to be a huge improvement against Slovenia next Tuesday."], "ranking": [1, 14, 5, 3, 2, 4, 6, 8, 18, 12, 7, 9, 11, 10, 15, 16, 17, 13, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Frankfurt Arena will host the match between Denmark and England on 20 June 2024 at 18:00. Gates will open at 15:00.", "Stadium rules include no bags larger than A4 size, no professional cameras, and no smoking or e-cigarettes.", "Public transport is recommended for matchday travel as there will be no stadium parking available.", "Fans are advised not to travel to the stadium without a valid match ticket as no tickets will be available for purchase at the stadium."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Group C will be resolved with England vs Slovenia and Denmark vs Serbia, both matches kicking off simultaneously.", "England have won just two of their last eight competitive meetings with Denmark (D4 L2), having won each of their first four such games against them.", "No player created more chances (3) or played more line-breaking passes in the final third (5) for England against Denmark than Trent Alexander-Arnold, despite him being subbed off in the 54th minute."], "ranking": [3, 2, 1]}
{"candidates": ["The match was highly anticipated as both teams were expected to top their group.", "Both teams needed to avoid defeat to keep their qualification hopes alive."], "ranking": [2, 1]}
{"candidates": ["The upcoming Africa Cup of Nations (AFCON) match between Egypt and Ghana promises to be a highly anticipated encounter.", "Set to take place on January 18, 2024, at 9:00 PM WAT, the match will be hosted at the Felix Houphouet Boigny Stadium in Abidjan, Ivory Coast.", "Both Egypt and Ghana had less-than-ideal starts in their AFCON campaigns. Egypt managed a narrow escape from defeat against Mozambique, securing a point with a late penalty from Mohamed Salah.", "Ghana suffered a 2-1 loss to Cape Verde after conceding a late goal by Garry Rodrigues in the 92nd minute.", "Egypt's lineup is expected to include key players like Mohamed Salah, Trezeguet, and Elneny.", "For Ghana, Mohammed Kudus is a player to watch, bringing creativity and goal-scoring ability to the team. The return of Kudus, who missed the opening match due to an injury, is a significant boost for Ghana.", "Egypt's recent form has been relatively stable with a draw and three wins in their last five matches across all competitions.", "Ghana has been struggling with only one win in their last six matches.", "Historically, Egypt has had the upper hand in matches against Ghana, winning 12 out of 23 encounters.", "Egypt has had to manage without players like Osama Galal and Ahmed Nabil Koita due to pre-tournament injuries, and there's also a concern over Mohamad Hany who was substituted in their opener against Mozambique due to an injury.", "Ghana has a fully fit squad with no new major injury concerns. They are expected to include Inaki Williams and Andre Ayew in their starting lineup.", "Egypt narrowly avoided a shocking loss to Mozambique in their AFCON opener, salvaging a point with a late penalty goal from Mohamed Salah.", "Eintracht Frankfurt’s Omar Marmoush eyes a start, and Al Ahly’s Mohamed Abdelmonem is a yellow card away from suspension.", "Ghana faced defensive issues in a 2-1 loss to Cape Verde.", "The AFCON 2023 match between Egypt and Ghana will be on Thursday, 18th January 2024, 8:00 PM (GMT); Friday, 19th January 2024, 1:30 AM (IST) at Felix Houphouet Boigny Stadium.", "Former Black Stars midfielder Emmanuel Agyemang-Badu has expressed confidence in Ghana’s potential to secure victory against Egypt in their second group stage match at the 2023 Africa Cup of Nations (AFCON).", "Despite Egypt’s 2-2 draw against Mozambique and Ghana’s 2-1 defeat to Cape Verde in their respective opening matches, Badu remains optimistic about the Black Stars’ chances against Egypt.", "Badu acknowledged the challenge of the encounter but expressed hope for Ghana’s success with the right preparations.", "The former Black Stars midfielder highlighted the importance of coach Chris Hughton’s proper selection for the match against Egypt.", "As both teams aim for a crucial victory to enhance their tournament prospects, the upcoming clash promises to be a closely contested and highly anticipated encounter, set to kick off at 8 p.m. on Thursday."], "ranking": [10, 19, 5, 6, 8, 4, 11, 14, 16, 13, 7, 9, 15, 18, 3, 2, 1, 12, 17, 20]}
{"candidates": ["Egypt boss Vitoria gave an update after Salah was forced off during the draw with Ghana.", "Jurgen Klopp and Rui Vitoria will be hoping Mohamed Salah's injury is not serious as Egypt needs their talisman for the last group game, and Liverpool cannot afford to lose their star player for a prolonged period.", "Ghana is now on a run of six AFCON games without a win.", "Both Egypt and Ghana need to win their final group games to qualify for the round of 16.", "Egypt faces an anxious wait over an injury concern for Mohamed Salah."], "ranking": [3, 1, 5, 4, 2]}
{"candidates": ["The match saw three goals scored in the space of five minutes and 10 seconds during the second half.", "Ghana's Abdul Samed was taken off on a stretcher but later returned to the pitch.", "Ghana remained bottom of Group B with just one point, level with Mozambique.", "Egypt was second in Group B, two points behind group leader Cape Verde.", "Cape Verde and Mozambique play their second game of the tournament on Friday.", "Only the top two in each group are assured of advancing."], "ranking": [2, 5, 4, 3, 6, 1]}
{"candidates": ["The AFCON 2023 match between Egypt and Ghana will be telecasted in India on Fancode.", "You can live stream this match on Fancode App.", "The live telecast of the match will be on Sky Sports in the UK.", "You can watch Egypt vs Ghana live on beIN Sports in the USA.", "Live streaming of this match in Nigeria will be available on NTA."], "ranking": [5, 5, 5, 5, 5]}
{"candidates": ["Didier Deschamps made three changes to the French lineup, including starting Olivier Giroud in his last international match in France.", "Jesse Marsch opted to start Maxime Crépeau in goal over Dayne St. Clair."], "ranking": [1, 2]}
{"candidates": ["The Canadian men’s national team will face France, the second-best national team in the world as of the latest FIFA rankings, on June 9, 2024.", "This match will be just the second game for Canada under coach Jesse Marsch and their last before they take on Argentina at the Copa América.", "France coach Didier Deschamps will use this match as his final chance to evaluate his team before Euro 2024.", "Kylian Mbappé's recent move from Paris Saint-Germain to Real Madrid was announced this week, adding to the anticipation of his performance in the match.", "France's squad includes players from Europe's top five leagues, with many having won titles with clubs like Real Madrid, PSG, and Inter Milan.", "Canadian players like Tajon Buchanan and Alphonso Davies will face familiar opponents from their club teams.", "Concluding their preparations for Euro 2024, France take on Canada at the Stade Matmut Atlantique in Sunday evening's international friendly.", "Didier Deschamps's men ran out convincing 3-0 victors over Luxembourg in their first fixture of the month, while their visitors were crushed 4-0 by the Netherlands on Thursday evening.", "Neither of France's opening two results of 2024 - a 2-0 loss to Germany and nervy 3-2 win over Chile - would have raised hopes of ending their agonising wait for Euros glory this summer, but Deschamps's charges were as dominant as expected in Wednesday's battle against Luxembourg.", "By registering helpers for Kolo Muani and Clauss's efforts, Mbappe took his assists tally for the national team to a staggering 27 - a number that not even Zinedine Zidane nor Thierry Henry could manage - helping to reignite belief that France are one of the undisputed favourites for Euro 2024 glory.", "Before Les Bleus can begin to dream of continental stardom, challenging group fixtures with the Netherlands, an in-form Austria and 2022 World Cup foes Poland must be navigated this month, but a third-straight friendly victory is the next item on Deschamps's agenda.", "The aforementioned 2-0 loss to Germany represents the only loss that France have been subjected to in their last nine home battles, as each of the other eight have ended in victory, including their record-breaking 14-0 annihilation of Gibraltar in Euro 2024 qualifying.", "Sunday's battle will see Canada pit their wits against the second of three Euro 2024 Group D teams, having tested their mettle against the Dutch on Thursday evening, but Jesse Marsch's men were no match for their counterparts in orange.", "Obtaining his first victory at the helm at the second time of asking this Sunday will be another tall order for Marsch, whose side are also gearing up for their own continental championships, taking part in their final friendly before the Copa America begins.", "First and foremost, attention turns to just a second-ever meeting with France, whom they faced in their first-ever World Cup match in the 1986 edition, but a solitary Jean-Pierre Papin strike was enough to propel Les Bleus to a 1-0 win on that occasion."], "ranking": [10, 8, 7, 12, 5, 9, 6, 3, 1, 4, 2, 11, 13, 14, 15]}
{"candidates": ["We were up against some good opposition with a lot of intensity, and we had a few good chances in the first half. After that it was more difficult,\" said manager Didier Deschamps.", "It's not ideal but it was important for me to spread the play around and get everyone involved in these two friendly games. It wasn't easy today, and we're going to make the most of it in terms of what awaits us on June 17,\" Deschamps added.", "Jesse Marsch praised his team's performance and noted the improvement from their previous match against the Netherlands.", "Marsch highlighted the development of the partnership between Moïse Bombito and Derek Cornelius in defense.", "Stephen Eustáquio and Ismaël Koné were praised for their midfield performances.", "Olivier Giroud is retiring from the French national team after Euro 2024, which starts Friday in Germany."], "ranking": [4, 5, 2, 3, 1, 6]}
{"candidates": ["France, who comfortably beat Luxembourg 3-0 on Wednesday, are among the favourites to win the European title with the tournament kicking off in Germany on Friday.", "France face Austria in their tournament opener before taking on the Netherlands on June 21 and Poland four days later.", "Canada, under new coach Jesse Marsch, will kick off the Copa America against Lionel Messi's Argentina on June 20, before facing Peru five days later and Chile on June 29.", "The match was held in Bordeaux.", "Canada had 55% possession in the first half and a 92% passing accuracy.", "This was Jesse Marsch's second game as Canada's head coach."], "ranking": [5, 4, 3, 6, 2, 1]}
{"candidates": ["France's recent form includes a 3-0 win over Luxembourg and a 2-0 loss to Germany in friendlies, as well as a 3-2 win over Chile.", "France qualified for Euro 2024 by topping their group with a 7-1-0 record, including a 4-0 victory over the Netherlands."], "ranking": [2, 1]}
{"candidates": ["Jude Bellingham scored his first goal at Wembley and became the second Real Madrid player to score for England at Wembley, along with Steve McManaman in September 1999 vs Luxembourg.", "Declan Rice became the first Arsenal player to start a match as England captain since Sol Campbell in 2005 against USA, and the first at Wembley since Tony Adams in 2000 against Germany in the final game at the old Wembley.", "Ivan Toney is the first player to score a penalty on his first England start since Allan Clarke against Czechoslovakia at the 1970 World Cup.", "Ivan Toney is the first Brentford player to score for England, with the Bees the 46th different English league club to provide a scorer for the national side since the creation of the Football League in 1888.", "In his 60th England cap, goalkeeper Jordan Pickford made an error leading to an opposition goal for the very first time.", "Youri Tielemans became the first Belgian player to score at Wembley for both club (for Leicester City against Chelsea in the 2021 FA Cup final) and country.", "Youri Tielemans was the first player to score two first half goals against England since Tranquillo Barnetta in June 2011 for Switzerland."], "ranking": [4, 2, 6, 5, 1, 3, 7]}
{"candidates": ["Jude Bellingham's 94th-minute equaliser salvaged a draw for England.", "Jordan Pickford's poor clearance led to Youri Tielemans putting Belgium ahead after 11 minutes.", "Ivan Toney equalised from the penalty spot six minutes later after being brought down by Jan Vertonghen.", "Lewis Dunk's mistake allowed Romelu Lukaku to provide the perfect cross for Tielemans to head in Belgium's second goal.", "Jarrod Bowen had a close-range header ruled out for offside.", "Matz Sels saved well from Bowen before Bellingham's last-minute equaliser.", "Jude Bellingham struck in stoppage time to earn England a 2-2 draw with Belgium.", "Youri Tielemans scored twice for Belgium, in the 11th and 36th minutes.", "Ivan Toney equalized for England with a penalty in the 17th minute on his first international start.", "John Stones was withdrawn early due to an adductor injury and replaced by Joe Gomez.", "Romelu Lukaku provided a sumptuous cross for Tielemans' second goal.", "Jude Bellingham scored a 95th-minute equaliser to salvage a 2-2 draw for England against Belgium.", "Youri Tielemans scored twice for Belgium, capitalizing on defensive mistakes by England.", "Ivan Toney scored his first goal for England from the penalty spot.", "Jarrod Bowen had a goal ruled out for offside.", "Phil Foden narrowly missed a shot.", "Lewis Dunk's slip led to Tielemans' second goal.", "Final score: England 2-2 Belgium", "GOAL! England 2-2 Belgium (Bellingham, 90+5 mins)", "Half time: England 1-2 Belgium", "GOAL! England 1-2 Belgium (Tielemans, 36 mins)", "GOAL! England 1-1 Belgium (Toney, 17 mins)", "Penalty to England!", "GOAL! England 0-1 Belgium (Tielemans, 11 mins)", "Jude Bellingham scored a last-minute equaliser for England to secure a 2-2 draw against Belgium.", "Kobbie Mainoo made his first start for England at just 18 years old and delivered an impressive performance.", "Ivan Toney scored his first goal for England from the penalty spot.", "Youri Tielemans scored twice for Belgium, including a header from a Romelu Lukaku cross.", "Jordan Pickford made a crucial save to deny Jeremy Doku.", "Joe Gomez replaced John Stones early in the match due to an injury.", "Phil Foden missed a significant chance to equalize for England.", "England's defensive frailties were highlighted as a concern despite their dominant performance.", "Jude Bellingham scored England's equaliser in stoppage time at Wembley against Belgium.", "Ivan Toney scored a goal from the penalty spot on his full debut for England.", "Youri Tielemans scored two goals for Belgium, one in the 11th minute and another in the 36th minute.", "Jordan Pickford made a critical error with a clearance leading to Belgium's first goal.", "Lewis Dunk's miskick led to Belgium's second goal.", "Dodi Lukebakio missed a crucial chance to secure victory for Belgium in the 92nd minute."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38]}
{"candidates": ["Ivan Toney scored a penalty in the 17th minute.", "Jude Bellingham scored in the 90+5th minute.", "Joe Gomez scored in the 67th minute.", "James Maddison scored in the 90+1st minute.", "Youri Tielemans scored in the 11th and 36th minutes.", "Michy Batshuayi scored in the 90+5th minute."], "ranking": [5, 2, 4, 3, 1, 6]}
{"candidates": ["England's final game before Euro 2024 squad is announced.", "Gareth Southgate's side play further friendlies against Bosnia-Herzegovina & Iceland before the tournament opener on 16 June.", "England lost 1-0 to Brazil on Saturday night.", "England was without several first-choice players due to injuries.", "Gareth Southgate emphasized the importance of giving opportunities to new players due to numerous injuries in the squad.", "Declan Rice was set to captain England for his 50th cap.", "Kobbie Mainoo and Ivan Toney were highlighted as key players to watch in the match.", "England aimed to impose themselves as an attacking force after their 1-0 defeat against Brazil.", "Kobbie Mainoo made a strong case for inclusion in Gareth Southgate's squad for the European Championship finals with his performance."], "ranking": [8, 5, 9, 4, 6, 7, 3, 2, 1]}
{"candidates": ["Experts predicted a tight match with a possible draw.", "England was missing key players Harry Kane and Bukayo Saka.", "Belgium was without Romelu Lukaku and Kevin De Bruyne.", "Belgium had a 12-game unbeaten run heading into the match.", "England wrap up their international break with a testing showdown against Belgium at Wembley this week.", "The Three Lions were lacklustre as they fell to a 1-0 defeat to Brazil at the weekend, despite the best efforts of Jude Bellingham.", "Boss Gareth Southgate knows he is under pressure to deliver with arguably England's brightest squad in a generation.", "Belgium's own golden generation is in decline, but they still pose a threat - with Romelu Lukaku, Jeremy Doku and Leandro Trossard set to lead the line in London."], "ranking": [8, 6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Ivan Toney expressed his joy at scoring and praised his teammates, especially Kobbie Mainoo.", "Jan Vertonghen commented on the tough match and the missed opportunity to win.", "Jarrod Bowen highlighted the resilience of the England squad and the importance of contributions from all players.", "Jude Bellingham reflected on the importance of the draw and praised Kobbie Mainoo's performance.", "Gareth Southgate felt the performance deserved the draw and was pleased with the team's effort.", "Jude Bellingham expressed that the team should be happy with their performance despite the draw.", "Bellingham acknowledged the importance of taking positives from the game.", "Jude Bellingham expressed his support for Kobbie Mainoo, highlighting his potential for the future.", "Ivan Toney hoped his performance would secure him a spot in the Euro 2024 squad.", "Gareth Southgate will now focus on finalizing his squad for Euro 2024.", "Jude Bellingham’s last-second goal rescued a draw for England after two defensive blunders had given Belgium the advantage.", "Jude Bellingham commented on the performance, highlighting the difficulty of playing under pressure and the importance of the draw after a previous defeat.", "Gareth Southgate defended his decision to pick John Stones despite his injury.", "Gareth Southgate will be pleased with the individual performances of Ivan Toney and Kobbie Mainoo.", "The match highlighted England's defensive issues despite their overall dominance.", "Jude Bellingham's maturity and importance to the team were emphasized after his last-minute goal.", "Gareth Southgate wanted a statement victory against a high-ranking opponent but settled for a draw.", "Southgate was without three of his favoured back four – Kyle Walker, Harry Maguire, and Luke Shaw."], "ranking": [14, 12, 10, 11, 9, 8, 7, 6, 5, 4, 1, 2, 13, 3, 15, 16, 17, 18]}
{"candidates": ["Gareth Southgate reflected on the positives despite the lack of cutting edge.", "Southgate's men avoided a second successive home friendly defeat."], "ranking": [2, 1]}
{"candidates": ["England remain unbeaten against Belgium on English soil, winning six and drawing two.", "This was the second time England came from 2-1 down at half-time to draw 2-2 against Belgium, the first being in 1964.", "The match had an attendance of 80,733 at Wembley Stadium.", "Belgium extended their unbeaten run to 12 games under coach Domenico Tedesco.", "Kobbie Mainoo made an impressive debut and was named player of the match.", "The match was played on a heavy, damp pitch.", "England players wore shirts without names on the back in the second half to raise awareness of dementia.", "Kobbie Mainoo made a serious case to be included in Gareth Southgate’s squad for the European Championship with his performance.", "The match was played at Wembley Stadium.", "England's new away strip was worn for the first time in this match.", "The match was dedicated to Alzheimer's Society, with England players wearing nameless shirts in the second half to raise awareness."], "ranking": [2, 1, 9, 8, 3, 10, 5, 4, 11, 6, 7]}
{"candidates": ["Kyle Walker withdrew from the squad due to a hamstring problem.", "Harry Maguire and Sam Johnstone also withdrew due to injuries.", "Rico Lewis and James Trafford were promoted to the first team.", "Romelu Lukaku was expected to return for the match against England."], "ranking": [3, 2, 4, 1]}
{"candidates": ["England v Belgium will take place on Tuesday 26th March 2024.", "England v Belgium will kick off at 7:45pm.", "Fans can tune in to watch the game for free on Channel 4 from 7pm.", "You can also live stream the match via Channel 4 on a range of devices including laptops, smartphones and tablets.", "You can listen to the match on BBC Radio 5 Sports Extra."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Franses Mzize scored an own goal in the 54th minute, leading to Congo DR's victory.", "Mbemba received a yellow card in the 46th minute.", "Essende received a yellow card in the 68th minute.", "Moutoussamy received a yellow card in the 72nd minute.", "Salum received a yellow card in the 23rd minute.", "Job received a yellow card in the 79th minute.", "Saadun Hamoud received a yellow card in the 90+5th minute."], "ranking": [1, 6, 5, 4, 3, 2, 7]}
{"candidates": ["Tanzania's national football team, Taifa Stars, is set to face DR Congo in a crucial AFCON 2025 qualifier match in Kinshasa.", "Tanzania enters the match with a 2-1 victory over Guinea, boosting their morale.", "DR Congo leads Group H with six points from two wins.", "In the last six matches between Taifa Stars and DR Congo, DR Congo has won twice and drawn three times.", "Acting Head Coach of Taifa Stars, Hemed Suleiman 'Morocco', aims for a win to top Group H.", "Striker Mbwana Samatta returns to the squad after missing two matches and is a fan favorite in DR Congo due to his success with TP Mazembe.", "Sports Mole predicted a 2-1 win for Congo DR.", "Congo DR and Tanzania had a solid start to the qualifying campaign.", "Congo DR was expected to win with a probability of 60.69%.", "A draw had a probability of 27.5% and a win for Tanzania had a probability of 11.85%."], "ranking": [8, 6, 5, 4, 3, 2, 9, 7, 1, 10]}
{"candidates": ["Congo DR and Tanzania return to action in the 2025 Africa Cup of Nations qualifiers at the Stade des Martyrs.", "Congo DR has won their first two matches in the qualifiers and seeks a sixth competitive home victory since June 2022.", "Tanzania picked up their first win in the AFCON qualifying race with a 2-1 victory over Guinea.", "Congo DR has named a solid 25-man squad for October's qualifying games against Tanzania and Ethiopia.", "Tanzania's squad includes players like Mohamed Husseini, Ibrahim Hamad, Dickson Job, and Lusajo Mwaikenda."], "ranking": [5, 2, 3, 4, 1]}
{"candidates": ["The result leaves Tanzania needing a positive result in their next match to keep their qualification hopes alive.", "Sports Mole's data analysis correctly predicted a 1-0 win for Congo DR."], "ranking": [1, 2]}
{"candidates": ["Group H includes DR Congo, Tanzania, Ethiopia, and Guinea, with DR Congo leading and Tanzania in second place.", "Tanzania's fans are expected to watch the match in large numbers via TV and radio.", "President Samia Suluhu Hassan's support has motivated the Taifa Stars.", "Team captain Mohamed Hussein 'Zimbwe Jr' acknowledges the team's responsibility to win for their fans.", "Soccer experts predict a tough and competitive match, emphasizing the need for discipline and focus from Taifa Stars."], "ranking": [3, 5, 4, 2, 1]}
{"candidates": ["Harry Kane now has 63 goals for his country, the most in Three Lions history, now 10 clear of the second place Wayne Rooney.", "Cole Palmer became just the fifth England player to score his first senior goal for the national team via the penalty spot."], "ranking": [1, 2]}
{"candidates": ["Cole Palmer netted his first senior international goal from the penalty spot.", "Trent Alexander-Arnold scored a volley five minutes from time.", "Harry Kane added a goal from close range.", "Cole Palmer got England on their way on the hour mark via the penalty spot.", "Trent Alexander-Arnold added a second goal with a sublime volley.", "Harry Kane sealed the victory with a third goal in scruffy fashion.", "Eberechi Eze was a bright spark in a dull first half and continued to impress in the second period.", "Jarrad Branthwaite and Adam Wharton made their debuts for England.", "Ezri Konsa blocked Jarrod Bowen's goal-bound shot during the celebrations of the third goal.", "Cole Palmer scored the opening goal from the penalty spot after a VAR decision.", "Trent Alexander-Arnold scored England's second goal with a swerving volley.", "Harry Kane scored the third goal to make the scoreline more respectable.", "Cole Palmer scored his first senior England goal from a penalty.", "Trent Alexander-Arnold scored a volley to make it 2-0.", "Harry Kane scored a close-range finish to complete the scoring for England.", "Cole Palmer scored a penalty at the 60th minute.", "Trent Alexander-Arnold scored at the 85th minute.", "Harry Kane scored at the 89th minute.", "Trent Alexander-Arnold capped an impressive individual display with a tremendous volley as England beat Bosnia and Herzegovina 3-0.", "Cole Palmer’s spot-kick was followed by an excellent Alexander-Arnold effort and late Harry Kane goal.", "Eberechi Eze and Palmer produced positive displays on their first England starts.", "Ezri Konsa was fouled in the box leading to Palmer's penalty.", "Alexander-Arnold scored a superb late volley.", "Harry Kane added a goal after Bowen’s shot was blocked on the line.", "Watkins forced a save from Vasilj after a neat pass by Palmer."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["England won 3-0 against Bosnia-Herzegovina with goals from Palmer (60' pen.), Alexander-Arnold (85'), and Kane (89').", "Guehi (29') and Branthwaite (76') were notable players in the match.", "Tahirovic (59') and Gazibegovic (64') were notable players for Bosnia-Herzegovina.", "Cole Palmer scored a penalty in the 60th minute.", "Trent Alexander-Arnold scored in the 85th minute.", "Harry Kane scored in the 89th minute.", "Marc Guehi received a yellow card in the 29th minute.", "Jarrad Branthwaite received a yellow card in the 76th minute.", "Benjamin Tahirovic received a yellow card in the 59th minute.", "Nihad Gazibegovic received a yellow card in the 64th minute."], "ranking": [1, 5, 6, 3, 4, 2, 8, 9, 7, 10]}
{"candidates": ["Gareth Southgate gave opportunities to players who don't get them too often, with Cole Palmer and Eberechi Eze starting for the first time.", "Trent Alexander-Arnold was deployed in midfield, which is what has been expected under Southgate.", "Gareth Southgate aimed for a successful summer as England took on Bosnia & Herzegovina in a pre-Euro 2024 friendly.", "The match was a chance for fringe players like Jarrod Bowen, Cole Palmer, Eberechi Eze, and Trent Alexander-Arnold to make their case for the final squad.", "Gareth Southgate decided to introduce Harry Kane, James Maddison, and Jack Grealish from the bench.", "Debuts were given to Jarrad Branthwaite and Adam Wharton.", "Preparations for this summer’s shot at silverware stepped up at St James’ Park as players got a chance to stake their claim for a place on the plane, or even a starting role against Serbia.", "Gareth Southgate picked a team of Euro 2024 hopefuls but few impressed enough to book a seat on the plane in a scrappy performance."], "ranking": [5, 3, 2, 6, 4, 8, 1, 7]}
{"candidates": ["England's next friendly match is against Iceland on June 7, 2024, before their Euro 2024 group-phase opener against Serbia on June 16, 2024.", "A reminder of the key dates for England ahead of a busy summer: 7 June - final warm-up match against Iceland at Wembley, 8 June - announcement of final 26-man squad, 16 June - opening game of Euro 2024, against Serbia, 20 June - second group game of Euro 2024, against Denmark, 25 June - final game of Euro 2024 group stage, against Slovenia."], "ranking": [2, 1]}
{"candidates": ["Harry Kane is in line to win his 100th senior international cap, becoming just the 10th man in history to win 100 caps for England.", "Harry Kane becoming the 10th Englishman to make 100 appearances for his country.", "Harry Kane will receive a golden cap in recognition of making his 100th appearance for the senior team, becoming only the 10th man to reach that milestone for England.", "Harry Kane is expected to start on what would be his 100th senior appearance for England, becoming just the 10th man to reach a century of England caps.", "England could match an all-time national team unbeaten record if they claim at least a point over Finland, equaling their record for the most games against a single country without ever suffering defeat."], "ranking": [1, 4, 3, 2, 5]}
{"candidates": ["Harry Kane scored the opening goal with a dipping right-footed strike in the 57th minute.", "Harry Kane scored his second goal in the 76th minute, sweeping in another right-footed effort.", "Harry Kane had a first-half header ruled out for offside.", "Lukas Hradecky made several fine saves to deny Harry Kane.", "Harry Kane was given a standing ovation when he was substituted in the 80th minute.", "Harry Kane scored twice to secure a 2-0 victory for England over Finland.", "Noni Madueke assisted Harry Kane's second goal.", "Harry Kane received a standing ovation when substituted off.", "Harry Kane scored the first goal in the 57th minute with an unstoppable drive into the roof of the net.", "Harry Kane scored his second goal 14 minutes from the end with a clever first-time finish following a square pass from substitute Noni Madueke.", "Harry Kane scored twice, once in the 57th minute and again in the 76th minute.", "Trent Alexander-Arnold provided key assists for both of Kane's goals.", "Noni Madueke made a notable debut by assisting Kane's second goal.", "Ezri Konsa was forced to withdraw after rolling his ankle.", "Harry Kane scored two goals to secure a 2-0 victory for England against Finland.", "Trent Alexander-Arnold created five chances, one of which was scored by Kane.", "Ezri Konsa was injured during the match.", "Noni Madueke went close to scoring on his England debut.", "Harry Kane scored twice to secure a 2-0 victory for England.", "Kane's first goal came from a blistering second half strike.", "Kane added a second goal after being fed the ball in the box by substitute Noni Madueke.", "Kane had a goal disallowed for offside in the first half.", "Hradecky made a crucial save from Kane's free kick.", "Alexander-Arnold's shot was pulled wide.", "Kane's shot was saved by Hradecky.", "Harry Kane scored a brace to secure a 2-0 victory for England over Finland.", "Trent Alexander-Arnold created multiple chances and provided a key assist.", "Lukas Hradecky made several crucial saves for Finland but couldn't prevent the goals.", "England dominated possession and attempted 801 passes, the most in a single match in the 2024-25 Nations League.", "Harry Kane scored both goals for England, one in the 57th minute and another in the 76th minute.", "Trent Alexander-Arnold provided two key assists for Harry Kane's goals.", "England won the match 2-0 against Finland."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32]}
{"candidates": ["Harry Kane scored two goals (57', 76') to secure a 2-0 victory for England over Finland.", "Finland's Schuller received a yellow card in the 66th minute.", "Harry Kane scored two goals at the 57th and 76th minutes to secure a 2-0 victory for England.", "Schuller received a yellow card at the 66th minute."], "ranking": [1, 4, 2, 3]}
{"candidates": ["Harry Kane received a golden cap before kick-off and sported a pair of dazzling golden boots.", "Harry Kane was presented with a golden cap before kickoff and played in gold boots.", "Interim England manager Lee Carsley took over after Gareth Southgate stepped down following England's loss to Spain in the Euro 2024 final.", "Harry Kane expressed his ambition to score 100 goals for England.", "Harry Kane was awarded a gold cap to mark his 100th England appearance, presented by Frank Lampard.", "Kane wore golden boots to commemorate his 100th cap.", "Lee Carsley emphasized the importance of precise passing and possession-based football.", "Harry Kane expressed pride in reaching 100 caps and discussed his motivation to continue performing at a high level.", "Harry Kane is set to win his 100th cap for England against Finland.", "England are unbeaten in all 11 of their previous meetings with Finland (W9 D2).", "England will host Finland for the first time since a March 2001 World Cup qualifier, winning 2-1 in Sven-Goran Eriksson’s first competitive game in charge.", "Teemu Pukki has been directly involved in 12 goals in 18 appearances in the Nations League (eight goals and four assists), at least three times as many as any other player for Finland in the competition.", "England interim manager Lee Carsley hinted at making some changes to the XI that started in the previous match.", "Angel Gomes and Rico Lewis are expected to start for England.", "England will celebrate the life of former manager Sven-Goran Eriksson, who died last month aged 76.", "Lee Carsley emphasized the importance of supporting and believing in the players.", "Lee Carsley mentioned that only 'the best' will do for England and backed the Football Association to get the appointment right."], "ranking": [1, 2, 5, 6, 3, 4, 10, 8, 7, 9, 11, 12, 13, 14, 15, 16, 17]}
{"candidates": ["England's win was their second under interim manager Lee Carsley after the away victory over Ireland on Saturday.", "England's win puts them joint top of their Nations League group with Greece.", "Lee Carsley secured his second straight 2-0 win as interim manager.", "There is a possibility that Lee Carsley could remain in the position for a while longer if the search for Southgate's permanent successor extends beyond the next international break in October.", "Harry Kane described his 100th cap for England as a 'pretty much perfect' night after scoring both goals in the 2-0 win over Finland.", "Kane expressed pride in his performance and the team's victory, highlighting the significance of his milestone and his desire to keep pushing boundaries.", "Lee Carsley enjoyed his second win as England's interim manager.", "Harry Kane's family was present and shown on camera during the match.", "Lee Carsley expressed his happiness for Harry Kane, noting his motivation and conduct during the week.", "Harry Kane reflected on the significance of his 100th cap and his determination to prove doubters wrong.", "Lee Carsley acknowledged being out of his comfort zone during the international break but emphasized the high standards maintained by the team.", "Harry Kane praised Lee Carsley's energy and approach, highlighting the freedom and attacking mindset instilled in the team.", "Harry Kane expressed pride in reaching 100 caps and reflected on his journey from loan spells to becoming a key player for England.", "Noni Madueke expressed pride in making his first appearance for the national team and assisting Kane on his 100th appearance.", "Lee Carsley praised his team's performance and the clean sheet in his first two competitive games as manager.", "Harry Kane expressed pride in his performance and his desire to continue scoring goals for England.", "Lee Carsley praised Harry Kane's motivation and Trent Alexander-Arnold's passing ability.", "Craig Hope noted Trent Alexander-Arnold's impressive performance and Harry Kane's class finishing.", "Lee Carsley praised Harry Kane's performance and mentioned the emotional significance of his 100th cap.", "Harry Kane expressed pride in reaching 100 caps and emphasized his motivation to score goals for England.", "Lee Carsley highlighted the performances of Trent Alexander-Arnold and Rico Lewis in different positions."], "ranking": [10, 8, 7, 18, 1, 2, 6, 15, 5, 4, 12, 3, 11, 9, 14, 16, 17, 13, 19, 20, 21]}
{"candidates": ["Lee Carsley aimed to join an exclusive club of England managers who have won both of their opening matches in charge."], "ranking": [1]}
{"candidates": ["England have not been beaten in any of their first 11 meetings with Finland, winning nine and drawing two.", "This was the first meeting between England and Finland since March 2001."], "ranking": [1, 2]}
{"candidates": ["Harry Kane is set to make his 100th appearance for England.", "Finland has conceded at least two goals in each of their last four away games.", "Under Lee Carsley, England has shown more attacking freedom, registering more shots on target than under previous management.", "England has failed to win their last three matches at Wembley.", "Jack Grealish has been in fine form, contributing goals and assists in recent matches.", "Finland has lost four of their last five away matches.", "England has never lost to Finland in 11 meetings."], "ranking": [2, 5, 4, 7, 3, 6, 1]}
{"candidates": ["Endrick became the youngest male player - at 17 years and 246 days - to score an international goal at Wembley."], "ranking": [1]}
{"candidates": ["Seventeen year-old prodigy Endrick scored his first goal for Brazil to give the struggling South Americans a 1-0 win over England at Wembley in coach Dorival Junior's first match in charge.", "Endrick (Brazil) left footed shot from the centre of the box is saved in the bottom left corner.", "Endrick scored the winning goal for Brazil in the 80th minute.", "Lucas Paquetá hit the post in the 35th minute.", "Jordan Pickford saved a potential second goal from Endrick in the dying seconds.", "Endrick scored the only goal of the match, converting a rebound after Vinícius Júnior was denied by Jordan Pickford.", "Lewis Dunk made an error leading to Brazil's goal.", "Kyle Walker was forced off with a hamstring problem early in the match.", "Vinícius Júnior was denied a goal by Jordan Pickford and later by Kyle Walker.", "Lucas Paquetá struck the post with a sidefoot shot in the 35th minute."], "ranking": [1, 8, 3, 6, 5, 2, 9, 10, 7, 4]}
{"candidates": ["England was missing captain Harry Kane and other regulars.", "Brazil gave debuts to five players in their starting 11 due to injuries to key players.", "Gareth Southgate missed key players including Harry Kane, Luke Shaw, and Bukayo Saka.", "Brazil's new manager, Dorival Júnior, warned that he did not have a magic wand to fix the team's issues.", "There was pre-match talk about Brazil being in crisis and struggling to connect with fans back home."], "ranking": [3, 2, 4, 5, 1]}
{"candidates": ["Southgate happy with 'good experiment' vs. Brazil.", "Endrick expressed his happiness and described the goal as a unique feeling.", "Gareth Southgate praised his team's performance despite the loss and highlighted the ruthlessness of football at this level.", "Southgate confirmed that Harry Kane would not recover in time for Tuesday's friendly against Belgium.", "Gareth Southgate was left with much to ponder before the next friendly against Belgium.", "The smattering of boos upon the full-time whistle was inevitable, almost traditional."], "ranking": [3, 5, 1, 6, 4, 2]}
{"candidates": ["The match was held at Wembley Stadium with an attendance of 83,664.", "The match ended with England 0, Brazil 1.", "The match had an attendance of 83,664 at Wembley Stadium.", "The atmosphere inside a sold-out Wembley was flat, with fans resorting to throwing paper planes.", "Brazil's physical force pushed the boundaries, with Lucas Paquetá avoiding a second yellow card for a trip on Jude Bellingham."], "ranking": [3, 2, 1, 5, 4]}
{"candidates": ["Granit Xhaka received his first red card in 32 months during the match."], "ranking": [1]}
{"candidates": ["Patrick Dorgu scored a debut goal a minute after coming off the bench.", "Nico Elvedi received a red card after a VAR review for a foul on Kasper Dolberg.", "Jonas Wind had a goal disallowed for offside in the 72nd minute.", "Granit Xhaka was dismissed in the 87th minute after receiving a second yellow card.", "Pierre-Emile Højbjerg scored a stoppage-time goal to secure the victory.", "Nico Elvedi received a controversial red card after a VAR decision, which was heavily criticized by Swiss fans.", "Denmark won the match 2-0 against Switzerland in the Nations League opener.", "Granit Xhaka was also sent off during the match.", "Nico Elvedi was controversially sent off in the 52nd minute after a VAR review.", "Patrick Dorgu scored Denmark’s opener in the 82nd minute while Breel Embolo was injured on the ground.", "Granit Xhaka received a second yellow card and was sent off in the 87th minute for a foul on Pierre-Emile Højbjerg.", "Denmark scored a second goal in stoppage time, with Pierre-Emile Højbjerg finding the net to seal a 2-0 win.", "Granit Xhaka was sent off in a fiery clash between Denmark and Switzerland on September 5, 2024.", "Switzerland’s Silvan Widmer was booked for wasting time.", "Nico Elvedi was sent off for a last-man foul on Kasper Dolberg.", "Patrick Dorgu scored the opening goal for Denmark.", "Granit Xhaka received a yellow card for his complaints.", "Pierre-Emile Hojbjerg, Morten Hjulmand, and Manuel Akanji also received yellow cards.", "Granit Xhaka was shown a second yellow card and subsequently a red card for a late challenge on Pierre-Emile Hojbjerg.", "Pierre-Emile Hojbjerg scored a second goal for Denmark.", "Danish defender Patrick Dorgu scored in the eighty-second minute to make it 1-0.", "Swiss defender Nico Elvedi received a red card in the fifty-second minute.", "Swiss midfielder Granit Xhaka received Switzerland’s second red card of the match.", "Danish midfielder Pierre-Emile Høgbjerg sealed the victory with a goal 2 minutes into stoppage time to make it 2-0."], "ranking": [1, 2, 18, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Dorgu scored in the 82nd minute.", "Hojbjerg scored in the 90+2 minute.", "Gronbaek received a yellow card in the 23rd minute.", "Hjulmand received a yellow card in the 83rd minute.", "Akanji received a yellow card in the 83rd minute.", "Vestergaard received a yellow card in the 90+4 minute.", "Widmer received a yellow card in the 47th minute.", "Xhaka received a yellow card in the 83rd minute.", "Hojbjerg received a yellow card in the 83rd minute.", "Embolo received a yellow card in the 86th minute.", "Elvedi received a yellow card in the 52nd minute.", "Xhaka received a yellow card in the 87th minute."], "ranking": [8, 1, 6, 5, 5, 7, 4, 5, 5, 3, 2, 9]}
{"candidates": ["Denmark and Switzerland will kick off their quests for UEFA Nations League glory on Thursday.", "Denmark will seek their first win in five matches on Thursday evening.", "Denmark's knockout contest with hosts Germany was disrupted by a storm.", "Kasper Hjulmand stood down as Denmark's coach after a 2-0 defeat.", "Switzerland exited the European Championship in the quarter-finals, losing on penalties to England.", "Switzerland had strung together an eight-game unbeaten streak across all competitions.", "Denmark, returning to their native country for the first time since their underwhelming Euro 2024 campaign, will be keen to atone under the fresh interim management of Morten Wieghorst.", "Switzerland, fresh off a quarter-final show at Euro 2024, is ready to show their tenacity and keep their outstanding form.", "Both sides depend on this game to negotiate a difficult group including Spain and Serbia.", "Switzerland’s tactical discipline combined with Denmark’s strong defensive record at home point to a closely fought game.", "Denmark is expected to put a strong lineup emphasizing both defensive solidity and creative attacking play for their forthcoming UEFA Nations League game against Switzerland.", "Switzerland is probably going to use a balanced lineup combining defensive resilience with aggressive possibilities.", "Denmark’s recent form has been a mix of draws and losses, reflecting their struggles in major tournaments.", "Switzerland has displayed a balanced approach, with a strong defensive setup complemented by effective counter-attacks.", "Recent matches between Denmark and Switzerland have typically been tight affairs, with three draws and two wins for Denmark in the last five games.", "Denmark is expected to field a strong lineup focused on both defensive solidity and creative attacking play.", "Switzerland is likely to deploy a balanced lineup that combines defensive resilience with dynamic attacking options.", "Denmark will be without Andreas Christensen and Rasmus Hojlund, which could weaken their defensive and attacking capabilities.", "Switzerland is missing key veterans like Yann Sommer and Xherdan Shaqiri, impacting their experience level.", "Kasper Schmeichel’s goalkeeping and Christian Eriksen’s playmaking will be crucial for Denmark’s performance.", "Denmark has struggled to win matches, whereas Switzerland has been more consistent, particularly in high-pressure situations.", "Denmark’s interim coach, Lars Knudsen, faces a challenge in rallying the team amidst leadership changes.", "Both teams have demonstrated strong defensive tactics, which may lead to a low-scoring game.", "Denmark’s familiarity with Parken Stadium could provide them a psychological edge.", "Switzerland’s consistent presence in League A showcases their resilience and ability to compete at this level.", "Gregor Kobel has replaced Yann Sommer as Switzerland's number 1 goalkeeper.", "Kobel expressed his excitement about playing in the national team, stating it was his dream since childhood.", "Yakin mentioned that the team has various options for central defense and expects a tough duel against Denmark.", "The question of who will take penalties after Shaqiri's retirement was raised, with the captain deciding during the game.", "Kobel is new to the national team council and aims to create a good atmosphere and perform well.", "Yakin emphasized the importance of the Nations League for World Cup qualifiers and expressed delight for Kobel's new role.", "Yakin stated that the team will play a system with two central midfielders against Denmark."], "ranking": [14, 10, 6, 4, 12, 16, 2, 3, 8, 5, 11, 15, 7, 9, 1, 13, 18, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 19, 17, 6]}
{"candidates": ["Granit Xhaka criticized the referee's decision to send off Nico Elvedi, calling it a scandal.", "Xhaka expressed frustration over Denmark's lack of sportsmanship for continuing play while Breel Embolo was injured.", "Xhaka apologized to his teammates on social media for his dismissal and its impact on the result.", "Joachim Andersen commented on Granit Xhaka's behavior, stating, 'He is a top footballer, but he is also a bit of a b***h.'", "Joachim Andersen added, 'We know Granit, and he can go to it once in a while and get a little angry on the pitch. That’s the way it is. He is a player I have a lot of respect for, and sometimes you can lose your head.'", "Joachim Andersen reflected, 'I think he has been good at keeping calm for many years, but today he lost his head a little.'", "Granit Xhaka will be suspended for Switzerland’s match against Spain on Sunday."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Denmark's victory left them top of the group after a scoreless draw between Spain and Serbia.", "The match was held at Parken Stadium in Copenhagen, Denmark with an attendance of 26,024.", "The match was held in the Parken stadium in Copenhagen, Denmark.", "Granit Xhaka's red card marks the 16th dismissal of his professional career."], "ranking": [1, 3, 4, 2]}
{"candidates": ["Gareth Southgate has taken England to a third tournament semi-final under his management."], "ranking": [1]}
{"candidates": ["Gareth Southgate's 100th game in charge of England.", "Southgate's decision to introduce Cole Palmer, Eberechi Eze, and Luke Shaw with 12 minutes left."], "ranking": [1, 2]}
{"candidates": ["I feel sorry for Gareth,\" Foden said. \"The players have got to take some of the blame. There has to be some leaders to get together and find out a solution to why it is not working. There is only so much the manager can do.", "It might also be the end of Gareth Southgate as England’s manager, which would make people very sad too, because he’s done such a good job over the last eight years."], "ranking": [2, 1]}
{"candidates": ["Since the 1998 World Cup, England have played 32 major tournament matches on ITV and 29 on the BBC.", "On ITV they have won just 25 per cent of those matches (8/32), while on the Beeb they have won a whopping 69 per cent (20/29)."], "ranking": [2, 1]}
{"candidates": ["Bradley Barcola scored in the opening 12 seconds, one of the fastest goals in Nations League history.", "Bradley Barcola scored the fastest goal in France's history after just 12 seconds against Italy."], "ranking": [2, 1]}
{"candidates": ["Barcola scored in the 1st minute for France", "Dimarco scored in the 30th minute for Italy", "Frattesi scored in the 51st minute for Italy", "Retegui scored in the 49th minute for Italy", "Raspadori scored in the 74th minute for Italy", "Barcola scored in the 1st minute for France.", "Dimarco scored in the 30th minute for Italy.", "Frattesi scored in the 51st minute for Italy.", "Retegui scored in the 49th minute for Italy.", "Raspadori scored in the 74th minute for Italy."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}
{"candidates": ["Both sides came into the game looking for redemption after failing to impress at Euro 2024."], "ranking": [1]}
{"candidates": ["Luciano Spalletti praised Sandro Tonali's performance, highlighting his contributions despite concerns about his fitness.", "Didier Deschamps' team struggled to threaten after Italy's equalizer.", "France had 12 shots compared to Italy’s 11 but only managed an expected goals total (xG) of 0.86.", "Italy outperformed their own xG of 1.71.", "Deschamps faces a tough test against Belgium next.", "Italy manager Luciano Spalletti praised Sandro Tonali's performance, stating, 'We found a very strong player again.'"], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Bradley Barcola's goal was his first for the French national team in his sixth appearance.", "Despite Barcola's quick goal, France lost 3-1 to Italy.", "Mateo Retegui was named Player of the Match for his constant threat and assist for Frattesi’s goal.", "Bradley Barcola has scored five goals in his first four games at the start of the 2024/25 season.", "The match was held at Parc des Princes with an attendance of 44,956.", "Sandro Tonali returned to the side after serving a 10-month ban for breaching betting rules.", "The match took place at Parc des Princes in Paris, France, with an attendance of 44,956 spectators."], "ranking": [3, 2, 1, 4, 6, 5, 7]}
{"candidates": ["This was Italy's first competitive meeting with France in 16 years"], "ranking": [1]}
