{"candidates": ["The match will be broadcast live and free on TV 1 (Programme national), TV 6, and L’Equipe Web."], "ranking": [1]}
{"candidates": ["Brazil missed a string of chances and were held 0-0 by Costa Rica in their Copa América Group D opener.", "Brazil dominated possession but lacked precision in front of goal with just three of their 19 shots on target.", "Costa Rica's five-man defense contained Brazil and deprived them of space.", "Raphinha had an early opportunity to score but Costa Rica keeper Patrick Sequeira came off his line to snuff out the danger.", "Brazil thought they had scored in the 30th minute but the goal was disallowed for offside after a lengthy VAR delay.", "Lucas Paquetá rattled the woodwork with a long-range effort in the 63rd minute.", "Guilherme Arana's strike was kept out by a fine save from Sequeira.", "Coach Dorival Junior brought on youngsters Endrick and Sávio in the 70th minute as Brazil sought a winner.", "Paqueta twice shot wide in the final 10 minutes as Brazil failed to break the deadlock.", "Brazil missed a string of chances and were held 0-0 by Costa Rica in their Copa América Group D opener.", "Raphinha had an excellent early opportunity to score but Costa Rica keeper Patrick Sequeira came quickly off his line to snuff out the danger.", "Brazil thought they had got the breakthrough in the 30th minute when a free kick was flicked on by Rodrygo into the path of Marquinhos, who poked it in at the far post but the goal was disallowed for offside after a lengthy VAR delay.", "Lucas Paquetá rattled the woodwork with a long-range effort in the 63rd minute.", "A venomous Guilherme Arana strike was kept out by a fine save from Sequeira.", "Coach Dorival Júnior brought on youngsters Endrick and Sávio in the 70th minute as Brazil desperately sought a winner but Paquetá twice shot wide in the final 10 minutes.", "Brazil and Costa Rica played to a 0-0 draw in their Copa América opener.", "Brazil dominated possession, controlling the ball for more than 65 of the 90 minutes and outshooting Costa Rica 19-2.", "Brazil's Marquinhos had a goal ruled offside after a lengthy video review in the first half.", "Lucas Paqueta's shot struck the near post in the 63rd minute.", "Costa Rica's keeper Patrick Sequeira made a crucial save after Haxzel Quiros misplayed a clearance.", "Brazil missed a string of chances and were held 0-0 by Costa Rica in their Copa America Group D opener.", "Joseph Mora (Costa Rica) won a free kick in the defensive half in the 90'+5' minute."], "ranking": [20, 18, 16, 14, 12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 15, 13, 11, 19, 17, 21, 22]}
{"candidates": ["A Group D meeting between Brazil and Costa Rica, their first match in the 2024 Copa America, kicks off at 9:00 PM ET on June 24 at SoFi Stadium.", "For this group-stage game, Brazil is -1111 to win and Costa Rica is +2200, with the draw at +1000.", "An over/under of 3.5 goals (with the over at -110 and the under at -115) has been set for this match.", "We are predicting Brazil to win, with a 91.7% chance of winning this match, based on the moneyline.", "Brazil has scored 23 goals in 13 matches the past two years, and Costa Rica has conceded 27 goals in 14 matches.", "Costa Rica has scored 19 goals in 14 games the past two years. On the flip side, Brazil has conceded 20 goals in 13 games.", "In terms of goal differential, Brazil was in positive territory at +3. With 19 goals scored and 27 conceded, Costa Rica posted a negative goal differential."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Brazil defender Marquinhos emphasized the importance of creating alternatives to score and the significance of early points in the competition.", "Costa Rica coach Gustavo Alfaro commented on the team's underdog status, comparing it to Bruce Willis in 'The Sixth Sense'.", "Paqueta expressed frustration at not winning but maintained confidence in the team's performance and highlighted the need to improve finishing.", "Neymar, Brazil's all-time leading scorer, looked dejected as he watched from the stands due to an anterior cruciate ligament injury.", "Vinícius Junior said after the game, 'We know we can improve, we have to improve. I also know what I can improve, evolve and do for our team.'", "Dorival Júnior said post-game, 'We tried with [Vinícius] on the wing and we didn’t succeed. Then we put him inside and we couldn’t find a way through either... he was very well marked.'", "Vinícius said, 'Every time I enter the field for the national team, I have three or four players marking me.'", "Vinícius said, 'New coach, new players, everything takes time. Our fans want everything immediately done, but we’re going little by little. In the next game, I’m sure we’ll play much better because we now already understand what the competition will be like, what the pitch, what the referees will be like.'", "Brazil's unimpressive performance against Costa Rica offered little reason to think Brazil will turn around soon.", "Brazil needs a win or draw against Paraguay on Friday to get its tournament back on track.", "Costa Rica held Brazil scoreless in the Copa opener.", "Brazil rued a lack of quality in the final third after the match ended 0-0."], "ranking": [8, 10, 6, 9, 5, 4, 7, 3, 2, 1, 11, 12]}
{"candidates": ["Colombia leads Group D following their 2-1 win over Paraguay earlier on Monday.", "The match was held at SoFi Stadium in Inglewood, California, with an attendance of 67,158.", "Brazil’s all-time leading scorer Neymar, who has been sidelined by an anterior cruciate ligament injury, cut a dejected figure as he looked on from the stands.", "Frustration has become the norm for Brazil in recent years. After 18 months of upheaval in the federation, dugout and squad, they have fallen to sixth in South American qualifying for the 2026 World Cup.", "This summer’s Copa América was billed as a chance to hit a reset with a new manager and fresh, young stars. After a flat opening draw, Vinícius is still preaching patience.", "The match took place at SoFi Stadium in Inglewood, California, USA.", "Attendance for the match was 67,158."], "ranking": [7, 5, 3, 2, 4, 6, 1]}
{"candidates": ["The match will take place at SoFi Stadium in Inglewood, CA.", "The game is scheduled for Monday, June 24, 2024, at 9:00 p.m. ET and will be broadcast on FS1.", "The Rose Bowl in Pasadena is a significant site for Brazilian football, where Brazil sealed their fourth World Cup title in 1994.", "Brazil aims to repeat their 1994 World Cup success as they prepare for the 2026 World Cup."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Ajdin Hrustic scored the opening goal for Australia in the 29th minute.", "Lachlan Yengi extended Australia's lead with a goal in the 62nd minute.", "Rakib Hossain scored a consolation goal for Bangladesh in the 83rd minute."], "ranking": [2, 1, 3]}
{"candidates": ["Australia's commanding place at the top of Group I allowed coach Graham Arnold to experiment with the team and introduce new players like Nestory Irankunda.", "Australia aimed to overtake South Korea in the FIFA world rankings to secure a spot in pot one for the next qualifying round.", "Nestory Irankunda was handed a shock start by Graham Arnold in an attacking starting line-up.", "The match was effectively a dead rubber as Australia had already progressed to the next round of qualifying and claimed top spot in Group I."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Graham Arnold expressed satisfaction with the team's performance and highlighted the challenging humid conditions in Dhaka.", "Nestory Irankunda reflected on his debut, expressing pride and acknowledging the tough conditions.", "Coach Graham Arnold criticized the poor pitch conditions, calling it 'dangerous' and expressing concern over player welfare.", "Arnold praised Kusini Yengi for his performance despite the challenging conditions and his recent lack of match fitness.", "Nestory Irankunda expressed pride in making his national team debut and acknowledged areas for improvement.", "Arnold was pleased with Irankunda's debut, noting his potential and the need for further development.", "Graham Arnold was critical of the surface at the Bashundhara Kings Arena, calling it 'unacceptable' and 'dangerous'", "Arnold expressed relief that his players escaped injury despite the poor pitch conditions", "Nestory Irankunda made his international debut and reflected on his performance, stating, 'I could have done better with my performance but I’m really proud to obviously cap for the nation, it’s a dream come true for me'", "Graham Arnold's team was frustrated with a 2-0 win, as they expected more goals.", "The Socceroos' performance was marred by poor crosses and finishing in difficult conditions.", "Jordy Bos was highlighted as Australia's main creative outlet and possibly the player of the match."], "ranking": [7, 9, 1, 5, 8, 4, 2, 6, 3, 10, 11, 12]}
{"candidates": ["Alexander Isak scored two goals for Sweden at the 65th and 71st minutes.", "Viktor Gyökeres scored a penalty at the 80th minute for Sweden.", "Renat Dadachov scored for Azerbaijan at the 82nd minute."], "ranking": [1, 2, 3]}
{"candidates": ["Isak scored two goals for Sweden in the 65th and 71st minutes.", "Gyokeres scored a penalty for Sweden in the 80th minute.", "Dadasov scored for Azerbaijan in the 82nd minute.", "Wahlqvist received a yellow card in the 59th minute.", "Saletros received a yellow card in the 90+1 minute."], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Azerbaijan and Sweden will meet for a UEFA Nations League C clash in Baku on Thursday evening.", "Sweden will be looking for a vast improvement on their most recent trip to Baku back in November 2023, when a three-goal defeat in Euro qualifying dealt their hopes of reaching Germany a major blow.", "Sweden are heavy favourites to top a section containing Azerbaijan, Slovakia, and Estonia.", "Sweden and Azerbaijan will play a pivotal match for the UEFA Nations League, League C, Group 1 on September 5, 2024.", "The competition will take place in the 31,200-seat Tofiq Bahramov Republican Stadium in Baku, Azerbaijan.", "The start time of the match is 16:00 UTC.", "Berke B., a Hungarian referee with expertise and authority, will officiate the game.", "Group 1 is currently being led by Azerbaijan, with Sweden in fourth position.", "Both clubs need to win this game in order to maintain their group standing, pursue promotions, and avoid relegation.", "Azerbaijan’s recent performance has been inconsistent, which may have an impact on how they play against Sweden.", "Sweden has also experienced a series of mixed outcomes in their recent fixtures.", "Sweden has a strong head-to-head record against Azerbaijan, suggesting that team has performed well in previous meetings.", "Sweden has won four of the previous five games against Azerbaijan, maintaining their historical dominance.", "Azerbaijan emerged victorious in their most recent meeting in November 2023.", "Azerbaijan’s probable lineup includes Mahammadaliyev (GK), Mammadov (DF), Mustafazada (DF), Kryvotsiuk (DF), Cafarquliyev (DF), Sheydayev (MF), Isayev (MF), Diniyev (MF), Bayramov (MF), Mahmudov (FW), Dadashov (FW).", "Sweden’s probable lineup includes Olsen (GK), Wahlqvist (DF), Lindelof (DF), Helander (DF), Sema (DF), Svanberg (MF), Cajuste (MF), Gustafson (MF), Forsberg (MF), Gyokeres (FW), Kulusevski (FW)."], "ranking": [15, 2, 5, 10, 12, 16, 14, 8, 6, 11, 9, 3, 1, 4, 7, 13]}
{"candidates": ["The exhilarating contest will be broadcast live on Fancode, ensuring that fans worldwide can partake in the riveting spectacle.", "This will be the fifth meeting between Azerbaijan and Sweden, with Sweden winning three of the previous four encounters.", "Azerbaijan's only win against Sweden came on November 16, with a 3-0 victory.", "Sweden has failed to win five of their last six competitive away games, losing four and drawing one since June 2022.", "Azerbaijan has won just two of their last eight competitive matches, losing five and drawing one since March 2023.", "The match was held at Tofik Bakhramov Stadium in Baku, Azerbaijan with an attendance of 9,450.", "Sweden had a higher possession rate of 60.8% compared to Azerbaijan's 39.2%.", "Sweden had more shots on goal (11) compared to Azerbaijan (9)."], "ranking": [8, 5, 4, 2, 3, 6, 7, 1]}
{"candidates": ["The game’s outcome could be significantly impacted by the state of the field at Tofiq Bahramov Republican Stadium and the Baku climate.", "Sweden might be more vulnerable to rain and other bad weather that could hinder player footing and ball movement than Azerbaijan because they are not used to these situations."], "ranking": [2, 1]}
{"candidates": ["Bahrain's Ali Madan scored an important goal in the dying minutes to revive Bahrain’s hopes of advancing to the knockout stage.", "Bahrain’s Komail al Aswad and Malaysia's Shahrul Saad and Syamer Kutty Abba received yellow cards from the Omani referee.", "Ali Madan scored the winning goal for Bahrain in the 90+5 minute.", "Ali Madan was named Player of the Match with a rating of 8.1.", "Ali Madan scored the winning goal for Bahrain at minute 90+6' with a right-footed shot inside the box.", "Malaysia's Shahrul Saad received a yellow card for a foul on Waleed Al Hayam at minute 75'.", "Malaysia were eliminated from the Asian Cup in Doha after losing their second Group E game, 1-0, to Bahrain.", "Ali Madan scored the late winner for Bahrain."], "ranking": [1, 6, 2, 5, 3, 7, 4, 8]}
{"candidates": ["Madan scored the winning goal for Bahrain in the 90+5' minute.", "Al Aswad received a yellow card in the 45+1' minute.", "Kutty Abba received a yellow card in the 19' minute.", "Saad received a yellow card in the 52' minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["For the first time in their history, Bahrain and Malaysia will square off in an Asian Cup group fixture.", "Each team enters this contest with a defeat, as Bahrain were beaten 3-1 by South Korea on matchday one, while Malaysia lost 4-0 to Jordan.", "Bahrain have won their last three meetings with Malaysia, conceding just once over that stretch, and have never lost in five previous Asian Cup qualifiers against them.", "Malaysia returned to the group stage of the Asian Cup after over 16 years.", "Malaysia suffered their worst competitive defeat since 2021 in their opening match against Jordan.", "Both Bahrain and Malaysia come into this AFC Asian Cup tie on the back of defeats.", "Bahrain were handed a 3-1 defeat by South Korea while Malaysia faced a 4-0 defeat against table toppers Jordan.", "Bahrain's forward Abdullah Al-Hashash was their best player in the opening match against South Korea, scoring Bahrain’s lone goal.", "Malaysia's Junior Eldstal was one of the few positives from Malaysia’s opener against Jordan, making important clearances and crucial tackles.", "Malaysia have not managed to defeat Bahrain since 1978.", "Bahrain are ranked 86th while Malaysia stand at the 130th position in the latest FIFA rankings.", "Bahrain’s Abdulla Yusuf Helal and Malaysia’s Mohamadou Sumareh were on the scoresheet the last time these two teams met.", "Both teams are expected to have a fully fit squad available for selection going into this game.", "Predicted line-up for Bahrain: Sayed Mohammed Jaffer (GK) (C); Mohamed Adel, Amine Mohamad Hassan Benaddi, Waleed Al Hayam, Abdulla Al Khalasi; Mohamed Al-Hardan; Ali Madan, Moses Atede, Jasim Khelaif Wahab Al Salama, Kamil Al Aswad; Abdulla Yusuf Helal.", "Predicted line-up for Malaysia: Hazmi, Cools, Eldstal, Davies, Hanapi, Fazail, Wilkin, Corbin-Ong, Akhyar, Josue, Abdul Halim.", "Prediction: Bahrain 3-1 Malaysia.", "Bahrain and Malaysia both failed to earn points from matchday 1 of Group E in the AFC Asian Cup 2023 (held in 2024).", "Bahrain showed a decent performance against South Korea in matchday 1, managing to equalize before losing 1-3.", "Malaysia lost 0-4 to Jordan in their opening group match.", "Bahrain's coach, Juan Antonio Pizzi, emphasized the need for his team to maintain focus throughout the entire match.", "Malaysia's defender, Shahrul Saad, mentioned that scoring first against Bahrain would boost their confidence and increase their chances of winning."], "ranking": [10, 7, 1, 14, 5, 6, 8, 3, 4, 16, 11, 2, 18, 19, 15, 9, 12, 13, 17, 20, 21]}
{"candidates": ["Bahrain won 1-0 at home over Malaysia.", "The goal came from Ali Madan at minute 90+6'.", "The South Korean coach Kim Pan Gon’s plans looked solid for most of the match but in the end Malaysia lost to the better team as his substitutes couldn't impact the match."], "ranking": [2, 3, 1]}
{"candidates": ["Oman’s international umpiring team led by referee Ahmed al Kaaf produced outstanding officiating in the match.", "There were no red cards or VAR decisions during the match.", "Bahrain had 66% ball possession compared to Malaysia's 34%.", "Bahrain had 13 total shots with 3 on target, while Malaysia had 4 total shots with 1 on target.", "The match was held at Jassim Bin Hamad Stadium (Al-Sadd Stadium) with an attendance of 10,386.", "Bahrain had 66% possession compared to Malaysia's 34%.", "Bahrain had 13 total shots with 3 on goal, while Malaysia had 4 total shots with 1 on goal.", "Bahrain made 542 total passes compared to Malaysia's 272.", "Bahrain committed 11 fouls, while Malaysia committed 19."], "ranking": [8, 9, 5, 4, 1, 6, 3, 2, 7]}
{"candidates": ["Kick Off: January 20, 2024, 20:00 IST; January 20, 2024, 22:30 GMT+8; January, 20, 2024, 17:30 GMT+3.", "Telecast for Bahrain vs Malaysia: India – Sports 18, Jio Cinema; Qatar, Bahrain, Jordan, Kuwait, Lebanon, Palestine, Syria, Yemen, Oman – BeinSports, Alkass; United Kingdom, Ireland, France, Belgium, Netherlands – Triller TV; Australia – Network 10; Malaysia – Astro Go, RTM."], "ranking": [2, 1]}
{"candidates": ["Austria won 2-1 against Serbia.", "Wimmer scored for Austria in the 10th minute.", "Baumgartner scored for Austria in the 13th minute.", "Pavlovic received a yellow card in the 35th minute.", "Mitrovic scored for Serbia in the 72nd minute."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Austria will face Serbia at the Ernst Happel Stadion on Tuesday in a friendly clash between the two teams.", "Austria thrashed Turkey 6-1 in their last match, with four different players getting on the scoresheet including Freiburg man Michael Gregoritsch who netted a brilliant hat-trick to take his goal tally for the nation to 15.", "Serbia picked up a narrow but largely deserved 1-0 win over Cyprus in their last outing, with Sergej Milinkovic-Savic netting the sole goal of the game just seven minutes after kick-off.", "Following Tuesday's game, Serbia will lock horns with Sweden in another friendly clash before facing England in their group opener midway through the month.", "Tuesday's game will mark the fifth meeting between Austria and Serbia. The hosts have won just one of their previous matchups while the visitors have won the other three.", "The two sides last faced off in a World Cup qualifying clash back in 2017 which the hosts won 3-2, with Hannover man Louis Schaub netting a stunning winner late in the game.", "Austria are on a brilliant five-game winning streak and have lost just once since November 2022. They have lost just one of their last seven games on home soil and will be looking forward to Tuesday's game.", "Serbia's latest result ended a three-game winless streak and they will aim to build on that this week. They have, however, lost three of their last four games on the road and could see defeat here as well."], "ranking": [8, 2, 5, 6, 4, 3, 1, 7]}
{"candidates": ["The match will be held at Ernst Happel Stadion.", "Kick-off times are 06:45 PM (GMT), 02:15 PM (EST), and 12:15 AM (IST).", "Telecast details include Sony Sports Network and Sony Liv in India, Premier Sports 2 in the UK, ESPN and FOX Sports in the USA, and no telecast in Nigeria."], "ranking": [3, 2, 1]}
{"candidates": ["Veterans Kucka and Peter Pekarík have now started all eight games Slovakia has ever played in the European finals tournament since first qualifying for the 2016 edition.", "Since FIFA began its world rankings, no side has beaten an opponent as many places above it as Slovakia (48th) beating Belgium (second).", "This is statistically the biggest upset in European Championship history.", "It's the biggest upset by FIFA ranking differential in Euro history, with Belgium ranked No. 3 and Slovakia ranked No. 48, a difference of 45 spots.", "Ivan Schranz scored Slovakia's quickest goal at a major tournament."], "ranking": [5, 4, 2, 1, 3]}
{"candidates": ["Schranz scored for Slovakia in the 7th minute", "Mangala received a yellow card in the 29th minute", "Tielemans received a yellow card in the 76th minute", "Lukebakio received a yellow card in the 85th minute", "Schranz received a yellow card in the 41st minute"], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Belgium arrived at the tournament unbeaten in 14 matches with 10 wins.", "There had been talk before the game of this being a new Belgium, casting off the Golden Generation tag and filled with young talent."], "ranking": [1, 2]}
{"candidates": ["Belgium is on a 17-match unbeaten streak heading into the fixture against Slovakia", "Belgium has not lost a single game since Domenico Tedesco's appointment as head coach", "Belgium is the clear favorite to prevail from a group that also features Romania and Ukraine", "Slovakia's squad for Euro 2024 is headlined by Milan Skriniar, and the Paris Saint-Germain defender is in line to win his 69th cap for his national side in their campaign opener against Belgium.", "Head coach Francesco Calzona is set to line his side up in a 4-3-3 formation, with Juraj Kucka expected to overcome some fitness issues to feature in midfield.", "Denis Vavro is nursing a slight thigh problem, but the defender is expected to be in the XI, with the 28-year-old also an important player for Slovakia.", "Ondrej Duda is the leading goalscorer in the squad, finding the back of the net on 13 occasions, and he will feature in midfield for the Falcons on Monday.", "Ivan Schranz and Lukas Haraslin, meanwhile, are set to operate alongside Robert Bozenik in the final third of the field.", "Bozenik has struck seven times in 40 caps for his country, and the 24-year-old is the first-choice operator through the middle for Calzona's side.", "Newcastle United's Martin Dubravka is the first-choice goalkeeper and will feature between the sticks, while the most experienced player in the squad, Peter Pekarik, 37, is in line to win his 128th cap.", "Belgium, the group favorites, are led by Kevin De Bruyne and are expected to perform strongly under new manager Domenico Tedesco.", "Slovakia, with players like Milan Škriniar and Marek Hamšík, aim to leverage their solid defense to advance.", "Belgium vs Slovakia (June 17, Frankfurt): Belgium to win, utilizing their attacking prowess."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]}
{"candidates": ["At the final whistle, the Slovakia squad and staff danced in front of their fans as their choice of victory music, 'Freed From Desire,' boomed out.", "Slovakia pressing was energetic on Belgium’s makeshift defense despite fielding two 37-year-olds in outfield positions.", "Belgium has gone three straight tournament games without scoring.", "The match was held at Deutsche Bank Park in Frankfurt, Germany.", "Attendance for the match was 45,181.", "Belgium had 60.4% possession while Slovakia had 39.6%.", "Belgium had 16 shot attempts with 5 on goal, while Slovakia had 10 shot attempts with 4 on goal.", "Lukas Haraslin was named Player of the Match for his constant menace and enterprise.", "Player ratings for Belgium: Casteels 6, Castagne 5, Faes 6, Debast 6, Carrasco 5, Mangala 5, Onana 5, Trossard 5, De Bruyne 6, Doku 5, Lukaku 5. Subs: Bakayoko 6, Tielemans 6, Openda 7, Lukebakio 6.", "Player ratings for Slovakia: Dubravka 7, Pekalik 7, Vavro 8, Skriniar 8, Hancko 8, Kucka 7, Lobotka 7, Duda 7, Schranz 7, Bozenik 8, Harslin 8. Subs: Strelec 6, Suslov 6, Duris 6, Obert 6.", "Between 10,000 and 15,000 Belgian fans attended the match in Germany.", "From a sports betting perspective, Slovakia was +600 to win outright before the match started, while Belgium was the heavy favorite at -210.", "The odds of a draw closed at +340.", "Belgium were without their preferred central defensive pairing of Jan Vertonghen and Arthur Theate.", "Jérémy Doku played on the right in the first half and Yannick Carrasco as a left-wing back, leading to a lack of balance in the team."], "ranking": [1, 3, 2, 15, 14, 12, 11, 5, 6, 7, 9, 8, 10, 4, 13]}
{"candidates": ["Belgium and Slovakia have only met three times in their history, all friendly internationals", "Belgium won their last encounter against Slovakia 2-1 in 2013", "Frankfurt Arena will host the match between Belgium and Slovakia on 17 June 2024 at 18:00. Gates will open at 15:00."], "ranking": [2, 1, 3]}
{"candidates": ["The match broke the altitude record for an international fixture."], "ranking": [1]}
{"candidates": ["Bolivia claimed their second win in the South American World Cup qualifiers with a 4-0 home victory over Venezuela.", "Ramiro Vaca scored the first goal for Bolivia at the 13th minute.", "Carmelo Algarañaz scored a penalty at the 45'+5' minute.", "Miguel Terceros scored at the 46th minute.", "Enzo Monteiro scored the final goal at the 89th minute.", "Ramiro Vaca opened the scoring for Bolivia in the 13th minute with a long-range shot.", "Carmelo Algarañaz doubled Bolivia's lead from the penalty spot before the break.", "Miguel Terceros scored early in the second half.", "Enzo Monteiro sealed the win with a goal in the 89th minute.", "Bolivia defeated Venezuela 4-0.", "Vaca scored in the 13th minute.", "Algaranaz scored a penalty in the 45+5th minute.", "Terceros scored in the 46th minute.", "Eduardo Monteiro de Castro Becerra scored in the 89th minute.", "Cuellar received a yellow card in the 9th minute.", "Vaca received a yellow card in the 14th minute.", "Eduardo Monteiro de Castro Becerra received a yellow card in the 90th minute.", "Casseres Jr received a yellow card in the 78th minute.", "Soteldo received a yellow card in the 79th minute."], "ranking": [1, 5, 6, 7, 8, 2, 3, 4, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]}
{"candidates": ["Bolivia won 4-0 against Venezuela.", "Vaca scored in the 13th minute.", "Algaranaz scored a penalty in the 45+5th minute.", "Terceros scored in the 46th minute.", "Eduardo Monteiro de Castro Becerra scored in the 89th minute.", "Cuellar received a yellow card in the 9th minute.", "Vaca received a yellow card in the 14th minute.", "Eduardo Monteiro de Castro Becerra received a yellow card in the 90th minute.", "Casseres Jr received a yellow card in the 78th minute.", "Soteldo received a yellow card in the 79th minute."], "ranking": [1, 3, 2, 4, 5, 8, 9, 10, 6, 7]}
{"candidates": ["Jhon Murillo and the Venezuelan national team will face Bolivia on September 5, 2024, in a crucial World Cup qualifying match.", "The match will take place at the Estadio Municipal de El Alto in La Paz, Bolivia, at 14:00 hours (Mexico City time).", "Venezuela is currently fourth in the overall standings, and two positive results could bring them closer to a historic World Cup qualification.", "Bolivia and Venezuela will resume 2026 World Cup qualifying after competing at the Copa America in the summer.", "Bolivia are in ninth place with three points, while Venezuela are in fourth position with nine points from six matches.", "Bolivia experienced a disappointing campaign at the 2024 Copa America, leading to the sacking of Antonio Carlos Zago and the appointment of Oscar Villegas.", "Venezuela made a knockout-round appearance at the Copa America but were defeated by Canada in a penalty shootout.", "Venezuela are looking to qualify for their first-ever World Cup finals."], "ranking": [5, 8, 2, 7, 4, 3, 6, 1]}
{"candidates": ["Bolivia's newly-appointed coach Oscar Villegas earned his first triumph.", "The win moved Bolivia provisionally into the international playoffs spot in seventh place with six points, just one behind Brazil."], "ranking": [2, 1]}
{"candidates": ["The match was held at one of the world's highest altitude stadiums in El Alto, La Paz, Bolivia.", "The match was held at the Municipal de El Alto stadium, which is 4,150 metres above sea level and 550 metres above the Hernando Siles stadium in La Paz.", "Some 20,000 fans gathered at the stadium to watch the match."], "ranking": [2, 1, 3]}
{"candidates": ["Jadwal Bahrain vs Australia di laga uji coba AFC Asian Cup 2024 akan berlangsung pada Sabtu (6/1/2024), pukul 21.00 WIB.", "Bahrain yang tidak diunggulkan di Piala Asia 2024 bertekad menunjukkan performa yang apik.", "Australia yang bakal tampil dengan beberapa pemain muda di Piala Asia 2024, memiliki hasil yang lebih menjanjikan.", "Uji coba melawan Bahrain menjadi satu-satunya laga Australia pemanasan jelang Piala Asia 2024.", "Graham Arnold memanggil sejumlah pemain seperti Gethin Jones (Bolton Wanderers), Patrick Yazbek (Viking), dan John Iredale (Wehen Wiesbaden) yang belum memiliki caps bersama tim nasional.", "Samuel Silvera (Middlesbrough) yang masih berusia 23 tahun juga masuk dalam skuad Australia di Piala Asia 2024.", "Silvera mengaku senang mendapat kesempatan memperkuat Australia.", "Bahrain mengandalkan skuad yang dipenuhi pemain liga lokal.", "Penggawa yang berlaga untuk klub abroad adalah gelandang Moses Atede (Kedah Darul Aman, Malaysia), penyerang Ali Madan (Ajman, UEA), dan Abdulla Yusuf Helal, eks Persija yang kini memperkuat Mada Boleslav (Ceko).", "In preparation for the Asian Cup, Bahrain and Australia will battle in a friendly on Saturday at Baniyas Stadium in the United Arab Emirates (UAE).", "Juan Antonio Pizzi has begun his tenure as Bahrain manager well, suffering just one defeat since taking charge.", "Bahrain have never beaten the Socceroos in their five previous meetings, suffering a 1-0 defeat the last time around at the 2011 Asian Cup.", "The Aussies enter 2024 full of confidence, fresh off successive victories in November, putting them at the top of their second-round World Cup qualifying group with a 2-0 record and without a goal conceded.", "Australia boast an all-time 100% record versus Bahrain, conceding only once in their five previous encounters against them (3-1 win at the 2006 Asian Cup)."], "ranking": [12, 9, 8, 11, 7, 6, 5, 4, 3, 2, 10, 1, 13, 14]}
{"candidates": ["Graham Arnold described the match as perfect preparation for the Asian Cup.", "Craig Goodwin praised the Socceroos' patience in their 2-0 win.", "Mitchell Duke was pleased with the important minutes gained in the Bahrain test."], "ranking": [2, 3, 1]}
{"candidates": ["The match was held at Baniyas Stadium with an attendance of 300.", "The final score was Bahrain 0, Australia 2."], "ranking": [2, 1]}
{"candidates": ["Three second half goals saw Argentina ease past Chile in World Cup Qualifying.", "Scorers: Mac Allister 48′, Alvarez 84′, Dybala 90+1", "Alexis Mac Allister popped up from midfield to fire Argentina into a deserved lead.", "Julián Alvarez got his name on the scoresheet with a screamer from the edge of the box.", "Paulo Dybala added a third goal in injury time.", "Alexis Mac Allister scored in the 48th minute.", "Julián Álvarez scored in the 84th minute.", "Paulo Dybala scored in the 90'+1' minute.", "Argentina defeated Chile 3-0 in World Cup qualifying on Thursday.", "Goals from Alexis Mac Allister, Julian Alvarez, and Paulo Dybala sealed the victory.", "Alexis Mac Allister scored the opening goal three minutes into the second half.", "Julian Alvarez scored a long-range stunner in the 84th minute.", "Paulo Dybala scored the third goal in stoppage-time.", "Alexis Mac Allister, Julian Alvarez and Paulo Dybala were on target as Argentina tightened their grip on South America's 2026 World Cup qualifying tournament with a 3-0 win over Chile.", "Liverpool midfielder Mac Allister swept in a low finish three minutes after half-time to break the deadlock at the Estadio Monumental in Buenos Aires against a defensive Chile side.", "Former Manchester City striker Alvarez doubled the lead in the 84th minute with a thumping shot from outside the area before substitute Dybala put the seal on the victory with a late strike in stoppage time.", "Argentina claimed a 3-0 home win over Chile thanks to second-half goals from Alexis Mac Allister, Julian Alvarez, and Paulo Dybala.", "Liverpool midfielder Mac Allister scored three minutes after the break off a cross from Alvarez.", "Julian Alvarez scored a long-range effort in the 84th minute.", "Substitute Paulo Dybala found the net in stoppage time to seal the victory."], "ranking": [1, 20, 4, 6, 10, 18, 19, 17, 3, 5, 7, 9, 11, 12, 13, 14, 15, 16, 2, 8]}
{"candidates": ["Argentina came into the night having won five of their opening matches.", "Chile have been in a rut with just one win in their opening seven games.", "Argentina will welcome Chile to Estadio Mâs Monumental in the 2026 FIFA World Cup qualifiers on Thursday.", "The hosts are at the top of the CONMEBOL qualifying standings and La Roja are in eighth place in the table with just one win in six games.", "La Albiceleste will play for the first time since their Copa America triumph in July and will look to continue their winning run in this match.", "They have a 100% record in all competitions in 2024 and in their previous World Cup qualifying match, they registered a 1-0 away win over Brazil.", "Nicolás Otamendi scored the game's only goal with Giovani Lo Celso picking up the assist.", "Chile were eliminated from the group stage of the Copa America, failing to score in three games.", "They have won just two of their last nine games in all competitions with both wins coming in friendlies.", "They suffered a 1-0 away loss to Ecuador in their last World Cup qualifying match.", "The two teams have a long-standing rivalry and have met 95 times in all competitions since 1910.", "The defending World Cup champions have the upper hand in these meetings with 63 wins.", "The visitors have just eight wins to their name and 24 games have ended in draws.", "The Copa America 2024 winners are unbeaten in their last seven meetings against La Roja, recording four wins.", "They last met in the Copa America group stage in June and Lautaro Martínez's 88th-minute strike helped La Albiceleste register a 1-0 win.", "The hosts have lost just one of their last 27 games in the World Cup qualifiers.", "The two teams have met 17 times in the World Cup qualifiers and Argentina have the upper hand in these meetings, recording 12 wins while suffering just one loss.", "La Albiceleste are on an 11-game winning streak in all competitions, keeping eight clean sheets.", "They have an unbeaten home record against La Roja in all competitions, though the last two home meetings have ended in draws.", "Lionel Scaloni has a few key absentees for the ongoing international break as Lionel Messi misses out due to an injury, while Nicolás Tagliafico and Leonardo Balerdi also dropped out from the squad.", "Ángel Di María retired after the Copa America and will be honored before the match.", "La Roja have been in poor touch in the World Cup qualifiers with just one win in six games.", "They have failed to score in four games in that period which is a cause for concern.", "They have suffered four consecutive losses in away games in the qualifiers and will look to improve upon that record.", "Claudio Bravo announced his retirement from international football last week and is not in the squad.", "Alexis Sánchez and Diego Valdez will also play no part in the match due to their injuries.", "Considering the current form of the two teams and home advantage for the Copa America 2024 champions, the home team should be able to eke out a narrow win.", "Argentina paid tribute to Angel Di Maria, who announced his international retirement after winning the Copa America.", "Argentina went into Thursday's game missing injured captain Lionel Messi and veteran winger Angel Di Maria, who retired from international football after the Copa America triumph in July.", "Di Maria was feted by his former teammates at a pre-game ceremony before taking his place in the stands to watch the world champions secure their sixth win from seven qualifying games."], "ranking": [1, 2, 28, 4, 5, 3, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 29, 30]}
{"candidates": ["Ale Moreno reacted to Argentina's comfortable win over Chile in their first competitive fixture since 2013 without Lionel Messi or Angel Di Maria.", "Argentina's dominance was noted despite the absence of Lionel Messi and Ángel Di María, who received a tribute at the Monumental stadium after his international retirement.", "Lionel Scaloni's side stayed atop the CONMEBOL standings in World Cup qualifying with 18 points out of 21.", "Lionel Scaloni should be thrilled with the team's performance, especially in the second half.", "Lionel Scaloni's team lead South America's 10-team round-robin qualifying table by five points after seven games.", "Despite the absence of Messi and Di Maria, Argentina had plenty of creative guile in attack with Lautaro Martinez and Atletico Madrid's Alvarez causing problems for the Chile defense.", "Argentina controlled midfield with Mac Allister lining up alongside Rodrigo De Paul and Enzo Fernandez.", "The Copa America champions looked dominant and untroubled by the absence of talismans Lionel Messi and Angel Di Maria.", "Angel Di Maria received a tribute at the Monumental stadium after his international retirement."], "ranking": [8, 6, 5, 4, 3, 2, 7, 1, 9]}
{"candidates": ["Next up for the reigning champions is a qualifying showdown with Colombia, while Chile will take on Bolivia.", "Argentina's win left them with 18 points, five clear of second-placed Uruguay.", "The match was held at Mâs Monumental stadium with an attendance of 52,160.", "Emiliano Martinez made an outstanding save in the first half.", "Nicolas Otamendi completed 96 percent of his 84 total passes.", "Giovani Lo Celso bagged an assist for Julian Alvarez's goal.", "Alejandro Garnacho assisted on Paulo Dybala's third goal."], "ranking": [7, 2, 6, 4, 5, 3, 1]}
{"candidates": ["Argentina will be without Lionel Messi due to an ankle injury", "Alexis Mac Allister was in pain after pulling up with an unspecified issue in training and is unlikely to feature against Chile", "Defenders Nicolas Tagliafico and Leonardo Balerdi are both ruled out through injury", "Angel Di Maria and Franco Armani have both retired from international football", "41-year-old goalkeeper Claudio Bravo has retired from international football", "Alexis Sanchez and Diego Valdes are both ruled out through injury", "Arturo Vidal, Gary Medel and Francisco Sierralta have all been left out of Gareca's squad"], "ranking": [1, 2, 3, 4, 5, 6, 7]}
{"candidates": ["Argentina will play at Colombia in a rematch of the Copa America final on Tuesday.", "Chile hosts Bolivia, who beat Venezuela earlier on Thursday."], "ranking": [2, 1]}
{"candidates": ["Dominik Szoboszlai scored the first goal for Hungary in the 38th minute.", "Szoboszlai converted a penalty in the second half to make it 2-0 for Hungary.", "Hungarian goalkeeper Dénes Dibusz made key saves against Edin Džeko.", "Dominik Szoboszlai scored twice to secure Hungary's victory against Bosnia.", "Zsolt Nagy assisted Dominik Szoboszlai for the first goal.", "Nail Omerovic conceded a penalty for a reckless challenge, which led to Hungary's second goal."], "ranking": [4, 3, 5, 1, 2, 6]}
{"candidates": ["Katic (24'), Kolasinac (60'), Huseinbasic (74')", "Szoboszlai (38', 50' pen.)", "Fiola (87')"], "ranking": [2, 1, 3]}
{"candidates": ["Bosnia and Herzegovina and Hungary aim for their first 2024-25 UEFA Nations League victory in Monday’s clash in Zenica.", "Neither side has managed to secure a win in this campaign, and with relegation looming, emotions are running high.", "Both squads have shown flashes of quality in their recent games, but inconsistency and defensive frailties have left them vulnerable.", "Experts predict a tightly contested affair where nerves and strategy will play a significant role.", "Bosnia have lost eight of their last nine international games, yet their only draw in this period came against Hungary in a 0-0 result just last month.", "Hungary come into this fixture off the back of consecutive draws, including a 1-1 draw against the Netherlands despite playing against ten men.", "Bosnia’s defensive issues are highlighted by conceding seven goals in just three Nations League matches.", "Edin Dzeko has scored in two of his last three outings for Bosnia.", "Hungary’s Roland Sallai remains a threat, evidenced by his 18th international goal against the Netherlands.", "Dominik Szoboszlai’s creativity will be essential for Hungary, though he might struggle if the team continues to falter in front of goal.", "Bosnia-Herzegovina and Hungary will look to claim their first win of the 2024-25 UEFA Nations League when they face off in Zenica on Monday.", "Having mustered one point from three matches, the hosts are leading Group A3, while the visitors are one point better off in third position.", "Bosnia are now facing a battle to avoid an immediate return to League B.", "Bosnia look to be in a head-to-head battle with Hungary to avoid automatic relegation, while Netherlands and Germany are set to compete for promotion.", "Hungary are sitting in the relegation playoff spot after drawing two and losing one of their first three Nations League matches.", "Having won just one of their last six internationals, Monday's visitors will be desperate to claim maximum points in their first away game against Bosnia since winning 3-1 in Euro 2008 qualifying in September 2006."], "ranking": [5, 2, 8, 10, 1, 3, 6, 12, 9, 11, 4, 7, 15, 13, 14, 16]}
{"candidates": ["Sergej Barbarez will be fuming with how badly Bosnia defended and missed chances.", "Marco Rossi will be pleased with Hungary's performance as his planning and tactics worked."], "ranking": [1, 2]}
{"candidates": ["Hungary's victory over Bosnia and Herzegovina puts them tied on points with the Netherlands in their group.", "Hungary's last game in the group stage will be against Germany at the Puskás Arena in Budapest.", "Hungary aims to make amends with fans after a heavy 5-0 loss to Germany in the away leg."], "ranking": [2, 3, 1]}
{"candidates": ["Vahan Bichakhchyan scored a goal, assisted by N. Tiknizyan at 6'.", "G. Arutyunyan scored an own goal at 9'.", "K. Dubra scored an own goal at 35'.", "L. Zelarayán scored a goal at 48'.", "E. Sperstian scored a goal, assisted by G. Mamedova at 86'.", "L. Vapne received a yellow card at 22'.", "J. Ikaunieks received a yellow card at 69'.", "Eduard Spertsyan scores the fourth goal of the game in favor of Armenia thanks to a right-footed shot that could not be contained by the opposing goalkeeper.", "Substitution, Armenia. Grant-Leon Ranos replaces Lucas Zelarayán.", "Substitution, Latvia. Renars Varslavans replaces Janis Ikaunieks because of an injury.", "Substitution, Armenia. Sergey Muradyan replaces André Calisir because of an injury.", "Substitution, Armenia. Zhirayr Shaghoyan replaces Artur Serobyan.", "Substitution, Armenia. Edgar Sevikyan replaces Vahan Bichakhchyan.", "Substitution, Latvia. Roberts Savalnieks replaces Alvis Jaunzems.", "Substitution, Latvia. Vladislavs Gutkovskis replaces Eduards Daskevics.", "Substitution, Latvia. Daniels Balodis replaces Kaspars Dubra.", "Substitution, Latvia. Dmitrijs Zelenkovs replaces Lukass Vapne.", "Yellow card for Janis Ikaunieks in Latvia.", "Yellow card for Lukass Vapne in Latvia.", "Georgi Harutyunyan scores an own goal and Latvia manages to tie the game unexpectedly.", "Vahan Bichakhchyan opens the account for Armenia, after a powerful left-footed shot impossible for the visiting goalkeeper to save.", "Kaspars Dubra scores an own goal and Armenia now takes control of the scoreboard with a one-goal difference.", "Lucas Zelarayán shot a right-footed shot very close to the visitors' goal to score Armenia's third of the match.", "V. Bichakhchyan scored in the 7th minute", "G. Harutyunyan scored an own goal in the 10th minute", "K. Dubra scored an own goal in the 36th minute", "L. Zelarayán scored in the 49th minute", "E. Spertseyan scored in the 87th minute", "Armenia’s Vahan Bichakhchyan opened the score in the 6th minute with a left footed shot from the center of the box to the high center of the goal.", "The score leveled after Georgi Harutyunyan’s own goal in the 9th minute.", "Armenia restored the advantage after an own goal by Kaspars Dubra, Latvia, in the 35th minute.", "Lucas Zelarayán scored the third goal for Armenia shortly into the second half.", "Eduard Spertsyan sealed the score in the 86th minute with a right footed shot from very close range to the bottom left corner.", "Armenia coasted to victory with a 4-1 win over Latvia in League C."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]}
{"candidates": ["Armenia take on Latvia at Republican Stadium - Vazgen Sargsyan in one of the matches in round one of the group phase of the UEFA Nations League this season.", "Armenia are ranked number 97 in the FIFA world ranking, while Latvia are ranked number 137.", "Armenia lost twice in their last three matches, as they were defeated 2-1 by Czech Republic and 2-1 against Slovenia, but won 2-1 against Kazakhstan.", "Latvia came through the last three games without a win, recording two draws and one loss.", "Armenia have not kept a clean sheet in their last 21 matches.", "Both teams have been involved in matches with few goals recently, suggesting a close encounter is expected.", "The home team, ranked 97th in the FIFA ranking, is in a bad moment of form with only 1 win in their last 10 matches between official and friendly matches. What could definitely help them will be the home factor, as in their last 6 home matches they have managed to win or draw in 4 of them, including the 1-1 draw against Wales.", "On the away side, we find the 137th in the world also in a not too positive form but with the precedent of almost a year ago when they won at home the Armenian team by 2-0 in a duel that is remembered of a lot of action where the accuracy in front of goal was key. However, as visitors they will have a big problem, having lost 6 of their last 7 away games.", "Latvia's best player is Kristers Tobers is a Latvian footballer who plays as a defensive midfielder or central defender. Born on December 13, 2000, Tobers has been a prominent figure in the Latvian national team, known for his defensive solidity, ability to intercept balls and his versatility on the field. He began his career with FK Liepāja, one of Latvia's top clubs, before moving to Lechia Gdańsk in Poland, where he has continued to develop his skills. Tobers is considered one of the most promising young talents in Latvian soccer, with a bright future both for his national team and at club level.", "Eduard Spertsyan is an Armenian footballer who has gained recognition as one of the most promising talents of the Armenian national team. Born on June 7, 2000 in Krasnodar, Russia, he plays as an attacking midfielder and is known for his technique, dribbling ability and ability to create attacking moves. Since his debut with FC Krasnodar in the Russian Premier League, he has proven to be a key player for both his club and the Armenian national team. Spertsyan has scored important goals and has been a key player in Armenia's bid to improve its performance in international competitions.", "Armenia will face Latvia at the Vazgen Sargsyan Republican Stadium on Saturday in the opening game of their 2024-25 UEFA Nations League campaign.", "Armenia endured a very poor Nations League campaign in 2022, losing five of their six group games and being relegated from League B.", "Armenia returned to winning ways last time out, beating Kazakhstan 2-1.", "Latvia featured in League D of the Nations League in 2022, winning four of their six group games to finish atop their group.", "Latvia are set to make their League C debut this week.", "Latvia faced the Faroe Islands in their most recent outing, picking up a 1-0 win to secure a third-place finish in the 2024 Baltic Cup.", "Saturday's game will mark the fifth meeting between Armenia and Latvia.", "The two sides last faced off in a European Championship qualifying clash last October, which Latvia won 2-0 despite finishing the game with 10 men.", "Latvia were ranked 137th in the latest FIFA rankings and now sit 40 places behind Armenia."], "ranking": [10, 8, 14, 12, 16, 6, 3, 2, 5, 4, 15, 18, 11, 9, 1, 7, 13, 17, 19]}
{"candidates": ["In the opening game of their 2024-25 UEFA Nations League C campaign, Armenia are set to welcome Latvia at Vazgen Sargsyan anvan Hanrapetakan Marzadasht on Saturday.", "The home side beat Kazakhstan 2-1 last time out on June 7, while the visitors managed to overcome Faroe Islands 1-0 on June 11.", "Armenia have lost their last five Nations League matches, and conceded 17 goals in those fixtures.", "Boss Oleksandr Petrakov's side come into Saturday's clash having lost seven of their last nine games, as well as having failed to win nine of their last 10 fixtures.", "Armenia have at least scored in 10 of their last 14 games in all competitions.", "Opponents Latvia narrowly beat Faroe Islands 1-0 thanks to a goal in the 50th minute from Andrejs Ciganiks.", "The visitors are currently ranked 137th in the world, and in their most recent Nations League campaign in 2022-23, they were promoted from the D League into the C League.", "Boss Paolo Nicolato's side have failed to win their two most recent matches in the competition, but prior to these results they did win their last five Nations League games.", "Latvia will have to improve on their away form if they are to win on Saturday given they are winless in their last eight games on the road, losing six of those clashes.", "Armenia will look to kick off their Nations League campaign in style when they face Latvia at Vazgen Sargsyan Republican Stadium.", "Armenia continues life without Henrikh Mkhitaryan, who retired from international football, and nowadays captain Varazdat Haroyan is the team’s most influential player.", "Hovhannisyan, Bichakhchyan, and M’gladbach forward Ranos made the cut for the Armenian team.", "Latvia struggled in the EURO 2024 qualifiers, collecting only three points in total.", "Latvia are not regarded as good travelers, and the prediction is that Armenia will emerge triumphant in the match.", "A key player to watch in the Latvian team is Daejeon attacker Vladislavs Gutkovskis, who has netted 11 goals in 45 appearances for the national team."], "ranking": [10, 8, 14, 15, 6, 7, 5, 12, 11, 9, 13, 4, 3, 2, 1]}
{"candidates": ["Armenia defeated Latvia 4-1 to take all three points in their quest to win the group."], "ranking": [1]}
{"candidates": ["The match was played at the Republican Stadium Vazgen Sargsyan in Yerevan, Armenia.", "The match will be broadcasted on Disney+.", "The ball possession was Armenia 66%, Latvia 34%."], "ranking": [3, 2, 1]}
{"candidates": ["Armenia will next face North Macedonia in an away match on September 10."], "ranking": [1]}
{"candidates": ["Raphinha scored the opening goal from the penalty spot in the 38th minute.", "Raphinha scored a second penalty goal in the 54th minute.", "Andreas Pereira scored a stunning overhead kick in the 71st minute.", "Luiz Henrique scored an unstoppable finish three minutes after Pereira's goal."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Raphinha scored two penalties for Brazil in the 38th and 54th minutes.", "Pereira scored for Brazil in the 71st minute.", "Henrique scored for Brazil in the 74th minute.", "Vanderson scored for Brazil in the 83rd minute.", "Reyna received a yellow card in the 8th minute.", "Gallese received a yellow card in the 45th minute.", "Castillo received a yellow card in the 48th minute.", "Zambrano received a yellow card in the 55th minute.", "Cartagena received a yellow card in the 68th minute."], "ranking": [1, 3, 4, 2, 8, 7, 6, 5, 9]}
{"candidates": ["Gabriel Martinelli is set to miss Brazil’s World Cup qualifier against Peru due to a calf injury.", "Brazil head coach Dorival Junior named his starting line-up against Peru in his pre-match press conference: Ederson; Vanderson, Marquinhos, Gabriel Magalhaes, Abner; Bruno Guimaraes, Gerson, Rodrygo; Savinho, Raphinha, Igor Jesus.", "Dorival Junior stated, 'The team captain tomorrow will be Marquinhos and I expect a satisfactory performance from the team, improving every moment, the objective at this moment is to seek the result respecting our opponent who is also in a recovery process, trying to find an adjustment, perhaps the same one we are looking for in this phase of the competition.'"], "ranking": [2, 3, 1]}
{"candidates": ["Brazil's manager Dorival Junior was under pressure before the match due to recent poor performances.", "Brazil had a crucial win against Chile just before this match, which helped them stay in the automatic qualifying positions.", "Peru moved off the bottom of the standings with their first win in the previous week.", "Brazil had a run of five straight wins over Peru before this match.", "Brazil coach Dorival Júnior is expected to give more playing time to Botafogo strikers Igor Jesus and Luiz Henrique.", "Júnior could be set to use Flamengo midfielder Gerson as a replacement for the suspended Lucas Paquetá.", "Right back Vanderson is expected to replace Danilo, and midfielder André is expected to take the place of Bruno Guimarães.", "President Luiz Inácio Lula da Silva suggested that more local players should be featured in the national team."], "ranking": [5, 2, 7, 1, 6, 4, 3, 8]}
{"candidates": ["Brazil manager Dorival Junior temporarily silenced his critics with the victory.", "Brazil ended the current cycle of 2026 FIFA World Cup Qualifying matches four points above the final automatic qualification position.", "Peru's best chance of reappearing at the World Cup now looks to be the seventh-place inter-confederation playoff position."], "ranking": [2, 1, 3]}
{"candidates": ["Mabululu converts from penalty spot.", "Stunning Bounedjah strike ruled out for offside.", "Bounedjah gives Algeria deserved lead.", "Angola hold on for a point after coming from behind.", "Baghdad Bounedjah scored for Algeria in the 18th minute.", "Mabululu scored a penalty for Angola in the 68th minute.", "Youcef Atal (Algeria) received a yellow card in the 79th minute.", "Ismaël Bennacer (Algeria) received a yellow card in the 52nd minute.", "Nabil Bentaleb (Algeria) received a yellow card in the 48th minute.", "Ramy Bensebaïni (Algeria) received a yellow card in the 35th minute.", "Núrio Fortuna (Angola) received a yellow card in the 32nd minute.", "Baghdad Bounedjah gave Algeria the lead with a clinical finish after 18 minutes.", "Bounedjah's spectacular overhead kick goal was disallowed for offside after a VAR review.", "Mabululu equalized for Angola in the 65th minute after his penalty hit the bar and he converted the rebound.", "Mabululu's equalizer cancels out Baghdad's early lead.", "Mahrez sent a shot into the visitors' net, but the ball was deflected wide.", "Aït-Nouri took advantage of a good shot, but the goalkeeper was well positioned.", "Mahrez sent a tremendous shot on goal, but the ball went wide.", "Bennacer sent a shot on goal, but the ball was deflected by the defense.", "Fredy sent a lethal shot at goal, but failed to score.", "Goal for Angola! A shot from the penalty spot that Mabululu sends into the back of the net.", "Penalty for Angola! After a foul inside the area, the referee signals the penalty.", "Fredy was encouraged to shoot, but the defense made a good interception.", "Belaïli's powerful shot, but the ball goes wide.", "Goal for Algeria! Bounedjah fired into the net and opened the scoring in brutal fashion.", "Angola held Algeria to a 1-1 draw.", "Baghdad Bounedjah scored the opening goal for Algeria with a lob in the 18th minute.", "Bounedjah's second goal was ruled out for offside in the 25th minute.", "Nabil Bentaleb conceded a penalty in the 65th minute, which Mabululu converted on the rebound to equalize for Angola.", "Algeria vs Angola ended in a 1:1 draw on 15 Jan 2024."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]}
{"candidates": ["Algeria and Angola’s tense AFCON opener ended 1-1 in Bouaké.", "Algeria were leading Angola 1-0 at half time in their AFCON Group D clash in Bouaké."], "ranking": [2, 1]}
{"candidates": ["Algeria are looking to bounce back from their AFCON horror show two years ago when they crashed out in the group-stage, finishing bottom with just one point and one goal to their name.", "It is 12 years since Angola last won an AFCON match, but they come into this match on the back of four consecutive goalless draws, suggesting they are capable of making it a frustrating night for Algeria.", "Pedro Gonçalves, Angola's coach, told the media: 'Let's do what we haven't done before, this is our main objective. We know that if we win twice, we qualify. We will see how far our performance and ability will take us, but I think we can qualify from the group and try to win the knockout stage. If you do that, then you have a chance to go to the final. We'll see.'", "Algeria coach Djamel Belmadi spoke to the media: 'It is a huge pride to represent my country and lead this national team in incredible competitions like the AFCON and, at the same time, it is a huge responsibility because we are a football country and we have a population that loves football and especially the national team and we gave our people a lot of joy when we won the AFCON in 2019. We were disappointed with the last one because there were many expectations and we could not satisfy them, we could not satisfy ourselves first and we could not satisfy them, that's why we feel like we have to give something back at this AFCON.'", " 'I know that there are many big teams; Since we were eliminated in the first round in Cameroon, we cannot say that we are favorites for this competition, no. We were not in the last World Cup, which was our main objective since 2019. We put a lot of energy into qualifying for 'This World Cup, in fact, was our first objective.'", "'So we can't say that we are favorites, we can't say that we are going to win, but we can say that we have prepared ourselves to give our best and to perform in this competition and go as far as possible.'"], "ranking": [2, 5, 4, 1, 6, 3]}
{"candidates": ["Algeria and Angola begin their TotalEnergies CAF Africa Cup of Nations Côte d'Ivoire 2023 on Monday, with so much expected from both sides.", "It’s redemption time for the Fennec Foxes, who are eager to impress after a shambolic 2021 run in Cameroon.", "Captain Riyad Mahrez and his colleagues aim to make amends by going past stiff opposition in Angola before handling the other two in the group - Burkina Faso and Mauritania.", "Algerians will look for inspiration from Milan's Ismael Bennacer, who has become an important part of the squad after sustaining a knee injury.", "Islam Slimani, playing in his sixth TotalEnergies CAF AFCON, Said Benrahma (West Ham), and Houssem Aouar (Roma) are among the key talents for Algeria.", "Djamel Belmadi has a lot of quality to tap from in the Algerian squad.", "Pedro Goncalves, the Angolan coach, has the task of navigating past the North African opposition.", "Angola is making their ninth AFCON appearance and their first since 2019.", "Breezing past the group stage is an important morale booster for the Palancas Negras, who are in Côte d’Ivoire without M’bala Nzola (Fiorentina).", "Jérémie Bela of Ligue 1 side Clermont is a key player for Angola.", "Angola reached the quarter-finals in 2008 and 2010 (which they hosted) and hope to do better in Group D.", "Angola's recent attribute of not being heavy scorers yet not conceding is a potential negotiating tool for opponents.", "Pre-tournament predictions favor Algeria, but Monday’s game could go either way.", "Head-to-Head: Algeria has recorded two wins (1985 and 2001), while Angola has recorded just one win over Algeria (2006 World Cup Qualifiers).", "Six of their encounters have been drawn games, the last one being the 0:0 game in the group stage of the 2010 TotalEnergies CAF AFCON.", "In the last match of the day at AFCON, Group D favourites Algeria kicked off their campaign with a tricky match against Angola."], "ranking": [14, 12, 6, 10, 8, 11, 9, 15, 7, 13, 5, 4, 3, 2, 1, 16]}
{"candidates": ["More frustration at AFCON for Algeria, following on from their results two years ago.", "Angola had to come from behind to get a result, really impressive from them. They'll be believing they can reach the knockout stages.", "Algeria endured more Africa Cup of Nations frustration as they were held to a 1-1 draw by Angola.", "The Algerians are looking to avoid a similar fate to 2022 when they entered as defending champions but crashed out in the group stages after failing to win a game.", "Riyad Mahrez had a quiet evening and was heavily marked by the Angolan defense.", "The Angolan team did a fantastic job in keeping the superior Algerians at bay."], "ranking": [3, 2, 1, 5, 6, 4]}
{"candidates": ["The match ended in a 1-1 draw.", "Attendance for the match was 19,740.", "Riyad Mahrez proved a constant threat at set-plays during a late spell of pressure.", "Angola went into the match on the back of four consecutive goalless draws.", "These teams have met 9 times, six of which have ended in a draw, two wins for Algeria and one for Angola, so both teams will be looking for a victory.", "This will be the first match of group D, which also includes Burkina Faso and Mauritania, both Algeria and Angola will go all out to win.", "Algeria dominated proceedings from the start.", "Angola, ranked 117th, managed to secure a draw against the 30th-ranked Algeria."], "ranking": [5, 8, 3, 6, 2, 4, 1, 7]}
{"candidates": ["Denis Undav's brace helped Germany extend its unbeaten record in the Nations League to three matches after a convincing 2-1 win at Bosnia-Herzegovina.", "Džeko scored from a corner in the 70th minute.", "Deniz Undav scored two goals, one in the 29th minute and another in the 35th minute.", "Three goals were ruled out due to offside.", "Deniz Undav scored a brace to secure Germany's 2-1 victory over Bosnia and Herzegovina.", "Edin Dzeko pulled one back for Bosnia and Herzegovina, setting up a nervy finish.", "Undav's potential hat-trick was denied by VAR for offside.", "Ermedin Demirovic hit the bar for Bosnia and Herzegovina.", "Florian Wirtz assisted Undav's first goal with a well-timed pass.", "Maximilian Mittelstadt provided the assist for Undav's second goal.", "Serge Gnabry's goal was also ruled out for offside.", "Benjamin Tahirovic assisted Dzeko's goal with a corner kick.", "Deniz Undav scored two first-half goals in six minutes to guide Germany to a 2-1 victory over Bosnia and Herzegovina.", "Edin Dzeko scored for Bosnia and Herzegovina in the 70th minute.", "Joshua Kimmich received a yellow card in the 90+5 minute.", "Deniz Undav scored twice in the first half to give Germany a 2-0 lead.", "Edin Dzeko scored in the 70th minute to reduce the deficit for Bosnia-Herzegovina.", "A member of the Bosnia-Herzegovina coaching team was sent off as tempers rose.", "Germany's Deniz Undav had a hat-trick goal disallowed in the second half.", "Denis Undav scored twice for Germany.", "Germany extended their unbeaten record in the Nations League to three matches with a 2-1 win at Bosnia-Herzegovina.", "Edin Dzeko scored for Bosnia-Herzegovina in the 70th minute.", "Florian Wirtz provided an assist for the first goal.", "Maximilian Mittelstädt provided an assist for the second goal."], "ranking": [1, 14, 3, 20, 2, 10, 18, 16, 7, 8, 19, 11, 15, 12, 13, 6, 17, 4, 5, 9, 21, 22, 23, 24]}
{"candidates": ["Germany defeated Bosnia and Herzegovina 2-1 on October 11, 2024.", "Denis Undav scored two goals for Germany in the 30th and 36th minutes.", "Edin Dzeko scored for Bosnia and Herzegovina in the 70th minute.", "Joshua Kimmich received a red card in the 90+5th minute."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Julian Nagelsmann is dealing with many injuries but expectations are high for Germany.", "Alexander Nübel is set to start as the goalkeeper for Germany against Bosnia and Herzegovina, with Oliver Baumann expected to play against the Netherlands.", "With ter Stegen expected to be out for almost a year, Nübel and Baumann have a chance to make a case for the German #1 keeper spot.", "Germany were favorites to win despite their previous poor away record in the Nations League.", "Germany had won just four of their previous 13 matches outside of Germany.", "Germany lamented the absences of Jamal Musiala and Kai Havertz before the match.", "Germany's coach Julian Nagelsmann acknowledged Bosnia and Herzegovina's strong defense."], "ranking": [5, 3, 2, 6, 7, 4, 1]}
{"candidates": ["Germany manager Julian Nagelsmann is likely to hand full debuts to at least two players in Friday's UEFA Nations League clash with Bosnia-Herzegovina in Zenica.", "Germany have already lost five players to injury this month, including Arsenal's Kai Havertz and Bayern Munich's Jamal Musiala.", "Benjamin Henrichs, David Raum, and Robin Koch have also withdrawn from the October squad.", "Other key names such as Niclas Fullkrug and Marc-Andre ter Stegen are absent from the ranks this month.", "With neither Ter Stegen nor the retired Manuel Neuer available, 34-year-old Oliver Baumann is expected to make his senior debut in goal.", "Antonio Rudiger, Joshua Kimmich, Jonathan Tah, and Maximilian Mittelstadt are fit and firing.", "Robert Andrich and Pascal Gross could form the two-man midfield pairing.", "Florian Wirtz will no doubt occupy one of the advanced positions, and Serge Gnabry could hold off the threat of Kevin Schade to start on the left.", "Deniz Undav is Germany's chief attacking threat, and the one-time Brighton & Hove Albion man may be joined by the uncapped Jonathan Burkardt, who boasts five goals from his first six Bundesliga appearances of the season for Mainz 05.", "Germany aimed to secure a spot in the quarter-finals of the UEFA Nations League.", "Germany had taken four points from their first six in League A Group 3, while Bosnia and Herzegovina were still searching for their first victory.", "Germany's coach Julian Nagelsmann was managing a squad with several key players out due to injuries or retirement.", "Bosnia and Herzegovina's coach Sergej Barbarez was dealing with a team struggling to avoid relegation.", "Germany, leading their UEFA Nations League group, aim to edge closer to the quarter-finals when they face Bosnia-Herzegovina at the Bilino Polje Stadium in Zenica on Friday.", "Germany have averaged 3.5 goals per game in the Nations League so far, creating an average of six big chances per match.", "Bosnia-Herzegovina have conceded an average of 2.5 goals per game in the Nations League, including a 5-2 hammering by the Netherlands.", "Germany have scored at least twice in six of their last eight matches.", "Germany, led by Julian Nagelsmann, are sitting comfortably at the top of League A Group 3, having bagged four points from their opening two games.", "Germany demolished Hungary 5-0 and followed it up with a 2-2 draw against the Netherlands.", "Bosnia are languishing in third, having only one point to their name.", "The big question heading into this encounter is whether Bosnia can capitalise on Germany’s somewhat weakened line-up, given the absence of key players like Kai Havertz, Jamal Musiala, and Leroy Sané."], "ranking": [14, 20, 19, 18, 17, 16, 15, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 21]}
{"candidates": ["Following the retirements of Manuel Neuer and Toni Kroos, coach Julian Nagelsmann's team has started a new cycle and their spirited, clean and fluid display bodes well for the future.", "Germany made the second half needlessly complicated by allowing Džeko to score from a corner, but otherwise it was a comfortable performance.", "Deniz Undav is looking like the striker that Germany have been begging for.", "Julian Nagelsmann's side strengthened their position at the top of Group A3.", "Germany maintained their unbeaten start to the Nations League season.", "Deniz Undav built on his momentum from scoring against the Netherlands in the previous match.", "Germany moved onto seven points from three games in League A Group 3.", "Bosnia-Herzegovina dropped to fourth place after equalling their longest-ever winless run of nine straight matches.", "Julian Nagelsmann commented on the numerous chances Germany had and the defensive lapse that allowed Bosnia to score."], "ranking": [3, 6, 2, 8, 5, 4, 9, 1, 7]}
{"candidates": ["Germany's victory moved them closer to the quarter-finals of the UEFA Nations League.", "Bosnia and Herzegovina continued to struggle in the tournament, remaining winless."], "ranking": [1, 2]}
{"candidates": ["The match took place at Bilino Polje Stadium, Zenica, Bosnia and Herzegovina.", "The kickoff was at 8:45 pm local time, 2:45 am EST.", "Germany now have a two-point cushion at the top of Group A3.", "Germany had to ensure their concentration levels did not wane after Dzeko’s header.", "Germany maintained top spot in their Nations League group with this victory.", "The match was held at Bilino Polje in Zenica, Bosnia and Herzegovina with an attendance of 11,000.", "Germany had 73% possession compared to Bosnia-Herzegovina's 27%.", "Germany had 12 shots with 4 on target, while Bosnia-Herzegovina had 8 shots with 1 on target.", "Germany will host the Netherlands at the Allianz Arena on October 14.", "Bosnia-Herzegovina will play against Hungary in Zenica on October 14.", "Germany tops their group after also thrashing Hungary 5-0 and drawing 2-2 with the Netherlands.", "Germany played with confidence and developed complex attacking moves despite the absence of several stalwarts."], "ranking": [12, 11, 8, 9, 7, 10, 5, 4, 6, 3, 2, 1]}
{"candidates": ["Germany's away performance had been historically weak in the Nations League, with only one win in nine matches before this game.", "Bosnia and Herzegovina had a three-game winning streak at home in the Nations League before this match."], "ranking": [1, 2]}
{"candidates": ["Northern Ireland had 12 attempts at goal in the first half, forcing Fedor Lapoukhov into seven saves.", "Eoin Toal’s header came back off the post.", "Northern Ireland had two goals ruled out in the first half.", "Northern Ireland had two goals ruled out and hit the post in the first half.", "Conor Bradley created a string of opportunities for his team-mates.", "Belarus made it seven clean sheets in their last nine competitive games.", "19-year-old goalkeeper Pierce Charles enjoyed a quiet night on his debut.", "Bradley had the ball in the net in the ninth minute, but was offside.", "Eoin Toal hit the post in the 39th minute.", "Belarus were denied a penalty in the 66th minute.", "Northern Ireland had a frustrating goalless draw against Belarus in Hungary.", "Michael O’Neill’s side had the bulk of the chances in the UEFA Nations League encounter but could not find the net.", "Northern Ireland had 61% possession in the game, had 15 attempts on goal compared to Belarus’ seven.", "Senior men’s team manager Michael O’Neill gave a senior debut to goalkeeper Pierce Charles from the start.", "Conor Bradley, donning the captain’s armband for the first time, fired home from close range on 10 minutes, however he was adjudged to have been offside.", "Belarus keeper Fedor Lapoukhov produced an excellent stop from a powerful Jamie Reid header.", "Paddy McNair put a header wide before Isaac Price ran from deep and let fly, however the keeper comfortably stopped his low drive.", "Jamie Reid broke the offside trap but his low shot lacked power and was comfortably pushed away by Lapoukhov.", "Bradley then ran from deep and fed Callum Marshall. His first-time shot was palmed away by the Belarusian keeper.", "Jamal Lewis fired the loose ball goalwards and his blaster was pushed over the top by Lapoukhov.", "George Saville played a lovely ball to Reid but the keeper was equal to his shot, while the keeper also saved a follow-up header from the striker.", "On 39 minutes Shea Charles delivered a free-kick into the danger zone. Eoin Toal rose highest and was unlucky to see his header come back off the post.", "Just after half-time Belarus attacker Antilevski launched a free-kick over the bar.", "Northern Ireland striker Reid twisted and turned his marker inside the area but his low drive was blocked.", "Saville fired well over as Northern Ireland pushed forward.", "Price broke forward and cleverly left the ball for Bradley just outside the area but his low shot drifted off target.", "In the 76th minute striker Lee Bonis made his debut for Northern Ireland, replacing Reid.", "Hume fired a cross towards Bonis inside the area minutes later but the Belarus keeper plucked the ball out of the air.", "The game petered out after that with the two sides cancelling each other out.", "Belarus stood firm against Northern Ireland to stay unbeaten in Group C3."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]}
{"candidates": ["Belarus is scheduled to welcome Northern Ireland to ZTE Arena on 10/12/2024 in a UEFA Nations League C match.", "The prediction for the Belarus vs Northern Ireland match is Draw.", "Belarus vs Northern Ireland Prediction 2: Under 2.5 total Goals.", "Belarus vs Northern Ireland Possible Lineups: Belarus: Fedor Lapoukhov, Zakhar Volkov, Sergey Politevich, Pavel Zabelin, Yuri Kovalev, Evgeni Yablonski, Afrid Max Ebong Ngome, Kirill Pechenin, Dmitri Antilevski, Nikita Korzun, Evgeniy Shikavka. Northern Ireland: Pierce Charles, Trai Hume, Paddy McNair, Eoin Toal, Conor Bradley, Isaac Price, Shea Charles, George Saville, Jamal Lewis, Jamie Reid, Callum Marshall."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Michael O’Neill expressed frustration with the result but praised the performance, highlighting the team's dominance in the first half and the creation of excellent chances.", "O’Neill noted the learning curve for the team in not taking their chances and acknowledged the different feel of the second half as Belarus tightened up.", "O’Neill mentioned the heavy pitch and the lack of match fitness for some senior players as factors affecting the game.", "O’Neill emphasized the positive aspect of not being beaten and looked forward to the next home game against Bulgaria.", "It’s as you were in the group after Bulgaria drew 0-0 with Luxembourg at home earlier today. Bulgaria and Belarus are joint top on five points from three games, with Northern Ireland third on four points. Luxembourg have a single point to date.", "Next up for Northern Ireland is a UNL C3 game against the Bulgarians at the National Football Stadium at Windsor Park on Tuesday (7.45pm)."], "ranking": [2, 4, 5, 1, 3, 6]}
{"candidates": ["The match was played in a neutral venue in Zalaegerszeg, Hungary, and was behind closed doors.", "This was considered one of Northern Ireland’s most awkward away fixtures in the Nations League campaign.", "The match was played behind closed doors due to UEFA restrictions after Russia’s invasion of Ukraine.", "Pierce Charles and Shea Charles became the 23rd set of brothers to play for Northern Ireland or Ireland."], "ranking": [3, 2, 1, 4]}
{"candidates": ["The match will be held behind closed doors at ZTE Arena in Zalaegerszeg, Hungary, due to UEFA restrictions."], "ranking": [1]}
{"candidates": ["Leo Messi now holds the record for the most appearances in Copa America history.", "Lionel Messi set a Copa América record by playing in his 35th match, surpassing Chile's Sergio Livingstone.", "Messi extended his own record with his 18th assist in Copa América."], "ranking": [2, 1, 3]}
{"candidates": ["Canada playing some inspired defense.", "Canada with some good chances. Playing good counter attack football.", "The keeper gambled a little too much but honestly had no choice...horrible center back play.", "A seemingly broken play leads to a goal."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Neither manager offered many surprises with their starting XI.", "Canada played the same side that drew 0-0 with France in a friendly.", "Argentina played arguably their strongest possible side, with Lionel Messi and Ángel Di María flanking Julián Álvarez up front.", "Leo Messi and Co. were heading into their Copa America opener behind four consecutive wins in international friendlies.", "Canada's Alphonso Davies led the starting lineup as captain.", "Argentina fans made their presence felt outside Mercedes-Benz Stadium in Atlanta, sporting jerseys with Messi's name and number."], "ranking": [6, 5, 2, 1, 4, 3]}
{"candidates": ["The 2024 Copa América will be the 48th edition of the Copa America, which is the international men's soccer championship organized by South America's football ruling body CONMEBOL.", "The tournament will be held in the US and is co-organized by CONCACAF.", "The US will host the tournament for the second time, and it will be held from June 20, 2024 to July 14, 2024.", "The winner will later compete in the 2025 UEFA Cup of Champions against the UEFA Euro 2024 winner.", "The futbol kicks off tomorrow with the defending champion Argentina taking on Canada at the Mercedes Benz Stadium - Atlanta, GA.", "Argentina face Canada in a Copa America game on Thursday, June 20, 2024, at Mercedes-Benz Stadium in Atlanta, Georgia.", "Argentina will play as the favorite to defend its Copa America title.", "The tournament could mark the 36-year-old Messi’s final act with the national team.", "Jesse Marsch took over as team manager for Canada in mid-May after spending a year at the helm of Leeds United.", "Canada Soccer is hoping Marsch can do better against tough competition in Copa America, including facing off against reigning world champion Argentina.", "The inauguration of the Copa América will take place on June 20, 2024 at Mercedes-Benz Stadium in Atlanta, Georgia.", "Colombian singer Shakira will perform a version of her song Puntería for the Copa, and there are rumors that she will make a special presentation before the first match of the tournament, which will be played between reigning champion Argentina and Canada.", "Canada will enjoy playing in the tournament’s opening match against Argentina on June 20 at Mercedes-Benz Stadium in Atlanta.", "Canada announced its new head coach: former Leeds and RB Leipzig manager Jesse Marsch.", "Canada’s star, Bayern Munich’s Alphonso Davies, has won all three matches he has played against Lionel Messi.", "With the help of his attacking colleagues, Mallorca’s Cyle Larin and Lille’s Jonathan David, Davies will attempt to extend his winning streak against Messi to 4 out of 4.", "Another player to watch is Inter’s Tajon Buchanan, who could be Jesse Marsch’s hidden ace despite getting a few minutes in the Italian league."], "ranking": [15, 14, 13, 12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 16, 17]}
{"candidates": ["Alphonso Davies expressed disappointment with the result in his post-match interview.", "Canada's performance caused genuine frustration for the reigning world champions.", "The next step for Canada will be turning strong performances and moral victories into actual results.", "Canada needs at least a point against Peru next week to stand a chance of advancing from Group A.", "Argentina secured a 2-0 win over Canada to gain three points and top position in Group A.", "Messi struggled to find the back of the net all evening.", "Canada coach Jesse Marsch commented on Messi's performance, stating that despite their efforts, Messi's plays were world-class.", "Canada captain Alphonso Davies expressed disappointment with his team's performance, especially in the second half.", "Messi expressed satisfaction with the 'important' win over Canada."], "ranking": [8, 6, 5, 4, 3, 2, 9, 7, 1]}
{"candidates": ["Canada won 56 per cent of the duels in the first half, winning 73 per cent of their attempted tackles.", "Canada had 13 clearances in the first half, ending the first 45 minutes level at seven shots apiece.", "Argentina had to adjust tactically with about 20 minutes left to hold onto their lead.", "Maxime Crépeau made five saves and a number of perfectly-timed challenges to cause missed shots.", "Sergio Aguero presented the Copa America trophy before the match.", "The match took place at Mercedes-Benz Stadium in Atlanta.", "Grass was installed at Mercedes-Benz Stadium after a MLS game on the usual artificial turf.", "Argentina started eight players who began the 2022 World Cup final victory over France.", "The match was held at Mercedes-Benz Stadium in Atlanta, Georgia, USA, with an attendance of 70,564."], "ranking": [3, 5, 2, 1, 8, 9, 6, 4, 7]}
{"candidates": ["Lionel Messi became the second highest all-time international men’s goalscorer, eclipsing Ali Daei with 109 goals.", "Lionel Messi scored his 109th international goal and first of the tournament.", "Messi has 28 goals in his past 25 matches for Argentina and 14 in Copa America play, three shy of the record.", "Lionel Messi scored his 109th international goal, moving closer to the record for most goals in Copa America history, with 14 goals, three shy of the record.", "Lionel Messi scored his 14th goal in the Copa América tournament overall."], "ranking": [1, 5, 3, 2, 4]}
{"candidates": ["Canada advanced to the semi-final against Argentina by beating Venezuela 4-3 on penalty kicks after a 1-1 draw in the quarter-finals on July 5.", "Both Canada and Argentina come into Tuesday’s contest off the back of quarter-final victories on penalty kicks.", "Argentina were forced to the spot after Ecuador’s Kevin Rodríguez scored a stoppage-time equalizer in a 1-1 draw.", "Lionel Messi hit the bar on a Panenka with Argentina’s first penalty, but they were perfect thereafter while goalkeeper Emi Martínez continued his dominance in shootouts saving two of Ecuador’s efforts.", "Canada were also tied 1-1 after 90 minutes against Venezuela in their quarter-final, and after five rounds of penalty kicks. But in sudden death pens, Max Crépeau continued his tournament heroics with a save on Wilker Ángel before Ismaël Koné stepped up and won the match for Canada with a coolly taken penalty kick."], "ranking": [5, 2, 3, 4, 1]}
{"candidates": ["Jesse Marsch chose to put Ismaël Koné back into midfield after his strong play in the quarter-final against Venezuela.", "Argentina's coach Lionel Scaloni made changes to the team, including Gonzalo Montiel at right-back, Ángel Di María on the wing, and Julian Álvarez starting up top ahead of Lautaro Martínez."], "ranking": [2, 1]}
{"candidates": ["Argentina will face the winner of Uruguay vs. Colombia in the final on July 14, 2024.", "Canada will play in the third-place game against the loser of Uruguay vs. Colombia on July 13, 2024.", "The crowd of 80,102 on a night with an 82 degree temperature and 82% humidity was overwhelmingly pro-Argentina.", "MetLife's temporary grass surface appeared heavy, with water splashing and sand popping up during dribbles.", "Argentina extended its unbeaten streak to 10 games.", "Argentina fans gathered in Times Square on the eve of the match and filled the streets of Manhattan before heading to MetLife Stadium.", "The match was held at MetLife Stadium in New Jersey.", "Attendance for the match was 80,102.", "The match was played on a temporary grass surface at MetLife Stadium, which appeared heavy and affected play.", "The crowd of 80,102 was overwhelmingly pro-Argentina, with only a few sections of Canadian supporters.", "Argentina extended its unbeaten streak to 10 games with this victory.", "The temperature during the match was 82 degrees with 82% humidity.", "Argentina's goalkeeper Emiliano Martínez resorted to time-wasting tactics late in the match.", "Canada's Tani Oluwaseyi had two close chances to score but was denied by Emiliano Martínez.", "MetLife Stadium’s temporary grass surface appeared heavy, with water splashing and sand popping up during dribbles.", "Canadian rapper Drake placed a $300,000 bet on Canada to win, which would have returned $2.88 million if successful.", "The match was played in front of more than 80,000 fans at a hot and humid MetLife Stadium.", "The game was played on a strangely sandy and uneven surface.", "Argentina will take on Uruguay or Colombia in the final at the Miami Dolphins’ Hard Rock Stadium."], "ranking": [16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 18, 17, 19]}
{"candidates": ["The 2024 Copa América final is the next day at Hard Rock Stadium in Miami, Florida on Sunday, July 14.", "If Canada want to reach the final match, they will need to be far more clinical than they have been so far under Marsch.", "Since winning the 2022 FIFA World Cup in Qatar, Argentina have kept 14 clean sheets in 18 matches.", "Canada’s rise at this competition has been perhaps best personified by that of Jacob Shaffelburg.", "Shaffelburg was a real headache for Argentina in his half-hour cameo off the bench in the tournament opener, despite playing his off-wing.", "Projected lineups for Argentina: E. Martínez; Tagliafico, Li. Martínez, Romero, Molina; Di Maria, De Paul, Mac Allister, González; Messi, La. Martínez.", "Projected lineups for Canada: Crépeau; Johnston, Bombito, Cornelius, Davies; Shaffelburg, Eustáquio, Koné, Laryea; David, Larin.", "All-time series: Argentina wins: 2  Canada wins: 0  Draws: 0.", "Match officials: Referee: Piero Maza (CHI), ARs: Claudio Urrutia (CHI), Jose Retamal (CHI), 4th Official: Christian Garay (CHI), VAR: Juan Lara (CHI)."], "ranking": [8, 6, 3, 5, 2, 9, 9, 7, 1]}
{"candidates": ["Despite the loss, the 48th-ranked Canadians did not disappoint before a lively crowd of 80,102.", "Canada was looking to reach their first tournament final since the 2000 Gold Cup.", "Canada, the last survivor of the six CONCACAF guest teams, is making its Copa debut."], "ranking": [2, 3, 1]}
{"candidates": ["Mohamed Salah and Mohamed Elneny reached 100 caps for Egypt."], "ranking": [1]}
{"candidates": ["Trezeguet scored a first-half brace for Egypt.", "Mohamed Salah scored the third goal for Egypt in the 56th minute.", "Fathi scored the fourth goal for Egypt at the end of the game.", "M. Trezeguet scored two goals for Egypt at the 6th and 30th minutes.", "M. Salah scored a goal for Egypt at the 57th minute.", "M. Fathi scored a goal for Egypt at the 90+5th minute.", "Trezeguet scored the opening goal in the 4th minute after following up Salah's shot rebound.", "Trezeguet scored a second goal in the 29th minute with a brilliant through pass from Rami Rabia.", "Mohamed Salah scored in the 56th minute after a howler from the Botswanan keeper.", "Mostafa Fathi scored the fourth goal for Egypt in the final seconds after a solo run and cross by Ibrahim Adel."], "ranking": [7, 5, 3, 6, 4, 2, 10, 9, 8, 1]}
{"candidates": ["Trezeguet scored in the 5th and 29th minutes for Egypt.", "Mohamed Salah scored in the 56th minute for Egypt.", "Fathi scored in the 90+4th minute for Egypt.", "Majafi scored in the 50th minute for Botswana.", "Mangolo scored in the 77th minute for Botswana."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["The Egyptian national football team, under the leadership of Hossam Hassan, is set to face Botswana in a pivotal second-round match of the 2025 Africa Cup of Nations (AFCON) qualifiers.", "Hossam Hassan has worked closely with his players to prepare for this encounter, urging them to focus on scoring an early goal and maintaining balance between attack and defense.", "Hassan’s tactical plan will focus on quick transitions and utilizing the speed of Egypt’s star players, particularly on the wings.", "Injuries have forced Hassan to make adjustments to his lineup. Key players like Imam Ashour, Omar Marmoush, and Mostafa Mohamed are unavailable due to injury, and experienced defender Ahmed Hegazy will miss the match due to personal reasons.", "Despite these setbacks, Hassan has opted to retain Hamdi Fathi and Rami Rabia in central defense, while relying on Mohamed Elneny, Marawan Attia, and Zizo to control the midfield.", "The attack will feature a formidable trio of Mohamed Salah, Trezeguet, and Osama Faisal.", "Salah, Egypt’s captain and key player, will lead the offensive charge, with his pace and finishing ability expected to be crucial in breaking down Botswana’s defense.", "Trezeguet’s creativity and Osama Faisal’s presence as a central striker will complement Salah’s efforts, providing Egypt with a balanced and potent attack.", "The starting lineup is expected to feature Mohamed El-Shennawy in goal, with Mohamed Hani, Hamdi Fathi, Rami Rabia, and Mohamed Hamdi forming the defensive line.", "The midfield trio of Attia, Elneny, and Zizo will provide both defensive cover and attacking support, while Salah, Trezeguet, and Faisal will be tasked with leading the attack.", "Botswana and Egypt square off in Group C of the 2025 Africa Cup of Nations qualifiers on Tuesday.", "Botswana head into the game off the back of a 1-0 defeat against Mauritania.", "Egypt head into the game off the back of a 3-0 victory over Cape Verde.", "Egypt hold a clear upper hand in the history of this fixture, having picked up four wins and one draw in the previous five encounters between the two nations.", "The Pharaohs are unbeaten in 12 of their last 13 competitive matches, claiming eight wins and four draws since June 2022.", "Botswana have failed to win eight of their nine games across all competitions in 2024, losing three and picking up five draws since the turn of the year.", "Egypt have lost just one of their last nine competitive away matches while picking up three wins and five draws since June 2022.", "Prediction: Botswana 0-2 Egypt", "Betting Tip 1: Result - Egypt to win", "Betting Tip 2: Over 2.5 goals - No (There have been fewer than three goals scored in eight of Botswana’s last 10 games)", "Betting Tip 3: Over 4.5 cards - No (There have also been fewer than five bookings in eight of Botswana’s last nine matches)", "Egypt had to change their lineup heavily due to injuries and absences of key players like Omar Marmoush, Mostafa Mohamed, Ahmed Hegazi, Emam Ashour, and Mohamed Abdelmonem.", "Osama Faisal and Khaled Sobhi were brought into the starting XI to fill in the gaps."], "ranking": [1, 5, 4, 3, 6, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]}
{"candidates": ["Egypt now tops the group with six points from two games, having scored seven goals and conceded none.", "Egypt will continue their campaign in October 2024 with home and away games against Mauritania."], "ranking": [1, 2]}
{"candidates": ["Botswana arrived just hours before the game, affecting their preparation.", "The hosts had two chances to score in the second half but both efforts went wide."], "ranking": [1, 2]}
{"candidates": ["Belarus and Bulgaria get their 2024 UEFA Nations League campaign underway when they square off at the ZTE Arena on Thursday.", "Ilian Iliev’s men have won the last two meetings between the two nations and will look to extend this impressive run.", "Belarus were denied their first win in 2024 as they suffered a 4-0 defeat against Israel when the two nations met in a friendly matchup at the Ferenc Szusza Stadium on June 11.", "Carlos Alos-Ferrer’s side have now gone four consecutive games without a win, losing three and claiming one draw while conceding 10 goals and failing to find the back of the net since beating Kosovo 1-0 in the European Championship qualifiers back in November 2023.", "Belarus, who are currently 99th in the latest FIFA World Rankings, get their Nations League campaign underway, where they will battle Bulgaria, Luxembourg, and Northern Ireland in Group 3 of League C.", "Bulgaria were involved in a share of the spoils for the third consecutive game as they played out a 1-1 draw with Slovenia in a friendly on June 8.", "Iliev’s men have now gone six straight matches without defeat across all competitions, picking up one win and five draws since a 2-0 friendly defeat against Albania in October 2024.", "Bulgaria head into Thursday’s clash without a win in their last eight competitive games and will be looking to end this poor run.", "Belarus take on Bulgaria at ZTE Arena in the first round of the group phase of the UEFA Nations League.", "Belarus are ranked 99th in the FIFA world ranking, while Bulgaria is ranked 82nd.", "Belarus scored 11 goals in their previous ten matches, averaging 1.1 goals per game, and conceded 12 goals, averaging 1.2 goals per game.", "Bulgaria scored 14 goals in their past ten games, averaging 1.4 goals per game, and conceded 12 goals, averaging 1.2 goals per game.", "Belarus managed two wins in their past six internationals, drew one, and lost three, scoring two goals and conceding ten.", "Bulgaria managed one win in their past six internationals, drew five, and lost zero, scoring six goals and conceding seven.", "Both teams are focused on not losing and might prefer a draw over risking a loss."], "ranking": [12, 3, 9, 5, 11, 8, 2, 6, 15, 14, 10, 4, 7, 1, 13]}
{"candidates": ["Belarus and Bulgaria will square off at the neutral ZTE Arena in Hungary, opening their respective 2024-25 UEFA Nations League campaigns.", "Both nations aim to make a strong start in League C Group 3, where they will battle with Northern Ireland and Luxembourg.", "Belarus have conceded an average of 1.4 goals per game in their last 10 international matches.", "Bulgaria have drawn five of their last six games but failed to keep a clean sheet in any of them.", "Max Ebong is Belarus’s top scorer in their squad with five international goals, while Bulgaria’s Kiril Despodov leads with 14 goals.", "Belarus have failed to keep a clean sheet in their last four international fixtures, shipping four goals in two of those matches.", "Bulgaria’s record of conceding 14 goals in eight Euro 2024 qualification matches speaks volumes.", "Ilian Iliev’s side also failed to keep a clean sheet in their last six matches.", "Belarus average 0.9 goals per game from their last 10 matches, with Bulgaria matching that statistic.", "Bulgaria’s average of 10.5 shots per game indicates they will pressure Belarus’s defence throughout the match.", "Belarus and Bulgaria begin their 2024-25 UEFA Nations League campaign with a fixture at ZTE Arena - a neutral venue in Hungary - on Thursday night.", "The two nations will have aspirations of gaining promotion from League C Group 3 along with Northern Ireland and Luxembourg.", "Belarus have never competed at either a World Cup or European Championship and they failed to qualify for Euro 2024 despite collecting a respectable 12 points from 10 group matches, finishing fourth and just three points behind the playoff position.", "Carlos Alos has been in charge of the White Wings since December 2023 and has a record of two wins, four draws and four defeats from 10 games, with his team failing to win or score in four matches so far in 2024.", "Ranked 99th in the world by FIFA, Belarus will be keen to avoid a repeat of the last international break in June when they suffered back-to-back 4-0 defeats in friendlies against Russia and Israel.", "Belarus will also endeavour to vastly improve on their performance in the previous Nations League campaign in which they failed to win any of their six matches in League C Group 3 and finished rock bottom behind Kazakhstan, Azerbaijan and Slovakia.", "The White Wings can be optimistic of success on Thursday as they have beaten Bulgaria in their last two meetings, although their last encounter was in February 2020 when they secured a narrow 1-0 friendly win away from home.", "Like Belarus, Bulgaria failed to qualify for Euro 2024 after enduring a miserable campaign in which they failed to win any of their eight group matches, conceding 14 goals in the process.", "Mladen Krstajic was relieved of his duties in October 2023 following a nine-game winless streak across all competitions, including four defeats in a row, and current boss Ilian Iliev has since steadied the ship with one win and five draws in his first six matches over the past 10 months.", "Bulgaria's solitary victory during this run was a slender 1-0 friendly success over Tanzania, while they have shared the spoils in draws with Hungary, Serbia, Azerbaijan, Romania and Slovenia, drawing with the latter two in June.", "Ranked 82nd in the world by FIFA, Bulgaria finished second in League C Group 4 of the 2022-23 Nations League, winning two and drawing three of their six matches and finishing seven points behind group winners Georgia.", "The Lions now head into Thursday's opening fixture of the new Nations League seeking to claim their first win over Belarus since November 2016 when they came out on top by a 1-0 scoreline on home soil in 2018 World Cup qualifying."], "ranking": [14, 18, 10, 12, 16, 8, 5, 7, 11, 9, 1, 2, 20, 15, 6, 4, 17, 13, 19, 3, 21, 22]}
{"candidates": ["With five wins from the last eight meetings between the sides, Bulgaria boast a superior record in the history of this fixture, compared to Belarus’ five victories.", "Bulgaria have won just one of their last 15 matches across all competitions while losing six and claiming eight draws since November 2022.", "Belarus are unbeaten in their last four competitive matches, picking up two wins and two draws since a 1-0 loss against Israel in September 2023.", "Bulgaria have failed to win their last eight competitive matches, losing four and claiming four draws since a 1-0 victory over North Macedonia in the Nations League back in September 2022.", "In 10 of the last 12 Belarus matches in the UEFA Nations League C, the sum of goals was under 3.5.", "Belarus have lost 3 of the last 4 matches without scoring a goal.", "Belarus have not won the last 7 matches in a row in the UEFA Nations League C.", "In 7 of the last 9 Belarus matches in the UEFA Nations League C, the sum of goals was under 2.5.", "Belarus have lost 3 of the last 4 matches while scoring less than 0.5 goals.", "In 15 of the last 17 Bulgaria matches, the sum of goals was under 3.5.", "Bulgaria have not won 14 of the last 15 matches.", "In 10 of the last 12 Bulgaria matches in the UEFA Nations League C, the sum of goals was under 3.5.", "Bulgaria have not lost 10 of the last 12 matches in the UEFA Nations League C.", "Bulgaria have conceded in 12 of the last 14 matches."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]}
{"candidates": ["Prediction: Belarus 1-2 Bulgaria", "Tip 1: Result - Bulgaria to win", "Tip 2: Over 4.5 cards - No (There have been fewer than five bookings in five of the last seven meetings between the two nations)", "Tip 3: Over 10.5 corners - No (There have been fewer than 11 corner kicks in Belarus’ last six outings)"], "ranking": [4, 3, 2, 1]}
{"candidates": ["Lionel Messi scored his 107th and 108th international goals, putting him joint-second with Iran legend Ali Daei on the list of top men’s international scorers behind Cristiano Ronaldo’s 130."], "ranking": [1]}
{"candidates": ["Lionel Messi scored a brace in Argentina's 4-1 win against Guatemala.", "Messi's first goal came in the 12th minute after intercepting a pass from goalkeeper Nicholas Hagen.", "Messi's second goal was scored in the 77th minute from a service by Ángel Di María.", "Lionel Messi scored a brace and assisted one goal.", "Lautaro Martinez scored two goals, including a penalty.", "Lisandro Martinez scored an own goal for Guatemala.", "Nicholas Hagen's clearance error led to Messi's first goal.", "Enzo Fernandez assisted Messi, who then set up Martinez for an easy finish.", "Angel Di Maria assisted Messi's second goal with a delightful pass.", "Lionel Messi netted two goals in a strong, 90-minute showing.", "Lautaro Martinez scored Argentina’s 39th-minute penalty, the first he’s taken for his country.", "Messi assisted Martinez for Argentina’s third goal in the 66th minute.", "Lisandro Martinez scored an own goal off a Guatemala free kick in the fourth minute.", "Lionel Messi scored twice and assisted on another goal in Argentina's 4-1 win over Guatemala.", "Messi struck the woodwork with a free kick and contributed to a sequence leading to a penalty kick goal.", "Lautaro Martinez also scored twice for Argentina.", "Guatemala took a surprise lead in the fourth minute due to an own goal by Lisandro Martinez.", "Messi tied the game eight minutes later after an errant pass from Guatemala goalkeeper Nicholas Hagen.", "Messi's feed led to a penalty shot for Lautaro Martinez in the 38th minute.", "Martinez scored his second goal in the 66th minute after a pass from Messi.", "Messi finished the scoring in the 77th minute with a chip over the goalkeeper after a give-and-go with Angel Di Maria."], "ranking": [1, 5, 4, 2, 7, 18, 10, 9, 8, 3, 11, 12, 19, 6, 15, 16, 20, 13, 14, 17, 21]}
{"candidates": ["Manager Lionel Scaloni has confirmed that Lionel Messi will start for Argentina against Guatemala at FedEx Field in Landover, Maryland, as they finalize their preparations for Copa América.", "Messi, 36, came off the bench in Argentina's opening warmup game against Ecuador on Sunday, with Scaloni saying they would manage the forward's minutes in the lead-up to the tournament.", "Messi has dealt with muscle injuries while playing for Inter Miami this season, with Argentina making sure he remains fit for Copa América.", "Scaloni confirmed Messi will start against Guatemala and could play the whole match.", "Scaloni is yet to announce his final 26-player roster, waiting until after the Ecuador game to make the final cuts.", "Argentina manager Lionel Scaloni hoped Messi would play the full 90 minutes against Guatemala.", "The match against Guatemala was viewed as a trial for several players to solidify their place in the team or in Scaloni’s starting XI.", "Lionel Messi played his first international start since November.", "Messi previously missed a pair of international friendlies in March due to a hamstring issue.", "Messi's performance was part of Argentina's preparations for the 2024 Copa America."], "ranking": [6, 8, 5, 3, 2, 4, 9, 1, 7, 10]}
{"candidates": ["Reigning World Cup champion Argentina takes on Guatemala in a soccer friendly on Friday.", "With the 2024 Copa America less than a week away, Argentina prepares to defend its trophy at the event with a soccer friendly matchup against Guatemala.", "The reigning World Cup and Copa America champion will have a lot of expectations this summer to repeat as Lionel Messi remains in lead of the country.", "This will be Argentina’s final friendly ahead of the high-stakes Copa America, which begins next Thursday, June 20, 2024.", "Argentina has won its last four matches in a row, most recently defeating Ecuador 1-0 thanks to an Angel Di Maria goal in the 40th minute to secure the victory.", "Guatemala, meanwhile, is likewise undefeated in its last four matches, defeating the British Virgin Islands most recently 3-0, defeating Dominica 6-0 prior to that and drawing 1-1 with Guatemala and 0-0 with Venezuela."], "ranking": [3, 2, 1, 4, 5, 6]}
{"candidates": ["Lionel Scaloni expressed disappointment over the early goal conceded but was pleased with the team's quick recovery and overall performance.", "Lautaro Martinez thanked Messi for letting him take the penalty, calling it the gesture of a great player.", "Messi praised 19-year-old Valentin Carboni, highlighting his development and quality.", "Manager Lionel Scaloni mentioned the idea was to look for something different and improve.", "Scaloni praised Messi's decision to let Lautaro Martinez take the penalty, highlighting Messi's kindness."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Argentina had nearly 75% possession, particularly in the second half.", "A pitch invader reached Messi at Commanders Field.", "The match was held in Landover, Md.", "Argentina is the defending Copa America and World Cup champion.", "Guatemala is ranked 108th in FIFA’s world rankings."], "ranking": [4, 2, 5, 1, 3]}
{"candidates": ["Despodov scored the only goal for Bulgaria in the 40th minute.", "Ahmedov, Nurnberger, and Kolev received yellow cards for Bulgaria in the 78th, 90+1, and 90+3 minutes respectively.", "Charles, McNair, Bradley, and Hume received yellow cards for Northern Ireland in the 28th, 29th, 59th, and 81st minutes respectively."], "ranking": [1, 2, 3]}
{"candidates": ["Bulgaria hosts Northern Ireland in the second round of matches of the 2024/25 Nations League on Sunday.", "Bulgaria got their Nations League campaign off to a solid start by securing a 0-0 away draw with Belarus.", "Northern Ireland got their Nations League campaign off to a winning start with a 2-0 victory over Luxembourg at Windsor Park.", "Bulgaria is ranked 88th in the world by FIFA and is in a rebuilding phase under head coach Ilian Iliev Snr.", "Northern Ireland is ranked 74th by FIFA and is also in a rebuilding process under head coach Michael O'Neill.", "Bulgaria has been unbeaten in seven matches under Ilian Iliev Snr, but with only one win.", "Northern Ireland has won six out of 15 matches under Michael O'Neill.", "The retirement of key players like Jonny Evans, Steven Davis, and Stuart Dallas has brought down the average age of the Northern Ireland squad.", "Bulgaria has five draws in their last six matches, while Northern Ireland has recorded three wins in their last four matches.", "Michael O'Neill's young Northern Ireland squad head to Bulgaria for their second Nations League Group C3 game of the new campaign.", "The last year or so has felt like a changing of the guard, with some experienced heads, including Jonny Evans and Steven Davis, calling time on their international careers, but some of the talent coming through suggests the future can be bright.", "Putting right an awful Nations League record, with just one win in 16 games in the competition before this international break, will be a key priority for Northern Ireland this autumn, with six fixtures to be played before the end of 2024.", "Alongside Bulgaria, Thursday's opponents Luxembourg and Belarus join O'Neill's side in Group C3 – with a top-two finish needed to have a chance of winning promotion up to Nations League B.", "Sunday's hosts may be eight places lower than Northern Ireland in the FIFA Rankings, but they have been making progress since the appointment of manager Ilian Iliev last year, and will have promotion aspirations of their own.", "Bulgaria and Northern Ireland both made an unbeaten start to Group C3 of the UEFA Nations League.", "Northern Ireland posted a victory over Luxembourg, while Bulgaria was held by Belarus.", "Michael O'Neill has recorded four victories with clean sheets in Northern Ireland's last six outings.", "Ilian Iliev, Bulgaria's national team boss, has yet to lose a match, recording six draws from seven matches."], "ranking": [15, 12, 10, 8, 7, 14, 11, 9, 13, 6, 5, 4, 3, 2, 1, 16, 17, 18]}
{"candidates": ["The match will take place at Hristo Botev Stadium, Plovdiv, Bulgaria on Sunday 8th September at 5 pm BST.", "The match will be broadcast live on ITVX."], "ranking": [2, 1]}
{"candidates": ["Ismaïla Sarr scored the all-important goal in the 71st minute after converting from the penalty spot.", "Senegal registered their first victory in the 2025 Africa Cup of Nations (AFCON) qualifiers after downing Burundi 1-0.", "Ismaïla Sarr scored a penalty in the 71st minute.", "Ismaila Sarr scored a second-half penalty in the 71st minute to secure a 1-0 victory for Senegal.", "Senegal's defense held firm to secure the win despite previous concerns after their last-minute equalizer against Burkina Faso.", "Senegal won 1-0 against Burundi with a penalty scored by Ismaila Sarr after Sadio Mane was brought down by Burundian defender Nsabiyumva Frederic."], "ranking": [6, 5, 3, 2, 4, 1]}
{"candidates": ["Sarr scored a penalty in the 71st minute.", "Mendy received a yellow card in the 42nd minute.", "Diallo received a yellow card in the 69th minute.", "Mane received a yellow card in the 87th minute.", "Hadji Malick Diouf received a yellow card in the 90+6th minute."], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Burundi made a dream start to their Africa Cup of Nations qualifiers.", "Senegal aimed to bounce back from a late heartbreak in their opening encounter against Burkina Faso.", "Senegal were unbeaten in 12 of their last 13 matches, with the only defeat coming against Ivory Coast.", "Senegal were expected to be major contenders for next year's continental prize.", "Senegal had won both of the previous two meetings against Burundi by a combined score of 5-1.", "Burundi won consecutive games for the first time since 2020 and were without defeat in four straight outings.", "Burundi aimed to make it through to the AFCON finals for the first time since 2019."], "ranking": [5, 4, 3, 2, 6, 1, 7]}
{"candidates": ["Burundian coach Nda Yiragije Etienne praised his team's resilience and fighting spirit despite the defeat.", "Etienne expressed hope for a better performance in the next game and highlighted the team's chances to qualify for the 2025 African Cup of Nations.", "Senegal’s coach Aliou Cisse acknowledged the importance of the three points gained and noted the team's missed chances."], "ranking": [2, 3, 1]}
{"candidates": ["Senegal claimed their first win in Group L of the 2025 Africa Cup of Nations qualifiers.", "The match was held at the Bingu National Stadium in Lilongwe, Malawi.", "Burundi made a double change at the start of the second half to strengthen their team.", "Senegal introduced Habib Diallo and Iliman Ndiaye just after the hour mark to boost their attack.", "Senegal is leading Group L with four points, followed by Burundi with three points, Burkina Faso with one point, and Malawi with no points."], "ranking": [1, 5, 3, 2, 4]}
{"candidates": ["Miguel Terceros scored the only goal of the match in the 58th minute with an assist from Robson Matheus.", "Guillermo Viscarra was named Player of the Match.", "H. Cuellar received a red card for a professional foul in the 20th minute.", "B. Miranda was substituted in for C. Algarañaz in the 80th minute and received a yellow card for time wasting in the 90' +3 minute.", "Bolivia defeated Colombia 1-0 despite playing a large chunk of the match with an extra man after Bolivia midfielder Hector Cuellar was sent off after 20 minutes.", "Miguel Terceros scored a superb individual goal in the 58th minute.", "Bolivia overcame a 20th-minute red card to central midfielder Hector Cuellar to secure victory.", "Bolivia stunned Colombia with a 1-0 victory on October 10, 2024.", "Bolivia's Miguel Terceros scored the winning goal against Colombia.", "Bolivia played with 10 men after 20 minutes but still secured the win."], "ranking": [8, 5, 3, 2, 1, 6, 4, 9, 7, 10]}
{"candidates": ["Terceros scored the only goal for Bolivia in the 58th minute.", "Miranda received a red card in the 90+3 minute.", "Cuellar received a yellow card in the 21st minute.", "Castano received a yellow card in the 51st minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Colombia had lost only once since February 2022, and that was the 2024 Copa America final to Argentina.", "Bolivia's win against Colombia has boosted their confidence ahead of facing Argentina.", "Bolivia sits in one of South America's 2026 World Cup qualification spots.", "Miguel Terceros has been a standout player for Bolivia, scoring his third goal of the qualifying campaign."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Bolivia's Diego Medina celebrated the victory against Colombia.", "Bolivia hopes to continue their success in future matches to qualify for the World Cup."], "ranking": [1, 2]}
{"candidates": ["The match was held at Estadio Municipal de El Alto in El Alto, Bolivia.", "The referee for the match was Wilton Pereira Sampaio.", "Bolivia ranked 7th and Colombia ranked 4th in the World Cup Qualification standings at the time of the match.", "The match was played at Estadio Municipal de El Alto, which is 4,150 meters above sea level, making it a challenging location for opponents.", "Bolivia's win vaulted them into the automatic qualification places for the 2026 World Cup.", "Bolivia's fortunes have improved since moving home qualifiers to El Alto, situated more than 4,000m above sea level.", "Bolivia last qualified for the World Cup in 1994.", "Bolivia moved their home games to Estadio Municipal de El Alto, achieving a perfect record of three wins out of three.", "Bolivia's home stadium is located over 13,000 feet above sea level, providing a geographical advantage."], "ranking": [8, 9, 5, 6, 1, 3, 7, 2, 4]}
{"candidates": ["Bolivia's new home venue is even higher above sea level than the infamous Estadio Hernando Siles in La Paz.", "Bolivia's historic victory away in Chile was their first on the road in qualifying in 67 matches, since a 7-1 win against Venezuela in 1993.", "Colombia have won on just two of their last eight visits to Bolivia, with a 4-0 loss in La Paz in 2003 being a particularly low point.", "Bolivia have one of the youngest and inexperienced squads in South America.", "Colombian supporters were glad to see Luis Diaz kept in reserve by Liverpool at the weekend.", "Right-back Daniel Munoz broke down with a muscle issue and has been forced to withdraw.", "Captain James Rodriguez is not getting many minutes at Rayo Vallecano, but his levels for Los Cafeteros remain high."], "ranking": [4, 1, 3, 6, 5, 7, 2]}
{"candidates": ["Thabang Sesinyi scored the only goal of the match at the 52nd minute.", "Gift Moyo was substituted in at the 90th minute.", "Omaatla Kebatho received a yellow card at the 80th minute.", "Kabelo Seakanyeng received a yellow card at the 79th minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Botswana secured a 1-0 victory over Cape Verde with Sesinyi scoring in the 52nd minute.", "Key players for Botswana included Johnson, Ramotse, Seakanyeng, and Kebatho who were all notable in the match.", "Arcanjo from Cape Verde received a yellow card in the 70th minute.", "Sesinyi scored the only goal of the match in the 52nd minute to secure a 1-0 victory for Botswana.", "Johnson received a yellow card in the 2nd minute.", "Ramotse received a yellow card in the 22nd minute.", "Seakanyeng received a yellow card in the 79th minute.", "Kebatho received a yellow card in the 80th minute.", "Arcanjo received a yellow card in the 70th minute."], "ranking": [1, 2, 8, 3, 6, 5, 7, 4, 9]}
{"candidates": ["Botswana kicked off their quest for a place in Morocco with a 2-0 win over Cape Verde.", "Despite having over 75% of the possession and more than 25 shots on target, Cape Verde were left empty-handed as Tumisang Orebonye's second-minute strike was enough to give Botswana all three points.", "Botswana, currently 147th in the latest FIFA World Ranking, will now be looking to record back-to-back wins for the first time since July 2023 and move up to second place in Group C.", "The Zebras will be aiming to make their second appearance at the AFCON, having made their first appearance in 2012 when they were knocked out at the group stage after losing all three of their Group D matches.", "For Cape Verde, Thursday's defeat brought their quest for a third consecutive AFCON back down to earth, with just three points from their opening three games.", "Cape Verde go into Tuesday's clash on the back of four defeats in their last six matches in all competitions, including a 4-1 loss to Cameroon in the 2026 World Cup qualifiers, but they have taken seven points from four games and sit third in Group D, one point off the summit."], "ranking": [2, 1, 4, 5, 3, 6]}
{"candidates": ["Botswana and Cape Verde were set to clash in the second of their October double-header for the 2025 Africa Cup of Nations qualifiers.", "Botswana aimed to secure consecutive wins and move into second place in Group C.", "Cape Verde sought to bounce back from a defeat and improve their standing in the qualifiers.", "Sports Mole previewed the Africa Cup of Nations Qualifying clash between Botswana and Cape Verde, predicting a narrow win for Cape Verde despite Botswana's previous victory.", "Cape Verde was considered the favorite heading into the match based on their form and previous performances."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Cape Verde will be scratching their head as to how they dropped all three points despite their dominance in front of their home supporters."], "ranking": [1]}
{"candidates": ["Botswana had 30.6% possession while Cape Verde had 69.4%.", "Botswana had 3 shots on goal, while Cape Verde also had 3.", "Botswana had 4 yellow cards, while Cape Verde had 1.", "The match was held at Francistown Stadium with an attendance of 8,000."], "ranking": [2, 4, 1, 3]}
{"candidates": ["The match took place at Francistown Stadium on October 15, 2024, at 5pm UK time.", "The match ended with a 1-0 victory for Botswana, with the scoreline predicted correctly by data analysis."], "ranking": [2, 1]}
{"candidates": ["Angola claimed their biggest ever Cup of Nations finals win."], "ranking": [1]}
{"candidates": ["Angola set a new record by claiming two victories in the group stage, having never secured more than one win at previous editions."], "ranking": [1]}
{"candidates": ["Angola's goalkeeper Neblu was sent off after 17 minutes for handling the ball outside his penalty area.", "Namibia's Lubeni Haukongo received a red card for a second bookable offense just before halftime.", "Gelson Dala scored two goals in a remarkable four-minute span just before halftime.", "Gelson Dala scored twice for Angola in the 38th and 42nd minutes.", "Mabululu scored the third goal for Angola in the 66th minute.", "Neblú received a yellow card in the 17th minute.", "Lubeni Haukongo received a yellow card in the 40th minute.", "Gelson Dala scored twice for Angola.", "Angola's goalkeeper Neblu received a red card early in the match.", "Namibia defender Lubeni Haukongo received a red card shortly after Angola's first goal.", "Mabululu scored the third goal for Angola in the second period.", "Replacement keeper Antonio Dominique made a superb save from Deon Hotto’s free kick.", "Fredy provided assists for both of Gelson Dala's goals.", "Peter Shalulile fired over early in the second half as Namibia tried to reduce the deficit.", "Mabululu's goal came from a quick counterattack and was a fine finish at the far post.", "Angola's goalkeeper Neblu received a straight red card for handling outside the penalty area.", "Gelson Dala scored the first goal for Angola despite being down to 10 men.", "Namibia's Lubeni Pombili Haukongo received a second yellow card and was sent off.", "Gelson Dala scored his second goal from the resulting free-kick.", "Mabululu scored Angola's third goal with a stylish right-footed effort."], "ranking": [10, 9, 1, 4, 12, 16, 15, 7, 11, 8, 14, 5, 3, 13, 2, 6, 18, 17, 19, 20]}
{"candidates": ["Gelson Dala scored twice for Angola in the 38th and 42nd minutes.", "Mabululu scored for Angola in the 66th minute.", "Neblu received a yellow card in the 17th minute.", "Haukongo received a yellow card in the 14th minute and a red card in the 40th minute.", "Iimbondi received a yellow card in the 63rd minute."], "ranking": [1, 2, 5, 3, 4]}
{"candidates": ["Both Angola and Namibia are out to win their first-ever knockout game at the Africa Cup of Nations.", "Angola went through the group stage unbeaten and as group winners.", "Namibia stunned Tunisia to win their first AFCON match before qualifying in third place of Group E.", "Angola captain Fredy and Bruno Paz both came off with knocks in their last game.", "Namibia made changes after a heavy defeat to South Africa and drew with Mali to reach the knockouts, with Ryan Nyambe and Petrus Shitembi hoping for a recall.", "Pedro Goncalves' Angola is expected to have the firepower to punish Namibia's flimsy defence.", "Angola are unbeaten in their fixtures against Namibia, with 6 wins and 6 draws."], "ranking": [3, 5, 2, 6, 4, 1, 7]}
{"candidates": ["Angola qualified for the knockout stage for the first time in AFCON history.", "Namibia qualified for the knockout stages as one of the best third-place sides.", "Dala Gelson and Mabululu have scored two goals each for Angola.", "Deon Hotto's strike against Tunisia was crucial for Namibia's qualification.", "Angola are unbeaten in the last eight matches.", "Namibia have failed to score in the last two matches.", "Angola head into the round of 16 as unbeaten.", "Bruno Paz and Fredy are hoping to recover in time for the match.", "Namibia has a fully fit squad to select from.", "Angola are the favourites for the match due to their excellent form.", "Angola's round of 16 clash with Namibia sees the Palancas Negras seek to match their best showing at the Africa Cup of Nations.", "The Brave Warriors have already made history at AFCON 2023, making it to the knockout rounds for the first time in the nation's history.", "Angola topped Group D against pre-tournament predictions.", "Pedro Goncalves's men ended with seven points, playing a fourth game at the continental showpiece for the first time since hosting the finals in 2010.", "Collin Benjamin's troops secured a historic victory over 2004 champions Tunisia in their tournament opener in Group E.", "Deon Hotto's 88th-minute winner against Tunisia was Namibia's first-ever win at the finals."], "ranking": [1, 2, 5, 3, 6, 14, 7, 15, 13, 8, 4, 9, 10, 11, 12, 16]}
{"candidates": ["Neblu's emotional dismay was palpable as he received a red card.", "The goals showcased Angola's resilience and adaptability in the face of challenging circumstances.", "Angola's victory secured their place in the Africa Cup of Nations quarter-finals.", "Angola progressed to the quarter-finals of the Africa Cup of Nations for just the third time.", "Namibia's first-ever AFCON knockout fixture ended in disappointment.", "Gelson Dala was named Flashscore Man of the Match."], "ranking": [5, 4, 2, 3, 6, 1]}
{"candidates": ["The match is scheduled for a 5pm GMT kick-off on Saturday, January 27, 2024, at Stade de la Paix in Bouake.", "In the UK, the game will be televised live on Sky Sports Football, with coverage starting at 4.55pm.", "Subscribers can also catch the contest live online via the Sky Go app.", "Angola to qualify odds: 6/10, Namibia to qualify odds: 6/5."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Lautaro Martínez blasted a shot past Colombia goalie Camilo Vargas on a breakaway following a turnover in the 112th minute.", "Lionel Messi was subbed out in the 66th minute with an ankle injury.", "The game was delayed by more than an hour after fans rushed the stadium and tried to get inside.", "Colombia played without defender Daniel Muñoz, who was sent off after a second yellow card in the semifinal against Uruguay.", "The Copa America final between Argentina and Colombia was delayed by more than an hour due to chaotic scenes outside the stadium.", "Lionel Messi was forced off with an injury in the 66th minute of the final.", "Lautaro Martinez scored the winning goal in extra time.", "Leandro Paredes made a significant contribution by winning the ball back and starting the move for the winning goal.", "Emiliano Martinez kept a clean sheet, making it 33 clean sheets in 45 appearances for Argentina.", "Lautaro Martínez scores an INCREDIBLE goal in 112' to give Argentina a late 1-0 lead over Colombia", "Lionel Messi leaves game vs. Colombia with injury", "Argentina vs. Colombia: Start of Copa América final delayed due to fans rushing gates", "Police say they made 27 arrests, ejected 55 from stadium in chaos at Copa América final", "Lautaro Martínez scored a late extra-time goal in the 112th minute to secure the victory for Argentina.", "Lionel Messi suffered a noncontact injury in the 64th minute and had to leave the match.", "The match started over 75 minutes late due to crowd trouble at Hard Rock Stadium.", "Nicolás Tagliafico's goal in the 75th minute was ruled offside.", "Nicolas Gonzalez, who replaced Messi, was stopped by Vargas in the 95th minute.", "Numerous players lost their footing during the second half due to heavily watered grass following the half-time performance by Shakira."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]}
{"candidates": ["Few would argue there could be a more perfect setting for the final game of the Copa América soccer tournament on Sunday night.", "Never was there any doubt that Miami, the nation’s most Pan-American city, was the most fitting place to host the final game of the Copa América.", "Even the tournament’s organizers could not script a matchup like the one that will take place on Sunday night between Argentina and Colombia — two countries that, on any given day, would be received like the home team in South Florida.", "The tournament, which started on June 20, has lost some of its trademark South American feel being played entirely in the United States, with empty seats at some matches and players complaining about the surfaces of several fields.", "The setting of the final may restore some of Copa América’s typical festive energy.", "Argentina gets the most attention from American soccer fans thanks to the star Lionel Messi, whose move to Fort Lauderdale last year caused a veritable frenzy.", "Florida, while home to the largest Argentine population in the country (about 66,000 people as of 2021), has a far larger number of Colombians (more than 400,000).", "Both populations are heavily concentrated in South Florida, where the culture is so inescapably Latin American that most residents, regardless of nationality or ethnicity, know the difference between an Argentine empanada (wheat flour, baked) and a Colombian one (corn flour, fried).", "Argentina were the favorites of the tournament and never trailed during the competition.", "The match was delayed by 82 minutes due to organizational issues and chaotic scenes outside the stadium.", "Argentina vs. Colombia final preview: Will Lionel Messi win back-to-back Copa Américas?", "What's fueling Colombia's dominant Copa América run, and can they upset Argentina?", "The tournament gave us jam-packed action, thrilling storylines and plenty to talk about and now Argentina and Colombia face off in Sunday's final.", "Will Lionel Messi & Co. win back-to-back titles at the tournament, or will a Colombia side supercharged by James Rodríguez give the country a second Copa América?"], "ranking": [12, 11, 10, 8, 9, 7, 6, 5, 4, 3, 2, 1, 13, 14]}
{"candidates": ["BetMGM senior trader Tristan Davis anticipates a massive following for Argentina in the Copa America final against Colombia.", "BetMGM’s Copa America odds have Argentina as favorites with a moneyline of +110, while Colombia is at +310.", "Colombia has been well bet through the tournament and is the bettors’ best result for the Copa America title.", "Current champion Argentina will defend their title against Colombia in the 2024 Copa America final on Sunday, July 14 at the Hard Rock Stadium in Miami Gardens, Florida.", "The heated semifinal between Colombia and Uruguay ended in a 1-0 victory for Colombia, with Jefferson Lerma scoring in the 39th minute.", "For Argentina’s advancement, Julián Álvarez scored in the first half of the semifinal against Canada. Lionel Messi secured their spot with his first goal in the tournament, ending in a 2-0 victory.", "While Colombia only has one Copa America win from 2001, Argentina is looking to become the tournament’s historic champion with a record-breaking 16 wins.", "Argentina and Colombia expressed safety worries ahead of Sunday night's Copa America final, days after Uruguay's Darwin Núñez and a handful of his teammates went into the stands amid a brawl following a semifinal loss to Colombia.", "Argentina coach Lionel Scaloni said through an interpreter, speaking in a news conference Saturday before his team goes for a record 16th Copa America title against Colombia.", "Colombia midfielder Juan Quintero expressed concern about the incident and hoped it would not happen during the final match.", "Argentina goalkeeper Emiliano Martínez called for the tournament to reinforce security for the final.", "CONMEBOL, South American soccer's governing body, condemned the violence in a news release the day after Wednesday's match at Bank of America Stadium in Charlotte, North Carolina.", "Both Argentina and Colombia are known for their passionate fanbases and will meet for the 44th time. More than 65,000 people are expected to attend the game, and asking prices for resale tickets have ranged from a couple thousand dollars to upward of $10,000.", "Scaloni noted that his family will be in attendance and urged fans and others to respect their rivals.", "The Copa América final is set: Colombia will face Lionel Messi and Argentina, who will defend their championship title, on Sunday at the Hard Rock Stadium.", "Dubbed 'the world’s oldest continental tournament,' Copa América has been underway in 14 venues across the U.S. this year, culminating in Miami Gardens with the top two teams in a final match on July 14th.", "Looking ahead to the final on Sunday, July 14th, the two teams facing off against each other are Colombia and Argentina. The match is scheduled for 8 p.m."], "ranking": [7, 2, 3, 5, 10, 6, 1, 12, 9, 11, 13, 14, 15, 4, 8, 16, 17]}
{"candidates": ["The result broke Colombia’s 28-game international win streak, which dated to February 2022.", "Lionel Messi has bowed out of the 2024 Paris Olympics, and the next World Cup is almost two years away.", "Argentina coach Lionel Scaloni praised his team's resilience and ability to overcome difficulties.", "Colombia coach Nestor Lorenzo reflected on the impact of the pre-match delay on his team's preparations.", "Lionel Scaloni praised Angel Di Maria's performance and his contributions to the team.", "Lionel Scaloni commented on Lionel Messi's determination to play through injury.", "Davinson Sanchez expressed his disappointment but emphasized Colombia's determination to move forward.", "Sergio Aguero praised the Argentina team for their victory.", "Lionel Messi goes to Instagram to write his appreciation for his teammates and his fans following Argentina's Copa America victory", "Lionel Messi cried uncontrollably after he exited the Copa America final before full time for the first time in his career as another injury", "From tears to triumph: Lionel Messi once again leaves Copa América as a champion", "Angel Di Maria reflected on his final Argentina match, expressing gratitude and joy for retiring with a title.", "Di Maria and Otamendi are set to end their international careers.", "Di Maria commented on Messi's injury and the team's ability to give him joy despite his early exit."], "ranking": [1, 12, 8, 10, 9, 7, 11, 6, 5, 4, 3, 2, 13, 14]}
{"candidates": ["The Hard Rock Stadium will host seven World Cup matches in 2026.", "Concacaf, the confederation governing soccer in North and Central America and the Caribbean, has its headquarters in downtown Miami.", "FIFA, soccer’s international governing body, opened its U.S. office last year in the affluent suburb of Coral Gables.", "Argentina’s national soccer federation is working on major U.S. plans that include a $10 million training facility in North Bay Village, between Miami and Miami Beach.", "Soccer has been good for business, said Leo Graziano, the Argentine-born chief executive of Graziano’s Group, which runs 11 Argentine restaurants and mercados in South Florida that religiously broadcast soccer matches — and sell Argentina and Messi jerseys, by popular demand.", "Luis Carlos Perea, a former central defender who played for Colombia’s national team in two World Cups and four Copa América tournaments in the 1980s and 1990s, has lived in Miami for more than two decades.", "Over the past year, his youth soccer academy has seen increased demand from parents looking to get their children into the sport.", "The game was marred by a delay of more than an hour after fans, many of whom didn’t have tickets, rushed the stadium and tried to get inside.", "A handful of people received medical treatment and asked for water in the sweltering South Florida heat.", "The match was played in searing heat, which added to the issues faced by fans outside the stadium.", "Argentina's victory marked their third consecutive major trophy win, following the 2021 Copa America and the 2022 World Cup.", "Argentina conceded only one goal in the entire tournament, becoming the fourth team ever to achieve this in a single edition of Copa America.", "Shakira's full halftime performance at 2024 Copa América Final", "The start of the match was delayed due to crowd control issues, including fans breaching security gates.", "The match was held at Miami's Hard Rock Stadium, which will be used for the 2026 World Cup.", "Attendance for the match was 65,300.", "The grass was heavily watered with sprinklers following the half-time performance by Colombian pop star Shakira, causing an extended half-time break."], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17]}
{"candidates": ["The Hard Rock Stadium is scheduled to host a total of three games, including two group stages and the final.", "Tickets for the match are available for purchase on Ticketmaster, with prices starting at $1,500 and going as high as $9,000.", "Shakira will perform at the Copa América closing ceremony, and her song 'Puntería' has been designated the official song for this year’s tournament.", "The tournament will be broadcast on FOX Networks, including Fox Sports 1, Fox Sports 2, as well as the Fox Sports app. The matches will also be broadcast on Univision and TUDN with Spanish commentary."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Faisal Mansour Ali Saleh Al Badri converted a penalty in the 9th minute to give Libya an early lead.", "Steve Mouine equalized for Benin Republic in the 50th minute, assisted by Junior Olaitan.", "Junior Olaitan converted a penalty in the 62nd minute to give Benin Republic the lead.", "S. Mounié scored a goal at 50 minutes for Benin.", "J. Olaïtan scored a penalty at 62 minutes for Benin.", "Faisal Saleh Al Badri scored a penalty at 9 minutes for Libya.", "Benin Republic came from behind to defeat Libya 2-1 in the second match of Group D’s MatchDay 2 contest in Abidjan.", "Libya’s Faisal Saleh converted a 9th minute penalty kick.", "Steve Mounie scored a rifling shot to restore parity for Benin Republic five minutes into the second half.", "Junior Olaitan converted a penalty kick to secure the win for Benin Republic.", "Steve Mounié scored at the 50th minute.", "Junior Olaitan scored a penalty at the 62nd minute.", "Faisal Saleh scored a penalty at the 9th minute.", "Benin manages to come from behind against Libya to take three key points in the CAF qualifiers.", "Olaitan converts the penalty and gives his country the partial comeback goal.", "Mounié equalizes the score with a great volley after a cross from the left flank.", "Al Badri converts the penalty kick and scores the first goal of the match for Libya.", "Al Woheshi, Libya's goalkeeper, made several good saves.", "Mounie scored for Benin in the 50th minute.", "Olaitan scored a penalty for Benin in the 62nd minute.", "Al Badri scored a penalty for Libya in the 9th minute.", "Shafshuf received a yellow card in the 13th minute.", "Mukhtar Al Shremi received a yellow card in the 45+3rd minute.", "Al Badri received a yellow card in the 54th minute.", "Abo Shaalah received a yellow card in the 54th minute.", "Arteeba received a yellow card in the 60th minute."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]}
{"candidates": ["Steve Mounie scored for Benin in the 50th minute.", "Junior Olaitan scored a penalty for Benin in the 62nd minute.", "Al Badri scored a penalty for Libya in the 9th minute.", "Shafshuf, Mukhtar Al Shremi, Al Badri, Abo Shaalah, and Arteeba received yellow cards for Libya."], "ranking": [2, 1, 3, 4]}
{"candidates": ["Benin and Libya clash at the Felix Houphouet Boigny Stadium in neutral Ivory Coast on Tuesday in the 2025 Africa Cup of Nations qualifiers.", "Neither side won their first game of the round in Group D.", "Benin are ranked 91st in the world and are looking to reach the AFCON showpiece next year for their fifth appearance in history, and a first since 2019.", "Libya were pegged back by Rwanda in a 1-1 stalemate in their first game of the round.", "The Mediterranean Knights have beaten their West African opponents in their most recent two encounters: 3-2 in February 2011 and 1-0 in November 2013 (both friendlies).", "The sides are clashing for the first time in almost 11 years.", "The Cheetahs are ranked 91st in the world. Their rivals from North Africa are 26 places adrift.", "In nine official clashes this year, the Libyans have lost just once while winning six.", "Since 2023, the Cheetahs have played 10 games, winning just twice and losing five times.", "The Mediterranean Knights have seen a better run than their rivals, who've been going through a rough patch since last year.", "Back-to-back wins over Rwanda and Nigeria in the World Cup qualifiers signaled a possible return to form, but the Super Eagles crushed them last week to lay bare their vulnerabilities.", "Group D of the 2025 Africa Cup of Nations qualifiers will see Benin and Libya square off at the Stade Felix Houphouet-Boigny on Tuesday.", "Both teams will be aiming to win their first game of the qualifiers.", "Benin lost 3-0 to the Super Eagles at the Godswill Akpabio Stadium on Saturday as they were outmatched and outplayed by their opponents from West Africa, Nigeria, in their Group D opening.", "Les Guepards will enter Tuesday’s match hoping to restart their pursuit of a spot in Morocco after finishing in the quarterfinals in Egypt back in 2019.", "The team has not appeared in the Africa Cup of Nations.", "Rwanda held Libya to a 1-1 draw in Tripoli’s 11 June Stadium on Wednesday, denying them a dream start to their AFCON qualifying campaign.", "Libya last participated in the continental championship back in 2012, when they were eliminated in the group stages after earning four points from three games—one victory, one tie—and placing third in Group A.", "Steve Mounié is the player to watch for Benin, having played 51 games for his national team, scoring 17 goals and providing 3 assists.", "Ahmed Elmsmari is the most interesting player of the Libyan national team, currently 18 years old and playing for FC Barcelona B.", "The match between Benin vs Libya on matchday 2 of the African qualifiers will be played at the Stade Félix Houphouët Boigny located in Abidjan, Ivory Coast, with a capacity of 45,000 spectators.", "Sports Mole predicted a narrow victory for Benin, citing their quality to get the job done."], "ranking": [14, 18, 10, 16, 7, 19, 11, 13, 12, 5, 20, 15, 9, 17, 8, 6, 4, 3, 2, 1, 21, 22]}
{"candidates": ["Both Benin and Libya have shown defensive fragility in their recent outings, with Benin keeping only two clean sheets in their last 11 matches and Libya failing to secure a clean sheet in seven consecutive matches.", "Steve Mounie is a significant threat to Libya’s defence, averaging two shots on target per game.", "Libya have been able to score in six of their last seven games, indicating their scoring consistency.", "Benin come into the match off the back of a 3-0 defeat to Nigeria, while Libya drew 1-1 with Rwanda in their opening game.", "Both teams are desperate for points in this qualifier, which should make for an open, attacking game.", "Benin and Libya return to action in Group D of the 2025 Africa Cup of Nations qualifiers.", "This will be the first meeting between the two nations since November 2018.", "Benin were outclassed by Nigeria in their Group D opener, losing 3-0.", "Libya were held to a 1-1 draw by Rwanda in their AFCON qualifying campaign opener."], "ranking": [3, 6, 5, 8, 2, 9, 7, 1, 4]}
{"candidates": ["This victory helped Benin Republic recover from their 1-0 loss to Nigeria and move into second place in Group D.", "Libya, with a draw and a loss, now sit at the bottom of the group."], "ranking": [1, 2]}
{"candidates": ["The match was held at Stade Félix Houphouët-Boigny.", "Benin had 62.3% possession while Libya had 37.7%.", "Benin had 12 shots with 7 on target, while Libya had 5 shots with 1 on target.", "Benin had 27 total touches in the box compared to Libya's 4.", "Libya's goalkeeper made 5 saves, while Benin's goalkeeper made none.", "Benin committed 23 fouls, while Libya committed 15.", "Benin had 7 corners, while Libya had 1.", "The approximate temperature at the Stade Félix Houphouët Boigny was around 82 degrees Fahrenheit.", "Libya had to play its matches outside its country for almost 7 years due to war and conflict.", "Benin lost its first match against Nigeria with a final score of 3-0."], "ranking": [9, 5, 2, 3, 4, 6, 7, 10, 1, 8]}
{"candidates": ["Benin Starting XI: Dandjinou, Verdon, Hountondji, Roche, Moumini, D’Almeida, Dokou, Hassane, Olaitan, Dossou, Mounie", "Libya Starting XI: Al Wuheeshi, Al Dawi, Yousef Musrati, Arteeba, Shafshuf, Al Qulaib, Al Badri, Al Shuraimi, Ekrawa, Aliaddawi, bin Ali"], "ranking": [2, 1]}
{"candidates": ["Mohamed Marhoon scored a stunning 35-yard freekick in the 15th minute to give Bahrain the lead.", "Ragnar Oratmangoen equalized for Indonesia in first-half stoppage time.", "Rafael Struick scored a sublime curling effort to give Indonesia a 2-1 lead.", "Mohamed Marhoon scored his second goal in the 99th minute to equalize for Bahrain.", "Indonesia's national team had to settle for a 2-2 draw against Bahrain at the Bahrain National Stadium.", "Omani referee Ahmed Al Kaf made controversial decisions against Indonesia throughout the match.", "The second half was given six minutes of added time, but the game ended nine minutes after the regular time.", "Bahrain managed to score an equalizer in the 90+9th minute due to the extended injury time.", "Home side Bahrain took the lead in the 14th minute through Mohamed Mahroon.", "Ragnar Oratmangoen equalized for Indonesia just before the end of the first half.", "Rafael Struick scored a stunning curling goal in the 75th minute to give Indonesia a 2-1 lead.", "Mohamed Mahroon scored again for Bahrain in the 98th minute to level the score at 2-2.", "Bahrain’s goals came through Mohamed Marhoon in the 15th minute and 90+8'", "The Indonesian national team scored through Ragnar Oratmangoen in the 45+2nd minute and Rafael Struick 74'", "Referee Ahmed Al Kaf’s controversial decision at the end of the match ruined the Indonesian national team‘s victory", "The referee from Oman gave six minutes of extra time in the second half, but instead, the match was allowed to end for nine minutes", "Bahrain was able to equalize in the 90+9th minute", "Indonesian national team manager, Sumardji, received a red card from the referee for protesting too loudly", "Indonesia led 2-1 until stoppage time when Omani referee Ahmed Al-Kaf extended the match beyond the six minutes of extra time initially indicated, allowing Bahrain to equalize in the 99th minute.", "The Indonesian national team manager was given a red card for his protests.", "Mohamed Marhoon scored for Bahrain at 15' and 90'+9'.", "Ragnar Oratmangoen scored for Indonesia at 45'+3'.", "Rafael Struick scored for Indonesia at 74'.", "Ivar Jenner (Indonesia) received a yellow card at 90'+10'.", "Komail Al-Aswad (Bahrain) received a yellow card at 90'+10'."], "ranking": [1, 5, 2, 3, 18, 4, 20, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 21, 22, 23, 24, 25]}
{"candidates": ["Ali Haram scored a goal in the 11th minute.", "Mohamed Jasim Marhoon scored a goal in the 15th minute.", "Ragnar Oratmangoen scored a goal in the 48th minute."], "ranking": [1, 2, 3]}
{"candidates": ["Indonesia continued their unbeaten start to the third round of Asian qualifiers for the 2026 FIFA World Cup.", "Indonesia's next game is against China, who have lost all three outings thus far.", "A similar case occurred during the 2016 World Cup Qualifiers, in a match between South Africa and Senegal for the 2018 World Cup.", "Referee Ahmed Abu Bakar Said Al Kaf's decision to allow play to continue after the allotted time had expired raised questions.", "The extra time granted was six minutes, but the match ended well beyond that point.", "Indonesia received an additional 4.39 points in the FIFA ranking but remained in 129th position", "Bahrain experienced a significant decline in FIFA’s ranking, dropping to 78th after losing 4.39 points", "The match ended in a 2-2 draw.", "Bahrain had 56.2% possession while Indonesia had 43.8%.", "Bahrain had 24 shot attempts compared to Indonesia's 5.", "The match was held at Bahrain National Stadium with an attendance of 10,731."], "ranking": [5, 3, 11, 8, 9, 2, 1, 6, 7, 10, 4]}
{"candidates": ["The match between Indonesia and Bahrain will take place at Bahrain National Stadium on October 10, 2024, at 23:00 WIB, and will be broadcast live on RCTI and Vision+."], "ranking": [1]}
{"candidates": ["Referee Ahmed Al Kaf issued three yellow cards in the match, one for Bahrain and two for Indonesia", "Al Kaf fouled Indonesia 27 times, one of which led to a free kick that gave Bahrain the lead in the 15th minute", "The controversy highlights broader concerns about officiating when Middle Eastern referees oversee matches involving non-Middle Eastern teams.", "Teams from Japan, Australia, and South Korea have expressed similar frustrations in past matches, where they perceived referees from the region as favoring Middle Eastern teams.", "Incidents such as the 2019 Japan vs Qatar AFC Asian Cup final and the 2018 Australia vs Iraq World Cup qualifier serve as precedents."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Formation Forecast: Bahrain (4-2-3-1): Ebrahim Lutfala; Amine Benadi, Sayed Mahdi, Vincente Emmanuel, Abdulla Alkhulasi; Abbas Alasfoor, Ali Haram; Ali Madan, Mohamed Marhoon, Mahdi Abdouljabbar; Komail Alaswad", "Formation Forecast: Indonesia (3-4-2-1): Ernando Ari; Rizky Ridho, Jay Idzes, Mees Hilgers; Sandy Walsh, Ivar Janner, Nathan Tjoe-A-On, Calvin Verdok; Eliano Reijnders, Ragnar Oratmangoen; Rafael Struick"], "ranking": [2, 1]}
{"candidates": ["Lisandro Martinez became the first Argentina defender to score at Copa America since Victor Cuesta in 2016.", "Lionel Messi broke the all-time record for Copa América minutes played.", "Lionel Messi broke the record for most minutes played in the tournament's history.", "Lionel Messi set the record for the most minutes played in Copa América history during the match."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Lionel Messi missed a penalty in the shootout.", "Emi Martinez made two crucial saves in the penalty shootout.", "Nicolas Otamendi scored the decisive penalty to secure Argentina's victory.", "Lisandro Martinez scored the opening goal for Argentina.", "Kevin Rodriguez scored a stoppage-time equalizer for Ecuador.", "Enner Valencia missed a penalty for Ecuador during regular time.", "Emiliano Martinez made two crucial saves in the penalty shootout.", "Nicolas Otamendi clinched the penalty shootout victory for Argentina.", "Jordy Caicedo missed a header that could have won the match for Ecuador but redeemed himself in the penalty shootout.", "Gonzalo Montiel scored a penalty for Argentina.", "John Yeboah scored a penalty for Ecuador.", "Alexis Mac Allister scored a penalty for Argentina.", "Julian Álvarez scored the first penalty of the shootout for Argentina.", "Lionel Messi missed a penalty in the shootout.", "Kevin Rodriguez scored a dramatic header to tie the match for Ecuador in stoppage time.", "Lisandro Martinez scored the first goal for Argentina with a header.", "Enner Valencia missed a penalty for Ecuador.", "Enzo Fernández missed three clear chances for Argentina in the first half.", "Enner Valencia received the first yellow card of the match for a hard tackle on Alexis Mac Allister.", "Lisandro Martínez scored the opener for Argentina in the 35th minute.", "Kevin Rodríguez equalized for Ecuador in stoppage time (91st minute).", "Emiliano Martínez made two key saves in the penalty shootout.", "Nicolás Otamendi scored the decisive penalty kick to secure Argentina's semifinal spot.", "Emiliano Martinez made two crucial saves in the penalty shootout.", "Lisandro Martínez scored for Argentina in the 35th minute.", "Kevin Rodríguez scored for Ecuador in the 90'+1' minute.", "Argentina won the penalty shootout 4-2 to advance to the semifinals.", "Lisandro Martínez scored his first goal for Argentina with a header in the 34th minute.", "Enner Valencia missed a penalty kick for Ecuador, hitting the post.", "Kevin Rodríguez scored a stoppage-time goal for Ecuador to force penalty kicks.", "Argentina won the penalty shootout 4-2 to advance to the semifinals."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]}
{"candidates": ["Lionel Messi started the game despite being an injury doubt after missing their final group match against Peru due to a hamstring issue."], "ranking": [1]}
{"candidates": ["The quarter-final games start July 4th at 9:00 pm ET with Argentina vs. Ecuador.", "The World Cup champions Argentina managed to win all of their games from their group and finish first in Group A.", "Ecuador finished second in Group B after losing to Venezuela and tying with Mexico.", "Ecuador is currently in fifth place in the World Cup qualifiers.", "Argentina should still be able to win, but it won't be as easy as their Group A games.", "Argentina and Ecuador will go head-to-head on Sunday evening in what will be their first warm-up match before the Copa America 2024.", "Lionel Messi and his teammates are aiming to win another Copa America title, following their victory in the World Cup held in Qatar in 2022.", "Argentina is widely regarded as the top contender for the tournament, with Brazil also considered a strong contender.", "Scaloni has the luxury of having both Julian Alvarez and Lautaro Martinez available for selection this summer.", "Ecuador possesses a wealth of talent that could potentially pose a challenge for Argentina, with Enner Valencia, Moises Caicedo, and Piero Hincapie forming a formidable core.", "Valencia, Ecuador’s all-time leading goal scorer, will be the key player to make a significant impact.", "Argentina has a win probability of 65%, whereas Ecuador has a win probability of 20%, and the possibility of Extra Time is 15%.", "Lionel Messi and Argentina will play Ecuador in the Quarter-Finals of the 2024 Copa America Final Stage on Thursday, July 4 at the NRG Stadium in Houston, TX.", "Messi sustained a right groin/adductor injury during the match against Chile on June 15 and sat out during the match against Peru on June 29.", "Messi is back training ahead of the Quarter-Finals against Ecuador, so fans can hopefully get the chance to see him in action.", "Ecuador most recently faced off against Mexico on June 30, which ended in a draw 0-0.", "Ecuador will face Argentina on Thursday, July 4 at 20:00 in the quarterfinals of the Copa América 2024 at NRG Stadium in Houston.", "Ecuador seeks to advance to the semifinals after an irregular campaign, aiming for their second victory in the tournament after defeating Jamaica.", "Ecuador's coach, Félix Sánchez Bas, considers making changes in the system, possibly adding a midfielder and having Enner Valencia as the sole attacker."], "ranking": [15, 2, 12, 14, 10, 16, 3, 6, 9, 5, 4, 1, 8, 11, 13, 7, 17, 18, 19]}
{"candidates": ["Lionel Scaloni praised his team's resilience and Emi Martinez's performance in the shootout.", "Emi Martinez expressed his determination and dedication to his training.", "Rodrigo De Paul praised Emi Martinez, calling him an 'animal in goal'.", "Lisandro Martinez expressed excitement over scoring his first goal for Argentina.", "Argentina coach Lionel Scaloni emphasized the team's confidence in their goalkeeper, Emi Martinez, especially after Lionel Messi's missed penalty.", "Scaloni mentioned that winning in this manner was not enjoyable despite the happiness of advancing.", "Ecuador coach Felix Sanchez reflected on Enner Valencia's missed penalty, acknowledging his confidence and contribution in other areas of the game.", "Emiliano Martinez's saves were pivotal in securing Argentina's victory.", "The match ended in a 1-1 draw in regulation time before going to penalties.", "Argentina is making a strong case to defend its title after a win over a tough Ecuador team.", "Argentina will face the winner of Canada vs. Venezuela in the semifinals."], "ranking": [3, 9, 2, 8, 5, 6, 7, 1, 10, 4, 11]}
{"candidates": ["The pitch conditions at Houston’s NRG Stadium were criticized for being fast and choppy.", "Ecuador limited Lionel Messi to just 32 touches, his fewest in a competitive game since 2011.", "The match took place at NRG Stadium in Houston.", "There is no extra time in Copa América knockouts until the final.", "The match was held at NRG Stadium in Houston, Texas, with an attendance of 69,456 spectators.", "The match was held at NRG Stadium in Houston, Texas, with an attendance of 69,456 spectators."], "ranking": [5, 1, 4, 6, 2, 3]}
{"candidates": ["Tickets to the match are completely sold out, but fans can score resale tickets at reasonable prices through Vivid Seats, SeatGeek, StubHub or Ticketmaster.", "The cheapest tickets start at $138 before fees on SeatGeek.", "Copa America 2024 will take place in 14 cities in the United States between June 20 and July 14, 2024.", "MetLife Stadium will host one final match: July 9 - Semi-Final - TBD vs. TBD."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Argentina will next play either Venezuela or Canada in the semifinals."], "ranking": [1]}
{"candidates": ["It is the first time in European Championship history that all four teams in a single group are on equal points after two match weeks.", "Belgium have not drawn a match at the European Championship since a 0-0 stalemate against Italy at the 1980 tournament, all of 19 games ago.", "Belgium have won exactly half of their all-time meetings against Romania (six from 12). This was their first clash at a major tournament.", "Youri Tielemans scored the third quickest goal in the history of the European Championship.", "For the first time in European Championship history, all four teams in a group are on equal points after two rounds.", "For the first time in the history of the UEFA European Championship group stage, all four teams in a single group will be level on points going into the final round of matches.", "Youri Tielemans’ strike after one minute and 13 seconds is Belgium’s earliest ever goal at a major tournament (World Cup/Euros), and the third-fastest overall in UEFA European Championship history.", "Jan Vertonghen (37 years, 59 days) became the oldest player to appear for Belgium at the UEFA European Championships and the third-oldest at a major tournament (EUROs + World Cup)."], "ranking": [6, 4, 3, 8, 5, 2, 1, 7]}
{"candidates": ["Youri Tielemans scored in the 2nd minute.", "Kevin De Bruyne scored in the 80th minute.", "Kevin De Bruyne was named Player of the Match by UEFA.", "Romelu Lukaku had a goal disallowed by VAR for the third time in two games.", "Koen Casteels made terrific saves in both halves, stepping in for the injured Thibaut Courtois.", "Kevin De Bruyne scored Belgium's second goal in the 80th minute.", "Youri Tielemans scored in the second minute for Belgium.", "Romelu Lukaku had a goal disallowed by VAR for offside.", "Dennis Man had a scoring chance denied by Belgium goalkeeper Koen Casteels.", "Youri Tielemans scored from the edge of the area in the second minute.", "Kevin De Bruyne scored the second goal in the 80th minute after converting a long kick from goalkeeper Koen Casteels.", "Romelu Lukaku had a third goal ruled out by VAR.", "Dennis Man was denied a goal by Koen Casteels.", "Youri Tielemans struck inside two minutes to give Belgium an early lead.", "Kevin De Bruyne doubled Belgium's lead with 10 minutes left, scoring from seven metres out after a long ball from goalkeeper Koen Casteels.", "Romelu Lukaku provided an assist for Youri Tielemans' goal.", "Kevin De Bruyne was named Player of the Match by UEFA's Technical Observer Panel.", "Youri Tielemans fired Belgium in front with less than two minutes on the clock.", "Kevin De Bruyne sealed the points for Belgium with a goal 10 minutes from time.", "Romelu Lukaku had a goal disallowed for offside.", "Dennis Man had Romania’s best chance in the second half, which was smothered by Koen Casteels.", "Youri Tielemans scored a goal after 73 seconds.", "Kevin De Bruyne scored a late goal to secure Belgium's 2-0 win.", "Romelu Lukaku had a goal ruled out for offside by VAR.", "Koen Casteels made a crucial save from Radu Dragusin's header.", "Dennis Man missed a clear chance for Romania, shooting straight at Casteels.", "Kevin De Bruyne scored a second goal to wrap up a win for Belgium.", "Youri Tielemans scored the first goal of the game after just 73 seconds.", "Romania's Dennis Man had a key chance but hit his shot straight at Casteels.", "Kevin De Bruyne scored his second goal after a long ball from Casteels.", "Youri Tielemans opened the scoring after 73 seconds.", "Kevin De Bruyne scored Belgium's second goal after 80 minutes.", "Romelu Lukaku had a third overturned goal of the tournament decided by the tip of a knee.", "Domenico Tedesco made four changes to the lineup, including restoring Jan Vertonghen to defense and adding Youri Tielemans alongside Amadou Onana in midfield.", "Kevin De Bruyne's slide rule pass sent Lukaku clear to finish calmly into the bottom corner, only for VAR to intervene."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Belgium recorded a 2-0 win against Romania.", "Kevin De Bruyne doubled Belgium's lead to seal all three points.", "Belgium had a goal ruled out by VAR for offside.", "Belgium led Romania 1-0 at half-time thanks to an early strike.", "Jeremy Doku assisted Romelu Lukaku, who laid it off for Youri Tielemans to score Belgium's opener.", "Tielemans scored in the 2nd minute", "De Bruyne scored in the 80th minute", "Lukebakio received a yellow card in the 35th minute", "Bancu received a yellow card in the 59th minute", "Marin received a yellow card in the 65th minute"], "ranking": [5, 2, 8, 6, 1, 9, 3, 10, 7, 4]}
{"candidates": ["In the lead-up to Euro 2024, there was talk about whether Belgium’s golden generation could achieve something historic.", "Belgium's manager Domenico Tedesco emphasized the importance of a must-win game."], "ranking": [1, 2]}
{"candidates": ["Belgium faced Romania in the final game of the day.", "The match was crucial for Group E standings.", "Romania head coach Edward Iordanescu is considering an attacking alteration for the match against Belgium", "Valentin Mihaila is expected to replace Florinel Coman in the starting lineup", "Mihaila scored three goals in qualifying for Romania", "Denis Dragus and Dennis Man are expected to start alongside Mihaila", "Romania's captain Nicolae Stanciu is set to play alongside Razvan Marin and Marius Marin in midfield", "Tottenham Hotspur's Radu Dragusin will be part of Romania's defense"], "ranking": [8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Belgium boss Domenico Tedesco expressed relief at winning the game and emphasized the importance of the three points.", "Tedesco praised the team's high pressing and mentality against Romania.", "Romania's coach Edward Iordanescu acknowledged Belgium's quality and expressed faith in his team's ability to improve.", "Iordanescu mentioned that with a bit of luck, Romania could have gotten a point from the match.", "Kevin De Bruyne emphasized the importance of the win to avoid early elimination.", "Belgium coach Domenico Tedesco expressed relief over the victory and highlighted the need to secure the win earlier.", "The result means all four teams in Group E have three points, making the final round of games crucial.", "Belgium's win was crucial after their loss to Slovakia, which raised the prospect of another early exit from a major tournament.", "The format of the Euros, in which the four best third-place teams advance, leaves more room for error, but another defeat would have broken the team's confidence.", "Kevin De Bruyne was praised for making the difference for Belgium as they claimed their first points in Euro 2024.", "The result leaves all four teams in Group E on three points, setting up a nail-biting end to the group stages.", "Belgium put their shock matchday 1 defeat to Slovakia behind them with an impressive 2-0 win over Romania.", "The result means that all four teams in Group E now have three points, with the remaining fixtures to be played on Wednesday.", "For such a venerated group of players, Belgium’s record at international tournaments in the last decade has been poor.", "After the shock of a defeat to Slovakia in their opening match, it looked like they might meekly depart the international stage at an early juncture once more.", "In Cologne they fired back with a vibrant performance in one of the most entertaining matches of the tournament.", "It is a foothold at Euro 2024 for them, and perhaps a base camp for one final yahoo at a major trophy for their thirtysomething stars.", "Jan Vertonghen slotted into defence effortlessly, while De Bruyne turned in the kind of performance we see on a regular basis for Manchester City.", "If their record scorer Romelu Lukaku can stay just the right side of the offside line and turn his personal fortunes around, they can still be a handful.", "Belgium manager Domenico Tedesco expressed satisfaction with the result and noted Romania left more space than Slovakia.", "Romania coach Edward Iordanescu emphasized the need for solidarity and unity as they are still first in the group.", "The victory leaves Group E as open as it could possibly be, with all four teams tied on three points.", "With De Bruyne on form, Belgium are favorites to beat Ukraine and advance to the knockout stage.", "Domenico Tedesco expressed relief at winning the game and emphasized the importance of getting three points.", "Tedesco showed frustration at the team's inability to kill the game earlier despite having 20 shots and nine on target.", "Tedesco mentioned that the mentality of the team was good during the match."], "ranking": [1, 5, 7, 10, 3, 4, 6, 2, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]}
{"candidates": ["The match took place in Cologne, Germany, which is just two hours from Belgium.", "Belgium fans stayed to cheer the substitutes' warm-down after the match.", "Kevin De Bruyne's performance was highlighted as the emotional and technical heartbeat of the team.", "The gap between Gheorghe Hagi's last European Championship match and his son Ianis Hagi's appearance in this tournament was 8760 days.", "Belgium's King Philippe, Queen Mathilde, Prince Emmanuel, and Prince Gabriel attended the match.", "Belgium had 67% possession in the first half.", "Belgium had 67% possession in the first half.", "The Belgium royal family was present at the match.", "All four teams in Group E have three points, making the final round of games crucial.", "The match was played in an astonishing atmosphere in Cologne.", "Romania and Belgium have the advantage with a plus-one goal difference in the group.", "Romania had the lowest possession share by a victorious team on record at the Euros in their first match against Ukraine.", "Belgium had two goals disallowed in their previous match against Slovakia."], "ranking": [12, 11, 2, 5, 4, 9, 9, 4, 8, 3, 6, 1, 10]}
{"candidates": ["India played out a goalless draw against hosts Afghanistan at the Damac Stadium in Abha, Saudi Arabia.", "Vikram Partap Singh made the starting XI for the first time in his career and was a constant thorn in the Afghanistan defence.", "Manvir Singh had multiple opportunities to score but missed.", "Vikram Pratap Singh missed several chances to score in the second half.", "Rahul Bheke made a crucial intervention to prevent Omid Popalzay from scoring.", "Subhasish Bose missed a free header inside the Afghanistan box.", "Liston Colaco created a last-minute opportunity that was ultimately unsuccessful."], "ranking": [5, 2, 6, 4, 1, 7, 3]}
{"candidates": ["The equation was clear for both teams: a win would significantly improve their standings in Group A.", "India will be eyeing three points out of the crucial game since it has a dominant record against Afghanistan in the history books.", "India’s national football team will face Afghanistan in its away leg of the second round of the FIFA World Cup 2026 and AFC Asian Cup 2027 Preliminary Joint Qualification on March 21, 2024, in Abha, Saudi Arabia.", "Qatar currently leads the group with six points with India and Kuwait tied behind with three points while Afghanistan is last with zero points having lost both its matches.", "Afghanistan has only won once in the 11 matches played against the Blue Tigers."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Jeakson Singh is back in the national team after a six-month absence due to a shoulder injury.", "Jeakson Singh has been a pivotal player for the Blue Tigers, featuring in 17 consecutive matches from the AFC Asian Cup Qualifiers in June 2022 until the King's Cup in Thailand in September 2023.", "Jeakson Singh is excited to rejoin the national team for the FIFA World Cup Qualifiers against Afghanistan.", "The Blue Tigers have had four full training sessions in Abha, Saudi Arabia, to acclimatize to the conditions ahead of the match on March 21.", "Jeakson Singh reminisced about the last meeting with Afghanistan in 2022 at the Asian Cup Qualifiers in Kolkata, where India secured a dramatic victory."], "ranking": [3, 1, 4, 5, 2]}
{"candidates": ["India climbed to the second spot in Group A with four points from three matches.", "Afghanistan and India will face off again on March 26 in Guwahati for their second encounter in the Asian Qualifiers for the FIFA World Cup."], "ranking": [1, 2]}
{"candidates": ["Burkina Faso became the first qualifiers for the 2025 African Cup of Nations following a 2-0 win in Burundi.", "A goal from Mohamed Konate and a penalty from Bertrand Traore secured the victory for Burkina Faso.", "Burkina Faso beat Burundi 2-0 in their Afcon 2025 qualifier at the Felix Houphouet-Boigny Stadium.", "Mohamed Konate scored the opening goal in the fifth minute with an assist from Cedric Badolo.", "Bertrand Traore scored the second goal for Burkina Faso in the fourth minute of stoppage time."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Konate scored an early goal for Burkina Faso in the 5th minute.", "Ntibazonkiza scored for Burundi in the 53rd minute.", "Traore scored a penalty for Burkina Faso in the 90+4th minute.", "Kabore received a yellow card in the 85th minute."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Etienne Ndayiragije took a few positives from the match despite the loss, noting that his side managed to register more shots at goal than their opponents with just 40% possession.", "Burundi have now lost all three matches they have ever played against Burkina Faso, conceding nine goals and scoring only twice."], "ranking": [2, 1]}
{"candidates": ["The match was played at Stade de l'Amitie due to stadiums in both nations failing to meet FIFA standards for international competition.", "Burkina Faso have scored in every match since Brama Traore's arrival, with eight goals in the competition to date, the second-most of any participating nation."], "ranking": [2, 1]}
{"candidates": ["Jackson Irvine scored the first goal for Australia in the 50th minute after a failed grab by Indian goalkeeper Gurpreet Singh Sandhu.", "Jordan Bos scored the second goal for Australia in the 74th minute after a combination play with Riley McGree.", "Australia's goal at the start of the second half opened the scoreboard.", "Australia's second goal at the 70th minute put the match much calmer.", "The match ended with Australia 2-0 India.", "Australia's midfielder Jackson Irvine scored the first goal for Australia in the 50th minute.", "Jordan Bos scored the second goal for Australia in the 73rd minute.", "Vikram Partap Singh received a yellow card in the 90+3 minute."], "ranking": [1, 2, 5, 6, 8, 3, 4, 7]}
{"candidates": ["Australia comes from closing its preparation against Bahrain with a 2-0 victory.", "Australia is the favorite to finish as first place and to advance to the next round.", "India did not have any preparation matches and aims to cause a surprise in the Asian Cup.", "Neither team has any injured or suspended players.", "Japan's Yoshimi Yamashita will be in charge of the match.", "India’s head coach Igor Stimac acknowledged the challenge of facing Australia, highlighting the strength of their players who compete in top European leagues.", "India was missing key players like Jeakson Singh and Anwar Ali due to injuries."], "ranking": [5, 2, 4, 7, 6, 1, 3]}
{"candidates": ["Sunil Chhetri will lead the Indian Football Team against Australia in the AFC Asian Cup on January 13, 2024.", "The match will take place at the Ahmed bin Ali Stadium.", "India is placed in a tough group with Australia, Syria, and Uzbekistan.", "Sunil Chhetri and Gurpreet Singh Sandhu are expected to be crucial in establishing India's hopes against Australia.", "The game is anticipated to be a close one as both teams want to establish an early lead in Group B.", "The Subway Socceroos take on India to begin its AFC Asian Cup Qatar 2023™ on Saturday at 10:30pm AEDT.", "This will be the ninth meeting against India and first since the 2011 iteration of the Asian Cup where the Aussies recorded a 4-0 triumph in the opening match.", "Australia has been pitted in Group B alongside India, Syria, and Uzbekistan with all of its Group B matches kicking off at 10:30pm AEDT.", "Graham Arnold announced his 26-man squad for the tournament, determined to build on its recent strong form over the last 12 months."], "ranking": [7, 2, 3, 6, 5, 8, 9, 4, 1]}
{"candidates": ["Indian coach Igor Stimac kept a close watch on his team, showing their commitment and determination.", "The large number of Indian fans present felt proud and encouraged by the Blue Tigers' performance despite the loss.", "India's coach Igor Stimac might reflect on the team's defensive communication in the first half as a positive takeaway for their next match against Uzbekistan."], "ranking": [2, 1, 3]}
{"candidates": ["The match was held at the Ahmad bin Ali Stadium in Doha, Qatar.", "India will play their next match in Group B against Uzbekistan on January 18 at the same stadium.", "The stadium was more than half full for this match.", "The match was part of the AFC Asian Cup 2024.", "The match took place at the Ahmad bin Ali Stadium in Qatar.", "India showed excellent communication in defense during the first half to keep Australia at bay."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["All matches involving Australia at the AFC Asian Cup Qatar 2023™ will be broadcast Live and Free on Australia's 'Home of Football,' Network 10 as well as streamed live via both 10 Play and Paramount+.", "Every AFC Asian Cup Qatar 2023 Match will be Live on Paramount+.", "International fans can check the official global broadcasters in each territory here.", "Australia v India will take place on Saturday, 13 January 2024 at Ahmad bin Ali Stadium, Al Rayyan with a kick-off at 2:30pm local (10:30pm AEDT)."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Albania scored the fastest goal in Euros history against Italy after only 23 seconds.", "Spain left with nine points from nine, no goals conceded, for the first time.", "Spain became the first team to record a 100 per cent record after three matches at Euro 2024."], "ranking": [1, 2, 3]}
{"candidates": ["Ferran Torres scored the only goal of the match in the first half, securing a 1-0 victory for Spain.", "David Raya made a crucial save to deny Armando Broja from scoring.", "Kristjan Asllani had a well-struck shot saved by David Raya just before half-time.", "Robin Le Normand took out Armando Broja as he threatened to race through.", "Ferran Torres scored the only goal of the match in the 13th minute.", "David Raya made a fine save from Kristjan Asllani's powerful 25-yard strike.", "David Raya kept out Armando Broja's shot on the turn.", "Ferran Torres scored the only goal of the match in the 13th minute.", "David Raya made a crucial save from Kristjan Asllani's well-struck shot.", "Joselu showed great agility to hook a volley over the bar from Alejandro Grimaldo's cross.", "Armando Broja almost made an immediate impact off the bench but was denied by David Raya.", "Ferran Torres opened the scoring for Spain with a smart finish.", "Thomas Strakosha denied Álvaro Morata from close range.", "David Raya made a superb save from Armando Broja.", "Robin Le Normand took out Broja as he threatened to race through.", "Broja drew another save from Raya in the last minute.", "Ferran Torres scored his 20th international goal to give Spain a first-half lead.", "Dani Olmo provided an assist for Torres' goal with a well-constructed pass."], "ranking": [1, 5, 4, 10, 3, 6, 7, 3, 8, 12, 11, 2, 9, 14, 15, 13, 16, 17]}
{"candidates": ["Spain defeated Albania 1-0 on June 24, 2024, with Torres scoring in the 13th minute.", "Albania's Bajrami and Berisha received yellow cards in the 66th and 89th minutes respectively.", "Spain's Vivian received a yellow card in the 90th minute.", "Torres scored in the 13th minute", "Bajrami scored in the 66th minute", "Berisha scored in the 89th minute", "Vivian received a card in the 90th minute"], "ranking": [1, 3, 4, 2, 7, 7, 5]}
{"candidates": ["Sylvinho acknowledged that Albania was in a tough group with Italy, Croatia, and Spain, and they knew advancing to the second round was unlikely.", "Sylvinho mentioned that even Spain's B team could play the final and still be favorites.", "Spain had already secured top spot in Group B thanks to wins over Croatia and Italy.", "Coach Luis de la Fuente made 10 changes to Spain's starting line-up.", "Spain coach Luis de la Fuente made 10 changes to the side that began the victory over reigning champions Italy.", "Albania's thousands of fans created a fever pitch atmosphere as kickoff approached on a sultry summer evening alongside the River Rhine.", "Sylvinho, Albania’s coach, mentioned that people claimed they would lose heavily in their group matches.", "Sylvinho acknowledged that Spain's B team could still be favorites to win the final.", "Spain's manager Luis de la Fuente made 10 changes to the starting XI, a significant rotation in the tournament's history."], "ranking": [8, 6, 5, 4, 3, 9, 7, 2, 1]}
{"candidates": ["Albania displayed pride and determination despite the loss, competing fiercely against Spain.", "The Albanian team and fans left the match proud of their performance.", "Spain maintained their 100% record at Euro 2024 and eliminated Albania.", "Albania finished bottom of Group B and were eliminated from the tournament.", "Spain will play their last-16 tie on Sunday in Cologne against a third-placed finisher from one of Group A, D, E or F.", "Julien Laurens praised Spain as they continue to impress after beating Albania 1-0.", "Spain coach Luis de la Fuente received food for thought from several players as the business end of the tournament looms.", "Spain matched their feat of 2008 when they also won every group game on the way to the title.", "Albania's hopes of a first venture into the knockout rounds were crushed as they finished bottom of the group with one point.", "Sylvinho expressed pride in his team's performance despite the loss.", "Sylvinho described the experience as 'gold' and something he wouldn't change for anything.", "Spain's victory underlined their credentials as a team with quality and depth.", "De la Fuente praised the spirit and commitment within the squad.", "Albania was eliminated from the tournament."], "ranking": [12, 11, 1, 14, 13, 5, 8, 2, 10, 9, 6, 4, 3, 7]}
{"candidates": ["L. Traoré scored two goals for Burkina Faso in the 35th and 38th minutes.", "H. Bandé scored a penalty for Burkina Faso in the 60th minute.", "Z. Nkhoma scored a goal for Malawi in the 80th minute.", "Lassina Traoré scored a quick double in the first half (35th, 38th minute).", "Hassane Bandé scored the third goal for Burkina Faso (60th minute, penalty).", "Zeliat Nkhoma reduced the deficit for Malawi late in the match (80th minute)."], "ranking": [4, 3, 2, 1, 5, 6]}
{"candidates": ["Traore scored in the 35th and 38th minutes for Burkina Faso.", "Bande scored a penalty in the 60th minute for Burkina Faso.", "Nkhoma scored in the 80th minute for Malawi.", "Chaziya received a yellow card in the 59th minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Burkina Faso drew their first match 1-1 against Senegal with a last-minute equalizer by Ousseni Bouda.", "Malawi lost their first match 3-2 at home to Burundi.", "Burkina Faso has not won in their last eight games in all competitions.", "Malawi has only won one of their last six games in all competitions.", "Burkina Faso host Malawi on Sunday in the Africa Cup of Nations qualifiers, with both teams seeking a crucial win following their opening results in the campaign.", "Burkina Faso’s Defensive Struggles: Burkina Faso have failed to keep a clean sheet in their last eight matches across all competitions.", "Malawi’s Attacking Threat: Malawi have averaged two goals per game in AFCON qualifying so far.", "Head-to-Head Dominance: Burkina Faso have won four of their last six encounters with Malawi.", "Burkina Faso will host Malawi in Bamako, Mali, due to a lack of a suitable venue in their home country.", "Burkina Faso secured a hard-fought 1-1 draw against Senegal, while Malawi were left ruing a 3-2 defeat at home to Burundi."], "ranking": [8, 7, 5, 4, 2, 6, 3, 1, 9, 10]}
{"candidates": ["Burkina Faso have gone unbeaten in all six previous clashes against Malawi.", "Malawi have lost four of their five official games this year.", "Burkina Faso are winless in their last eight official clashes, drawing three of their last four.", "Senegal moved top of Group L after beating Burundi 1-0 at Bingu National Stadium. Ismaila Sarr scored from the penalty spot in the 71st minute as Senegal registered their first win in the 2025 Afcon qualifiers.", "Burundi is second with three points while Burkina Faso is third with one point. The Flames anchor Group L without a point.", "Burkina Faso took the lead in Group L with a better goal difference compared to Senegal."], "ranking": [1, 5, 3, 6, 4, 2]}
{"candidates": ["Lautaro Martínez is the tournament’s top scorer with nine goals since his debut in the 2019 CONMEBOL Copa América.", "Argentina has won their first three matches of a CONMEBOL Copa América tournament on 18 occasions, but this is only the third time they’ve done so in their last 12 participations (2007 and 2016).", "Argentina averaged 74% possession against Peru, matching their second-highest possession rate in the CONMEBOL Copa América since at least the 2011 edition.", "Argentina concluded their participation in the group stage of the 2024 CONMEBOL Copa América with three wins in three matches, without conceding any goals while scoring all their goals after half-time.", "Lautaro Martínez finished the group stage as the Argentine player with the most shots (9) and the most goals (four out of Argentina’s five).", "Argentina recorded their 13th victory against Peru in the CONMEBOL Copa América in 18 meetings (2 draws, 3 losses). This was the fifth time that the Albiceleste kept a clean sheet.", "Out of the last 16 penalties taken against Peru in the CONMEBOL Copa América (including shootouts), seven were not converted (44%)."], "ranking": [1, 3, 5, 2, 4, 6, 7]}
{"candidates": ["Martinez scored at 47' and 86'", "Paredes scored at 67'", "Guerrero received a yellow card at 28'", "Cartagena received a yellow card at 36'", "Flores received a yellow card at 53'", "Zambrano received a yellow card at 88'", "Cueva received a yellow card at 90+4'"], "ranking": [1, 2, 5, 6, 4, 3, 7]}
{"candidates": ["Lionel Messi did not play due to a thigh injury.", "Lionel Scaloni, Argentina's manager, was serving a one-match touchline ban.", "Argentina were expected to make wholesale changes to their starting XI as they had already secured progression to the quarter-final.", "Opta prediction favored Argentina to win with a 75.8% probability.", "Argentina had already secured a place in the quarter-finals before the match.", "Lionel Messi was out due to a groin injury, and manager Lionel Scaloni was serving a touchline ban.", "Argentina will meet Peru in the last round of group-stage matches at the 2024 Copa America, on June 29 at 8:00 PM ET.", "Argentina is -170 to win this group-stage game, Peru is +550, and the draw is +275.", "Sportsbooks have set 1.5 goals as the over/under for this game.", "We are predicting Argentina to win, with a 63.0% chance of winning this match, based on the moneyline.", "Argentina is fifth in the Copa America in goals scored (three overall, 1.5 per game), and Peru is second in goals conceded (one overall, 0.5 per game).", "In international matches the past two years, Argentina has scored 35 goals (2.2 per game) and Peru has given up 16 goals (1.0 per game).", "Peru has not scored a goal yet in this tournament, and Argentina has not conceded a goal yet.", "In international matches the past two years, Peru has scored 10 goals (0.6 per game) and Argentina has given up four goals (0.3 per game).", "Argentina has outscored opponents 3-0 in the Copa America, and its +3 goal differential is third in the tournament. It was +31 the past two years.", "In terms of goal differential, Peru is ninth in the Copa America at -1. It was -6 the past two years.", "Argentina had already qualified for the quarter-finals before the match in Miami with wins over Canada and Chile, the other teams in the group.", "That security allowed the defending champions to rest key players, including captain Lionel Messi.", "Messi, who celebrated his 37th birthday on Monday, is recovering from a thigh injury he picked up during their win over Chile on Tuesday. He is expected to return for their quarterfinal match on Thursday in Houston against the Group B runner-up."], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17, 18, 19]}
{"candidates": ["Eight-time Ballon d'Or winner Lionel Messi will miss Argentina's final Group A fixture at the 2024 Copa America against Peru due to a sore throat, fever, and a tweaked right hamstring.", "Manager Lionel Scaloni, who will serve a touchline ban, has confirmed that changes will be made to his starting lineup and those who did not feature in Argentina's first two group matches will play against Peru.", "A change in goal could be on the cards, with both Franco Armani and Geronimo Rulli set to battle for a starting spot ahead of first-choice shot-stopper Emiliano Martinez.", "Lucas Martinez Quarta and German Pezzella are yet to feature at this summer's tournament, while Nicolas Otamendi has made just one substitute outing, and all three centre-backs will compete for a start ahead of Lisandro Martinez and Cristian Romero.", "Exequiel Palacios and Guido Rodriguez are in contention to start in centre-midfield, with Enzo Fernandez in line to drop out of the first XI and be given a rest having only just recovered from a groin problem.", "In the absence of Messi, Lautaro Martinez could start his first game of the tournament after scoring two goals in two games as a substitute, while Manchester United's Alejandro Garnacho will be pushing to make his Copa America debut at the expense of either Nicolas Gonzalez or Rodrigo de Paul.", "Argentina, the reigning world champions, aimed to maintain their perfect record in Group A", "Peru needed maximum points to have any chance of escaping the group stage", "Argentina secured their spot in the quarter-finals after beating Chile 1-0", "Argentina had lost just two of their last 59 international matches since 2019", "Peru had only accumulated one point from their opening two Group A fixtures", "Peru needed to beat Argentina and hope for a draw between Canada and Chile to progress", "Argentina face Peru in a Copa America game on Saturday, June 29, 2024, at Hard Rock Stadium in Miami Gardens, Florida.", "Lionel Messi hopes a leg injury sustained during Argentina’s 1-0 Copa America win over Chile is 'nothing serious'.", "Argentina coach Lionel Scaloni said he’s planning to rest several starters in Argentina’s last Group A match, against Peru on Saturday in Florida.", "Argentina will win the group unless it loses to Peru in Miami Gardens and Canada beats Chile in a game played simultaneously in Orlando."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]}
{"candidates": ["Lautaro Martínez has stepped up in the tournament, scoring in all three of Argentina’s group games and leading the race for the Golden Boot with four goals.", "This is the first time Peru has been eliminated from the Copa America without a single victory since 1995.", "Lautaro Martínez expressed his happiness for scoring in the three group-stage games and helping the team.", "Martínez mentioned that he felt ready to get rid of the thorn from the World Cup and prepared well for the Copa America.", "Despite the absence of their coach Lionel Scaloni, suspended and fined for late second-half starts in two previous matches, and a much-changed starting line-up, Argentina were largely untroubled by their opponents.", "Lautaro Martínez expressed his enjoyment of playing for Argentina and his desire to prove himself to the coach.", "Argentina assistant Walter Samuel commented on Messi's injury status, stating that Messi is getting better but it is too early to tell if he will play in the next match.", "Peru coach Jorge Fossati described Peru’s performance as the weakest of their three games."], "ranking": [1, 2, 5, 6, 3, 7, 4, 8]}
{"candidates": ["The match took place at Hard Rock Stadium in Miami Gardens, Florida.", "There was a 30% chance of precipitation at kickoff time with a temperature of 87°F.", "Peru faced the possibility of being eliminated without winning a single game for the first time since 1995.", "Lautaro Martinez had scored five times in his last five international games.", "Argentina recorded a total of 18 shots on goal in their first two games, more than the sum of all three other teams in Group A.", "Argentina aimed to win all three of their group-stage games at Copa America for the third time this century.", "The match was held at the Hard Rock Stadium in Miami.", "Argentina will face the runner-up of Group B in their quarter-final.", "Canada took second place in Group A after their 0-0 draw with Chile.", "The match took place at Hard Rock Stadium in Miami Gardens, Florida, USA with an attendance of 64,972.", "Referee for the match was César Arturo Ramos Palazuelos.", "Argentina had 74.3% possession compared to Peru's 25.7%.", "The match was held at Hard Rock Stadium in Miami Gardens, Florida, USA, with an attendance of 64,972.", "The match was played in front of about 64,000 fans at the Miami Dolphins’ Hard Rock Stadium.", "Argentina controlled possession (74%) and had six shots on goal.", "Argentina will face the runner-up of Group B in the knockout stage on Thursday in Houston.", "Argentina aims for a record 16th Copa America title.", "Peru was held without a goal for the third game of the tournament."], "ranking": [15, 18, 6, 8, 4, 7, 17, 12, 16, 14, 11, 13, 10, 9, 5, 3, 2, 1]}
{"candidates": ["Argentina topped a Copa America group for the first time since 2016", "Peru was at risk of exiting the Copa America group stage for the first time since 1995"], "ranking": [1, 2]}
{"candidates": ["Angel Di Maria scored the only goal of the match in the 40th minute.", "Lionel Messi made his return to international football after a six-month hamstring injury, coming on in the 56th minute.", "Di Maria's goal was his second consecutive goal in an international match, tying him with Gonzalo Higuain for the fifth-most goals in Argentina's history.", "Ángel Di María scored the first goal of the match as he received the ball, played it to Rodrigo De Paul and continued his run into the penalty area. De Paul found Cristian Romero who held the ball and passed it onto Di María and he would score to give Argentina the 1-0 lead.", "Di María nearly made it 2-0 just moments later off a free kick but his effort hit the crossbar.", "Lionel Messi replaced Ángel Di María and Enzo Fernández replaced Lautaro Martínez.", "Rodrigo De Paul crossed to Lautaro but his unmarked header would fall straight to the goalkeeper.", "Scaloni would bring on Ángel Correa and Nicolás González who replaced Julián Álvarez and Leandro Paredes.", "Lucas Martínez Quarta was brought on for Gonzalo Montiel and played as a left back and Exequiel Palacios was substituted in for Rodrigo De Paul.", "Ángel Di María scored the only goal of the match in the 40th minute after a through ball from Cristian Romero.", "Lionel Messi replaced Ángel Di María in the 56th minute.", "Ángel Di María scored the only goal of the match for Argentina in their 1-0 win against Ecuador.", "Angel Di Maria scored the only goal of the match in the 40th minute, securing a 1-0 victory for Argentina over Ecuador.", "Lionel Messi attempted a left-footed shot from a difficult angle and long range on the left, which was high and wide to the right from a direct free kick in the 90'+6' minute."], "ranking": [5, 2, 3, 1, 4, 6, 8, 9, 10, 7, 11, 12, 13, 14]}
{"candidates": ["Angel di Maria scored the only goal for Argentina in the 40th minute.", "Gonzalez scored in the 90+1 minute to secure the win for Argentina.", "Caicedo received a yellow card in the 11th minute.", "Gruezo received a yellow card in the 66th minute."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Argentina head coach Lionel Scaloni decided to sit Messi for the first half to ensure he arrives in optimal conditions for the Copa America.", "Scaloni emphasized the importance of playing against a high-level rival like Ecuador to prepare for the Copa America."], "ranking": [1, 2]}
{"candidates": ["Argentina has not lost in their last seven meetings with Ecuador, a streak dating back to 2019.", "Di Maria's 31st goal for Argentina places him just four goals behind Diego Maradona on the country's all-time leaderboard.", "The match was a pre-Copa América friendly held in Chicago.", "Attendance for the match was 51,090.", "The match was a pre-Copa America friendly held in Chicago, Illinois, USA.", "The attendance for the match was 51,090 spectators."], "ranking": [2, 1, 5, 6, 4, 3]}
{"candidates": ["Erling Haaland became Norway's highest international scorer with 34 goals.", "Erling Haaland became Norway's all-time top goalscorer."], "ranking": [1, 2]}
{"candidates": ["Marko Arnautovic scored the opening goal for Austria by rifling a shot in off the underside of the bar.", "Alexander Sorloth equalized for Norway from a set-piece delivery by Julian Ryerson.", "Marko Arnautovic scored a penalty for Austria after Christoph Baumgartner was fouled by Andreas Hanche-Olsen.", "Philipp Lienhart scored Austria's third goal with a towering header from a Romano Schmid corner.", "Stefan Posch scored Austria's fourth goal with a header from a Marcel Sabitzer cross.", "Michael Gregoritsch scored Austria's fifth goal from another Marcel Sabitzer cross."], "ranking": [3, 2, 4, 5, 6, 1]}
{"candidates": ["Marko Arnautovic scored twice for Austria, including a penalty.", "Philipp Lienhart, Stefan Posch, and Michael Gregoritsch each scored for Austria.", "Alexander Sorloth scored for Norway.", "Norway's players Berge, Hanche-Olsen, and Myhre received yellow cards."], "ranking": [2, 1, 3, 4]}
{"candidates": ["Erling Haaland wore the captain’s armband for Norway in the absence of Martin Odegaard."], "ranking": [1]}
{"candidates": ["Experts noted that Norway, led by Erling Haaland, were the group leaders and unbeaten.", "Austria was under pressure to perform after a loss to Norway and a draw in their previous matches.", "Ralf Rangnick emphasized the importance of the match for Austria's promotion hopes.", "Norway's Erling Haaland was highlighted as a key player due to his recent scoring form.", "Austria have scored six goals in their first three Nations League matches, averaging two goals per game.", "Norway have conceded three goals in three of their last six away matches, highlighting their vulnerability on the road.", "Erling Haaland has averaged 0.94 goals per game for Norway, making him the primary threat to Austria’s defence.", "Austria’s recent demolition of Kazakhstan, where they scored four goals, has bolstered their confidence.", "Austria have struggled against Norway in recent meetings, winning just once in their last four encounters.", "Austria’s high possession stats (61.7%) demonstrate their ability to control the tempo and keep the pressure on their opponents.", "Austria’s midfield creativity, spearheaded by Marcel Sabitzer and Christoph Baumgartner, ensures they will likely break through the Norwegian defence.", "Norway’s inconsistency on the road and the absence of their influential captain Martin Ødegaard might leave them exposed at the back."], "ranking": [7, 5, 3, 9, 2, 10, 11, 4, 1, 6, 8, 12]}
{"candidates": ["Austria's victory drew them level on points with Norway at the top of UEFA Nations League Group B3.", "This win was Austria's second victory in the last seven meetings between the sides.", "Norway experienced their first defeat in five matches without Martin Odegaard."], "ranking": [1, 3, 2]}
{"candidates": ["Ralf Rangnick may reflect on the importance of the victory for Austria's promotion hopes.", "Norway's coach Stale Solbakken might discuss the impact of Haaland's record-breaking performance despite the loss."], "ranking": [2, 1]}
{"candidates": ["The floodlights temporarily failed during the match, plunging the stadium into darkness.", "Marko Arnautovic was named Flashscore Man of the Match."], "ranking": [2, 1]}
{"candidates": ["The match was held at Raiffeisen Arena in Linz.", "Austria's captain David Alaba was unavailable due to injury.", "Norway's captain Martin Odegaard was also sidelined due to an ankle injury."], "ranking": [3, 2, 1]}
{"candidates": ["Nishan Velupillay became the first Aussie of Sri Lankan descent to represent the Socceroos."], "ranking": [1]}
{"candidates": ["Nishan Velupillay scored a goal at 90'+2' to secure the victory for Australia.", "Craig Goodwin scored a goal at 53' for Australia.", "Xie Wenneng scored a goal at 20' for China.", "Xie Wenneng scored the opening goal for China after 19 minutes.", "Lewis Miller scored his first international goal just before the break.", "Craig Goodwin scored a spectacular goal from outside the area eight minutes after the restart.", "Nishan Velupillay scored in stoppage time on his debut international appearance.", "Australia came from behind to beat China 3-1.", "Goals from Lewis Miller, Craig Goodwin, and debutant Nishan Velupillay secured the victory for Australia.", "China took the lead in the 20th minute against the run of play.", "Craig Goodwin scored a screamer to give the Socceroos the lead.", "Xie Wenneng scored against the run of play in the first half, giving China the lead.", "Lewis Miller scored a header in first-half stoppage time to level the score.", "Nishan Velupillay scored a debut goal in stoppage time to secure the victory for the Socceroos.", "Australia defeated China 3-1.", "Velupillay scored on his international debut.", "Craig Goodwin was named player of the match.", "China opened the scoring.", "Australia equalized.", "Australia took the lead.", "Velupillay scored the final goal in stoppage time."], "ranking": [1, 5, 4, 3, 7, 2, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]}
{"candidates": ["Australia went into the game after a shock 1-0 home loss to Bahrain and a scoreless draw in Indonesia, leaving them in a perilous position in Asian Group C.", "The match marked Tony Popovic's first game as coach of Australia after the departure of Graham Arnold."], "ranking": [1, 2]}
{"candidates": ["New coach Tony Popovic has steered the Socceroos to a 3-1 victory against China to revitalise hopes of qualifying for the World Cup.", "Tony Popovic's first game in charge resulted in a 3-1 victory for Australia.", "Popovic was hired last month after the resignation of Graham Arnold as head coach.", "Socceroos skipper Jackson Irvine praised the team's calm and composed approach, even after conceding the first goal.", "Craig Goodwin commented that his goal was 'exactly how I imagined it' and praised the team's character in responding to previous poor results.", "Goalkeeper Joe Gauci noted the team's patience and trust in their opportunities, which was different from their previous games.", "Joe Gauci expressed happiness over the record crowd and described the match as a positive step.", "Craig Goodwin reflected on the team's performance and life under coach Tony Popovic."], "ranking": [1, 2, 8, 5, 3, 6, 4, 7]}
{"candidates": ["The match was held at Adelaide Oval with an attendance of 46,219.", "Australia had 72.7% possession compared to China's 27.3%.", "Australia had 18 shot attempts with 4 on goal, while China had 7 shot attempts with 1 on goal.", "The match was held at the Adelaide Oval with a crowd of 46,000.", "Australia is aiming for a sixth straight World Cup appearance.", "Australia is second in Group C above Saudi Arabia.", "The match was played in front of 46,291 fans at Adelaide Oval.", "The match was Tony Popovic's first as coach of the Socceroos.", "The attendance at Adelaide Oval was 46,291.", "China has now lost four-straight internationals for the first time since 2003.", "Tony Popovic's first match in charge resulted in a win.", "The match had a record crowd turnout in South Australia."], "ranking": [10, 8, 9, 6, 5, 4, 1, 3, 2, 7, 11, 12]}
{"candidates": ["Tickets for this match start from $15 Child, $20 Concession, $29 Adult, and $58 Family via Ticketek.", "The Subway Socceroos FIFA World Cup 2026™ Qualifiers will be broadcast live thanks to Football Australia’s broadcast partner, Paramount Australia."], "ranking": [2, 1]}
{"candidates": ["Australia's Alessandro Circati will be sidelined for the remainder of the 2024-25 campaign due to a cruciate ligament injury.", "Conor Metcalfe is also unavailable for Australia due to a groin strain.", "Australia may make attacking alterations with Awer Mabil and Joshua Nisbet pushing for starts.", "China may stick with a centre-back pairing of Tyias Browning and Chenjie Zhu despite conceding two goals against Saudi Arabia last month.", "Match Details: Subway Socceroos v China PR, Thursday, 10 October 2024, Adelaide Oval, Adelaide, Kick-off: 7:30 pm ACDT (8:00pm AEDT). Tickets: Start from $15 Child, $20 Concession, $29 Adult, and $58 Family. Tickets from Ticketek. Broadcast: 10, 10 Play and Paramount+."], "ranking": [3, 4, 2, 1, 5]}
{"candidates": ["Rodrygo scored the only goal of the match in the 30th minute with a stunning long-range strike.", "Lucas Paqueta provided the assist for Rodrygo's goal.", "Alisson Becker made a crucial save in first-half stoppage time to deny Moises Caicedo.", "Brazil's forward Rodrygo scored the only goal of the match during the 2026 FIFA World Cup South American qualifiers football match between Brazil and Ecuador.", "Rodrygo's goal came in the 29th minute, with his effort deflecting off a defender and hitting the right post before finding the back of the net.", "Defender Gabriel Magalhaes denied Moises Caicedo's effort with a last-minute goal-line clearance right before the break.", "Rodrygo scored a goal in the first half, leading Brazil to a 1-0 victory over Ecuador.", "Rodrygo's goal was a shot from outside the box that was deflected by a defender to the right post in the 30th minute.", "Real Madrid forward Rodrygo scored the only goal as Brazil secured a 1-0 victory over Ecuador.", "Rodrygo's deflected 30th-minute strike was enough to secure all three points for Brazil.", "Despite dominating possession for long periods, Brazil created little in the way of clear-cut scoring chances, with only three shots on goal.", "Rodrygo scored a goal, assisted by Lucas Paqueta at the 30th minute.", "K. Paez substituted in for J. Sarmiento at the 45th minute.", "Estevao substituted in for Luiz Henrique at the 62nd minute.", "Gerson substituted in for B. Guimaraes at the 62nd minute.", "J. Mercado substituted in for K. Rodriguez at the 68th minute.", "Wendell substituted in for G. Arana at the 74th minute.", "L. Moura received a yellow card at the 78th minute.", "Y. Medina Ortiz substituted in for P. Estupinan at the 85th minute.", "Brazil won 1-0 at home over Ecuador, the goal was scored by Rodrygo at minute 30'.", "Yellow card for Lucas Moura of Brazil after a foul in the opponent's half on Carlos Gruezo.", "Four minutes of added time will be played in the second half.", "Rodrygo scored the only goal of the match in the 29th minute with a deflected shot.", "Gabriel Magalhães made a crucial goal-line clearance to deny Moisés Caicedo's effort right before the break."], "ranking": [1, 5, 3, 7, 2, 4, 6, 8, 9, 10, 11, 12, 15, 16, 17, 18, 19, 20, 13, 14, 21, 22, 23, 24]}
{"candidates": ["We are ready to bring you the broadcast of the match between Brazil and Ecuador, valid for matchday seven of the South American Qualifying Round for the 2026 World Cup.", "The match between Brazil and Ecuador will take place at the Major Antônio Couto Pereira Stadium in the city of Curitiba (Brazil).", "One of the players to take into account in Ecuador is Kevin Rodriguez, the 24 year old center forward is currently playing for Club Union St. Gilloise of Belgium.", "One of the most outstanding players in Brazil is Rodrygo, the 23-year-old center forward is currently playing for Club Real Madrid of Spain.", "In total, both squads have met five times since 2016, Brazil dominates the record with four wins, no draws have been recorded and Ecuador has won one match.", "Ecuador has been performing well in the current edition of the South American Qualifiers for the 2026 World Cup.", "Brazil has been performing well in the South American Qualifiers for the 2026 World Cup."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Brazil will resume their 2026 World Cup qualifying campaign when they welcome Ecuador to Estadio Major Antonio Couto Pereira on Friday.", "Brazil boss Dorival Junior experienced disappointment in his first tournament in charge of the national team after being eliminated in the quarter-finals of the Copa America.", "Despite an underwhelming tournament, Dorival has not lost in regulation time in any of his eight matches in charge.", "Brazil began their qualifying campaign with back-to-back wins and a draw against Venezuela, followed by three defeats against Uruguay, Colombia, and Argentina.", "Brazil will be confident of taking something from Friday's contest against Ecuador, having avoided defeat in each of their last 12 head-to-head matches.", "Ecuador also experienced penalty-shootout disappointment in the quarter-finals of the 2024 Copa America.", "Felix Sanchez left his post following Ecuador's Copa America exit and was replaced by Sebastian Beccacece.", "Ecuador have put together a five-game unbeaten run in World Cup qualifying and are sitting one place above Brazil despite a three-point deduction for fielding an ineligible player in the previous qualifying cycle.", "Brazil are without Neymar, who is recovering from an anterior cruciate ligament injury.", "Borussia Dortmund's Yan Couto and Manchester City's Savinho have withdrawn from Brazil's squad due to injury.", "Real Madrid defender Eder Militao has been ruled out for the next two fixtures after sustaining a thigh injury.", "Dorival has called up 17-year-old Palmeiras attacker Estevao Willian.", "With Raphinha suspended, Dorival could select an all-Real Madrid forward line of Rodrygo, Vinicius Junior, and Endrick.", "Ecuador are unable to call upon defender Christian Ramirez due to an ankle injury.", "Brighton & Hove Albion's Pervis Estupinan has returned to the fold and is expected to start against Brazil.", "Ecuador's all-time leading scorer Enner Valencia will spearhead the attack.", "The match between Brazil and Ecuador will take place on Friday, September 6, 2024, at 22:00 at Couto Pereira in Curitiba.", "The match is part of the seventh round of the World Cup 2026 Qualifiers.", "Brazil, coached by Dorival Júnior, is in 6th place with 7 points, having two wins, one draw, and three losses.", "Ecuador, coached by Sebastián Beccacece, is in 5th place with 8 points, having three wins, two draws, and one loss.", "Ecuador lost 3 points at the beginning of the Qualifiers due to the Byron Castillo case.", "Dorival Júnior's squad selections for the World Cup qualifiers include a significant number of Brazil-based players.", "The likely starting XI for Brazil includes Alisson, Danilo, Éder Militão, Gabriel Magalhães, Guilherme Arana; André, Bruno Guimarães, Lucas Paquetá; Rodrygo, Vini Júnior, Endrick.", "Brazil's disappointing quarterfinal exit from the Copa América is influencing current squad selections.", "Dorival Júnior has replaced several Europe-based players with Brazil-based players, including André, Gerson, Luiz Henrique, Pedro, and Estêvão.", "Dorival Júnior's squad selection suggests a shift towards Brazil-based players, possibly due to various factors such as match fitness or external pressures.", "Ecuador's recent performance has been inconsistent, especially when not playing at altitude."], "ranking": [14, 10, 12, 16, 8, 11, 9, 5, 20, 18, 22, 7, 15, 13, 6, 4, 3, 2, 1, 21, 19, 17, 24, 25, 26, 23, 27]}
{"candidates": ["Brazil dominated possession but failed to create clear chances throughout the match.", "Ecuador applied physically aggressive pressure, making it difficult for Brazil to get inside their box and forcing them to resort to long-range strikes.", "Brazil's performance was lackluster, with only two shots on target in the first half and a single shot on target in the second half.", "The match was played at the Major Antônio Couto Pereira stadium in Curitiba, Brazil.", "Possession: 57% Brazil - Ecuador 43%", "Total shots: 10 Brazil - Ecuador 9", "Shots on goal: 3 Brazil - Ecuador 2", "Total Passes: 611 Brazil - Ecuador 450", "Fouls: 8 Brazil - Ecuador 17", "Brazil dominated possession but struggled to create clear chances.", "Ecuador applied physically aggressive pressure, making it difficult for Brazil to penetrate their defense.", "The match had an attendance of 36,914."], "ranking": [5, 2, 3, 12, 10, 9, 8, 7, 6, 4, 1, 11]}
{"candidates": ["The match will be broadcast on Globo and SporTV, with real-time updates available on CNN Esportes."], "ranking": [1]}
{"candidates": ["Algeria defeated Togo with a score of 5-1 on October 10, 2024.", "Saïd Benrahma scored at 29' and 55' (penalty)", "Houssem Aouar scored at 68'", "Amine Gouiri scored at 86'", "Mohamed Amoura scored at 90'+5'", "Thibault Klidje scored at 11'", "Hicham Boudaoui received a yellow card at 90'+3'"], "ranking": [1, 3, 4, 5, 6, 2, 7]}
{"candidates": ["Benrahma scored at 29' and 55' (penalty)", "Aouar scored at 68'", "Gouiri scored at 86'", "El Amine Amoura scored at 90+6'", "Boudaoui scored at 90+3'", "Klidje scored at 11'", "Dakonam received a yellow card at 46'", "Ouro-Gneni received a yellow card at 53'", "Romao received a yellow card at 74'"], "ranking": [1, 3, 5, 6, 4, 2, 8, 7, 9]}
{"candidates": ["Algeria eager to preserve their perfect start to the campaign", "Algeria has not lost an AFCON qualifying match on home soil since 2007", "Algeria's 16-game unbeaten streak in AFCON qualifiers", "Algeria's star-studded roster featuring Riyad Mahrez and Islam Slimani", "Togo has drawn both of their opening group games", "Togo's manager Dare Nibombe appointed in July", "The match between Algeria and Togo on October 10, 2024, is a decisive qualifier for the 2025 Africa Cup of Nations.", "Algeria, having won their first two matches, aims to extend their winning streak and solidify their position at the top of Group E.", "Togo, despite a mixed start to their campaign, seeks to surprise one of the continent's most formidable teams.", "Algeria is favored to win, but their defense has shown vulnerability, conceding goals in 6 of their last 9 matches.", "Togo has demonstrated offensive capability, scoring in 10 of their last 12 matches, including a late goal in their recent match against Equatorial Guinea.", "The Togolese national football team will face a significant challenge in their upcoming matches against Algeria, scheduled for October 10 and 14, 2024, as their starting goalkeeper, Jeffrey Agboloso, will be absent due to ankle surgery.", "Jeffrey Agboloso, a key player for Togo, was injured during training and had been a crucial part of the team in previous qualification matches against Liberia and Equatorial Guinea.", "The Togolese team is currently preparing in Tunisia and will travel to Annaba, Algeria, to face the Algerian team.", "The absence of Agboloso could impact the dynamics of the game, as he had shown great determination and impressive skills in previous matches.", "The Togolese Football Federation is considering alternative solutions to replace Agboloso, hoping that this situation will not disrupt the team's performance."], "ranking": [5, 2, 1, 3, 14, 15, 6, 4, 8, 7, 9, 10, 12, 11, 13, 16]}
{"candidates": ["Algeria had 64% possession compared to Togo's 36%", "The match was held at Stade du 19 Mai 1956 in Annaba, Algeria with an attendance of 60,000"], "ranking": [1, 2]}
{"candidates": ["Merih Demiral scored the fastest ever goal in a European Championship knockout match.", "Austria conceded the fastest-ever goal in the knockout stage of a European Championship after just 57 seconds."], "ranking": [1, 2]}
{"candidates": ["Austria were known for their fast starts, having scored early in previous matches and even holding the record for the fastest goal in international football."], "ranking": [1]}
{"candidates": ["Turkey will be without the services of inspirational captain Hakan Calhanoglu for their last-16 contest against Austria at this summer's European Championship.", "Vincenzo Montella's side booked their spot in the knockout stage of Euro 2024 on Wednesday night courtesy of a 2-1 success over the Czech Republic, which saw them finish second in Group F.", "Calhanoglu sent Turkey ahead in the 50th minute of the clash with a rasping strike, but the 30-year-old, who plays his club football for Inter Milan, will be suspended against Austria on Tuesday, having been booked for remonstrating with the referee after the Czech Republic goal.", "Montella paid tribute to the captain for his 'extraordinary goal' in what was an ill-tempered affair, with 16 yellow and two red cards being issued by the referee.", "Turkey picked up six points from their three games in Group F to finish second behind Portugal, with the national side in the last-16 stage of a European Championship for the first time since Euro 2008, when they progressed to the semi-finals.", "Montella told UEFA's official website that they managed to overcome difficult situations and want to enjoy the victory, but starting on Thursday they will concentrate on the next match and aim to continue making history.", "Montella mentioned that some of their players will not play in the Austria match, and they will feel their absence. They need to recover and have six days ahead of them.", "Montella highlighted that Austria came out on top of a very tough group (which also featured France and the Netherlands). They are very fast, very fluid, a team worthy of great admiration.", "Montella noted that only three of the starting 11 today had played at a European Championship before and hopes their success in making it out of the group will relieve some pressure.", "Turkey were knocked out in the group stage of both Euro 2016 and Euro 2020, with their run to the semi-finals of Euro 2008 proving to be their best-ever performance in the competition.", "Should Montella's side navigate their way past Austria in the round of 16, they would take on either Romania or Netherlands in the quarter-finals of the competition."], "ranking": [5, 8, 2, 6, 1, 9, 10, 4, 7, 3, 11]}
{"candidates": ["Austria exits the Euros at the same stage as in the previous tournament.", "Turkey's lack of tactical intelligence was highlighted despite their entertaining play.", "Turkey's victory over Austria secured their spot in the Euro 2024 quarterfinals.", "Turkey coach Vincenzo Montella emphasized the importance of team spirit from the first minute to the last minute.", "Vincenzo Montella highlighted the historic nature of the result, matching Turkey's 2008 victories.", "Austria's coach Ralf Rangnick reflected on the team's efforts and the lack of necessary luck, comparing Gunok's save to Gordon Banks' famous stop.", "Turkey's goalkeeper Mert Gunok pulled off what could be the save of the tournament in the final minute of added time.", "Turkey will now face the Netherlands in Berlin on Saturday as the final Euro 2024 quarter-final was confirmed.", "Turkey are carrying a lot of injuries, suspensions, and potential suspensions into the business end of the tournament, but they also have momentum.", "Ralf Rangnick, Austria manager, expressed disbelief at being eliminated and emphasized the need to carry the experience into future competitions.", "Mert Gunok, Turkey goalkeeper, expressed confidence and morale boost from the win."], "ranking": [8, 6, 2, 9, 3, 5, 1, 10, 7, 4, 11]}
{"candidates": ["Heavy rain in Leipzig affected the match, exaggerating slide tackles and adding to the chaos.", "Both sets of supporters threw objects onto the pitch, with a coin from the Turkish end striking Austria’s Marcel Sabitzer on the head.", "Turkey's Arda Guler was pelted with cups thrown from the stands.", "The match was held at Red Bull Arena in Leipzig, Germany, with an attendance of 38,305.", "Celebrations broke out across many cities in Germany as thousands of Turks took to the streets, honking car horns, waving flags and chanting.", "The match was played amid pouring rain.", "Attendance for the match was 38,305.", "Turkey's goals came from corner kicks, both whipped in by Arda Guler and finished off by Merih Demiral.", "Arda Guler orchestrated everything good that Turkey did, calmly kept possession, and drew fouls to alleviate the pressure on his side.", "Supporters threw plastic cups onto the pitch, causing interruptions.", "The match was played at a frenetic pace with relentless attacking from both sides.", "Rain in the second half added to the chaotic nature of the game."], "ranking": [5, 10, 8, 2, 1, 4, 3, 6, 9, 7, 11, 12]}
{"candidates": ["Raphael Onyedika scored for Nigeria in the 27th minute.", "Jodel Dossou scored for Benin in the 37th minute.", "Steve Mounié scored for Benin in the 45'+3' minute.", "Sodiq Ismail (Nigeria) was shown a yellow card for a bad foul in the 90'+3' minute.", "Benin come from behind to beat Nigeria 2-1 for dia group C World Cup qualifying match.", "Mounni score di winner for Benin afta Dossou bin equalise Nigeria goal wey Onyedike score.", "Nigeria dey fifth position wit four points for table, while Benin dey top group C wit seven points.", "If di oda teams for di group win dia games Nigeria go dey bottom of di group.", "Nigeria raced into the lead through Raphael Onyedika, who scored from outside the box in the 27th minute.", "Junior Olaitan scored for Benin after a defensive mix-up.", "Steve Mounié found space in the Nigeria box to poke past Stanley Nwabali from a corner."], "ranking": [8, 6, 5, 10, 1, 2, 9, 11, 7, 4, 3]}
{"candidates": ["The 2026 FIFA World Cup qualifying clash between Benin Republic and Nigeria in Abidjan today will be the defining moment for the Super Eagles in the race to who picks Group C ticket to the Mundial to be jointly hosted by Canada, USA and Mexico in two years’ time.", "After three draws and a miserable three points out of nine has left the three-time African champions strangely in fifth position, Coach Finidi George and his Super Eagles have no choice but get a win today against the Cheetahs if they want to remain in contention for the top prize.", "Interestingly, Eagles will go head-to-head with the Beninoise coached by the same man Nigeria fired from the senior national team job after leading the country to a third place finish at the AFCON 2019 in Egypt and a first round exit at the 2018 World Cup in Russia.", "Playing in this group having teams generally classified as minnows of African football like Lesotho, Rwanda, Benin Republic, Zimbabwe and South Africa, the Super Eagles have fared badly unable to win a single match out of three. It is the first time such is happening to the team since 1960!", "The draw against South Africa last Friday in Uyo means that Lesotho, who defeated Zimbabwe 2-0 earlier same day, remain top of their Group C standings with five points, while South Africa, Benin Republic and Rwanda are on four points, with Nigeria on three. Zimbabwe are at the bottom on two points.", "Coach Finidi George knows the implications of another dismal outing in the series. While signing the contract to take over from Portuguese gaffer, Jose Peseiro, he was told point blank that qualifying Nigeria for the 2026 World Cup was not negotiable, considering the fact that Super Eagles were absent at the last Mundial in Qatar.", "Finidi George stated, 'We’re very much aware of why we are here (in Abidjan) and what we have to do. The players want to go to the World Cup and they have resolved to give their all in every game going forward. We had our opportunities against South Africa on Friday and should have won, but that is gone and we face another challenge now.'", "Finidi George added, 'We have resolved not to look too far ahead in this race. The essence is to take it one match at a time. Benin Republic is in our front now, and we must deal with that squarely.'", "Eagles will not be strangers to the turf of the Stade Felix Houphouet-Boigny in Abidjan. It was at that venue they chalked up all three matches they played there during AFCON early in the year.", "Head coach of the senior national team of Nigeria, Finidi George, has made three changes to the team that drew 1-1 against South Africa in their world cup qualifiers game on Friday.", "Finidi’s team came from behind to draw 1-1, a result that leaves them 5th in the six-team group and two points behind group leaders Lesotho.", "The newly appointed coach has made changes to his starting lineup in reaction to the draw against South Africa.", "Kelechi Iheanacho has been dropped from the starting lineup with Samuel Chukwueze certain to start in his place.", "Raphael Onyedika, who impressed after coming on as a substitute on Friday, is included in the starting lineup.", "Benjamin Tanimu keeps his spot in the starting lineup for today’s game with Chidozie Awaziem remaining on the bench.", "The game will start at 5pm Nigerian time."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]}
{"candidates": ["West African neighbours Benin and Nigeria battle in Monday's World Cup qualifying match at Stade Felix-Houphouet-Boigny.", "Gernot Rohr could inflict even more misery on his old side when his current one host the three-time African champions on Monday.", "Rohr hopes his side give everything to build on the recent 1-0 triumph over Rwanda that elevated them to third in the standings, one ahead of the Super Eagles.", "The Cheetahs hope to be beneficiaries of the extra day's rest, keen to end the Super Eagles' undefeated start to qualifying.", "Finidi George's men have played 1-1 draws in qualifying against Lesotho, Zimbabwe and South Africa.", "George's men can put their three consecutive draws behind them by defeating Benin in Abidjan, potentially taking the Super Eagles top of the group if South Africa are unsuccessful against Zimbabwe and Lesotho and Rwanda play out a stalemate.", "Nigeria must get their act together and avoid being absent in consecutive editions for the first time since their maiden appearance in 1994.", "The Nigerian team trained on Sunday, June 9, 2024, at the Félix Houphouët Boigny stadium in preparation for the World Cup 2026 qualifier match against Benin scheduled for Monday, June 10, 2024.", "The Nigerian team trained on Sunday, June 9, 2024, at the Félix Houphouët Boigny stadium in preparation for the World Cup 2026 qualifier match against Benin scheduled for Monday, June 10, 2024."], "ranking": [8, 6, 5, 4, 3, 2, 1, 9, 7]}
{"candidates": ["Senator John Owan Enoh expressed dissatisfaction with the Super Eagles' performance, especially given the substantial support from President Bola Ahmed Tinubu's administration.", "Senator Enoh emphasized that Nigerian football fans demand and deserve answers and accountability from the NFF."], "ranking": [2, 1]}
{"candidates": ["The match ended with Benin 2, Nigeria 1.", "The game was held at Felix Houphouet-Boigny stadium in Abidjan, Ivory Coast.", "Attendance for the match was 9,000."], "ranking": [1, 3, 2]}
