{"candidates": ["Antonín Barák received the earliest red card ever at the European Championship after 19 minutes and 28 seconds.", "Turkey became the first team to receive eight yellow cards in a Euros match, eventually ending with 11 including subs.", "There were 18 cards shown between Czech Republic and Turkey in this fixture (16 yellows, two reds); the most in a single game in the tournament’s history.", "The match set a new record for the most cards awarded in a single game at a European Championship with 18 cards.", "Antonin Barak received the earliest sending-off in Euro’s history at 20 minutes, beating the previous record of 24 minutes held by Eric Abidal.", "This was the most ill-disciplined match in European Championship history with a total of 16 yellow and two red cards.", "The referee showed 18 cards in total, two red and 16 yellow, to set a new Euros record."], "ranking": [2, 5, 1, 3, 4, 6, 7]}
{"candidates": ["Exciting youngsters Arda Güler and Kenan Yildiz were back into the starting XI for Turkey.", "Mojmír Chytil replaced the injured Patrik Schick up front for the Czechs.", "The Czech Republic is +165 to win and Turkey is +170, with the draw at +235.", "The over/under for this game is 2.5 goals.", "The Czech Republic has scored two goals in two matches in this tournament, and Turkey has conceded four goals in two matches.", "In international matches the past two years, the Czech Republic scored 32 goals (2.0 per game) and Turkey conceded 26 goals (1.6 per game).", "With three goals in two matches, Turkey is seventh in the UEFA European Championship.", "The Czech Republic has conceded three goals in two matches, 12th in the competition.", "In international matches the past two years, Turkey scored 24 goals (1.5 per game) and the Czech Republic conceded 15 goals (0.9 per game).", "The Czech Republic's goal differential (-1) is 15th in the UEFA European Championship. It was +17 the past two years.", "In terms of goal differential, Turkey is 15th in the UEFA European Championship at -1. It was -2 the past two years.", "Vladimir Coufal has one assist but zero goals in two matches for the Czech Republic in UEFA Euro.", "Patrik Schick has one goal in two matches for the Czech Republic in UEFA Euro.", "Lukas Provod has one goal for the Czech Republic in UEFA Euro, in two matches.", "Arda Guler has netted one goal without an assist in two UEFA European Championship matches for Turkey.", "Kerem Akturkoglu has one goal (sixth in UEFA European Championship action) for Turkey in two matches.", "Kaan Ayhan has compiled one assist for Turkey in UEFA Euro (two matches).", "Mert Muldur has one goal (sixth in UEFA European Championship play) in two matches for Turkey."], "ranking": [14, 13, 18, 17, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 15, 16]}
{"candidates": ["Ahead of Wednesday's meeting with Turkey in Hamburg, head coach Ivan Hasek has some big calls to make - particularly throughout the final third.", "Having wasted a whole host of chances in their 1-1 draw with Georgia, the Czechs clearly need to sharpen up in attack, but Patrick Schick - who became his nation's all-time top scorer at the Euros on Saturday - may now be missing through injury.", "Therefore, Prague-based pair Jan Kuchta and Mojmir Chytil could be called upon to deputise, with Schick's versatile club colleague Adam Hlozek also likely to come under consideration.", "Hasek introduced Chytil, Antonin Barak and Ondrej Lingr from the bench at the weekend, but at least two of the three may start at Volksparkstadion.", "After securing his place in the squad by finishing second in the Czech First League's goalscoring charts, Viktoria Plzen midfielder Pavel Sulc was a surprise starter against Portugal, so Hasek will also consider his claim.", "Elsewhere, the established back three of Tomas Holes, Ladislav Krejci and Robin Hranac is unlikely to change, while captain Tomas Soucek and his West Ham United teammate Vladimir Coufal are certainly assured of their places.", "Turkey meets the Czech Republic on Wednesday, June 26 at 3:00 PM ET in its third game of the group stage at the 2024 UEFA European Championship.", "Turkey is +140 to win, the Czech Republic has +188 odds to win, while the match has +230 odds to end in a draw.", "Turkey's goal differential (-1) is 15th in UEFA Euro.", "The Czech Republic's goal differential (-1) is 15th in UEFA Euro.", "Offensively, Turkey is fifth in UEFA Euro (three goals, 1.5 per match). Defensively, the Czech Republic is 16th (three goals conceded, 1.5 per match).", "With two goals scored in two matches, the Czech Republic is ninth in UEFA Euro. On the other side, Turkey has given up four goals in two matches, 17th in the competition.", "Turkey is third in the competition in shots (16.5 per game), and the Czech Republic is 10th in shots conceded (10.5).", "In terms of shots, the Czech Republic is ninth in the competition offensively (taking 13.0 per game), and Turkey is 12th defensively (conceding 12.0).", "Mert Müldür is set to start against the Czech Republic.", "Mert Müldür scored the first goal for Turkey against Georgia, which boosted Turkish fans' hopes for Euro 2024.", "Mert Müldür had a strong, consistent game playing at right back against Georgia.", "Mert Müldür was out of the game against Portugal, which Turkey lost 3-0.", "The result against Portugal will likely influence manager Vincenzo Montella’s selection for the decisive game against the Czech Republic.", "Zeki Çelik struggled against Portuguese forwards and didn’t provide much support in attack, leading to Mert Müldür's expected inclusion in the lineup against the Czech Republic.", "Turkey needs to avoid defeat against the Czech Republic to ensure their qualification for the knockout rounds."], "ranking": [14, 1, 5, 7, 10, 12, 20, 18, 16, 15, 3, 4, 6, 8, 2, 9, 11, 13, 17, 19, 21]}
{"candidates": ["Turkey advanced to the knockout stages at Euro 2024 while the Czechs were eliminated.", "Turkey will play Austria in the round of 16.", "Turkey have won each of their last four games against Czech Republic.", "Turkey have qualified for the knockout stages of a major tournament for the fourth time in their last six attempts.", "Turkey were the more creative side, and deserved their victory overall", "Turkey will play Austria in Leipzig next Tuesday; one of Turkey, Austria, Romania and the Netherlands will make it to the semis", "The ten men gave it a brave go, but they’ll be heading home", "Turkey will now meet Austria in the last 16.", "The Czechs, who reached the last eight in the previous Euros, end up rock bottom and head home early.", "Turkey have made a habit of beating the Czechs in the last group game at a Euros.", "Cenk Tosun expressed his delight with his goal and mentioned that they had discussed the timing beforehand.", "Czech coach Ivan Hasek commented on Barak's sadness and self-punishment after being sent off.", "Tomas Soucek expressed disappointment over not advancing and mentioned the difficulty of playing with a player less.", "Shaka Hislop believes the referee played a massive part in Czechia's loss to Turkey and says it may have cost them a place in the round of 16.", "Mert Muldur commented on the team's improvement against tough opponents.", "Baris Alper Yilmaz expressed happiness about advancing to the knockout stage.", "Tomás Soucek lamented the impact of the 'disrespectful' red card and expressed disappointment at not advancing."], "ranking": [1, 5, 3, 4, 2, 6, 8, 7, 9, 10, 11, 12, 13, 14, 15, 16, 17]}
{"candidates": ["Canada will face Uruguay in the Copa América’s third-place game on July 13, 2024, at Bank of America Stadium in Charlotte, North Carolina.", "Marcelo Bielsa’s Uruguay currently sit 14th in the world and are the only team to have defeated Argentina since the 2022 World Cup.", "Uruguay beat Brazil on penalties in the Copa América quarter-finals.", "Uruguay suffered a 1-0 semi-final loss to ten-man Colombia, with several Uruguay players involved in an altercation in the stands with Colombian supporters.", "Defender Guillermo Varela is suspended for the match against Canada due to a late red card in the semi-final.", "Rodrigo Bentancur is also unlikely to be available against Canada due to injury.", "Canada’s head coach Jesse Marsch has indicated that there will be changes in the lineup, with players like Ali Ahmed, Mathieu Choinière, and Tani Oluwaseyi potentially getting more playtime.", "18-year-old defender Luc de Fougerolles of Fulham could be in line for his first international start on Saturday.", "You will be able to follow the third-place match between Canada and Uruguay on RDS2 and RDS.ca starting at 19:45.", "If Canada can already consider its presence in the Copa América semi-finals as a victory, the team will want to finish on a positive note on Saturday evening in its third-place match against Uruguay.", "The two teams will face off at the Bank of America Stadium in Charlotte, North Carolina. The kickoff is scheduled for 20:00.", "Canada fought well against Argentina in the semi-finals, but the defending champions proved their superiority on the field with goals from Julian Alvarez and Lionel Messi to win 2-0, the same score as in the group stage, but in a match where Canada performed much better.", "Jesse Marsch has not yet announced his lineup, but he might be tempted to shuffle the deck after good performances from some substitute players, including Ismaël Koné and Tani Oluwaseyi.", "Mathieu Choinière, who got his first minutes of the tournament in the semi-finals, could also see the field again if the coach wants to rotate his squad to bring in fresher legs.", "Alphonso Davies had to undergo X-rays after a tackle that forced him to leave the match in the 71st minute. Fortunately for the Canadian captain, no issues were detected, and he could be back in his position.", "The incident occurred in the 66th minute, and Davies remained on the ground and was unable to continue, so he was replaced by Jonathan Osario.", "Uruguay, appearing too strong for Canada, might be deprived of key elements for this match after incidents that occurred on Wednesday.", "A dozen players ended up in the stands confronting Colombian supporters who might have been celebrating Colombia's victory over Uruguay too ardently.", "The South American Football Confederation (Conmebol) announced on Thursday the opening of an investigation into the violent incidents, involving notably Celeste striker Darwin Nunez, but no sanctions have yet been announced.", "Uruguayan coach Marcelo Bielsa stated that his players deserved apologies, not sanctions, following the events.", "Bielsa said, 'Sanctions should not go against the players, but against those who forced them to act like that. It has become a witch hunt. It's embarrassing.'"], "ranking": [14, 2, 5, 10, 16, 17, 7, 11, 20, 4, 6, 13, 15, 9, 18, 19, 1, 3, 8, 12, 21]}
{"candidates": ["It's a tough end for Marsch's side, but what a run from Les Rouges.", "All eyes are on Canada heading into the 2026 World Cup on home soil.", "Uruguay may have finished third, but Canada captured the hearts of people around the world with brave performances.", "This is only the beginning of the journey for Canada.", "Uruguay manager criticized Copa América organizers.", "Jesse Marsch and Canada should hold their heads high after challenging several of the best teams in the world en route to a fourth-place finish.", "Ismaël Koné was the best player on the pitch despite missing a pivotal penalty in the shootout.", "Uruguay manager Marcelo Bielsa accused the Copa América organizers of lying multiple times throughout the tournament.", "Canada, under coach Jesse Marsch, considered the tournament one of their best performances since winning the 2000 Concacaf Gold Cup."], "ranking": [6, 8, 2, 9, 5, 1, 4, 3, 7]}
{"candidates": ["Canada finished top 4 at the 2024 Copa America.", "Uruguay is ranked 14th in the world according to FIFA, while Canada is ranked 48th.", "The match was held at Bank of America Stadium in Charlotte, North Carolina.", "Attendance was 24,386.", "Luis Suárez's goal in what could be his final match for Uruguay.", "Alphonso Davies missed the final penalty for Canada, hitting the crossbar.", "The match was played at the Bank of America Stadium in Charlotte, North Carolina.", "The game had an announced attendance of 24,386.", "The game was more subdued compared to Uruguay's heated semifinal against Colombia."], "ranking": [5, 4, 9, 8, 2, 1, 7, 6, 3]}
{"candidates": ["The two nations have only met twice before at the senior level, with Uruguay winning both matches.", "The most recent meeting was a friendly prior to the 2022 Qatar World Cup, where Uruguay won 2-0."], "ranking": [1, 2]}
{"candidates": ["Luka Modrić made his 180th appearance for the national team against Poland."], "ranking": [1]}
{"candidates": ["Luka Modric scored the only goal of the match with a free-kick, giving Croatia a 1-0 victory over Poland.", "Duje Caleta-Car forced Lukasz Skorupski into an early save with a goal-bound header.", "Igor Matanović missed multiple chances to score for Croatia.", "Nicola Zalewski's shot for Poland was saved by Dominik Livakovic.", "Robert Lewandowski hit the crossbar for Poland.", "Luka Modric scored a beautiful free-kick goal in the second half, which was the only goal of the match, leading Croatia to a 1-0 victory over Poland.", "Dominik Livaković made vital saves and kept a clean sheet for Croatia.", "Luka Modric scored the winning goal for Croatia in the 52nd minute.", "Mateo Kovacic received a yellow card in the 2nd minute.", "Marko Pjaca received a yellow card in the 14th minute.", "Petar Sucic received a yellow card in the 40th minute.", "Jan Bednarek received a yellow card in the 44th minute.", "Bruno Petkovic received a yellow card in the 68th minute.", "Ante Budimir received a yellow card in the 90+1st minute.", "Croatia's victory over Poland saw the two sides go level on points in Group A1 of the UEFA Nations League.", "The fights happened following Croatia's 1-0 victory against Poland.", "Luka Modric scored the winning goal with an expertly executed free kick in the 52nd minute.", "Dominik Livakovic made a crucial save to deny Nicola Zalewski.", "Igor Matanovic and Robert Lewandowski both hit the bar later in the second half.", "Luka Modrić scored a free-kick goal in the 51st minute to secure a 1-0 victory for Croatia.", "Robert Lewandowski hit the post in the 70th minute.", "Luka Modric scored early in the second half to secure a 1-0 home win over Poland.", "Hand ball by Karol Swiderski (Poland) in the 90'+4' minute.", "Luka Modrić scored the winning goal with a beautiful shot from a free kick in the 52nd minute."], "ranking": [1, 5, 10, 7, 9, 2, 4, 3, 18, 19, 20, 21, 22, 15, 16, 11, 12, 13, 14, 17, 6, 8, 23, 24]}
{"candidates": ["Andrej Kramarić was not in the starting eleven due to an illness.", "Coach Zlatko Dalić made five changes from the starting line-up in the previous match against Portugal, giving Igor Matanović a chance from the first minute."], "ranking": [2, 1]}
{"candidates": ["Croatia held on for an important victory after losing their Nations League opener 2-1 to Portugal.", "Both teams now have three points from their first two matches as they aim to qualify for the UNL play-offs."], "ranking": [1, 2]}
{"candidates": ["Croatia National Football Team News: Luka Modric with his teammates during a clash against Portugal.", "Croatia, looking for their first win in five games, may change their roster this weekend.", "After Domagoj Vida and midfielder Marcelo Brozovic retired from international action, Josip Stanisic and Martin Erlic were both ruled out of this month’s training due to injuries, while Duje Caleta-Car has been suffering with fitness.", "Poland National Football Team News: Poland stars celebrating a win against Scotland in the Nations League.", "Robert Lewandowski is leading a team without long-serving players Wojciech Szczesny and Kamil Grosicki, the latter of whom has retired from football altogether, and his injured striking partner Arkadiusz Milik.", "Adam Buksa is an alternate possibility, although Krzysztof Piatek, who has been playing well in the Turkish Super Lig, partnered with his captain in attack the previous game.", "In the absence of Szczesny, goalkeeper Marcin Bulka will start in goal.", "Croatia National Football Team Predicted Lineup: Livakovic; Jakic, Sutalo, Gvardiol, Sosa; Modric, Kovacic, L. Sucic; Pasalic, Kramaric, Ivanusec.", "Poland National Football Team Predicted Lineup: Bulka; Bednarek, Dawidowicz, Kiwior; Frankowski, Zielinski, Szymanski, Moder, Zalewski; Piatek, Lewandowski.", "The game will be a fierce battle between both sides, but looking at current results Poland could come out as the winner.", "Predicted Score: Croatia 1-2 Poland.", "Betting Tips and Odds: Croatia win – 1.67, Poland win – 3.90, Draw – 4.80.", "Where to watch Croatia vs Poland Live: India - Sony Network/SonyLiv, UK - Sky Sports, USA - ESPN, Croatia - DAZN, Poland - DAZN."], "ranking": [12, 9, 8, 11, 5, 10, 7, 4, 3, 2, 1, 6, 13]}
{"candidates": ["Colombia have now beaten Paraguay three straight times at Copa America, matching the longest winning run they've ever had against that opponent in the tournament.", "Colombia have also won their opening game at four straight Copa America tournaments, their longest such streak since 1983 to 1993."], "ranking": [1, 2]}
{"candidates": ["James Rodriguez created both goals in Colombia's 2-1 win over Paraguay.", "Daniel Muñoz scored for Colombia in the 32nd minute.", "Jefferson Lerma scored for Colombia in the 42nd minute.", "Julio Enciso scored for Paraguay in the 69th minute.", "James Rodríguez created both goals in Colombia's 2-1 win over Paraguay in their opening Copa América Group D game.", "Daniel Muñoz scored the first goal for Colombia in the 32nd minute.", "Jefferson Lerma scored the second goal for Colombia in the 42nd minute.", "Julio Enciso scored the lone goal for Paraguay in the 69th minute.", "Colombia thought they had a penalty in the 84th minute, but the decision was overruled by VAR.", "James Rodriguez provided two assists, leading Colombia to a 2-1 victory over Paraguay.", "Daniel Munoz scored the first goal with a header assisted by James Rodriguez.", "Jefferson Lerma scored the second goal with a header assisted by James Rodriguez.", "Julio Enciso scored for Paraguay in the 69th minute.", "32': Fantastic James Rodriguez cross headed home by Daniel Muñoz", "42': Another Rodriguez cross is headed home by Jefferson Lerma", "69': Julio Enciso scores to cut Colombia's lead in half", "90+4': Paraguay manager Daniel Garnero is upset and earns a yellow card", "90+2': James Rodríguez, assister of both goals, comes off to a great ovation", "88': The referee disallows a penalty for Colombia after reviewing the play at the monitor", "84': The referee spots Velazquez pulling on Mina and points to the spot for a penalty, which is later disallowed by VAR", "82': Attendance is 67,059, a huge number considering the conditions", "78': Cubas catches Rios on the knee with a high boot and is shown a yellow card"], "ranking": [1, 5, 5, 5, 2, 6, 6, 6, 14, 3, 4, 4, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17]}
{"candidates": ["Munoz scored for Colombia in the 32nd minute.", "Lerma scored for Colombia in the 42nd minute.", "Enciso scored for Paraguay in the 69th minute.", "Velazquez received a yellow card in the 53rd minute.", "Cubas received a yellow card in the 78th minute.", "Oscar Garnero received a yellow card in the 90+4th minute."], "ranking": [1, 2, 3, 4, 5, 6]}
{"candidates": ["We are predicting Colombia to win, with a 59.2% chance of winning this match, based on the moneyline.", "Colombia has scored 29 goals in 17 matches the past two years, and Paraguay has allowed nine goals in 11 matches.", "Paraguay has scored six goals in 11 games the past two years. On the flip side, Colombia has conceded 11 goals in 17 games.", "Colombia's goal differential was positive, +18.", "Paraguay had a negative goal differential in that time, at -3.", "Colombia vs Paraguay is the first Group D fixture of Copa America 2024.", "Colombia look to extend their 23-game unbeaten run as Los Cafeteros take on Paraguay at Copa America 2024 on June 24.", "Colombia might not have qualified for the 2022 World Cup, but the CONMEBOL side has done everything since to make up for the devastating failure.", "Under Nestor Lorenzo and led by James Rodriguez, Los Cafeteros have not lost a match since February 2022.", "Paraguay are Colombia's first opponents in the tournament, and although Nestor's squad are the favorites to win the match, Paraguay have recently performed well at the Copa America, only losing back-to-back quarter-finals in penalty shootouts.", "Both sides will look to start their 2024 campaign with three points.", "Colombia possess one of the most intriguing squads at Copa America. Although they might not have as many superstars as Argentina or Brazil, Los Cafeteros have dangerous players in their starting XI, including Liverpool's Luis Diaz and Fluminense's Jhon Arias.", "Nestor Lorenzo's squad has scored 12 goals in just four matches so far in 2024.", "Colombia's recent form would make them the favorites of almost any other Copa America group, but the 2019 champions, Brazil, are also in Group D.", "Regardless, James Rodriguez and co. are still expected to advance to the quarter-finals.", "Beyond Paraguay's most recent win against Panama in an international friendly, La Albirroja have struggled to produce positive results.", "Paraguay have just two wins in their last nine matches dating back to September 2023.", "Daniel Garnero's backline has shined despite Paraguay's lack of victories.", "The collective defense has kept two clean sheets in three matches this year, with help from their keeper, Carlos Miguel.", "It will take an outstanding feat to keep Colombia from scoring."], "ranking": [7, 5, 4, 10, 11, 18, 1, 3, 2, 6, 15, 9, 8, 14, 16, 13, 17, 12, 19, 20]}
{"candidates": ["Colombia head into this tournament on a 23-match unbeaten run.", "Colombia have not lost an international match in over two years.", "Colombia are currently on an eight-match winning run.", "Colombia have won their opening match in each of the last three editions of the Copa America.", "Paraguay won their final tune-up fixture, which was their first victory of 2024.", "Paraguay have not won a Copa America match against Colombia since 2007.", "Colombia have maintained a 23-match unbeaten run heading into this Copa America clash.", "Paraguay have failed to score in four of their last five matches.", "Colombia’s Luis Diaz is just one goal away from reaching 50 caps and has netted 12 goals for the national team.", "Colombia’s approach is likely to revolve around maintaining possession and applying constant pressure on Paraguay’s defence.", "Paraguay are expected to adopt a more conservative approach, focusing on deep defending and swift counter-attacks.", "The midfield battle will be particularly decisive in this matchup, with Colombia’s James Rodriguez against Paraguay’s Mathias Villasanti being a key duel to watch.", "Colombia’s expected lineup: Ospina; S. Arias, Mina, Cuesta, Machado; Uribe, Lerma; J. Arias, Rodriguez, Diaz; Cordoba.", "Paraguay’s expected lineup: Coronel; Velazquez, Balbuena, Gomez, Alonso; Villasanti, Cubas, Almiron; Sosa, Bareiro, Enciso."], "ranking": [1, 2, 3, 4, 12, 11, 5, 10, 6, 8, 9, 7, 13, 14]}
{"candidates": ["James Rodríguez expressed happiness about starting well against a tough opponent like Paraguay.", "Luis Díaz mentioned that scoring two goals gave Colombia a good lead and expressed confidence in having a very good tournament.", "James Rodriguez's performance was reminiscent of his peak years, showcasing his vision and playmaking abilities.", "Miguel Almiron struggled to make an impact and was substituted after 59 minutes.", "Colombia look as dynamic and as fired-up as their amazing run of form suggests.", "Despite a nervier-than-expected closing 20 minutes, Colombia held on to take all three points."], "ranking": [3, 2, 1, 6, 4, 5]}
{"candidates": ["The match was held at NRG Stadium in Houston, Texas, with an attendance of 67,059.", "Colombia had 67.7% possession compared to Paraguay's 32.3%.", "Both teams had 3 shots on goal and 11 shot attempts.", "Colombia extended their unbeaten run to 24 matches.", "Colombia maintained an impressive run of 19 victories and five draws since March 2022.", "Attendance for the match was 67,059.", "Colombia has not lost an international match since February 1, 2022.", "Colombia did not qualify for the 2022 FIFA World Cup.", "Colombia's fans popped some smoke bombs and the fire alarm in the press box went off.", "The last time Paraguay came back from a two-goal deficit at Copa America was in 1947 when they beat Uruguay 4-2 after trailing 2-0."], "ranking": [8, 5, 9, 2, 1, 7, 3, 10, 4, 6]}
{"candidates": ["Colombia will face Costa Rica on June 28 and Brazil on July 2 in their next Group Stage matches."], "ranking": [1]}
{"candidates": ["Youssouf M'Changama scored for Comoros in the 37th minute", "Musa Barrow scored for Gambia in the 45'+1 minute"], "ranking": [1, 2]}
{"candidates": ["M'Changama scored for Comoros in the 37th minute", "Barrow equalized for Gambia in the 45+1 minute", "Minteh received a yellow card in the 63rd minute", "Ceesay received a yellow card in the 64th minute", "Darboe received a yellow card in the 89th minute"], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Gambia are playing Comoros for the first time.", "Comoros and Gambia will play at the Ben M'Hamed El Abdi Stadium in El Jadida, Morocco.", "Comoros are ranked 119th in the world and are aiming to reach their second AFCON finals.", "Comoros head coach Stefano Cusin has called up 24 players, including prolific attacker El Fardou Ben Nabouhane and Troyes striker Rafiki Said.", "Gambia are looking to reach their third consecutive AFCON finals.", "Gambia have named 24 players in their squad, including Musa Barrow and rising star Yankubah Minteh."], "ranking": [3, 6, 2, 1, 4, 5]}
{"candidates": ["Comoros come into AFCON qualifying following an impressive COSAFA Cup campaign", "Gambia's last outing was almost three months ago during the last round of World Cup qualifying", "Gambia have made significant strides forward in recent years and have a few big names arriving in Casablanca for these qualifiers", "The forthcoming encounter between Comoros and Gambia is scheduled to occur on September 4, 2024, at 15:00 UTC at El Jadida’s Ben M’Hamed El Abdi Stadium.", "Both teams are fighting for a berth in the next round of the Africa Cup of Nations Qualification.", "Comoros brings a mixed bag of performance from their previous games, displaying both resiliency and weaknesses.", "Gambia has had a difficult run of games, alternating between victories and defeats.", "Gambia has displayed both attacking skill and defensive weaknesses, while Comoros has displayed a mix of strong defensive performance and sporadic slip-ups.", "Both Comoros and Gambia are trying to go higher in the current group standings as they get ready to play each other in the Africa Cup of Nations Qualification on September 4, 2024.", "Comoros has struggled for consistency, with two wins and three losses in their last five matches.", "Gambia has experienced a similarly inconsistent period in their last five matches, with a blend of wins and losses.", "Comoros and Gambia have faced off against one another multiple times throughout history, with varying degrees of success in each confrontation.", "Comoros is expected to field a balanced side in their vital Africa Cup of Nations qualification match against Gambia, emphasizing a strong defense while still offering offensive alternatives to test their opponents.", "Gambia will also be trying to present a strong side in order to obtain a favorable outcome against Comoros.", "Fans and analysts alike anticipate an entertaining match as both teams will depend on their best players to provide a performance that could determine their fate in the competition.", "A number of important factors could affect the result: injuries, current form, defensive stability, home advantage, key players, previous encounters, tactical approach, and motivation levels.", "Comoros face Gambia at Stade Ben Ahmed El Abdi as 2025 Africa Cup of Nations qualification begins.", "Comoros are unbeaten in their last five home fixtures.", "Gambia have averaged 11.3 shots per game in their recent matches.", "Gambia have conceded 7 goals in their last 3 matches.", "Gambia’s recent introduction of new talents into their squad, such as Brighton & Hove Albion’s Yankuba Minteh, adds a fresh impetus to their attacking options.", "Gambia’s recent performances, particularly under the new management of Johnny McKinstry, suggest that they are well-prepared to exploit the defensive weaknesses that Comoros have exhibited.", "The match promises to be a closely contested affair with both sides eager to start their qualifying journey on a positive note."], "ranking": [10, 8, 14, 2, 12, 11, 9, 13, 15, 7, 6, 16, 5, 4, 3, 1, 18, 17, 20, 19, 21, 22, 23]}
{"candidates": ["This is the first ever clash between Comoros and Gambia in all competitions.", "Gambia have won just once in five official games this year, a 5-1 defeat of Seychelles in a 2026 FIFA World Cup qualifier.", "Gambia's Yankubah Minteh is looking to score in his third consecutive game.", "Comoros have won just thrice from nine games this year."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Cyprus won 1-0 against Lithuania with Pittas scoring in the 22nd minute and Ioannou in the 78th minute.", "Girdvainis received a yellow card in the 6th minute, Paulauskas in the 41st minute, Gineitis in the 45th minute, and Lekiatas in the 48th minute."], "ranking": [1, 2]}
{"candidates": ["Predictions indicate a draw with under 2.5 goals expected.", "Score tip predicted as 0:0.", "Cyprus and Lithuania will be looking to pick up a morale-boosting result when they lock horns in a friendly at Alphamega Stadium on Sunday.", "Temur Ketsbaia’s men head into the weekend on a seven-game losing streak while the visitors have won just one of their last 18 matches since March 2022.", "Cyprus failed to stop the rot as they suffered a 3-1 defeat at the hands of Spain when the sides squared off in Kolossi on Thursday.", "Ketsbaia’s side have now lost seven games on the bounce, conceding 25 goals and scoring just three since March’s 2-2 draw against Armenia.", "Cyprus have now lost all eight games in the 2024 European Championship qualifiers to sit rooted to the bottom of Group A.", "Lithuania, on the other hand, were sent crashing back to earth last time out as they fell to a 2-0 loss against Montenegro in the European qualifiers.", "Prior to that, Edgaras Jankauskas’ men picked up a 2-0 victory over Bulgaria on October 14 to end their 15-game winless run, three days before holding out for a 2-2 draw against Hungary.", "Lithuania head into Sunday’s game unbeaten in three of their last four friendly matches, claiming two draws and one win since November 2021.", "Cyprus hold a slight upper hand in the history of this fixture, having won two of their last three games against Lithuania.", "The Nacionalinė komanda’s only victory over Cyprus came in February 2001, when they scraped a 2-1 victory in Limassol.", "Ketsbaia’s men have lost all but one of their last nine matches, with a 2-2 friendly stalemate against Armenia on March 28 being the exception.", "Lithuania have failed to win 17 of their last 18 matches in all competitions, losing 12 and picking up five draws since March 2022.", "Cyprus and Lithuania have endured a truly forgettable campaign in the European Championship qualifiers and will be looking to pick up a morale-boosting victory this weekend.", "While the Nacionalinė komanda have home advantage in their favour, they have lost their last five home matches and we see them struggling in front of their home supporters once again.", "Prediction: Cyprus 1-1 Lithuania", "Sports Mole previewed the friendly clash between Cyprus and Lithuania, including predictions, team news, and possible lineups.", "Cyprus had a poor form coming into the match, losing their last six games in all competitions.", "Lithuania also had a poor form, losing their last game 2-0 against Montenegro.", "Predictions suggested a Lithuania win with a probability of 55.9%, a draw with a probability of 24.2%, and a Cyprus win with a probability of 19.92%"], "ranking": [14, 15, 10, 6, 12, 4, 3, 8, 9, 11, 7, 5, 2, 1, 16, 18, 13, 17, 19, 20, 21]}
{"candidates": ["Cyprus and Lithuania will meet in Limassol for a friendly match, concluding their Euro 2024 qualifying campaigns.", "Cyprus endured a disappointing Euro 2024 qualifying run, suffering an 8th consecutive defeat against Spain with a 3-1 loss.", "Lithuania had a better qualifying campaign, securing their position above Bulgaria in their group.", "Cyprus manager Ketsbaia might experiment with the lineup but could call upon key players like Grigoris Kastanos.", "Lithuania will miss Eligijus Jankauskas and Paulius Golubickas due to injuries.", "Predicting a 1-1 draw, considering Lithuania’s struggles away from home and Cyprus’s determination to end on a positive note.", "Cyprus and Lithuania met in Limassol for a friendly after both completed their Euro 2024 qualifying campaigns.", "Neither side was close to threatening the top two positions in their respective groups.", "Cyprus had a dismal qualifying campaign, losing 3-1 to Spain in their last match.", "Lithuania fared better in their qualifying campaign, finishing above Bulgaria due to their superior head-to-head record."], "ranking": [6, 3, 5, 8, 9, 2, 1, 7, 4, 10]}
{"candidates": ["Mendes scored two goals for Cape Verde, one from a penalty in the 28th minute and another in the 75th minute.", "Pina, Borges, and Andrade received yellow cards at the 24th, 42nd, and 90+1 minutes respectively.", "Fofana and Mouhsine received yellow cards for Mauritania at the 4th and 36th minutes respectively."], "ranking": [1, 2, 3]}
{"candidates": ["Cape Verde will play host to Mauritania at Estádio Nacional de Cabo Verde in Africa Cup of Nations qualifying on Tuesday.", "Cape Verde were brought to their knees in Group C's opening match against Egypt, who claimed a 3-0 win at the Cairo International Stadium.", "Cape Verde are quite conscious of the fact that home advantage is crucial in these qualifiers.", "Cape Verde defeated Mauritania 1-0 when the sides last met.", "Mauritania were stretched by Botswana in their opener in Group C but managed to snatch a lone-goal win late in the game.", "Mauritania may have to change their tactics in the upcoming meeting, considering the fact that Cape Verde are stronger than Botswana.", "In the 2023 Afcon in Cote D’Ivoire, Mauritania reached the round of 16, their best record so far in the competition.", "Cape Verde have won once, drawn once and lost once in their last three clashes with Mauritania.", "Cape Verde have won thrice and drawn twice in their last five matches at home in all competitions.", "Cape Verde have scored four goals and conceded seven in their last five matches in all competitions.", "Mauritania have won once, drawn twice and lost twice in their last five matches on the road.", "Cape Verde have won thrice and lost twice in their last five matches while Mauritania have won once, drawn once and lost thrice.", "Cape Verde are determined to get back to winning ways and will leave no stone unturned to claim maximum points in order to improve their position.", "Mauritania will likely lower their expectations in their first-ever game in Cape Verde and would be happy to share the spoils.", "Cape Verde are the favorites based on home advantage.", "Cape Verde holds a slight historical advantage, having recorded one more win than Mauritania across their past encounters.", "Cape Verde fell to a tough 3-0 defeat at the hands of Egypt in Cairo, leaving them in search of their first points of the campaign.", "Mauritania claimed a well-earned victory in their first match, giving them a strong platform to build upon.", "Cape Verde’s squad, led by Bubista, is determined to set the record straight after the loss to Egypt.", "Cape Verde will likely look to control the tempo and play through their quick, attacking wingers, while Mauritania may adopt a more disciplined, counter-attacking approach."], "ranking": [14, 2, 10, 12, 8, 11, 5, 15, 9, 16, 7, 18, 1, 4, 6, 13, 3, 17, 19, 20]}
{"candidates": ["Cape Verde is seeking their first points in this campaign, while Mauritania aims to build on their opening-round victory.", "Cape Verde's quest for a fifth AFCON appearance got off to a poor start with a 3-0 loss against Egypt.", "Cape Verde is looking to make history by sealing a third consecutive AFCON appearance.", "Mauritania ended a run of five matches without a win with a 1-0 victory over Botswana in their opening AFCON qualifying match.", "Cape Verde have kept five clean sheets in their last six home games, demonstrating their ability to shut down opposing attacks when playing in Praia.", "Mauritania have failed to win in their last two away matches, drawing 0-0 with South Sudan and losing 2-0 to Congo DR.", "Both teams have been involved in low-scoring matches recently, with five of Cape Verde’s last seven games producing under 2.5 goals.", "Cape Verde are set to welcome Mauritania to the Estadio Nacional de Cabo Verde in what promises to be a crucial 2025 Africa Cup of Nations qualifying clash.", "Cape Verde’s defensive vulnerabilities were starkly exposed in their 3-0 defeat to Egypt.", "Mauritania secured a morale-boosting 1-0 win in their opener against Botswana, thanks to a late strike from Sidi Bouna Amar."], "ranking": [8, 9, 5, 6, 4, 3, 2, 1, 10, 7]}
{"candidates": ["Cape Verde has kept five clean sheets in their last six matches across all competitions prior to their loss against Egypt.", "Cape Verde is unbeaten in their last four matches on home soil, winning three and drawing one.", "Mauritania had a poor 2024, losing six matches and drawing two of the previous nine prior to their win against Botswana.", "The last time Mauritania won on the road was against Central African Republic in June 2023."], "ranking": [2, 1, 3, 4]}
{"candidates": ["James Rodríguez equalized Carlos Valderrama’s record of 11 assists in South American World Cup qualifying.", "James Rodríguez equalized Falcao García’s mark of 13 goals in World Cup qualifying.", "James Rodríguez equalized Carlos Valderrama's record of 11 assists in South American World Cup qualifying.", "James Rodríguez equalized Falcao García's mark of 13 goals in World Cup qualifying.", "James Rodríguez equalized Carlos Valderrama's record of 11 assists in South American World Cup qualifying.", "James Rodríguez equalized Falcao García's mark of 13 goals in World Cup qualifying."], "ranking": [1, 2, 3, 4, 5, 6]}
{"candidates": ["James Rodríguez scored from the penalty spot and had an assist to help Colombia edge defending champion Argentina 2-1 in Barranquilla.", "James Rodríguez scored from the penalty spot and had an assist to help Colombia edge Argentina 2-1.", "Yerson Mosquera opened the scoring for Colombia with a close-range header in the 25th minute.", "Nico Gonzalez equalized for Argentina in the 48th minute after intercepting a Rodríguez pass.", "James Rodríguez secured the win for Colombia with a penalty in the 60th minute, awarded after a video review.", "James Rodríguez scored from the penalty spot and had an assist to help Colombia edge defending champion Argentina 2-1.", "Yerson Mosquera opened the scoring in the 25th minute.", "Nico Gonzalez equalized for Argentina in the 48th minute after capitalizing on a defensive blunder from the Colombians.", "James Rodríguez’ 60th-minute penalty, awarded after a video review, secured the win for Colombia.", "James Rodriguez floated a cross to the far post, and Yerson Mosquera nodded home after Argentina fell asleep.", "Nico Gonzalez darted beyond the Colombia defence before finishing through the keeper's legs to level proceedings.", "Daniel Munoz was adjudged to have been fouled by Enzo Fernandez in the box after a lengthy VAR check, and James Rodriguez smashed home the resulting penalty.", "Yerson Mosquera opened the scoring in the 25th minute.", "Nico González equalized for Argentina in the 48th minute after a defensive blunder from Colombia.", "James Rodríguez scored a penalty in the 60th minute to secure the win for Colombia.", "James Rodriguez scored one goal and set up another as Colombia overcame Argentina 2-1.", "Yerson Mosquera put Colombia ahead with a close-range header after Rodriguez's cross.", "Nico Gonzalez equalized for Argentina by intercepting a pass and scoring.", "Rodriguez converted a penalty after Daniel Munoz was brought down by Nicolas Otamendi."], "ranking": [1, 5, 7, 10, 2, 6, 8, 11, 3, 4, 12, 9, 13, 14, 15, 16, 17, 18, 19]}
{"candidates": ["Mosquera scored for Colombia in the 25th minute", "Rodriguez scored a penalty for Colombia in the 60th minute", "Duran scored for Argentina in the 79th minute", "Vargas received a red card in the 90th minute", "Gonzalez received a yellow card in the 48th minute", "Montiel received a yellow card in the 21st minute", "Romero received a yellow card in the 90+8th minute", "Mosquera scored for Colombia in the 25th minute.", "Rodriguez scored a penalty for Colombia in the 60th minute.", "Duran scored for Argentina in the 79th minute.", "Vargas scored for Argentina in the 90th minute.", "Gonzalez received a yellow card in the 48th minute.", "Montiel received a yellow card in the 21st minute.", "Romero received a yellow card in the 90+8th minute."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]}
{"candidates": ["Injured Argentina star Lionel Messi didn’t play in Barranquilla, the first match between the teams since the Copa America final.", "This was the first match between Colombia and Argentina since the Copa América final.", "Lionel Messi did not play due to injury."], "ranking": [1, 2, 3]}
{"candidates": ["Argentina will be without Lionel Messi due to injury", "Paulo Dybala was handed the number 10 shirt and scored off the bench against Chile", "Julian Alvarez and Lautaro Martinez are set to start in attack for Argentina", "Scaloni may opt for a four-at-the-back system after a successful switch against Chile", "Exequiel Palacios, Leonardo Balerdi, and Nicolas Tagliafico are out due to injuries", "Lucas Martinez Quarta has lost his place in the squad", "Taty Castellanos, Matias Soule, Giuliano Simeone, and Ezequiel Fernandez could make their debuts", "Colombia remains unbeaten after a late equalizer in Peru last week.", "Argentina has had a phenomenal start and is already thinking about booking their flights to North America.", "The match is a repeat of July's Copa America final where Argentina won with a goal by Lautaro Martinez in the 112th minute.", "Colombia's coach Nestor Lorenzo has transformed the side since arriving in the summer of 2022.", "Argentina has an excellent record on the road, unbeaten in 13 away qualifiers dating back to a defeat in Bolivia seven years ago.", "Colombia welcome reigning world champions Argentina to Barranquilla for a South American World Cup 2026 qualifying encounter on Tuesday night.", "Colombia are unbeaten in the qualifiers after coming up with a last-gasp equaliser against Peru last week.", "Argentina can already consider their flights booked to North America after a brilliant qualifying campaign.", "This clash is a repeat of July’s Copa America final and both teams are absolute favourites to qualify for the World Cup two years from now.", "Colombia are now on 13 points and they are third in the qualifying standings, a comfortable seven points clear in the automatic qualifying spot.", "In their last six matches in World Cup qualifiers specifically, Colombia have won two and drawn four of their matches.", "Argentina have won five and lost one of their qualifying games."], "ranking": [10, 6, 8, 5, 4, 3, 2, 14, 1, 9, 11, 7, 15, 13, 12, 16, 17, 18, 19]}
{"candidates": ["Lionel Messi was missing from Argentina's lineup due to injury.", "The match took place at the Metropolitano Roberto Melendez stadium in Barranquilla, Colombia.", "The match was played at the Metropolitano Stadium in Barranquilla.", "This was the first time Colombia beat Argentina since 2019.", "World Cup champion Argentina lifted the Copa America trophy after a 1-0 overtime victory over Colombia in July.", "The top six teams in South American qualifying will get automatic spots at the 2026 World Cup.", "The match took place at Metropolitano Roberto Meléndez Stadium in Barranquilla, Colombia.", "Argentina's strikers Lautaro Martínez and Julián Álvarez failed to offer as much danger without Messi.", "The result lifted Colombia to second in the South American zone standings with 16 points from eight qualifiers, two points behind leaders Argentina."], "ranking": [5, 2, 8, 1, 9, 6, 2, 4, 3]}
{"candidates": ["Colombia is without veteran goalkeeper David Ospina and Davinson Sanchez due to injury.", "Argentina is without Lionel Messi due to an ankle injury.", "Angel Di Maria retired after the summer's success, opening up a place in the squad for Matias Soule."], "ranking": [2, 1, 3]}
{"candidates": ["James Rodriguez is expected to be in action vs Argentina.", "Colombia will miss two of their most experienced players for this clash as former Arsenal goalkeeper David Ospina and former Tottenham Hotspur defender Davinson Sanchez are both out with injury, respectively.", "Jhon Duran could attain a starting spot for this game.", "Colombia captain James Rodriguez only featured for 45 minutes in the last game and is expected to start and feature for the whole match against Argentina.", "Luis Diaz will be the man to watch in this game as he is currently in the form of his life.", "Argentina are obviously without Lionel Messi, who is still nursing an ankle injury that had forced him off the field in the Copa America final this past summer.", "Nicolas Tagliafico and Leonardo Balerdi are also injured alongside Exequiel Palacios.", "Angel Di Maria’s replacement Matias Soule could get a chance to start in this game along with striker Taty Castellanos.", "Argentina will have their regular duo of Alexis Mac Allister and Enzo Fernandez available for selection, which will give them additional protection in midfield.", "Emiliano Martinez is expected to start in goal for the world champions.", "James Rodriguez will be crucial for Colombia as he has always been.", "The 33-year-old midfield magician has been ever-present for the Colombian national football team since 2011 and has made over 100 appearances for his country, scoring over 25 goals.", "James makes Colombia tick and if he is in the mood, he can still be one of the most devastating attacking midfielders on his day.", "Argentina will need to be alert to his threat, especially on set-pieces and shots from outside the box.", "His vision and hold-up play could be crucial for Colombia’s chances of coming up with an unlikely win in this game.", "In Messi’s absence, Julian Alvarez will have to rise to the occasion for Argentina.", "Former Manchester City man Julian Alvarez is our pick from the Argentina side.", "The forward is box-office when it comes to crucial moments in big games and in the absence of Messi, we could see him have more of the ball.", "Alvarez is an expert in making crucial runs through the oppositions’ defensive channels and this is exactly how Scaloni will try to use him against Colombia.", "With Lautaro Martinez alongside him, Alvarez may have to just keep getting in pockets of space in order to create chances or receive goalscoring chances from his teammates throughout the game.", "Expect Alvarez to get on the scoresheet in this one!", "Colombia haven’t been able to beat Argentina since 2019 and we expect that trend to continue despite Lionel Messi’s absence.", "Colombia do have the creative acumen to hurt Argentina, but we believe that Lionel Scaloni’s men are way too balanced as a team as compared to their opponents in this one.", "Predicted Score: Colombia 1-2 Argentina"], "ranking": [14, 10, 18, 12, 16, 8, 6, 15, 11, 7, 20, 19, 13, 9, 5, 4, 3, 2, 1, 17, 21, 22, 23, 24]}
{"candidates": ["Albania struck the fastest goal in Euros history in their opener against Italy.", "Nedim Bajrami set a new record for the fastest goal scored in European Championship history when opening the scoring against Italy.", "Klaus Gjasula became only the second player to score an own goal and a goal within the same game at the Euros.", "The time read 94 minutes and 23 seconds when Albania got their equaliser, the latest goal to be scored at a Euros outside of extra time."], "ranking": [2, 1, 3, 4]}
{"candidates": ["Albania’s goal in their opening Group of Death match was the fastest in European history.", "Nedim Bajrami scored the fastest goal in European Championship history, taking just 23 seconds."], "ranking": [2, 1]}
{"candidates": ["Andrej Kramaric scored for Croatia in the 74th minute.", "Klaus Gjasula scored an own goal for Albania in the 76th minute.", "Qazim Laçi scored for Albania in the 11th minute.", "Klaus Gjasula scored for Albania in the 90'+5' minute.", "Mateo Kovacic's shot was saved in the 90'+8' minute.", "Qazim Laci's 11th minute header put Albania in an early lead.", "Andrej Kramaric grabbed a 74th minute equaliser on his 33rd birthday.", "Klaus Gjasula scored an own goal in the 76th minute, putting Croatia ahead.", "Klaus Gjasula scored a late equaliser in the 90'+5' minute for Albania.", "Qazim Laci scored the first goal for Albania in the 11th minute.", "Andrej Kramaric equalized for Croatia about half an hour into the second half.", "Klaus Gjasula scored an own goal, making it 2-1 for Croatia.", "Klaus Gjasula redeemed himself by scoring Albania's equalizer in extra time.", "Klaus Gjasula came off the bench after 72 minutes for Qazim Laci.", "Andrej Kramaric equalized for Croatia by squeezing a shot through Elseid Hysaj’s legs.", "Luka Sucic’s shot from Ante Budimir’s cutback was blocked by Berat Djimsiti and cannoned off Gjasula into the net, resulting in an own goal.", "Gjasula scored a late equalizer for Albania, sweeping the ball calmly past Dominik Livakovic.", "Klaus Gjasula scored an own goal and then a last-gasp equalizer for Albania in a 2-2 draw with Croatia.", "Qazim Laci scored the first goal for Albania in the 11th minute.", "Andrej Kramaric equalized for Croatia in the 74th minute.", "Klaus Gjasula scored an own goal making it 2-1 for Croatia.", "Klaus Gjasula redeemed himself by scoring the equalizer in the 95th minute.", "Klaus Gjasula followed up an own goal with a stoppage-time equaliser as Albania stunned Croatia to secure a 2-2 draw.", "Qazim Laci squeezed a header home on 11 minutes to give Albania an early lead.", "Andrej Kramaric cut a lovely finish into the bottom corner to equalize for Croatia.", "Klaus Gjasula turned into his own net via an unfortunate ricochet 14 minutes from time.", "Klaus Gjasula redeemed himself in the fifth minute of stoppage time with a low finish to earn Albania a point.", "Qazim Laci scored in the 11th minute from a superb cross by Jasir Asani.", "Andrej Kramaric scored the equaliser for Croatia in the 74th minute.", "Two minutes later, a cross intended for Luka Sucic pinballed in the penalty area before being turned in by Albania’s defensive midfielder Klaus Gjasula.", "Mitaj pulled back a wonderful low cross for Gjasula to score the equaliser in stoppage time."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]}
{"candidates": ["Kramaric scored for Croatia in the 74th minute.", "Gjasula scored an own goal in the 76th minute.", "Ivusic scored for Croatia in the 87th minute.", "Laci scored for Albania in the 11th minute.", "Gjasula scored for Albania in the 90+5th minute.", "Hysaj received a yellow card in the 77th minute.", "Daku received a yellow card in the 90+4th minute.", "Gjasula received a yellow card in the 90+7th minute."], "ranking": [3, 2, 4, 5, 1, 7, 6, 8]}
{"candidates": ["Croatia were talking up a strong response ahead of the match.", "Luka Modric warned that Group B was the most difficult in the tournament.", "Albania, managed by Sylvinho, are a physical counter-attacking side."], "ranking": [2, 1, 3]}
{"candidates": ["Underdogs Albania snatch late draw with Croatia.", "Lowly Albania held Croatia to a 2-2 draw in a thrilling Euro 2024 encounter on Wednesday that left both teams fighting it out for progression to the knockout stage.", "Andrej Kramaric commented on the dramatic nature of football, noting that sometimes you score in the last seconds and sometimes you concede.", "Klaus Gjasula expressed hope for Albania's next game against Spain, stating that anything is possible if they play like they did against Croatia.", "Croatia coach Zlatko Dalic acknowledged the poor first half but found encouragement in the second half performance, emphasizing their determination to prepare for the match against Italy.", "The result leaves both Croatia and Albania in a precarious situation in Group B after they lost to Spain and Italy, respectively, in their first matches.", "Albania manager Sylvinho described the game as crazy and expressed pride in his players' performance.", "Sylvinho stated, 'I’m going to remember this game all my life. We are proud and the nation should be proud about the performance.'", "Croatia coach Zlatko Dalic reflected on the match, noting the team's poor first half and improved performance in the second half.", "Klaus Gjasula described the day as very beautiful and historic for him.", "Andrej Kramaric expressed disappointment over conceding the last goal and missing out on a win.", "Albania coach Sylvinho said he was proud of his team's performance and would remember the game all his life.", "The result sees Albania remain in third spot behind Italy and leaders Spain.", "Croatia sit bottom with a vastly inferior goal difference.", "The Croatians will now face Italy on Monday evening with it all to do to reach the Last 16.", "Albania will continue to dream against one of the tournament favourites Spain.", "The Vatreni have seemed ageless for so long, reaching the latter stages of countless tournaments with Luka Modric the jewel in their crown.", "It looks like those creaking legs are finally being exposed.", "The humbling against Spain raised more than an eyebrow and this surprise draw was some way short of the strong response Zlatko Dalic and his players were talking up ahead of this match.", "It could take something special to see Croatia progress from here, with even a spot as a best third-placed team a tall order given they end with reigning champions Italy and have a negative goal difference.", "Albania showed spirit and desire, scaring Italy and could have been a couple of goals ahead prior to Croatia’s second-half revival.", "La Roja will know underestimating Albania would be to their cost.", "Sylvinho stated, 'We have to fight for every point, for our country and for our federation.'", "Asllani commented, 'This is Albania; it’s a bit crazy.'", "Asllani reflected, 'We started off on the right foot, and then I can say I missed a big chance, but I thought Modric would get on the ball before me. I think we conceded two avoidable goals. We’ll review them, surely. The game was crazy in the last 15 minutes.'"], "ranking": [1, 2, 5, 6, 7, 8, 3, 4, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["The match between Croatia and Albania will take place on 19 June 2024 at 15:00 local time at Volksparkstadion Hamburg.", "Volksparkstadion Hamburg has a matchday capacity of 49,000.", "Stadium gates will open 3 hours before kick-off.", "There are no parking spaces available at Volksparkstadion Hamburg on EURO 2024 matchdays.", "Bags larger than A4 size won’t be allowed into the stadium.", "All EURO 2024 stadiums are smoke-free venues.", "No tickets will be available to purchase at the stadium on matchday."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Jean-Philippe Krasso scored twice in an 11-minute spell to secure a 2-0 victory for Ivory Coast over Zambia.", "Foullah Edifice FC's Acyl Mbogo was forced off injured late in Chad's opening game against Sierra Leone.", "Ivory Coast defeated Chad 4-0 on November 19, 2024, in the 2025 Africa Cup of Nations qualifiers."], "ranking": [2, 3, 1]}
{"candidates": ["Chad aim for their first win in Group G of the 2025 Africa Cup of Nations qualifiers as they face reigning champions Ivory Coast.", "Ivory Coast dominated their opening match against Zambia with 69% possession, significantly higher than Chad’s 36% against Sierra Leone.", "Chad managed only 1 shot on target in their last match, despite firing off 19 shots in total.", "Ivory Coast produced 22 shots in their last outing, 7 of which were on target.", "Ivory Coast are unbeaten in their last nine matches across all competitions.", "Chad are unbeaten in their last three AFCON qualifiers, including a noteworthy aggregate win over Mauritania earlier this year.", "Ivory Coast began their campaign with a convincing 2-0 victory over Zambia.", "Jean-Philippe Krasso scored twice in quick succession in Ivory Coast's match against Zambia.", "Chad will be looking to secure their first win in Group G of the 2025 Africa Cup of Nations qualifiers when they take on reigning champions Ivory Coast.", "Ivory Coast journey to Yaounde unbeaten in each of their last nine outings across all competitions.", "Chad's bid for a first-ever AFCON appearance kicked off with a goalless draw against Sierra Leone.", "Ivory Coast kicked off their qualifying journey with a 2-0 victory over Zambia.", "Ivory Coast have gone nine consecutive games without defeat across all competitions.", "Ivory Coast are on course to secure their place in the 2026 FIFA World Cup, having picked up 10 points from the first 12 available in Group F."], "ranking": [10, 8, 6, 7, 5, 4, 3, 2, 9, 1, 12, 11, 13, 14]}
{"candidates": ["Ivory Coast had 75.8% possession compared to Chad's 24.2%", "Ivory Coast had 21 shots with 5 on target, while Chad had 7 shots with 1 on target", "Ivory Coast had 40 total touches in the box compared to Chad's 4", "The match was held at Stade Omnisport Ahmadou Ahidjo"], "ranking": [2, 1, 3, 4]}
{"candidates": ["Myziane Maolida scored a brilliant solo goal in the 43rd minute to secure a 1-0 victory for Comoros against Ghana.", "Antoine Semenyo missed a chance to open the score before Maolida's goal.", "Black Stars coach Chris Hughton substituted captain Andre Ayew with Mohammed Kudus.", "Despite substitutions like Ernest Nuamah and Majeed Ashimeru, Ghana could not equalize.", "Comoros defended well to maintain their 1-0 lead.", "Comoros goalkeeper Ben Biona wasted time before taking a goal kick in the 90+4 minute.", "Ghana's attempt to create a chance was cleared by Comoros defender Yaccine Bourhane in the 92nd minute.", "Comoros player Rafik Said took a shot that went out for a throw in the 91+1 minute.", "Comoros won a freekick after Black Stars defender fouled Ahmed Mogni just outside the box in the 88th minute.", "Mohammed Kudus struck from the edge of the box but the Comoros keeper caught the ball after a second attempt in the 86th minute.", "Comoros reserve goalkeeper received a yellow card for complaining about a decision in the 78th minute.", "Comoros attempted a counter-attack with three players against two but the attacker hit the ball into the defender in the 71st minute.", "Ernest Nuamah pressured the Comoros keeper and managed to get the ball into the net but the referee whistled for a foul against the Lyon striker in the 65th minute.", "Jordan Ayew managed to take the ball through the middle but the Ghana player missed the ball in the 62nd minute.", "Comoros captain Youssouf M’changama twisted his ankle and received treatment in the 46th minute.", "Myziane Maolida scored the only goal of the match in the 43rd minute.", "The match ended with Comoros defeating Ghana 1-0.", "Jonathan Sowah replaced Iddrisu Baba for Ghana in the 88th minute.", "The Black Stars were handed a painful 1-0 defeat by Comoros in the 2026 World Cup qualifiers at Moroni on Tuesday, November 21, 2023.", "Comoros striker Myziane Maolida found the back of the net in the 43rd minute.", "Ghana’s best chance in the game fell to Antoine Semenyo in the sixth minute when Inaki Williams set him up one-on-one with the Comoros goalkeeper.", "Ghana came close to scoring again in the 20th minute when Inaki Williams whipped in a cross for Jordan Ayew but the header went wide."], "ranking": [1, 5, 4, 7, 3, 18, 15, 19, 10, 12, 16, 9, 11, 8, 2, 6, 14, 20, 13, 17, 21, 22]}
{"candidates": ["Mohammed Kudus suffers injury in training ahead of Comoros clash.", "Kudus is expected to undergo a late fitness test to determine his chances of playing against Comoros on November 21, 2023.", "The Black Stars will be hoping to make another affirmative statement when they face Comoros to ensure they top Group I.", "The Black Stars have arrived in Moroni for their second Group I FIFA World Cup qualifier against Comoros on Tuesday.", "Ghana coach Chris Hughton travelled with all 25 players who have been in camp since the commencement of our preparations for this month's qualifiers.", "The Black Stars left it late to beat Madagascar 1-0 at the Baba Yara Sports stadium on Friday, while Comoros defeated Central African Republic 4-2 in their opening game.", "The team will hold its first training session on Sunday, November 19, 2023 in readiness for the game on Tuesday.", "Ghana are third in the Group - level on 3 points with leaders Comoros and second placed Mali.", "The game against Comoros is scheduled for the Moroni Stadium on Tuesday, November 21, 2023.", "Chris Hughton has made three changes to his starting line up for the FIFA World Cup qualifier against Comoros.", "Denis Odoi, Kasim Nuhu Adams and captain Andre Ayew have been named in place of injured Daniel Amartey, Alidu Seidu and Mohammed Kudus.", "Gideon Mensah, Denis Odoi, Nicholas Opoku and Kasim Nuhu make the back four with Richard Ofori keeping his place in goal.", "Abdul Samed Salis and Baba Iddrisu will play in the heart of pitch while Andre Ayew operates behind the front three of Antoine Semenyo, Jordan Ayew and Inaki Williams.", "The FIFA World Cup qualifier is scheduled for 19:00 CT (4pm Gh Time) kick off at Omnisports stadium in Moroni on Tuesday, November 21, 2023."], "ranking": [12, 11, 8, 7, 6, 5, 4, 3, 2, 10, 9, 1, 13, 14]}
{"candidates": ["Nurudeen Abdulai and Abdul Fatawu Issahaku have been called up to replace Abdul Mumin and KamalDeen Sulemana for the FIFA World Cup qualifiers against Madagascar and Comoros.", "The Black Stars opened camp in Accra Monday ahead of their trip to Kumasi to continue their preparations for the first game against Madagascar scheduled for the Baba Yara Sports stadium on Friday, November 17, 2023.", "Ghana will later take on Comoros in Moroni on Tuesday, November 21, 2023.", "Ghana commenced their 2026 World Cup qualifiers with a vital 1-0 win over Madagascar at the Baba Yara Stadium on Friday, November 17.", "Comoros Islands beat the Central African Republic 4-2 in an entertaining encounter.", "The Matchday two World Cup qualifier will take place at Moroni stadium – a multi-use stadium in Comoros that is currently used mostly for athletics competitions."], "ranking": [5, 4, 3, 2, 6, 1]}
{"candidates": ["With the win, Comoros went top of Group I with six points after their 4-2 win over Central African Republic.", "Mali drew with Central African Republic and are second with 4 points.", "Madagascar is third with 3 points, and Ghana is fourth with 3 points after their last-gasp 1-0 win against Madagascar.", "The match was held at Stade de Moroni in Moroni, Comoros Islands.", "Attendance for the match was 11,628.", "With the results, Comoros went top of Group I with Mali and Madagascar in 2nd and 3rd place respectively.", "Ghana is currently 4th with the Central African Republic and Chad in 5th and 6th place respectively."], "ranking": [1, 5, 2, 7, 6, 3, 4]}
{"candidates": ["The two teams last met in the 2021 Africa Cup of Nations in Cameroon where Comoros beat Ghana 3-2 in a Group C encounter on January 19, 2023."], "ranking": [1]}
{"candidates": ["Andrej Kramaric headed in a 70th-minute winner as Croatia fought back from a goal down to claim a 2-1 victory over visitors Scotland.", "Ryan Christie scored the opening goal for Scotland in the 32nd minute.", "Igor Matanovic equalized for Croatia in the 36th minute.", "VAR ruled out a late Scotland equalizer.", "Ryan Christie scored the opening goal for Scotland in the first half.", "Igor Matanovic equalized for Croatia shortly after Christie's goal.", "Andrej Kramaric scored the winning goal for Croatia with 20 minutes to go.", "Ché Adams had a 95th-minute equalizer disallowed by VAR for offside.", "Ryan Christie scored for Scotland in the 32nd minute.", "Ivan Perisic and Igor Matanovic combined for Croatia's equalizer four minutes later.", "Andre Kramaric scored the winning goal for Croatia in the 70th minute.", "Scotland had a goal disallowed for offside with the last kick of the game.", "Andrej Kramaric headed in a 70th-minute winner as Croatia fought back from a goal down to claim a 2-1 victory over visitors Scotland in the Nations League.", "Ryan Christie opened the scoring in the 32nd minute for Scotland.", "Igor Matanovic scored his first international goal in the 36th minute to equalize for Croatia.", "Scotland thought they had nabbed a late equaliser in the 95th minute, but Che Adams' goal was ruled out for offside after a VAR review.", "Ryan Christie capitalised on a mistake in the Croatia defence to fire his first competitive goal in two years.", "Igor Matanovic fired a first-time finish past goalkeeper Craig Gordon to equalise for Croatia.", "Andrej Kramaric headed into the net after a save from Gordon to give Croatia the lead.", "Che Adams saw a last-minute equaliser ruled out by VAR for offside."], "ranking": [1, 5, 6, 14, 7, 8, 2, 15, 9, 10, 3, 4, 11, 12, 13, 16, 17, 18, 19, 20]}
{"candidates": ["Matanovic scored in the 36th minute for Croatia", "Kramaric scored in the 70th minute for Croatia", "Christie scored in the 33rd minute for Scotland", "Hanley received a yellow card in the 8th minute", "Gilmour received a yellow card in the 90+4th minute"], "ranking": [2, 3, 1, 5, 4]}
{"candidates": ["Scotland was dealing with illness in the camp and had a dozen players out due to injuries.", "Ben Doak, a Liverpool teenager on loan at Middlesbrough, was handed his first Scotland start."], "ranking": [1, 2]}
{"candidates": ["Steve Clarke expressed disappointment over the disallowed equalizer and praised the team's performance.", "Clarke emphasized the need to believe in the team's path and anticipated future success.", "Luka Modric was impactful throughout the game, orchestrating play and covering every blade of grass.", "Modric won all three of his tackles, made six recoveries, and intercepted the ball six times.", "Modric's passing was crisp, helping his side traverse vertically on the pitch.", "Steve Clarke insists Scotland are 'on the right path' despite the defeat.", "Scotland's winless run in competitive games grew to nine games.", "Scotland have lost all three of their games in the Nations League ahead of the visit of Portugal on Tuesday night.", "Scotland now have their longest winless run in competitive matches in their history, having drawn three and lost six of their last nine.", "They’ve also lost four consecutive games for the first time since October 2019."], "ranking": [8, 6, 5, 4, 3, 7, 2, 9, 1, 10]}
{"candidates": ["The match took place at Maksimir Stadium in Zagreb, Croatia, with an attendance of 21,702 spectators.", "Craig Gordon, aged 41, made a return to the Scotland goal.", "Luka Modric, aged 39, played his 181st cap for Croatia.", "Croatia are second in League A Group 1 with six points, level with leaders Portugal.", "Scotland remain bottom with no points after three defeats.", "The match was held at Maksimir Stadium in Zagreb, Croatia, with an attendance of 21,702."], "ranking": [6, 4, 2, 5, 3, 1]}
{"candidates": ["Saturday's match marked the first meeting between Croatia and Scotland since Euro 2020", "Scotland emerged unbeaten from two previous visits to Croatia, drawing 1-1 in October 2000 and winning 1-0 in June 2013"], "ranking": [2, 1]}
{"candidates": ["Cape Verde won an Africa Cup of Nations knockout tie for the first time in their history."], "ranking": [1]}
{"candidates": ["Cape Verde defeated Mauritania 1-0 in the Africa Cup of Nations Round of 16 on January 29, 2024.", "Mendes scored the winning penalty for Cape Verde in the 88th minute.", "Niasse received a yellow card in the 87th minute."], "ranking": [2, 1, 3]}
{"candidates": ["Cape Verde national football team were the first nation to qualify for the Round of 16 after topping their Group B table.", "Mauritania national football team made it to the Round of 16 as a third-position entrant after a surprising 1-0 victory over Algeria.", "The match is scheduled to kick off on Monday, 29 January 2024 at 5:00 PM UK (10:30 PM IST) at Stade Félix Houphouët-Boigny.", "Cape Verde's form in all competitions is D-W-W-L-W, while Mauritania's form is W-L-L-D-D.", "Key players to watch include Bebé for Cape Verde and Babacar Niasse for Mauritania.", "Cape Verde rested key players in their last match against Egypt, including Bebé, Steven Moreira, Roberto Lopes, and Jovane Cabral, who are expected to return for this match.", "Mauritania is likely to stick with the team and formation that earned them a spot in the Round of 16, deploying a 4-1-4-1 formation.", "Head-to-head record shows Cape Verde with 5 wins, Mauritania with 3 wins, and 3 draws in their total 11 matches.", "Cape Verde's predicted lineup is Vozinha (GK); Moreira, Costa, Lopes, Fernandes; Duarte, Pina, Monteiro; Mendes, Bebé, Cabral.", "Mauritania's predicted lineup is Niasse (GK); Keita, Dellah Yaly, L. Ba, Diaw; Gassama; Amar, Thiam, Mouhsine, Koita; Anne.", "Match prediction favors Cape Verde with a 3-1 victory over Mauritania.", "Cape Verde aimed to match their best Africa Cup of Nations showing by reaching the quarter-finals.", "Cape Verde topped Group B, which included Egypt and Ghana.", "Mauritania reached the knockout stage for the first time in their history after defeating Algeria."], "ranking": [1, 2, 14, 12, 6, 5, 11, 8, 9, 10, 3, 4, 7, 13]}
{"candidates": ["Cape Verde coach Pedro 'Bubista' Brito expressed pride in his team's performance and their objective to reach the semi-finals.", "Mauritania coach Amir Abdou reflected on their loss and expressed hope for future success.", "“It’s sad for us, but we’ve had a great tournament. We missed a little experience, speed and continuity,” said losing coach Amir Abdou.", "Cape Verde's unbeaten run remains intact after their match with Mauritania.", "Ryan Mendes' penalty secured Cape Verde's place in the quarter-finals of the Africa Cup of Nations.", "Mauritania's impressive performance ended in a cruel defeat due to a single mistake."], "ranking": [3, 6, 2, 5, 1, 4]}
{"candidates": ["Cape Verde will face either Morocco or South Africa in the quarter-finals.", "Mauritania had hoped to extend their run after winning an AFCON match for the first time in nine attempts in their last group game.", "Cape Verde, with a population of about 600,000, will meet either Morocco or South Africa in the last eight on Saturday.", "Cape Verde were the first team to secure a place in the knockout phase after beating Ghana and Mozambique in their opening group B games.", "Mauritania upset Algeria in their last game to reach the knockouts for the first time.", "The match took place at Abidjan’s Félix Houphouët Boigny stadium on January 29, 2024.", "Mauritania competed in their first AFCON knockout game.", "Cape Verde will face either Morocco or South Africa in the quarter-finals."], "ranking": [8, 6, 5, 4, 3, 2, 7, 1]}
{"candidates": ["The winner of this match will face either Morocco or South Africa in the quarter-finals.", "Cape Verde is undefeated in the 2023 AFCON, while Mauritania recorded its first victory against Algeria."], "ranking": [2, 1]}
{"candidates": ["Telecast details for the match include FanCode in India, Sky Sports in the UK, beIN Sports in the US, and NTA in Nigeria."], "ranking": [1]}
{"candidates": ["Two first-half Pavel Sulc goals guided the Czech Republic to a 3-2 win over Ukraine.", "A late penalty by Tomás Soucek ensured the win for the hosts.", "Vladyslav Vanat scored for Ukraine in the 37th minute.", "Georgiy Sudakov scored for Ukraine in the 84th minute."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Sulc scored for Czech Republic at 21' and 45+2'", "Soucek scored a penalty for Czech Republic at 80'", "Vanat scored for Ukraine at 37'", "Sudakov scored for Ukraine at 84'"], "ranking": [1, 2, 3, 4]}
{"candidates": ["The second round of the Nations League starts for the Ukrainian national team. In the Czech Republic, the Ukrainian team will play against the local team. Serhiy Rebrov's charges will try to rehabilitate themselves after an unsuccessful first match.", "The first round of the Nations League was not the most successful for both teams. Ukraine lost to Albania, and the Czech Republic lost to Georgia, with the Czechs suffering a big 4-1 defeat.", "It is important to note that the Ukrainian team will have the return of its starting player Mykhailo Mudryk after an injury.", "The Czech Republic - Ukraine match will take place on 10 September in Prague. The match will be hosted by the Eden Stadium. The starting whistle will be blown at 21:45.", "The match will be broadcast by regional channels Suspilne and the MEGOGO platform.", "The match will take place in the Czech Republic, which is the third most popular country for Ukrainian refugees. Therefore, we should expect a lot of Ukrainian fans at the stadium, which is very important in terms of supporting the team.", "Given that the first matches were unsuccessful for both teams, we can expect a fairly fast-paced football game with a fight from the teams.", "Bookmakers consider the Czech national team to be the favourite of the match. They also give high odds for a draw."], "ranking": [6, 5, 4, 3, 2, 8, 7, 1]}
{"candidates": ["Luka Modric became the oldest scorer in Euros history at 38 years old.", "Luka Modric became the oldest goalscorer in Euros history at the age of 38 years and 289 days.", "Mattia Zaccagni scored the second-latest goal in a game at the Euros (excluding extra time) at 97 minutes and 19 seconds.", "Luka Modric is the second player to score at four different editions of the Euros after Cristiano Ronaldo.", "Luka Modric became the European Championship’s oldest goalscorer.", "At 38 years, 289 days, Luka Modric became the oldest scorer in European Championship history with his goal.", "Luka Modric became the tournament's oldest goalscorer in history and is now just the second player to score at four different European Championship tournaments, along with Cristiano Ronaldo."], "ranking": [1, 2, 5, 4, 3, 2, 1]}
{"candidates": ["Mattia Zaccagni equalised in the 98th minute to draw 1-1 against Croatia.", "Luka Modrić scored the opening goal in the second half.", "Gianluigi Donnarumma and Dominik Livaković made stunning saves throughout the match.", "Mattia Zaccagni scored a dramatic 98th-minute goal to secure Italy's qualification to the last 16.", "Luka Modric scored just 33 seconds after missing a penalty, becoming the oldest goalscorer in Euros history.", "Gianluigi Donnarumma saved a penalty from Luka Modric, marking Croatia's third consecutive penalty miss in major tournament football.", "Alessandro Bastoni's powerful header was brilliantly saved by Croatian goalkeeper Dominik Livakovic in the 27th minute.", "Mattia Zaccagni scored Italy’s equaliser in the last minute of added time.", "Luka Modric missed a penalty but scored moments later.", "Gianluigi Donnarumma saved a penalty from Luka Modric.", "Riccardo Calafiori made a crucial run and assist for Italy's equaliser.", "Josko Gvardiol earned acclaim for his defensive play.", "Luka Modric gave Croatia a 55th-minute lead after missing a penalty.", "Mattia Zaccagni curled home a 98th-minute equaliser for Italy.", "Gianluigi Donnarumma saved a penalty from Luka Modric.", "Modric scored on the rebound after Donnarumma's save.", "Italy's Gianluca Scamacca was inches from connecting with a cross in the 87th minute.", "Mattia Zaccagni scored in the final minute of stoppage time to secure a draw for Italy.", "Luka Modric scored a goal for Croatia in the 55th minute.", "Italy's substitutes played a crucial role in maintaining the balance of the game."], "ranking": [1, 5, 10, 2, 3, 4, 12, 6, 11, 15, 8, 14, 9, 7, 16, 13, 18, 17, 19, 20]}
{"candidates": ["Modric scored in the 55th minute", "Sucic received a yellow card in the 24th minute", "Modric received a yellow card in the 60th minute", "Ivanusec received a yellow card in the 73rd minute", "Pongracic received a yellow card in the 78th minute", "Stanisic received a yellow card in the 82nd minute", "Brozovic received a yellow card in the 90+1 minute", "Zaccagni received a yellow card in the 90+8 minute", "Calafiori received a yellow card in the 90+3 minute", "Fagioli received a yellow card in the 90+6 minute", "Spalletti received a yellow card in the 90+9 minute", "Modric scored at the 55th minute", "Sucic received a yellow card at the 24th minute", "Modric received a yellow card at the 60th minute", "Ivanusec received a yellow card at the 73rd minute", "Pongracic received a yellow card at the 78th minute", "Stanisic received a yellow card at the 82nd minute", "Brozovic received a yellow card at the 90+1 minute", "Zaccagni scored at the 90+8 minute", "Calafiori received a yellow card at the 90+3 minute", "Fagioli received a yellow card at the 90+6 minute", "Spalletti received a yellow card at the 90+9 minute"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]}
{"candidates": ["Luciano Spalletti admitted before the game that Croatia was technically superior."], "ranking": [1]}
{"candidates": ["Italy will play Switzerland in Berlin on Saturday at 18.00 in the knockout stage opening game.", "Croatia has two points from their three games and must wait on other results to see if they can progress as one of the best third-place finishers.", "Italy has never succeeded in beating Croatia in any major tournament so far.", "The match had a total of nine goals scored in second-half added time at Euro 2024, equalling the highest tally seen at a European Championship tournament.", "Italy ended a run of 281 minutes without a Euros goal with Zaccagni's strike.", "Smoke from fireworks drifted through the air during the match.", "The atmosphere was described as pregnant with the kind of twist that would unleash chaos.", "The match attendance was 38,322.", "The match was held at Red Bull Arena in Leipzig, Germany.", "The manner of Mattia Zaccagni's finish was reminiscent of Alessandro Del Piero's famous goal against Germany in the 2006 World Cup semi-final.", "Italy has come from behind to avoid defeat twice in this tournament, a feat they had only achieved twice before in Euros group stage matches."], "ranking": [10, 8, 6, 2, 4, 9, 5, 11, 7, 1, 3]}
{"candidates": ["Colombia extended their unbeaten run to 27 matches, with their last defeat coming in a 1-0 loss to Argentina in February 2022.", "James Rodriguez is the first player to score and assist on a goal in the first 15 minutes of a Copa América match since 2011."], "ranking": [1, 2]}
{"candidates": ["Jhon Córdoba scored the opening goal with a well-placed header in the eighth minute.", "James Rodríguez scored a powerful penalty kick to make it 2-0.", "Luis Díaz lobbed a shot over the goalkeeper to score the third goal.", "Richard Ríos blasted a long right-footed shot to score the fourth goal.", "Miguel Borja converted a penalty kick in stoppage time to score the fifth goal.", "James Rodríguez scored one goal and set up two more as Colombia dismantled Panama 5-0.", "Jhon Córdoba scored the opening goal in the 8th minute.", "James Rodríguez converted a penalty in the 15th minute.", "Luis Díaz scored in the 41st minute after a quick free kick from Rodríguez.", "Richard Ríos scored Colombia's fourth goal in the 70th minute.", "Miguel Borja scored a penalty in stoppage time.", "Miguel Borja scored a penalty kick in the 90'+4 minute.", "Richard Rios scored a goal in the 70th minute.", "Luis Diaz was subbed off for Luis Sinisterra in the 65th minute and received a rousing ovation.", "Luis Diaz scored a goal in the 41st minute.", "James Rodriguez scored a penalty kick in the 15th minute.", "Jhon Cordoba scored a header in the 8th minute.", "Jhon Córdoba, James Rodríguez and Luis Díaz scored goals during a dominant first half to spark Colombia to a 5-0 win over Panama.", "Colombia's James Rodríguez scored the second goal from the penalty spot.", "Colombia achieved its 27th consecutive win.", "James Rodriguez scored one goal and set up two more as Colombia thoroughly dismantled Panama in a 5-0 win.", "Jhon Córdoba scored the opening goal at 8 minutes.", "James Rodríguez scored a penalty at 15 minutes.", "Luis Díaz scored at 41 minutes.", "Richard Ríos scored at 70 minutes.", "Miguel Borja scored a penalty at 90'+4 minutes."], "ranking": [18, 21, 6, 19, 20, 18, 14, 16, 15, 13, 12, 11, 10, 9, 8, 7, 5, 4, 3, 2, 1, 17, 16, 15, 14, 13]}
{"candidates": ["Colombia defeated Panama 5-0 in the Copa America quarter-final on July 6, 2024.", "Goals were scored by Cordoba (8'), Rodriguez (15' pen.), Diaz (41'), Rios (70'), and Borja (90+3' pen.).", "Uribe received a yellow card in the 45th minute.", "Welch (54'), Farina (64'), and Cordoba (90+1') also received yellow cards.", "Colombia defeated Panama 5-0 in the quarter-finals of the 2024 Copa America.", "Goals were scored by Cordoba (8'), Rodriguez (15' pen.), Diaz (41'), Rios (70'), and Borja (90+3' pen.).", "Uribe received a yellow card in the 45th minute.", "Welch (54'), Farina (64'), and Cordoba (90+1') received yellow cards for Panama."], "ranking": [1, 2, 5, 6, 1, 2, 5, 4]}
{"candidates": ["We are predicting Colombia to win, with a 75.6% chance of advancing, based on the moneyline.", "In the Copa America, Colombia has put up six goals in three matches, and Panama has given up five in three matches.", "In international matches the past two years, Colombia scored 35 goals (1.8 per game) and Panama allowed 27 goals (1.2 per game).", "Offensively, Panama is third in the Copa America (six goals, two per match). Defensively, Colombia is fifth (two goals conceded, 0.7 per match).", "In international matches the past two years, Panama scored 40 goals (1.7 per game) and Colombia conceded 13 goals (0.7 per game).", "In terms of goal differential, Colombia is fourth in the Copa America at +4 (and was +22 the past two years).", "Panama's goal differential (+1) ranks sixth in the Copa America. It was +13 the past two years.", "Colombia faces Panama in a Copa America 2024 quarterfinal match on Saturday, July 6, 2024, at State Farm Stadium in Glendale, Arizona.", "Fans can watch the match with a free trial to DirecTV Stream or fuboTV."], "ranking": [8, 5, 4, 3, 2, 6, 7, 1, 9]}
{"candidates": ["Colombia had to cope without Jefferson Lerma due to a one-match suspension.", "Mateus Uribe was likely to replace Lerma in the starting lineup.", "Jhon Lucumi was doubtful for the match due to an earlier injury.", "Manager Nestor Lorenzo was expected to continue with Davinson Sanchez and Carlos Cuesta in central defense.", "Jhon Cordoba was competing with Rafael Santos Borre and Jhon Duran for a starting position as the central striker.", "Colombia progressed to the knockout rounds for the sixth successive Copa America tournament.", "Colombia finished top of Group D with seven points from three matches.", "Panama qualified for the knockout rounds for the first time in their history after finishing second in Group C.", "Colombia were regarded as the favorites to win the match."], "ranking": [8, 5, 4, 3, 6, 2, 1, 9, 7]}
{"candidates": ["Colombia coach Néstor Lorenzo praised James Rodríguez, stating, 'He’s a good player, there’s nothing to explain. He’s a player who is happy inside the field.'", "Panama manager Thomas Christiansen reflected on the mistakes made by his team and emphasized the need to learn from the experience.", "James Rodríguez expressed happiness about the team's performance and emphasized the importance of reaching the final.", "Panama coach Thomas Christiansen praised his players for their performance in the Copa América despite the loss.", "Herculez Gomez commented that James Rodriguez is the best player in the tournament.", "The victory allowed Colombia to advance to the Copa América semifinals."], "ranking": [5, 3, 4, 2, 1, 6]}
{"candidates": ["Colombia had a slight advantage in time of possession at 52%, but the quality of their possessions was far superior.", "The match was played in front of an announced crowd of 39,740 at State Farm Stadium, with most fans donning Colombia’s bright yellow jerseys.", "The stadium’s retractable roof was closed due to temperatures hovering around 115 degrees Fahrenheit (46 degrees Celsius) outside.", "The match was held at State Farm Stadium in Glendale, Arizona, with an attendance of 39,740.", "Panama's run in the Copa América included a memorable 2-1 win over the United States.", "This was Panama's best-ever performance at the Copa América, improving on their group stage exit in 2016.", "Colombia had possession for the majority of the first half and got off four shots, including three on goal, while Panama applied pressure with seven shots, though just one was on goal.", "The match was held at State Farm Stadium in Glendale, Arizona.", "Attendance for the match was 39,740."], "ranking": [3, 5, 9, 8, 2, 1, 4, 7, 6]}
{"candidates": ["The match took place at the University of Phoenix Stadium.", "Colombia will face the winners of the Uruguay vs Brazil match in the semi-finals."], "ranking": [2, 1]}
{"candidates": ["Orebonye scored for Botswana in the 2nd minute.", "Costa scored for Cape Verde in the 41st minute.", "Velaphi received a yellow card in the 5th minute.", "Mohutsiwa received a yellow card in the 35th minute.", "Phoko received a yellow card in the 77th minute."], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Cape Verde were clear favourites heading into the match, being significantly superior and impressive at home.", "Predictions suggested a Cape Verde win with a probability of 58.13%, a draw with 27.2%, and a Botswana win with 14.7%."], "ranking": [1, 2]}
{"candidates": ["Cape Verde's hopes of advancing now hang in the balance after the loss."], "ranking": [1]}
{"candidates": ["Cape Verde Islands had 77% possession compared to Botswana's 23%.", "Cape Verde Islands had 18 corner kicks while Botswana had none.", "Cape Verde Islands had 25 shot attempts compared to Botswana's 5."], "ranking": [2, 3, 1]}
{"candidates": ["OddsRun offers real-time tracking of odds movement for the Cape Verde vs Botswana match, helping bettors place their bets at the ideal time to lock in the highest odds.", "Additional markets such as under/over, handicap betting, and match winner occurrence are available, giving multiple ways to approach sports betting strategy.", "Bookmakers provide bonuses and promotions, including free bets and deposit bonuses, to enhance the betting experience for the Cape Verde vs Botswana match."], "ranking": [3, 2, 1]}
{"candidates": ["Magri scored for Cameroon in the 51st minute.", "Bayo scored for Guinea in the 10th minute.", "Magri received a yellow card in the 21st minute.", "Moukoudi received a yellow card in the 62nd minute.", "Diakhaby received a yellow card in the 63rd minute.", "Kamano received a yellow card in the 45+3rd minute."], "ranking": [2, 1, 6, 5, 4, 3]}
{"candidates": ["Cameroon were without key striker Vincent Aboubakar due to injury.", "Andre Onana was too late in reporting for duty after playing in Erik ten Hag's side's 2-2 draw with Tottenham on Sunday.", "Cameroon was missing injured captain Vincent Aboubakar.", "Fabrice Ondoa started in goal for Cameroon due to travel problems faced by André Onana.", "Five-time champions Cameroon take on Guinea in their first game of the 2023 Africa Cup of Nations in Group C.", "The big question will be whether Andre Onana who played for Manchester United in the Premier League on Sunday is fielded.", "This will be the third encounter between Cameroon and Guinea at the CAF Africa Cup of Nations, all taking place in the group stages. The two previous meetings ended in draws: 2-2 in 1998 and 1-1 in 2015.", "Cameroon are making their 21st appearance in the CAF Africa Cup of Nations, a tally only bettered by Egypt (26), Côte d’Ivoire (25) and Ghana (24).", "Egypt (7) are the only team to have won the tournament on more occasions than The Indomitable Lions (5).", "Cameroon won the only previous AFCON to be held in Côte d’Ivoire, it was in 1984. They beat Nigeria 3-1 in the final.", "Penalty shoot-outs excluded, Cameroon have lost only one of their last 17 matches at the Africa Cup of Nations (W8 D8), a 3-2 defeat against Nigeria in the round of 16 of the 2019 edition.", "Guinea are taking part in their 14th CAF Africa Cup of Nations. It’s the most appearances for a team at the tournament without ever winning it – the closest they came was in 1976 when Guinea finished second to Morocco in what was then a final group stage.", "Guinea have reached the knockout stages of the Africa Cup of Nations in six of their last seven participations but have never actually progressed in the knockout phase of the competition during that time, either in normal/extra-time or on penalties.", "Guinea have won only two of their last 13 matches at the CAF Africa Cup of Nations (D6 L5), a 2-0 win against Burundi in 2019 and 1-0 against Malawi in 2022.", "Vincent Aboubakar and Karl Toko Ekambi scored 13 of Cameroon’s 14 goals at the 2021 CAF Africa Cup of Nations, eight and five respectively. Aboubakar’s total was the highest in an edition of the tournament since 1974.", "Cameroon’s Rigobert Song is making his first CAF Africa Cup of Nations appearance as head coach. As a player, he featured in a joint-record eight AFCON tournaments and won it on two occasions (2000, 2002).", "Guinea’s nine goals scored in the qualifiers of this African Cup of Nations were scored by eight different players, with Naby Keïta the only player to find the net twice."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]}
{"candidates": ["Cameroon did level early in the second period through Frank Magri's header, but they didn't do enough to win the game.", "The two sides settled for a draw which puts them level in second place in Group C, behind Senegal, with Gambia bottom.", "Cameroon came from behind to share the points with 10-man Guinea in a 1-1 stalemate in the first game for both teams at the Africa Cup of Nations in Ivory Coast.", "Cameroon were frustrated with their inability to defeat a 10-man Guinea.", "The result was seen as ideal for defending champions Senegal in Group C.", "What a result that is for Guinea, who will fancy themselves to beat the Gambia and give Senegal game. Cameroon, meanwhile, should still qualify, but to do anything in this competition, they’ll not only have to play better than that, they’ll have to play different to that."], "ranking": [6, 2, 5, 4, 1, 3]}
{"candidates": ["The match took place in Yamoussoukro.", "The game ended in a 1-1 draw despite Guinea playing with 10 men for the entire second half.", "Bad weather caused travel problems for André Onana, who had flown in from Manchester on a private jet but was further delayed and not named in the match squad.", "Vincent Aboubakar's injury was not as bad as first feared.", "The match had an attendance of 11,271 spectators.", "The match ended in a 1-1 draw.", "Attendance for the match was 11,271."], "ranking": [7, 1, 3, 5, 4, 2, 6]}
{"candidates": ["Pittas scored for Cyprus in the 34th minute", "Mall scored for Latvia in the 44th minute", "Cigaņiks scored for Latvia in the 85th minute"], "ranking": [2, 1, 3]}
{"candidates": ["Cyprus and Latvia are set to meet at the AEK Arena in Larnaca for an international friendly on March 21, 2024.", "Cyprus had a terrible Euro 2024 qualifying campaign, losing all eight matches and finishing at the bottom of Group A.", "Latvia also struggled in their Euro qualifying campaign, winning only one game and finishing at the bottom of Group D.", "Cyprus head coach Temur Ketsbaia has called up 25 players for the double-header against Latvia and Serbia, including Omonia Nicosia forward Andronikos Kakoulis.", "Latvia head coach Paolo Nicolato has announced a 26-man squad for the double-header against Cyprus and Liechtenstein, including key forward Vladislavs Gutkovskis.", "Cyprus and Latvia have met only twice in history, with Cyprus winning both matches.", "Cyprus are ranked 125th in the world, while Latvia are ranked 136th in the FIFA World Rankings."], "ranking": [6, 2, 3, 5, 4, 1, 7]}
{"candidates": ["Underperforming nations Cyprus and Latvia meet in Larnaca for an international friendly", "Cyprus and Latvia struggled in Euro 2024 qualifying but registered wins in the autumn internationals", "Cyprus hopes to replicate their past friendly successes over Latvia", "Cyprus was drawn with strong teams like Spain, Scotland, Norway, and Georgia in Euro qualifying", "Temuri Ketsbaia has faced criticism after eight defeats from eight in Euro qualifying", "Cyprus struggled in League C of the Nations League campaign", "Latvia finished bottom of their Euro 2024 qualifying group but managed to put some points on the board", "Latvia enjoyed relative success in the Nations League, going unbeaten in eight matches between November 2021 and September 2022"], "ranking": [5, 8, 3, 2, 1, 6, 4, 7]}
{"candidates": ["Cameroon defeated Kenya 4-1 at the Ahmadou Ahidjo Stadium on October 11, 2024.", "Captain Vincent Aboubakar, Christian Bassogog, Bryan Mbeumo, and Martin Hongla each scored in the match.", "Captain Vincent Aboubakar’s early penalty opened the scoring for Cameroon.", "Martin Hongla scored the second goal for Cameroon with a shot from the edge of the box.", "Michael Olunga scored Kenya’s only goal from a free kick.", "Bryan Mbeumo scored Cameroon’s third goal from a Christian Bassogog cross.", "Christian Bassogog scored Cameroon’s fourth goal from a Martin Hongla assist.", "Hatayaspor's offensive midfielder Vincent Aboubakar ignited the home crowd with an early penalty kick conversion, barely eight minutes after kickoff.", "FC Granada playmaker Martin Hongla then doubled the advantage in the 39th minute before the visitors cut the deficit through skipper Michael Olunga in the 41st minute.", "Brentford FC's fleetfooted winger Brian Mbeumo stretched Cameroon's lead two minutes later.", "Okhdood Club's Christian Bassogog then hammered the final nail into Kenya's casket with a splendid goal in the 55th minute.", "Vincent Aboubakar opened the scoring by converting a penalty in the eighth minute.", "Martin Hongla doubled Cameroon's lead in the 39th minute.", "Michael Olunga pulled a goal back for Kenya in the 41st minute.", "Bryan Mbuemo restored Cameroon's two-goal cushion in the 43rd minute.", "Christian Bassogog scored the final goal of the match in the 55th minute."], "ranking": [12, 10, 8, 7, 6, 9, 11, 5, 4, 3, 2, 1, 14, 13, 15, 16]}
{"candidates": ["Vincent Aboubakar scored an 8th-minute penalty for Cameroon.", "Martin Hongla scored in the 39th minute for Cameroon.", "Bryan Mbeumo scored in the 43rd minute for Cameroon.", "Christian Bassogog scored in the 55th minute for Cameroon.", "Michael Olunga scored in the 41st minute for Kenya.", "David Nondi received a yellow card in the 30th minute for Kenya."], "ranking": [1, 3, 4, 2, 5, 6]}
{"candidates": ["The Harambee Stars arrived in Cameroon determined to shock the Lions, coming from seven straight victories.", "Coach Engin Firat expressed confidence ahead of the encounter, stating, 'Everyone knows it’s Cameroon and it’s a big football nation and anyone who comes knows they will be under pressure.'", "Coach Engin Firat also mentioned, 'We’re not used to playing in front of this crowd, fantastic fans.'", "Harambee Stars take on the Indomitable Lions on match day three of the 2025 Africa Cup of Nations (AFCON) qualifiers at the Stade Omnisport Ahmadou Ahidjo in Yaoundé.", "Kenya is searching for a win to move back to the top of Group J after Zimbabwe's victory over Namibia.", "Kenya's head coach Engin Firat expects a tough match but is hopeful for a good result.", "Firat emphasized the importance of planning for both the match in Yaoundé and the return match in Kampala.", "Firat has been boosted by the availability of striker Michael Olunga and defender Daniel Anyembe.", "Centreback Joseph Okumu is back fully fit after an injury.", "Cameroon has a potent squad with notable players like goalkeeper Andre Onana, Bryan Mbeumo, and Carlos Baleba.", "The encounter is a crucial one for the Indomitable Lions who can secure a spot for the 2025 Africa Cup of Nations in case of victory.", "The Indomitable Lions of Cameroon will take on the Harambee Stars of Kenya today October 11, 2024 at the Yaounde Ahmadou Ahidjo Stadium at 5:00 p.m.", "Today’s encounter between the Indomitable Lions and the Harambee Stars is a crucial one for the Lions.", "Cameroon needs to get at least four points to be sure of a qualification ticket.", "The two countries are leading the group with Kenya having an upper hand for scoring two goals as compared to Cameroon that scored just one.", "They are tied on four points and a plus one goal difference.", "A victory for Cameroon today will increase the chances of qualification for the Indomitable Lions.", "Ahead of the encounter, the coach Marc Brys had published a list of 24 players to defend the colours of Cameroon in the competition.", "All the players called to camp trained intensively at the Ngoa-Ekelle Stadium in Yaounde.", "The coach has brought in players who played the last two matches against Zimbabwe and Angola."], "ranking": [1, 5, 7, 18, 3, 9, 11, 15, 2, 6, 8, 10, 4, 12, 13, 14, 16, 17, 19, 20]}
{"candidates": ["Coach Engin Firat experienced his heaviest defeat since taking charge of the Harambee Stars.", "Firat will have three days to reorganize his team before the return tie in Kampala."], "ranking": [1, 2]}
{"candidates": ["The victory secured Cameroon a comfortable lead in group J with seven points ahead of Zimbabwe with five points, Kenya four points, and Namibia with no point.", "Marc Brys and his team will travel to Uganda for the second leg of the fixture against Kenya on Monday, October 14.", "Cameroon will have full support at home, creating a potentially hostile environment for Kenya.", "Kenya is unbeaten in seven matches in a row.", "The outcome extended Cameroon's dominance over Kenya, stretching their wins to five in the nine encounters involving the teams since 1972 when they met for the first time.", "Kenya has not won a single match against the West African nation.", "Whereas Kenya only had two shots on target, Cameroon had five.", "The host team still dominated possession with 61 per cent compared to Kenya's 39 per cent.", "Cameroon completed 496 passes against Kenya's 312.", "The teams will flex their muscles in the second-leg fixture on Monday.", "The outcome leaves Cameroon on top of Group J with seven points.", "Kenya now drops to third after matchday 3 and they must now try to get at least a point in the return leg against Cameroon on Monday in Uganda to avoid being pushed out of qualification positions ahead of the final matchday in November."], "ranking": [7, 12, 9, 5, 2, 4, 8, 10, 6, 11, 3, 1]}
{"candidates": ["This will be another international break where Kenyans will not have a chance to watch their national team live due to lack of facilities."], "ranking": [1]}
{"candidates": ["Mons Bassouamina scored for Congo at 45'+3'.", "Elias Mokwana scored for South Africa at 33'.", "Ramaric Etou (Congo) was substituted at 90'+3'.", "Nkosinathi Sibisi (South Africa) was substituted at 88'.", "Christopher Ibayi (Congo) was substituted at 85'.", "Elias Mokwana's 33rd minute strike gave Bafana Bafana a deserved lead.", "Poor defending by Bafana's defense on the stroke of halftime allowed Congo to equalize.", "Themba Zwane got injured and was replaced by Patrick Maswanganyi a few minutes after Mokwana had scored.", "Mokwana was unlucky not to open the score in the 24th minute after the Congo defense let him run through but shot wide.", "Bafana defender Rushwin Dortley saw his header cleared off the line after connecting well with Oswin Appolli's corner kick.", "A lapse of concentration by Dortley and Grant Kekana gave Congolese striker Andre Bassouamina enough room to level matters deep into referee's optional time.", "Congo started the second half a better side, forcing Bafana to retreat and make mistakes that led to a corner kick cleared by Mudau off the line in the 51st minute.", "Congo's skipper Ganvoula Mboussy came close to finding the winner but his shot went wide with a few minutes remaining.", "Bafana Bafana thrashed The Red Devils 5-0 courtesy of goals from Bathusi Aubaas, Lyle Foster, Iqraam Rayners and a brace by Teboho Mokoena."], "ranking": [12, 8, 14, 13, 11, 9, 10, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Bassouamina scored for Congo in the 45+3 minute.", "Mokwana scored for South Africa in the 33rd minute.", "Makouta and Ossete scored for Congo in the 54th and 57th minutes respectively.", "Mobbie received a red card in the 80th minute."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Bafana Bafana is on the verge of securing their qualification for next year’s Africa Cup of Nations following their group K qualifiers’ match against Congo Brazzaville.", "Bafana coach Hugo Broos has voiced out his concern about the synthetic pitch following their light training session where a light drizzle helped to cool down the scorching daytime temperatures.", "Broos mentioned that they have had bad experiences with synthetic pitches in the past and hopes the pitch is good for them to play their best football.", "The kick-off is set for 6pm and the 1996 AFCON champion will look for nothing but a victory in order to book their ticket to Morocco next year.", "Bafana Bafana head coach Hugo Broos has made one change with Iqraam Rayners replacing Lyle Foster in attack for their 2025 AFCON Qualifier second leg clash against Congo Brazzaville at the Alphonse Massemba-Débat Stadium.", "South Africa showed no mercy to the Congolese in a one-sided first leg affair at the Nelson Mandela Bay Stadium in Gqeberha, running out convincing 5-0 victors.", "Hugo Broos’ men occupy second spot in Group K behind leaders Uganda who beat minnows South Sudan 1-0 to also keep their undefeated run in the qualifying campaign intact.", "With a win today, Bafana would move to 10 points from four games and open a seven-point gap to Congo Brazzaville, ultimately booking their ticket for next year’s AFCON."], "ranking": [6, 4, 3, 8, 5, 1, 7, 2]}
{"candidates": ["Bafana Bafana play Congo Brazzaville back-to-back in the coming days hoping to qualify for their 12th Afcon tournament.", "Bafana Bafana host Congo Brazzaville at the Nelson Mandela Bay Stadium in Gqeberha on Friday, 11 October 2024 (7pm), and then they travel to Congo to play the return match on Tuesday, 15 October 2024.", "If Bafana wins both matches, they will sit with 10 points and be on the verge of qualifying for the Afcon.", "Should Uganda beat South Sudan home and away and Broos’ men also do the same against Congo, Bafana should qualify alongside Uganda.", "Broos has called Luke le Roux to join the squad after the withdrawal of two players.", "Luke le Roux has urged Bafana fans to come in their number for the Afcon qualifier against Congo Brazzaville.", "Three important points are up for grabs at Stade Alphonse Massemba-Debat as Congo entertain the challenge of South Africa in round four of the 2025 Africa Cup of Nations qualifiers.", "The hosts need a win to get their AFCON pursuit back on track before the final set of matches in November, while the visitors set out in search of a win that would confirm their place in Morocco.", "South Africa turned on the style in front of goal as they ran out emphatic 5-0 winners against Congo in Friday's encounter at the Nelson Mandela Bay Stadium.", "South Africa has not been beaten in their last 11 matches, propelling them to second place in their AFCON qualifying group, trailing Uganda only on goal difference.", "Congo kicked off their qualifying journey with a narrow 1-0 victory over South Sudan on September 5, but things have not gone as planned since then."], "ranking": [8, 2, 6, 5, 4, 3, 10, 9, 1, 7, 11]}
{"candidates": ["Bafana Bafana will have to beat Uganda in Kampala next month to ensure back-to-back qualification for the Africa Cup of Nations.", "Though not a satisfactory result, Bafana still have a better chance than Congo to qualify.", "Bafana always looked good on the ball, matching their credentials of coming to this match unbeaten in 16 matches."], "ranking": [2, 3, 1]}
{"candidates": ["South Africa will head into this one on a high, and it is hard to bet against them completing a double over Congo.", "Broos's men are expected to claim a routine win over the hosts and secure safe passage into the AFCON group phase."], "ranking": [1, 2]}
{"candidates": ["Off the back of his double against Congo, Teboho Mokoena has now scored eight times for South Africa—more than any other active player with the exception of Percy Tau and Themba Zwane.", "Christoffer Mafoumbi recently racked up his 38th cap to move level with fellow goalkeeper Brice Samba into 10th place on the hosts' all-time appearances chart."], "ranking": [1, 2]}
{"candidates": ["Vedat Muriqi scored a penalty in the 9th minute.", "Vedat Muriqi scored again in the 21st minute.", "Amir Rrahmani scored in the 48th minute.", "David Dellova scored in the 55th minute.", "Ioannis Pittas scored for Cyprus in the 62nd minute.", "Mergim Vojvoda received a red card in Kosovo's previous match, leading to his suspension for this game."], "ranking": [2, 3, 4, 5, 1, 6]}
{"candidates": ["Cyprus will face Kosovo at the AEK Arena on Monday in another round of their 2024-25 UEFA Nations League campaign.", "Cyprus kicked off their Nations League campaign with a 1-0 victory over Lithuania.", "Kosovo were beaten 3-0 by Romania in their tournament opener.", "Monday's game will mark the third meeting between Cyprus and Kosovo, with Kosovo winning their previous two matchups.", "The two teams last faced off in a Nations League clash in September 2022, which Kosovo won 5-1.", "Cyprus have managed just two clean sheets in their last 17 games across all competitions.", "Kosovo have failed to score any goals in four of their last five matches.", "Cyprus were ranked 127th in the latest FIFA rankings and now sit 21 places behind Kosovo."], "ranking": [8, 6, 5, 4, 3, 2, 7, 1]}
{"candidates": ["This victory boosts the team’s morale and demonstrates the players’ commitment to giving their best in every upcoming match."], "ranking": [1]}
{"candidates": ["Cyprus' form on home soil has been largely positive in the Nations League.", "Kosovo defeated Cyprus twice in the 2022 Nations League by a combined score of 7-1."], "ranking": [2, 1]}
{"candidates": ["Coach Franco Foda rotated players, bringing on Ilir Krasniqi, Emir Sahiti, and Eliot Bujupi, who made his debut for the national team."], "ranking": [1]}
{"candidates": ["Tonga kicked off their FIFA World Cup qualifying campaign with a crucial 3-1 win over the Cook Islands.", "Cook Islands lost to Tonga 1:3 in the World Cup 2026 - First Round Semi Finals on 2024-09-06 at Football Federation Samoa Football Stadium.", "Tonga’s National Football team, Tu’ulalupe, defeated the Cook Islands 3-1 today at the FIFA World Cup 26™ Oceania Qualifiers in Apia, Samoa.", "Viliami Tikoipau scored the opening goal for Tonga at the 27th minute.", "Hemaloto Polovili scored a penalty for Tonga at the 38th minute.", "Christopher Kefu scored the third goal for Tonga at the 79th minute.", "Taci Kumsuz scored the only goal for Cook Islands at the 63rd minute.", "V. Tikoipau scored the first goal for Tonga at 27 minutes.", "H. Polovili scored a penalty for Tonga at 39 minutes.", "T. Kumsuz scored for Cook Islands at 63 minutes.", "C. Kefu scored the final goal for Tonga at 79 minutes.", "Captain Hemaloto Polovili created the first goal and scored the second for Tonga.", "Viliami Tikoipau scored the first goal for Tonga at 27 minutes.", "Hemaloto Polovili scored from the penalty spot to double Tonga's lead.", "Taci Kumsuz scored for Cook Islands at 63 minutes.", "Christopher Kefu scored a crucial third goal for Tonga at 79 minutes."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]}
{"candidates": ["Viliami Tikoipau scored the first goal for Tonga in the 27th minute.", "Hemaloto Polovili scored the second goal for Tonga in the 39th minute from a penalty.", "Taci Kumsuz scored for Cook Islands in the 63rd minute.", "Christopher Latu 'Eiki'eua Kefu scored the third goal for Tonga in the 80th minute.", "Taci Kumsuz received a yellow card in the 82nd minute.", "Hemaloto Polovili received a yellow card in the 45+3rd minute.", "Ngereine Zachary Maro received a yellow card in the 38th minute."], "ranking": [2, 3, 4, 1, 6, 5, 7]}
{"candidates": ["Cook Islands coach Tuka Tisam is confident in his team's preparation and believes they are ready to face Tonga.", "Tonga's coach Kilifi Uele emphasizes the importance of their planning process and expresses excitement for the World Cup campaign.", "The locals are coming off a 1-0 win over Tonga in their last match, so Tonga will be looking to redeem themselves and take the win.", "This will be the 9th meeting between the two teams since their inception, with Cook Islands having 4 wins, 1 draw, and 3 wins for Tonga.", "The 2026 World Cup will be the first World Cup with 48 participants, allowing Oceania to have at least one direct qualifier for the first time in history."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Tonga wins 1-3 against the Cook Islands, in a match corresponding to the World Cup Qualifiers, where the locals suffered and ended up losing with key plays."], "ranking": [1]}
{"candidates": ["The match was held at J.S. Blatter Football Complex Tuanaimato Field 1, Apia.", "First half score was 0-2 in favor of Tonga.", "Final score was 1-3 in favor of Tonga."], "ranking": [3, 2, 1]}
{"candidates": ["The match took place at J.S. Blatter Football Complex Tuanaimato Field 1 (Main Stadium) with a great attendance.", "The Main Stadium is a soccer stadium located on Talimatau Road, Tuanaimato in Apia, Samoa, with a capacity of 3500 fans and a natural grass pitch."], "ranking": [2, 1]}
{"candidates": ["Son Heung-min scored his 40th goal for the national team.", "Korea marked the sixth consecutive match in which they conceded zero goals."], "ranking": [1, 2]}
{"candidates": ["Son Heung-min scored twice as South Korea beat China 3-0.", "Son Heung-min netted an 11th-minute penalty.", "Son Heung-min headed home a second goal just before the break.", "Son Heung-min assisted Jung Seung-hyun's header in the 87th minute.", "Son Heung-min scored a brace, including a penalty and a header.", "Hwang Hee-chan earned a penalty after Jiang Shenglong committed a foul.", "Defender Jung Seung-hyun scored his first-ever goal for the national team in the 87th minute.", "Son Heung-min scored a brace and assisted one goal to help South Korea beat China 3-0.", "South Korea showed dominance with 65 percent of ball possession and a total of 18 shots.", "South Korea broke the deadlock just 11 minutes into the match with a penalty converted by Son Heung-min.", "Son Heung-min headed home his second goal from a corner in the 45th minute.", "Jung Seung-hyun's header sealed the 3-0 victory for South Korea in the 86th minute.", "Son Heung-Min scored a penalty in the 11th minute.", "Jung Seung-Hyun scored in the 87th minute.", "Match ended with China PR 0, Korea Republic 3.", "Son Heung-min scored a brace as South Korea made it two wins from two games in 2026 World Cup qualifying with a 3-0 victory away in China.", "Son silenced a sell-out crowd of more than 40,000 in Shenzhen with two goals in the first half, the first a penalty and the second a clever header from a corner just before half-time.", "South Korea wrapped the game up in the dying minutes through a bullet header by Jung Seung-hyun — from a Son set-piece.", "Wolverhampton Wanderers forward Hwang Hee-chan was brought down in the box and Tottenham Hotspur’s Son duly stroked home the penalty.", "South Korean full-back Lee Ki-je was dispossessed and Liu Binbin crossed for Tan Long, but the Chinese forward’s first-time snap shot went narrowly wide.", "Son, who had been denied moments earlier by the legs of Yan, leapt unmarked from a corner to direct his deft header back across the China goal and into the far corner.", "Son Heung-Min scored twice and set up the third as South Korea handed China a 3-0 defeat in Shenzhen.", "Son Heung-Min put South Korea in front with an 11th minute penalty.", "Son Heung-Min added the second goal in the final minute of the first half with a header.", "Son Heung-Min provided an assist for Jung Seung-hyun's goal three minutes from time.", "Son Heung-min scored two goals and set up another to help South Korea win 3-0 over China.", "Son Heung-min scored his first goal from the penalty spot in the 11th minute.", "Son Heung-min scored his second goal just before halftime with a header.", "Jung Seung-hyun added the third goal with a header off a free kick from Son Heung-min."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]}
{"candidates": ["South Korea won 5-0 against Singapore with goals from Cho Gue-sung, Hwang Hee-chan, Son Heung-min, Hwang Ui-jo, and Lee Kang-in.", "China won 2-1 against Thailand with goals from Wu Lei and Wang Sangyuan.", "Lee Jae-sung's goal was incorrectly disallowed for offside.", "Cho Gue-sung hit the crossbar in the first half against Singapore."], "ranking": [1, 2, 4, 3]}
{"candidates": ["Klinsmann did not make significant changes to the starting XI from the match against Singapore, apart from midfielder Park Yong-woo replacing Lee Jae-sung and fullback Kim Tae-hwan starting in lieu of Seol Young-woo."], "ranking": [1]}
{"candidates": ["The team’s attack no longer seems to be an issue, unlike Klinsmann’s first five games in charge when Korea only managed four goals due to a lack of goal decisiveness.", "Regular striker picks Cho Gue-sung and Hwang Ui-jo did not get on the scoresheet during Tuesday’s game, but their improvements in the recent fixtures are a bright sign for Klinsmann.", "South Korea coach Jurgen Klinsmann commented that scoring a goal lifted the atmosphere for the team."], "ranking": [2, 3, 1]}
{"candidates": ["South Korea's route to goal involved getting crosses into the box to make the most of Cho Gue-sung's physical presence and aerial ability.", "China's back four is taller than Singapore's, which may impact Korea's aerial duels.", "Jurgen Klinsmann used a 4-4-1-1 formation with Son Heung-min behind Cho Gue-sung, later switching to a 5-4-1.", "China is currently ranked 79th in the world and 11th in Asia.", "China hasn't made it to a World Cup since 2002.", "Aleksandar Janković has been in charge of China since 2022, with a record of four wins, two draws, and three losses.", "The match will take place at Shenzhen Universiade Sports Centre on November 21, 2023, at 05:30 PM (IST).", "China's form: W L W L D W.", "South Korea's form: W W W W D D.", "Wu Lei is the leading goalscorer for Shanghai SIPG with 185 goals and the second-highest goalscorer in the history of the Chinese Super League with 116 goals.", "Son Heung-Min is celebrated for his remarkable speed, impressive finishing skills, proficiency with both feet, and his ability to connect and coordinate plays on the field.", "In the previous twelve meetings, South Korea has won seven times, China has won two, and there have been three draws.", "South Korea leads 20–11 in goal differential.", "South Korea has won four straight games and all six of their previous contests against China.", "Son Heung-Min experienced a moment of concern during South Korea’s 5-0 World Cup qualification triumph over Singapore but reassured everyone that he should be ready for the upcoming game against China.", "Zhang Yuning has had limited game time, featuring in only three matches for Beijing Guoan as a substitute in recent weeks."], "ranking": [5, 4, 3, 15, 14, 13, 16, 12, 11, 10, 9, 8, 7, 6, 2, 1]}
{"candidates": ["Lee Kang-in had a productive game against Singapore, scoring one and assisting one, and is expected to be a key player for South Korea.", "Wu Lei scored his 33rd goal for China in the win over Thailand and has a good record in World Cup qualification.", "Jung Seung-hyun's performance against Singapore was notable for his passing accuracy and defensive duels.", "Predicted Lineup for China: Junling; L Zhang, Zhu, L Li; Xu, Wu, K Li, Liu; Y Zhang, W Lei, Shihao.", "Predicted Lineup for South Korea: Kim Seong-Gyu; Seol, Kim Min-Jae, Jung, Lee-Ki; Hong, Park; Lee Jae-Sung, Lee Kang-In, Hwang; Son.", "Match Prediction: China 0-1 South Korea.", "Telecast: India – Sony Sports Ten 2, Sony Liv; Nigeria – SuperSport."], "ranking": [3, 2, 4, 6, 5, 1, 7]}
{"candidates": ["Davinson Sánchez scored at 34'", "Luis Díaz scored at 52'", "Jhon Durán scored at 82'", "Luis Sinisterra scored at 90'+3'", "VAR Decision: Goal Colombia 4-0 Chile (Luis Sinisterra)", "Colombia defeated Chile 4-0 in the World Championship Qualification match on October 15, 2024."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Colombia defeated Chile 4-0 on October 15, 2024.", "Goals were scored by Sanchez (34'), Diaz (52'), Duran (82'), and Sinisterra (90+3').", "Cordoba and Mojica received yellow cards for Colombia.", "Tapia and Pulgar received yellow cards for Chile."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Colombia aimed to regain momentum at home after a disappointing loss to Bolivia.", "Chile, struggling with only five points in nine matches, sought to claim a rare away victory.", "Colombia was preferred to win due to their strong home record and recent dominance in head-to-head encounters."], "ranking": [2, 3, 1]}
{"candidates": ["The jersey will be worn on 15 October 2024, during the World Cup Qualifier against Chile, paying tribute to the first kit worn by the national team in 1945.", "Colombia aimed to recover from a shock defeat to Bolivia.", "Chile was at the bottom of the table after a late defeat on matchday nine.", "Colombia had a strong home record, taking 10 points from a possible 12 in Barranquilla.", "Chile had only won once at home against Colombia since 2001.", "Chile's only win in the campaign came against Peru at home last year."], "ranking": [5, 2, 3, 1, 4, 6]}
{"candidates": ["The match took place at Estadio Metropolitano Roberto Meléndez in Barranquilla with a capacity of 46,789 spectators.", "Venezuelan referee Valenzuela J. officiated the game.", "The hot and humid climate in Barranquilla could have affected Chile's performance."], "ranking": [3, 2, 1]}
{"candidates": ["adidas and the Colombian Football Federation (FCF) have launched a special edition jersey to mark the Federation’s centenary.", "The Chalk White shirt symbolises Colombia's humble beginnings and the legacy of those who have represented the nation.", "It features the Colombian flag on the chest and a 100th-anniversary FCF logo on the back.", "The adidas trefoil and FCF logos are presented in gold, highlighting the unique character of this limited edition, while the collar features the vibrant colours of the national flag."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Key players such as Alexis Sanchez for Chile were unavailable due to injury.", "Colombia's star player Luis Díaz has scored four goals at home in World Cup qualifiers and remains a key figure in the attack."], "ranking": [2, 1]}
{"candidates": ["Vincent Aboubakar’s second-half strike proved the difference as Cameroon beat Namibia 1-0.", "Peter Shalulile threatened as early as the fourth minute with a shot.", "Edward Maova kept out Carlos Baleba’s effort on six minutes.", "Andre Onana saved a shot from Peter Shalulile on 25 minutes.", "Jackson Tchatchoua went close on 58 minutes with a shot that flew just wide.", "Bryan Mbeumo tested Maova at his near post on the hour mark.", "Vincent Aboubakar scored on the rebound after Maova couldn’t hold onto Bryan Mbeumo’s shot.", "Deon Hotto missed a golden opportunity to equalise in stoppage time.", "Vincent Aboubakar scored the only goal of the match in the 64th minute, securing a 1-0 victory for Cameroon.", "Bryan Mbeumo's powerful shot was parried by Namibian goalkeeper Edward Maova, leading to Aboubakar's goal.", "Vincent Aboubakar scored the only goal of the match at the 65th minute.", "Vincent Aboubakar scored the only goal of the match in the 65th minute, securing a 1-0 victory for Cameroon over Namibia."], "ranking": [1, 6, 8, 9, 10, 7, 2, 5, 3, 4, 11, 12]}
{"candidates": ["Vincent Aboubakar scored the only goal of the match in the 65th minute to secure a 1-0 victory for Cameroon.", "Ivan Kamberipa received a yellow card in the 20th minute.", "Aprocius Petrus received a yellow card in the 68th minute."], "ranking": [1, 3, 2]}
{"candidates": ["The Malian refereeing quartet, led by central referee Boubou Traore, has arrived in Garoua to officiate the Cameroon vs Namibia match on September 7, 2024.", "The referees, including assistant referees Modibo Samake and Amadou Belly Guisse, as well as fourth official Sory Ibrahima, are set to commence training on September 5 to familiarize themselves with the playing venue.", "Boubou Traore has a wealth of experience in CAF competitions, including officiating the Nigeria vs Algeria clash in 2023.", "A delegation from the Cameroon Football Federation (Fecafoot) has also arrived in Garoua to oversee match preparations.", "Cameroon’s national team is expected to arrive in Garoua on Thursday, while Namibia is scheduled to land later that night.", "As Cameroon prepares to host Namibia on September 7, 2024, for the first match of the CAN Morocco 2025 qualifiers, the national team is caught in a dispute between FECAFOOT and the Ministry of Sports.", "The two parties disagree not only on the choice of the stadium but also on the location for the players’ assembly.", "The players are caught between two conflicting flight plans, one from the coordinator of selections appointed by FECAFOOT and the other from the national team coordinator appointed by the government.", "One of the 24 players called up by coach Marc Brys mentioned receiving two flight plans, one asking to land in Douala and the other saying the destination is Yaoundé.", "The first players have already arrived in Cameroon and are awaiting the start of the preparatory camp, scheduled for September 2.", "The article highlights the ongoing conflict within Cameroonian football as FECAFOOT takes legal action against national team coach Marc Brys over player passports, which could potentially jeopardize the team's performance against Namibia on September 7, 2024.", "Cameroon national team's preparations for the 2025 Afcon Qualifiers have been hit by chaos.", "The selected players for the Indomitable Lions’ upcoming games are yet to report for camp in Douala.", "Cameroon is set to face Namibia at home on 7 September before travelling to Kampala, Uganda to play Zimbabwe three days later.", "FECAFOOT president Samuel Eto’o has called up the U20s to train while waiting for the senior players to arrive.", "The U20 team has been training for a few weeks at the CAF Centre of Excellence in Mbankomo and arrived at the La Falaise hotel in Douala.", "FECAFOOT has taken all necessary measures to transport the players from their respective clubs to the venue in Douala.", "FECAFOOT expects the 24 players duly summoned by the National Coach-Selection Coach to arrive no later than 8 a.m. on 4 September 2024 at the Hôtel la Falaise Bonanjo in Douala.", "Cameroon and Namibia are starting their 2025 Africa Cup of Nations qualifying campaign.", "Both teams are in Group C along with Kenya and Zimbabwe.", "Cameroon were held to a 1-1 draw by Angola in their last match in the 2026 FIFA World Cup qualifiers.", "Namibia suffered a 5-0 defeat to Angola in the 2024 COSAFA Cup final.", "Cameroon have called up 24 players for the qualifiers, including Andre-Frank Zambo Anguissa, Andre Onana, and Vincent Aboubakar.", "Namibia have named a 25-man squad for the qualifiers, retaining most players from the COSAFA Cup."], "ranking": [14, 18, 20, 16, 15, 1, 2, 3, 4, 10, 5, 6, 7, 8, 9, 11, 12, 13, 17, 19, 21, 22, 23, 24]}
{"candidates": ["The victory was seen as a powerful message of unity and pride for the nation, despite the administrative turmoil.", "The performance reminded Cameroonians of the unifying power of football.", "The team demonstrated resilience and mental strength, overcoming both on-field and off-field challenges."], "ranking": [1, 3, 2]}
{"candidates": ["The match was held at the Roumde Adjia Stadium in Garoua.", "This was the opening match of Cameroon’s 2025 Africa Cup of Nations qualifying campaign.", "Cameroon hold a slight upper hand in the history of this fixture, having won two of the last four meetings between the two nations.", "Namibia have managed one win in that time, which came in March 2023, when they beat Cameroon 2-1 in the AFCON qualifiers.", "Cameroon are unbeaten in their last four competitive home games, picking up three wins and one draw since a 1-0 loss against Algeria in March 2022.", "Namibia have lost just one of their last seven matches across all competitions while claiming three wins and three draws since June 5.", "The last two encounters between Cameroon and Namibia ended in a draw and a victory for Namibia.", "Ongoing disputes between FECAFOOT and the government continue to cast a shadow over the proceedings.", "The poor condition of the pitch in Garoua hindered both teams' ability to control the game and create clear-cut chances.", "The match highlighted the need for unity at all levels, including between FECAFOOT and the Ministry of Sports and Physical Education."], "ranking": [10, 8, 6, 5, 4, 3, 2, 9, 7, 1]}
{"candidates": ["The legal action underscores the deepening power struggle between FECAFOOT and the Ministry of Sports and Physical Education (MINSEP), resulting in two competing technical staffs for the national team."], "ranking": [1]}
{"candidates": ["On October 10, 2024, Brazil defeated Chile 2-1 in a World Cup Qualifying match."], "ranking": [1]}
{"candidates": ["Brazil are in unfamiliar territory, grappling with mounting pressure and uncertainty as they prepare for crucial World Cup qualifiers against Chile and Peru, without the help of key players sidelined by injuries.", "Brazil's manager Dorival Jr, who was appointed in January after the team spent a year under two caretaker coaches, has won only two competitive games.", "Dorival was forced to make five changes to his initial squad for the games against Chile in Santiago on Thursday and against Peru in Brasilia on Tuesday, after goalkeeper Alisson, defenders Bremer, Eder Militao and Guilherme Arana, and forward Vinicius Jr all suffered injuries.", "On Wednesday, the coach made the surprise announcement that Botafogo forward Igor Jesus would start up-front against Chile on his first call-up for the national team, leaving Real Madrid teenager Endrick on the bench.", "Chile are ninth in South America's World Cup qualifying standings on five points, two points ahead of last-placed Peru.", "This is the headline clash of this matchday in CONMEBOL World Cup qualifying: a high-stakes meeting between two recent powerhouses each trying to move beyond the aging superstars who carried them for the last decade.", "October 12, 2023 was Chile’s last competitive win, and only win in World Cup qualifying so far; if they cannot win on Thursday, they’ll officially pass one year without before reaching next Tuesday’s matchday.", "Brazil has been ravaged by injuries: in addition to the five players who had to be cut from the squad, the likes of João Pedro, Estêvão, Richarlison, Pedro, and Neymar weren’t fit enough to be selected to begin with.", "Dorival has chosen a grab bag of out-of-form nobodies in Europe and mid-tier Brasileirão performers over seemingly superior options playing regularly at a higher level.", "Dorival’s squad selection this time—only calling up four midfielders initially before finally bringing in Andreas Pereira after Vini Jr. got hurt—indicates that he has learned nothing and is only going to commit harder to the 4-2-4.", "Dorival’s apparent intention to move Lucas Paquetá deeper—a move that has worked before, but why not try it within the structure of a proper three-man midfield?"], "ranking": [6, 8, 5, 9, 10, 1, 3, 2, 4, 7, 11]}
{"candidates": ["The three points will come as a welcome relief to head coach Dorival Junior but it was a poor showing from Brazil.", "The pressure on the manager is now only likely to increase after such a disjointed performance.", "Brazil coach Dorival Júnior stated that his team will continue to have ups and downs as he tries out new players.", "Henrique expressed the significance of wearing the Brazil shirt and assured fans of their passion and commitment.", "Dorival Júnior mentioned that Brazil will have a very strong team in two years, referring to the next World Cup."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Brazil's victory lifted them to fourth in the standings with 13 points.", "Chile are second from bottom on five points.", "The match was held at Estadio Nacional Julio Martínez Prádanos in Santiago, Chile.", "Attendance for the match was 43,059.", "Brazil achieved a 2-1 away victory over Chile in the South American World Cup qualifiers.", "The match took place at Estadio Nacional Julio Martínez Prádanos in Santiago, Chile, with an attendance of 43,059."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["Brazil's dominance over Chile has continued into the present day, with the 2024 victory being part of a series of 17 wins in the last 20 encounters."], "ranking": [1]}
{"candidates": ["Dennis Man scored at the 16th minute.", "Razvan Marin scored a penalty at the 25th minute.", "Radu Dragusin scored at the 36th minute.", "Match ended with a score of Cyprus 0, Romania 3."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Romania's Man scored in the 16th minute", "Romania's R. Marin scored a penalty in the 25th minute", "Romania's Dragusin scored in the 36th minute"], "ranking": [2, 1, 3]}
{"candidates": ["Romania is seeking to win their third successive UEFA Nations League match.", "Cyprus has appointed Sofronis Avgousti as the new head coach after relieving Temur Ketsbaia of his duties.", "Cyprus has lost each of their last five competitive home matches by an aggregate score of 16-1.", "Romania has not lost any of their last seven qualification matches across all competitions away from home.", "Romania's head coach Mircea Lucescu returned to manage the national team 38 years after his first spell in charge.", "First match under Sofronis Avgousti as manager for Cyprus"], "ranking": [3, 2, 6, 5, 1, 4]}
{"candidates": ["Match was held at AEK Arena, Larnaca, Cyprus.", "Attendance was 6,092.", "Referee was Sascha Stegemann."], "ranking": [3, 2, 1]}
{"candidates": ["Group C2 Standings: Romania-9, Kosovo-6, Cyprus-3, Lithuania-0"], "ranking": [1]}
{"candidates": ["Cape Verde's biggest ever Afcon victory."], "ranking": [1]}
{"candidates": ["Bebe opened the scoring with a free-kick from 40 metres out.", "Ryan Mendes scored the second goal six minutes after half-time.", "Kevin Pina sealed the victory with a strike into the top corner in the 69th minute.", "Geny Catamo's penalty decision was reversed after VAR review.", "Tiago Manuel Dias Correia (Bebe) scored a brilliant free kick from distance on the half hour mark to give Cape Verde the 1-0 lead by the mandatory half time break.", "Ryan Isaac Mendes da Graca added the second goal six minutes into the second half.", "Kevin Lenini Goncalves Pereira de Pina scored the third goal with a scorching long range shot from 30 yards past goalkeeper Alberto Ernan Siluane.", "Cape Verde's forward Bebe scored a 40-yard free kick.", "Captain Ryan Mendes doubled Cape Verde's lead after a defensive lapse.", "Kevin Pina secured the victory with a brilliant strike into the top corner from outside the box.", "Geny Catamo of Mozambique won a penalty in the first half, but it was overturned by VAR.", "Geny Catamo hit the crossbar with a free kick and had one of Mozambique's two shots on goal.", "Cape Verde became the first team to qualify for the knockout stages of the Africa Cup of Nations with a 3-0 victory over Mozambique.", "Bebe’s extraordinary free-kick and a brace from Ryan Mendes in Abidjan guaranteed that the Blue Sharks will top Group B.", "Deroy Duarte forced an athletic save from Mozambique goalkeeper Ernan Siluane and also sent a diving header just wide of a post.", "Bebe crashed a dipping 30-yard free-kick against the crossbar, but later scored from a 40-yard free-kick.", "Geny Catamo went down under a challenge from two defenders and a penalty was awarded before referee Samir Guezzaz reversed his decision after consulting the VAR monitor.", "Mendes doubled the Blue Sharks’ advantage after 51 minutes by dispossessing Edmilson Dove and firing home from the edge of the box.", "Catamo clipped the crossbar with a curling free-kick, Mozambique’s best effort.", "Mendes scored his second goal with a thumping drive from 25 yards, his 17th international goal.", "Former Manchester United winger Bebe scored as Cape Verde won 3-0 against Mozambique to reach the last 16 of the Africa Cup of Nations.", "Bebe scored from a set piece on 32 minutes, with Mozambique 'keeper Ernan Siluane conceding from a long-range effort.", "Cape Verde’s captain Ryan Mendes scored on 51 minutes after a defensive error from Mozambique's Edmilson Dove.", "Kevin Pina scored a brilliant third goal for Cape Verde with a fierce shot into the top corner from outside the area.", "Geny Catamo of Mozambique threatened most for his team, earning a penalty that was overturned by a video review and striking the woodwork with a free-kick.", "Cape Verde won 3-0 at home over Mozambique, the goals came from Bebé at minute 32', Ryan Mendes at minute 51' and Kevin Pina at minute 69'.", "Kevin Pina scored a goal after a right-footed shot from outside the box, assisted by Deroy Duarte.", "Ryan Mendes scored a goal after a right-footed shot inside the box.", "Bebé scored a goal after a right-footed shot from outside the area, following a direct free kick."], "ranking": [1, 5, 3, 14, 2, 6, 4, 7, 8, 15, 16, 9, 10, 11, 12, 13, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]}
{"candidates": ["Cape Verde won 3-0 against Mozambique with goals from Bebe (32'), Mendes (51'), and Pina (69').", "Cabral received a yellow card at the 61st minute."], "ranking": [1, 2]}
{"candidates": ["Following their impressive first games in the 2024 TotalEnergies Africa Cup of Nations campaign, Cape Verde and Mozambique target a round of 16 slot when they square off on Friday.", "Cape Verde stunned five-time champions Ghana with a 2-1 win in their opener while Mozambique held record holders Egypt in a 2-2 draw conceding a late penalty.", "A win for the Blue Sharks will ensure passage to the last sixteen while it will be almost done for the Mambas as well if they pick maximum points.", "This will be the first ever meeting at the Africa Cup of Nations between the two nations.", "A win for Cape Verde could ensure progress from the group stages for the third time in four attempts.", "Mozambique are still in search for a first victory at the AFCON finals (D3, L10).", "Their two goals against Egypt means Mozambique have scored two or more goals in five international matches in eight matches.", "Six of Mozambique’s last eight internationals saw both teams score.", "In the past four meetings, all coming in the Africa Cup of Nations qualifiers, Cape Verde has won two and lost one. (D1).", "Cape Verde and Mozambique both warmed up on the Stade Félix Houphouët Boigny pitch.", "Mozambique's key player to watch was Witi, a center forward playing for Club Nacional Madeira of Portugal.", "Cape Verde's key player to watch was Jamiro Monteiro, a center forward playing for the San Jose Earthquakes Club of the United States.", "Cape Verde and Mozambique have met four times since 2014, with Cape Verde winning two matches, Mozambique winning one, and one draw.", "Mozambique was in third position in group B standings with one point before the match.", "Cape Verde was in the number one position in group B standings with three points before the match."], "ranking": [5, 2, 1, 14, 3, 6, 10, 8, 12, 15, 11, 9, 13, 4, 7]}
{"candidates": ["Cape Verde seek qualification from their Africa Cup of Nations group when they take on Mozambique.", "Cape Verde began their Group B journey with a victory over Ghana, while Mozambique suffered a late loss against Egypt.", "Cape Verde are keen to secure maximum points to assure them of a spot in the round of 16.", "Mozambique hopes to recover from their disappointment against Egypt.", "Cape Verde stunned a star-stunned Ghana 2-1, while Mozambique were unlucky not to win against tournament record holders, Egypt who snatched a late 2-2 draw.", "A victory for Mozambique could see them make history by advancing from the tournament’s group stages for the first time ever, but a tactically sound Cape Verde will not make it easy for them.", "This will be the first meeting between the two sides in the TotalEnergies CAF AFCON.", "Cape Verde remains on a series of three unbeaten matches against Mozambique (2 wins, 1 draw), all played in the qualifiers for the TotalEnergies CAF Africa Cup of Nations."], "ranking": [5, 4, 3, 2, 8, 7, 1, 6]}
{"candidates": ["Ryan Mendes commented on the team's belief and hard work after reaching the last 16.", "Mendes was named the man of the match as Cape Verde has now earned six points from two games after a 2-1 win over Ghana Black Stars.", "Cape Verde's victory secures top spot in Group B, ahead of former champions Egypt and Ghana, with one game remaining.", "Cape Verde will face a third-place finisher from Group A, C, or D in the round of 16.", "Cape Verde's 3-0 victory over Mozambique was covered in detail, including match statistics and key events."], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["Cape Verde is now certain to finish on top of Group B after defeating Ghana 2-1 in their opening game.", "Cape Verde became the first country to make the grade to the round of 16 stage at the on-going AFCON 2023 tournament in Cote D’Ivoire.", "Cape Verde has now earned six points from two games after a 2-1 win over Ghana Black Stars.", "With Cape Verde already qualified, group B remains wide open coming to the final games for the remaining three countries Egypt, Ghana and Mozambique.", "Cape Verde, ranked 73rd in the world, is in its fourth Africa Cup of Nations, having advanced from the group stage in three of them.", "Mozambique, ranked 111th in the FIFA rankings, were soundly defeated.", "Cape Verde became the first team of the 2024 Africa Cup of Nations to reach the last 16 of the tournament.", "The victory leaves Cape Verde on six points after two matches in Group B, with Egypt in second on four points, and both Mozambique and Ghana with a single point each.", "The match was played at the Stade Félix Houphouët Boigny stadium in Abidjan, Ivory Coast, with a capacity of approximately 40,000 spectators."], "ranking": [2, 1, 3, 6, 8, 5, 4, 7, 9]}
