{"candidates": ["Barnabas Varga had 2 shots on goal for Hungary.", "Dominik Szoboszlai had 3 shots for Hungary.", "Edin Dzeko had 1 shot for Bosnia and Herzegovina.", "Ermedin Demirovic had 1 shot for Bosnia and Herzegovina.", "A. Barisic (BIH) received a yellow card at 21'.", "N. Katic (BIH) received a yellow card at 39'.", "B. Tahirovic substituted in for D. Burnic at 45'.", "A. Gigovic substituted in for D. Saric at 60'.", "D. Huseinbasic substituted in for I. Basic at 61'.", "K. Csoboth substituted in for B. Bolla at 75'.", "E. Bajraktarevic substituted in for E. Demirovic at 77'.", "A. Schafer (HUN) received a yellow card at 77'.", "M. Adam substituted in for B. Varga at 82'.", "B. Balogh substituted in for E. Botka at 83'.", "Match ends, Hungary 0, Bosnia and Herzegovina 0.", "Second Half ends, Hungary 0, Bosnia and Herzegovina 0.", "Attempt missed. Willi Orbán (Hungary) header from the centre of the box misses to the right. Assisted by Dominik Szoboszlai with a cross.", "Hungary threatened the Bosnian goal multiple times but were unable to score.", "Bosnian goalkeeper Nikola Vasilj made a series of impressive saves to keep the match goalless.", "Dominik Szoboszlai hit the crossbar with a free kick.", "Martin Ádám's header was denied by Nikola Vasilj.", "Barnabas Varga diverted Dominik Szoboszlai’s corner goalwards, but Nikola Vasilj clawed it away.", "Varga met a deep cross from Zsolt Nagy, forcing Vasilj to tip the header over the bar.", "Roland Sallai sliced his shot across goal, and Varga fired it towards the near post, but Vasilj stopped it.", "Nikola Vasilj made four saves in the first half, including a stinging half volley from Zsolt Nagy.", "Ermedin Demirovic flicked the ball to Edin Dzeko, whose volley was well struck but straight at Denes Dibusz.", "Dominik Szoboszlai’s 25-yard dipping free-kick struck the crossbar.", "Roland Sallai crossed for Martin Adam, who planted his free header straight at Vasilj's legs."], "ranking": [25, 23, 21, 20, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 24, 22, 19, 26, 27, 28]}
{"candidates": ["Head coach Marco Rossi made several changes to the starting eleven compared to the previous game against Germany.", "Dénes Dibusz replaced Péter Gulácsi in goal.", "Endre Botka, Zsolt Nagy, Tamás Nikitscher, and Bendegúz Bolla were included in the starting lineup.", "Hungary will face Bosnia and Herzegovina at the Puskas Arena on Tuesday in another round of their 2024-25 UEFA Nations League campaign.", "Hungary endured perhaps the worst possible start to their Nations League campaign and now find themselves rock-bottom in Group 3.", "Bosnia and Herzegovina have endured a difficult start to life under Sergej Barbarez and continue to search for their first win under the new boss.", "Tuesday's game will mark the fifth meeting between Hungary and Bosnia. The home side are undefeated in all four of their previous matchups, picking up two wins and two draws.", "Hungary were ranked 31st in the latest FIFA rankings and now sit 44 places above their midweek opponents.", "Hungary have lost three of their last four games after losing just one of their previous 16. They are undefeated on home soil since September 2022 and will head into the midweek clash as clear favorites.", "Bosnia have lost their last seven games on the bounce and 12 of their last 15 across all competitions. They have lost their last four games on the road and could see defeat here as well."], "ranking": [8, 6, 5, 3, 9, 7, 4, 2, 1, 10]}
{"candidates": ["Hungary captain Dominik Szoboszlai commented that it felt like there were three people in the Bosnian goal.", "Fans were not impressed with Hungary's performance, as evidenced by jeers and whistles after the game.", "Marco Rossi has had rough periods with the team before but has always managed to come back."], "ranking": [2, 3, 1]}
{"candidates": ["Varslavans scored the only goal of the match in the 64th minute to secure a 1-0 victory for Latvia.", "Petersen received a red card in the 90+4 minute.", "Latvia won the match against Faroe Islands with a final score of 1-0.", "The match ended with a scoreline of 1-0, with the only goal scored in the second half.", "Renars Varslavans scored the only goal of the match in the 64th minute.", "The match ended with a score of Latvia 1, Faroe Islands 0.", "Roberts Uldrikis was caught offside in the 90'+5' minute."], "ranking": [1, 3, 2, 5, 4, 6, 7]}
{"candidates": ["Varslavans scored the only goal for Latvia in the 64th minute.", "Petersen received a red card in the 90+4th minute."], "ranking": [1, 2]}
{"candidates": ["Both Latvia and the Faroe Islands have shown tremendous improvements over the years, making this an interesting matchup to watch.", "This encounter is crucial for both sides as they aim to secure a victory and gather valuable points on the road to success.", "Both teams are eager to prove themselves, promising a fiercely contested battle on the field.", "Latvia's player X has been consistently delivering exceptional performances, showcasing their ability to score goals and set up crucial plays.", "The Faroe Islands' player Y has been a standout with their incredible agility and defensive prowess, making it difficult for the opponents to break through their lines.", "Latvia has been displaying encouraging form in their recent matches, with several wins and a few closely contested draws.", "The Faroe Islands have demonstrated resilience, showcasing their ability to pull off surprises even against stronger opponents.", "The head-to-head statistics of these two teams indicate that the matches between them have historically been closely fought battles.", "Experts predicted a narrow win for Latvia based on their previous encounter in the Baltic Cup.", "Latvia's coach Paolo Nicolato emphasized the importance of securing a win to improve their standings in League C Group 4.", "The match was anticipated to be a close contest given both teams' recent performances."], "ranking": [8, 6, 5, 2, 3, 9, 7, 10, 4, 1, 11]}
{"candidates": ["Latvia's coach Paolo Nicolato expressed relief at securing a win despite recent poor form.", "Faroe Islands' coach Hakan Ericson acknowledged the team's effort but lamented the missed opportunity to secure points."], "ranking": [1, 2]}
{"candidates": ["The match was held at the Skonto Stadium in Riga.", "Latvia had never competed outside League D prior to the 2024-25 season.", "The Faroe Islands are enjoying their second straight campaign of third-tier football in the Nations League."], "ranking": [3, 2, 1]}
{"candidates": ["Subhi Al Dawi opened the scoring for Libya in the 15th minute.", "Nshuti Innocent equalized for Rwanda two minutes after the second half started.", "Fiacre Ntwari made a crucial save to deny Ahmed Ekrawa's close-range attempt.", "Mutsinzi Ange made a critical clearance to deny Tariq Bishara from setting up Ekrawa for a potential match-winning goal."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Al Dawi scored for Libya in the 16th minute.", "Nshutiyamagara scored for Rwanda in the 47th minute.", "Aldeen Al Qulaib, Arteeba, and Al Badri received yellow cards for Libya in the 34th, 42nd, and 45+4 minutes respectively."], "ranking": [2, 1, 3]}
{"candidates": ["Libya host Rwanda at the Tripoli Stadium in Tripoli on Wednesday in the 2025 Africa Cup of Nations qualifiers.", "Libya are looking to end their AFCON drought and reach the next edition of the competition.", "Libya have lost just once in their last 15 games.", "Rwanda begin their quest for a second AFCON tournament.", "Rwanda have lost just once from their last seven matches."], "ranking": [5, 4, 2, 3, 1]}
{"candidates": ["Libya heads into their first match of AFCON qualifying in good spirits after beating Botswana 1-0 in a friendly match.", "Libya has shown improvement under new coach Milutin Micho Sredojevic, with only one loss in 11 matches.", "Rwanda aims for a major improvement in this qualifying campaign after finishing rock bottom in the last edition.", "Rwanda has been excellent in defense under new manager Torsten Spittler, conceding only one goal in his first six matches.", "Libya vs Rwanda predictions for this Africa Cup of Nations Qualifying affair. Libya face Rwanda at the 11 June Stadium in Tripoli on Wednesday evening, marking the start of Group D in the 2025 Africa Cup of Nations qualifiers.", "Libya, under new leadership, have shown promise in recent outings, while Rwanda have also improved their performances significantly under their current manager.", "With both sides eager to start on a positive note, this match is set to be a fascinating contest where every inch of the pitch will be fiercely contested.", "The most compelling bet for this match is to back under 2.5 goals. The data points towards a low-scoring affair, with both teams showcasing solid defensive capabilities in recent matches.", "Libya, under the stewardship of Serbian tactician Milutin Sredojević, have been a side that focusses on maintaining a sturdy defence.", "Rwanda, on the other hand, have been equally impressive in defence since the arrival of their German manager, Torsten Spittler. The Wasps have only conceded one goal in Spittler’s first six matches in charge, illustrating a strong defensive foundation."], "ranking": [8, 6, 5, 4, 10, 3, 2, 9, 7, 1]}
{"candidates": ["The match concluded in a 1-1 draw, earning Rwanda a crucial point in their quest to qualify for the 2025 Africa Cup of Nations."], "ranking": [1]}
{"candidates": ["Libya and Rwanda have both looked strong lately, not losing many games in recent months.", "Libya are unbeaten in their last four clashes against Rwanda, winning three and drawing once.", "Rwanda have kept a clean sheet in three of their four official clashes this year."], "ranking": [2, 1, 3]}
{"candidates": ["Libya and Rwanda have faced each other eight times, with Libya winning five times, Rwanda once, and two games ending in a draw."], "ranking": [1]}
{"candidates": ["Craig Bellamy becomes the first Wales manager to avoid defeat in each of his first three competitive matches."], "ranking": [1]}
{"candidates": ["Brennan Johnson scored the first goal for Wales in the 11th minute.", "Harry Wilson added a second goal for Wales in the 29th minute.", "Logi Tomasson scored for Iceland in the 69th minute.", "Danny Ward scored an own goal, resulting in Iceland's equalizer in the 72nd minute.", "Jon Dagur Thorsteinsson hit the post in the 89th minute.", "Brennan Johnson scored his seventh goal in seven consecutive games.", "Harry Wilson doubled Wales's lead with a goal before halftime.", "Logi Tómasson, a half-time substitute, was the architect of Iceland’s two goals in three second-half minutes.", "Danny Ward scored an own goal in the 72nd minute, gifting Iceland an equalizer.", "Jón Dagur Thorsteinsson almost completed the comeback but his shot hit the post with a minute of normal time remaining.", "Iceland secured a comeback draw against Wales in the Nations League in a match of two halves played out in the cold conditions of Reykjavik.", "Wales started the game as the more aggressive and competent side, resulting in two eerily similar goals.", "Neco Williams provided a long ball over the top, and Harry Wilson made a run from deep in behind the defense.", "Wilson’s first effort was cleared off the line by Hakon Rafn Valdimarsson, only for Brennan Johnson to tap in the rebound.", "The second effort was coolly dispatched by Harry Wilson, meaning the Dragons led 2-0 at half-time.", "Substitutions and an intense press from Iceland saw them turn the game around.", "Logi Tomasson netted twice to draw level for Iceland.", "Wales managed to keep out the hosts to earn themselves a good point.", "Brennan Johnson scored the opening goal for Wales in the 11th minute.", "Harry Wilson scored the second goal for Wales in the 29th minute.", "Logi Tomasson scored for Iceland in the 69th minute.", "Danny Ward scored an own goal in the 72nd minute, leading to Iceland's equalizer.", "Brennan Johnson scored for Wales in the 11th minute.", "Harry Wilson extended Wales' lead with a goal in the 29th minute.", "Logi Tomasson scored for Iceland in the 69th minute.", "Danny Ward scored an own goal for Wales in the 72nd minute.", "Danny Ward (Wales) received a yellow card in the 90+3 minute.", "Iceland secured a comeback draw against Wales in the Nations League.", "Neco Williams provided a long ball over the top leading to Harry Wilson's run from deep in behind the defense.", "Wilson’s first effort was cleared off the line by Hakon Rafn Valdimarsson, and Brennan Johnson tapped in the rebound.", "Wilson coolly dispatched the second effort, leading to a 2-0 lead for Wales at half-time.", "Logi Tomasson netted twice for Iceland to draw level.", "Wales managed to keep out the hosts to earn a draw.", "Brennan Johnson scored the opening goal for Wales in the 11th minute.", "Harry Wilson added a second goal for Wales in the 29th minute.", "Logi Tomasson scored twice for Iceland in the second half to equalize the match.", "Danny Ward made a crucial save to deny Oskarrson in the 57th minute."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37]}
{"candidates": ["Craig Bellamy brought four changes for this match with Danny Ward replacing Karl Darlow in goal, Chris Mepham replaced by Sorba Thomas, and Ethan Ampadu and Lewis Koumas replaced by Jordan James and Brennan Johnson.", "Craig Bellamy reflected on his first camp in charge of Wales, praising the players' exceptional performance and their eagerness for more information.", "Ben Davies expressed excitement and added pressure to repeat their performance from the last camp, emphasizing the importance of sticking to their plan and creating chances.", "Craig Bellamy acknowledged the expectations on the team and promised not to play them down, aiming to qualify for the top league in the Nations League and reach the next World Cup."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Iceland comes into this game sitting in 3rd place in the group having picked up three points.", "Iceland in the last game faced off against Turkey and they really struggled, scoring only a goal and conceding three.", "Sverrir Ingi Ingason has returned to the team and needs to have a huge game.", "Alfons Sampsted and Willum Thor Willumsson are both looking to move into the starting lineup and need to be strong.", "Wales comes into this game sitting 2nd place in the group having picked up four points.", "Wales faced off against Montenegro, scoring two goals and winning by a goal.", "Joe Allen has returned from retirement and needs to have a strong game.", "David Brooks, Nathan Broadhead, and Wes Burns have all been called up and need to be playmakers.", "Wales will be looking to preserve their unbeaten start to their UEFA Nations League campaign when they travel to Reykjavik to face Iceland on Friday night.", "While the Dragons sit second in League B Group 4 with four points from two matches, their Icelandic counterparts are just one point and one place further back in third spot.", "After drawing all four of their 2022-23 Nations League matches, Iceland have since made a mixed start to the 2024-25 campaign, with a 2-0 opening win at home to Montenegro followed by a 3-1 loss away against Turkey.", "Age Hareide's side have been inconsistent for much of 2024, alternating between victory and defeat in each of their last six internationals across all competitions, scoring eight goals and conceding 10 in the process.", "Ranked 71st in the world by FIFA, Iceland are bidding to finish top of League B and secure promotion back to League A where they suffered 10 defeats in 10 games across two separate campaigns.", "A home encounter with current group leaders Turkey will take place next Monday, but they must first turn their attention to Friday's battle with Wales, a nation they have beaten just once in their previous six meetings - winning 1-0 in World Cup qualifying back in September 1984.", "Wales secured a 3-1 friendly victory at home against Iceland in the last meeting between these two nations in March 2014, and they have made an unbeaten start to their 2024-25 Nations League campaign.", "The Dragons were held to a goalless stalemate by Turkey in their opening fixture - Craig Bellamy's first game in charge - before beating Montenegro 2-1 away from home courtesy of two quickfire strikes from Kieffer Moore and Harry Wilson in the first three minutes of the match.", "Bellamy's maiden win ended a run of four internationals without a victory for Wales, while it also represented just the second triumph that the Dragons have recorded on the road in their last 11 matches across all competitions.", "Ranked 29th in the world by FIFA, Wales will climb to the top of Group B if they beat Iceland on Friday for the first time away from home since 1980, coupled with Turkey dropping points at home to Montenegro."], "ranking": [14, 12, 10, 9, 13, 11, 8, 7, 6, 5, 4, 3, 2, 1, 15, 16, 17, 18]}
{"candidates": ["Craig Bellamy described the match as a learning experience for both him and the players.", "Bellamy expressed that the experience would be beneficial in the long run.", "Craig Bellamy expressed that there is a lot to benefit from the match for Wales, allowing more coaching opportunities.", "Åge Hareide praised Iceland's team for lifting themselves and coming back in the second half, though he was disappointed they did not win.", "Wales, still unbeaten under Craig Bellamy after three games, are second in the group on five points, two behind leaders Turkey.", "Iceland are third in the group with four points.", "Iceland staged a second half comeback to earn a 2-2 draw at home to Wales.", "The visitors looked in complete control at half time but the home side were much the better team after the break.", "Craig Bellamy remains unbeaten as Wales boss but acknowledges there is plenty to work on.", "Wales were outclassed in the second half and were fortunate to secure a draw."], "ranking": [8, 9, 7, 5, 3, 10, 2, 4, 6, 1]}
{"candidates": ["The match was played on a freezing night in Reykjavik.", "Brennan Johnson now has seven goals in his past seven games for club and country.", "Neco Williams provided key assists for both of Wales' goals.", "Neco Williams set up both of Wales's goals with identical passes over the Iceland back line.", "Jóhann Berg Gudmundsson, the Iceland captain, played under Bellamy while he was assistant to Vincent Kompany at Burnley.", "The match was played in cold conditions in Reykjavik.", "Iceland have won only one of their previous seven meetings with Wales, a 1-0 home win in 1984 in a World Cup qualifier.", "Wales have won their last four games against Iceland, most recently 3-1 in a 2014 friendly.", "The match was held at Laugardalsvöllur in Reykjavik, Iceland.", "Attendance for the match was 6,141.", "The match took place at Laugardalsvöllur in Reykjavik, Iceland.", "Attendance for the match was 6,141.", "The match was played out in cold conditions in Reykjavik.", "Wales manager Craig Bellamy mentioned that some players were receiving support after the death of George Baldock.", "The match was played in cold conditions in Reykjavik.", "Wales dominated the first half but struggled in the second half due to Iceland's intense press and substitutions."], "ranking": [16, 2, 5, 1, 14, 15, 8, 7, 12, 11, 13, 10, 9, 6, 4, 3]}
{"candidates": ["Emilio Nsue scored in the 10th minute to give Equatorial Guinea a 1-0 lead.", "Equatorial Guinea defeated Liberia 1-0 in their 2026 FIFA World Cup qualifying fixture.", "Emilio Nsue scored the only goal of the match in the ninth minute.", "Nohan Kenneh of Liberia was sent off at the stroke of halftime for a second bookable offence.", "Match ends, Liberia 0, Equatorial Guinea 1.", "Second Half ends, Liberia 0, Equatorial Guinea 1.", "Substitution, Equatorial Guinea. Dorian Hanza replaces Emilio Nsue.", "E. Nsue scored the only goal of the match in the 10th minute.", "N. Kenneh received a yellow card in the 28th minute and a second yellow card in the 45th minute, resulting in a red card.", "J. Miranda received a yellow card in the 39th minute.", "Iban Salvador received a yellow card in the 53rd minute.", "J. Owono received a yellow card in the 81st minute."], "ranking": [2, 1, 3, 4, 6, 7, 8, 5, 9, 10, 11, 12]}
{"candidates": ["Emilio Nsue scored the winning goal in the 64th minute for Equatorial Guinea against Namibia.", "Teenage striker Chifundo Mphasi scored the winning goal in the 78th minute for Malawi against Liberia."], "ranking": [2, 1]}
{"candidates": ["Liberia will be seeking to bounce back to winning ways when they take on Equatorial Guinea in their second Group H match of the 2026 FIFA World Cup at Samuel Kanyon Doe Sports Complex on Monday.", "The Lone Stars kicked off their campaign with a 1-0 defeat against Malawi at the same venue while the Nzalang Nacional secured a 1-0 victory against Namibia at Nuevo Estadio de Malabo."], "ranking": [1, 2]}
{"candidates": ["Attendance: 3,044", "Referees: Karim Sabri"], "ranking": [1, 2]}
{"candidates": ["Liberia starting XI: Ledlum, Dorley, Jebor, Johnson, Dweh, Kenneh, Korvah, Macauley, Pabai, Sangare, Williams.", "Subs: Wynney, Toe, Tisdell, Teah, Soumaoro, Sherman, Moses, Kamara, Deanneh, Arago.", "Coach: Ansumana Keita.", "Equatorial Guinea starting XI: Akapo, Bikoro, Coco, Ganet, Machin, Miranda, Ndong, Nsue, Orozco, Owono, and Salvador.", "Subs: Senra, Sapunga, Ondo, Nguema, Nlavo, Ondo, Hanza, Eneme, Elo, Buyla, Balboa, Anieboh.", "Coach: Juan Micha."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["This was the first time Syria won a title on Indian soil.", "Syria lifts maiden Intercontinental Cup, registers biggest win over defending champion India"], "ranking": [2, 1]}
{"candidates": ["India suffered a 0-3 loss to Syria in their second and final Intercontinental Cup 2024 match in Hyderabad.", "India conceded an early seventh minute goal.", "Syria scored the second goal against the run of play in the 77th minute.", "A third goal in the 96th minute by Pablo Sabbag sealed the match.", "Liston Colaco hit the crossbar in the 90+4th minute.", "Mustafa Abdullatif made a notable run down the right wing, evading multiple Indian defenders.", "Edmund Lalrindika took a venomous shot that narrowly missed the target.", "Chhangte hit the crossbar with a volley in the 88th minute.", "Asish Rai made a significant impact after being subbed in, contributing positively in both defense and offense.", "Syria's Daleho Irandust scored the second goal in the 77th minute.", "Mahmoud Al-Aswad scored the first goal for Syria in the seventh minute.", "Pablo Sabbag scored the third goal for Syria in the 96th minute.", "Syria defeated India 3-0 in the Intercontinental Cup", "Liston Colaco unleashed a fiery shot that rattled the crossbar", "The Syrian goalkeeper made two or three very difficult saves", "Mahmoud Al-Aswad scored the opener in the seventh minute.", "Daleho Irandust scored Syria's second goal in the 76th minute.", "Pablo Sabbag scored Syria's third goal in the 90+6 minute.", "Syrian goalkeeper Elias Hadaya made several key saves to prevent an Indian comeback.", "Mahmoud Al Aswad scored in the 7th minute for Syria.", "Daleho Irandust scored in the 76th minute for Syria.", "Sabbag scored in stoppage time for Syria.", "Gurpreet Singh made an important save in the 35th minute.", "Chhangte's shot hit the crossbar in the final minutes of normal time.", "Liston's attempt from outside the box hit the crossbar.", "Mahmoud Al Aswad scored for Syria in the seventh minute.", "Daleho Mohsen Irandust scored for Syria in the 77th minute.", "Pablo Sabbag scored in injury time to underline Syria's dominance.", "Gurpreet Singh Sandhu made a crucial save in the 35th minute.", "Liston Colaco's long-range effort hit the crossbar in stoppage time.", "Syria took the lead through Mahmoud Alaswad after superb play from Daleho Irandust.", "Gurpreet Singh Sandhu made a close-range save from Noah Shamoun.", "Syria hit the bar through Daleho Irandust.", "Syrian goalkeeper Elias Hadaya made excellent saves, particularly off Edmund Lalrindika and Lallianzuala Chhangte.", "Syria scored two goals on the counter-attack in the second half.", "Pablo Sabbag scored Syria's third goal after a clinical break.", "Syria defeated India 3-0 to lift the 2024 Intercontinental Cup title at Hyderabad’s GMC Balayogi Stadium on Monday.", "90+6’- IND 0-3 SYR; Another one for Syria!", "76’- IND 0-2 SYR; Syria doubles its lead!", "7’- IND 0-1 SYR; The Eagles of Qasioun take the lead!"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40]}
{"candidates": ["India needed to win the match against Syria to have a chance at lifting the Intercontinental Cup 2024.", "Manolo Marquez made two changes at the start of the second half, bringing in Apuia and Asish Rai.", "In what will be the Intercontinental Cup decider, India will need to up its game when it takes on the impressive Syrians."], "ranking": [1, 3, 2]}
{"candidates": ["Coach Manolo Marquez expressed that the 3-0 scoreline did not reflect the reality and that India deserved to score in the second half.", "Despite the loss, India created several chances in the second half and could have scored if they had been more clinical.", "Manolo Marquez suffered his first loss as India coach and is yet to win a game or see his side score a goal.", "India coach Manolo Marquez was happy with his side's performance despite the loss", "Marquez was angry with the first half as he felt his side was scared", "Marquez felt 3-0 wasn't a fair reflection of the game and that India deserved to score", "Marquez praised his team's bravery and improved performance in the second half", "India head coach Manolo Márquez expressed anger with the first half performance but satisfaction with the second half, stating the score did not reflect the game.", "Syria head coach José Lana expressed happiness with the performance and the tournament outcome, especially with a young squad.", "Manolo Marquez's first assignment as India coach ended on a sour note.", "India produced a better performance in the second half.", "Manolo Marquez began his stint as India head coach on a disappointing note after succeeding Igor Stimac.", "India's hopes of winning the Intercontinental Cup title for the third time were dashed.", "Coach Manolo Marquez expressed anger over the team's first-half performance, stating they were not brave.", "Marquez praised the team's second-half performance and their ability to create chances.", "Marquez believed the 3-0 scoreline was not an accurate reflection of the game and that India deserved at least a goal for their efforts.", "“I am angry with the first half...don’t like teams who are scared. The first goal could have been avoided. The scoreline doesn’t paint the real picture, we deserved to score. They killed us in the attack,” said Manolo Marquez.", "“Today we still had chances, unlike the last game. We were brave in this second half,” the Spaniard added about the positives from this tournament."], "ranking": [1, 5, 3, 10, 2, 6, 8, 4, 14, 11, 12, 13, 7, 9, 15, 16, 17, 18]}
{"candidates": ["Syria won the Intercontinental Cup 2024 with a clinical performance, beating Mauritius 2-0 and India 3-0.", "India finished last in the tournament, behind Mauritius on goal difference.", "The Hon'ble Chief Minister of Telangana, Shri A Revanth Reddy, presented the winners' trophy to Syria.", "Syria captain Mahmoud Al-Mawas was named the Syed Abdul Rahim Player of the Tournament.", "Syria needed only a draw to secure the trophy.", "The match took place at Gachibowli Stadium in Hyderabad.", "Syria had previously lost back-to-back Nehru Cup finals to India in 2007 and 2009.", "In their last trip to India in the 2019 Intercontinental Cup, Syria ended in third place."], "ranking": [1, 5, 4, 2, 3, 8, 6, 7]}
{"candidates": ["Match Details: Fixture: India vs Syria, Date: September 9, 2024, Venue: GMC Balayogi Athletic Stadium, Hyderabad, Time: 7:30 PM IST, Live Telecast: Sports 18 3, Live Streaming: JioCinema"], "ranking": [1]}
{"candidates": ["Amine Gouiri scored in the 17th minute for Algeria.", "Zorgane scored in the 25th minute for Algeria.", "Baghdad Bounedjah scored in the 80th minute for Algeria.", "Zerrouki received a yellow card in the 73rd minute.", "Khacef received a yellow card in the 82nd minute."], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Liberia and Algeria return to action in the 2025 Africa Cup of Nations qualifiers when they face off at the Samuel Kanyon Doe Sports Complex on Tuesday.", "This will be the first meeting between the two sides since June 2021, when the Greens picked up an emphatic 5-1 victory in a friendly.", "Liberia turned in a resilient team display on Friday when they fought back from behind to snatch a 1-1 draw against Togo in their group opener at the Stade de Kegue.", "Kevin Denkey put Togo in front with a 78th-minute strike but teenage striker Williams Gibson netted in the second minute of stoppage time to hand the Lone Stars a share of the spoils.", "Liberia have now gone five consecutive games without defeat across all competitions, a run which has seen them rise to third place in Group H of the 2026 FIFA World Cup qualifiers.", "Algeria turned in a solid team display in Thursday’s group curtain-raiser as they picked up a 2-0 win over Equatorial Guinea.", "Following a goalless first half at the Miloud Hadefi Stadium, Houssem Aouar and Amine Gouri scored second-half goals to hand the Greens a deserved victory.", "Algeria, who are 46th in the latest FIFA World Rankings, will be looking to secure a third competitive win on the bounce for the first time since June 2023.", "Liberia will face Algeria for the seventh time in history on September 10, 2024, at the Samuel Kanyon Doe Sports Complex in Paynesville.", "The match is the second in Group ‘E’ of the 2025 Africa Cup of Nations Qualifiers.", "Liberia has never won against Algeria in their previous six meetings, with three draws and three losses.", "Liberia is currently on a five-game unbeaten streak across all competitions.", "Algeria is on a 15-match unbeaten streak in AFCON qualifiers, with 11 wins and four draws since their last defeat in October 2018.", "Algeria's captain Riyad Mahrez will miss the match due to injury.", "Baghdad Bounedjah is expected to lead Algeria's attack alongside Saïd Benrahma.", "Liberia’s coach Mario Marinica is expected to field a similar lineup to the one that faced Togo."], "ranking": [12, 10, 8, 9, 5, 7, 6, 11, 15, 14, 13, 4, 3, 2, 1, 16]}
{"candidates": ["Algeria have been the dominant side in the history of this fixture, claiming three wins and three draws in the last six meetings between the two nations.", "Liberia are unbeaten in their five games in 2024, picking up two wins and three draws since the turn of the year.", "Algeria are unbeaten in four of their last five matches across all competitions, claiming three wins and one draw since January 15.", "Liberia have failed to win six of their last seven AFCON qualifying games, losing three and picking up three draws since June 2022.", "The match was held at Samuel Kanyon Doe Stadium.", "Algeria had 68.5% possession while Liberia had 31.5%.", "Liberia had 15 shots with 2 on target, while Algeria had 13 shots with 7 on target.", "Liberia had 11 total touches in the box, while Algeria had 28.", "Liberia's goalkeeper made 4 saves, while Algeria's goalkeeper made 2 saves.", "Liberia committed 10 fouls, while Algeria committed 14.", "Liberia had 1 corner, while Algeria had 7.", "The match took place at Samuel Kanyon Doe Sports Complex in Monrovia, Liberia.", "Attendance for the match was 21,754."], "ranking": [1, 3, 2, 4, 12, 6, 5, 8, 9, 10, 7, 11, 13]}
{"candidates": ["Motlomelo Mkwanazi scored in the 56th minute against Nigeria.", "Semi Ajayi equalized for Nigeria 11 minutes later.", "Percy Tau and Khuliso Mudau scored first-half goals for South Africa against Benin.", "Steve Mounie scored for Benin in the 70th minute against South Africa."], "ranking": [4, 3, 2, 1]}
{"candidates": ["The starting eleven for Lesotho has been confirmed, including players such as Moerane, S, and Motebang, S.", "The team sheet line-up for Benin has also been confirmed, featuring players like Saturnin Allagbé and Steve Mounié.", "Lesotho and Benin lock horns in their second fixture of the 2026 FIFA World Cup qualifiers at the Orlando Stadium in Johannesburg, South Africa on Tuesday.", "Ranked 153rd in the world, Lesotho have never qualified for any major tournament before.", "In their opening game of the World Cup qualifier, the Crocodiles were held to a 1-1 draw by Nigeria.", "Motlomelo Mkhwanazi put them in front after 56 minutes, but Semi Ajayi equalised for the Super Eagles after 11 minutes.", "Benin went down 2-1 to South Africa in their opening qualifier.", "Percy Tau put the Bafana Bafana in front after just two minutes before Khuliso Mudao made it 2-0 before the break.", "Steve Mounie pulled one back for Benin in the 70th minute as Gernot Rohr’s side threatened to come back into the game, but ultimately fell short of finding the equaliser.", "In their previous two encounters, Benin beat Lesotho 1-0 before the sides drew 0-0 (both coming in the Africa Cup of Nations qualifiers, in November 2020)."], "ranking": [8, 7, 6, 10, 5, 4, 3, 2, 1, 9]}
{"candidates": ["C’est un match de retrouvaille entre le Bénin et le Lesotho après les éliminatoires de la CAN Cameroun 2022.", "Lors de la première journée des éliminatoires de la Coupe du monde 2026, le Lesotho a mis en difficulté le Nigeria en arrachant match nul (1-1)."], "ranking": [2, 1]}
{"candidates": ["Lesotho starting XI: Sekhoane Moerane, Thabo Matsoele, Rethabile Rasethuntsa, Motlomelo Mkwanazi, Motete Mohai, Jane Thaba-Ntso, Lisema Lebokollane, Thabo Lesaoana, Tsepang Sefali, Tshwarelo Bereng, Sera Motebang.", "Subs: Mosoeu Seahlolo, Teboho Ratibisi, Bokang Sello, Rethabile Mokokoana, Teboho Letsema, Lehlohonolo Fothoane, Tsepo Toloane, Neo Mokhachane, Katleho Makateng, Rethabile Senkoto, Thabiso Brown, Mohlomi Makhetha.", "Benin starting XI: 16- Saturnin Allagbe, 4-Cedric Hountondji, 12- David Kiki, 5- Mohamed Tijani, 11- Moumini, 19- Dokou Dodo, 18 – Junior Olaitan, 15- Sessi d’Almeida, 20-Jodel Dossou, 9 – Steve Mounie, 3-Steve-Waren Traore.", "Subs: 1- Marcel Dandjinou, 23- Serge Obassa, 22- Sankamao, 2- Rodrigue Fassinou, 6- Ouorou Tamimou, 7- Matteo Ahlinvi, 13-Prince Ricardo Dossou, 10- Charbel Gomez, 8- Imrane Hassane, 14- Cebio Soukou, 17-Andréas Hountondji. And 21-Rodrigue Kossi."], "ranking": [4, 4, 4, 4]}
{"candidates": ["There were 22 passes in the build up to Duah's goal, the third longest passing sequence leading to a goal at the European Championship on record (since 1980).", "By scoring today, Embolo has become just the second Switzerland player to score in successive European Championships, having scored against Wales at Euro 2020.", "Michel Aebischer's goal came after a 22-pass move, the third-longest build-up move in a European Championship since 1980."], "ranking": [2, 1, 3]}
{"candidates": ["Kwadwo Duah scored the first goal for Switzerland in the 12th minute.", "Michel Aebischer scored the second goal for Switzerland in the 45th minute.", "Barnabás Varga scored the only goal for Hungary in the 66th minute.", "Breel Embolo scored the third goal for Switzerland in the 90'+3 minute.", "Breel Embolo scored the final goal in a 3-1 win over Hungary.", "Kwadwo Duah opened the scoring for Switzerland.", "Michel Aebischer scored the second goal for Switzerland.", "Barnabas Varga scored Hungary's only goal.", "Breel Embolo sealed the win for Switzerland with a lifted finish over Gulacsi in stoppage time.", "Goals from Duah, Aebischer and Embolo helped Switzerland past Hungary in Cologne.", "Granit Xhaka was named Player of the Match for his performance.", "Embolo scored a stoppage-time goal to secure the victory for Switzerland.", "Hungary's goalkeeper Gulacsi made a brilliant save to keep out Xhaka's header.", "Switzerland's manager Yakin was shown a yellow card.", "Hungary's Bolla was shown a yellow card for a cynical foul.", "Embolo's introduction from the bench made a significant impact on the game.", "Breel Embolo scored Switzerland's third goal in added time, marking his comeback after 18 months of injuries.", "Kwadwo Duah opened the scoring for Switzerland in just his second game for the national team.", "Michel Aebischer scored Switzerland's second goal just before halftime.", "Barnabas Varga scored Hungary's only goal with a diving header in the 66th minute.", "Kwadwo Duah scored his first international goal after just 12 minutes to give Switzerland the lead.", "Barnabas Varga halved the deficit for Hungary with a header.", "Breel Embolo scored Switzerland's third goal on his first international appearance since the 2022 World Cup.", "Kwadwo Duah scored his first goal for Switzerland in his second appearance.", "Michel Aebischer scored his first international goal for Switzerland.", "Breel Embolo scored a decisive goal in injury time to secure the win for Switzerland.", "Kwadwo Duah scored his first international goal in the 12th minute.", "Michel Aebischer scored his first international goal with a superb curling shot from outside the box on the stroke of half-time.", "Barnabás Varga scored for Hungary in the 66th minute with a header from Dominik Szoboszlai's cross.", "Breel Embolo sealed the win for Switzerland with a goal in stoppage time.", "Full time: Hungary 1-3 Switzerland", "GOAL! Hungary 1-3 Switzerland (Embolo 90+3)", "GOAL! Hungary 1-2 Switzerland (Varga 66)", "GOAL! Hungary 0-2 Switzerland (Aebischer 45)", "GOAL! Hungary 0-1 Switzerland (Duah 13)"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Swiss coach Murat Yakin made a tactical surprise by including Kwadwo Duah and Michel Aebischer in the starting lineup.", "Marco Rossi's Hungary team was known for its strong defense, conceding just seven goals in eight qualifying matches.", "Switzerland's coach Murat Yakin took a gamble by starting Kwadwo Duah, who had less than an hour of international football experience.", "Hungary were considered plausible outsiders with high expectations.", "Switzerland had concerns about being over the hill but pressed with focused energy."], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["Switzerland began their Euro 2024 campaign in style with a 3-1 Group A victory over Hungary.", "Breel Embolo made an emotional return to the Switzerland national team.", "Hungary were fancied as dark horses but looked off the pace against Switzerland.", "Hungary struggled to create chances in the first half and made mistakes in the second half.", "Hungary's next game is against Germany, which will be a huge challenge.", "Switzerland were outstanding in that game, Hungary really disappointing.", "The structure of the team that got Marco Rossi's side to the finals automatically let them down today.", "Switzerland's victory puts them in an excellent position to make the knockouts.", "Swiss coach Murat Yakin expressed hope and satisfaction with Breel Embolo's performance after his long injury layoff.", "Hungary coach Marco Rossi commented that his team was 'too passive' in the first half and mentioned a 'tactical misunderstanding' that allowed Aebischer too much time on the ball.", "Hungary coach Marco Rossi commented on the difficulty of correcting individual mistakes and the communication issues faced by his team.", "Swiss coach Murat Yakin likened football to chess and praised his team's tactics and use of formation.", "Murat Yakin praised Breel Embolo's commitment to get fit and his medical staff.", "Marco Rossi acknowledged a tactical misunderstanding in the first half.", "Swiss coach Murat Yakin praised his team's tactics and execution, likening football to chess.", "Hungary coach Marco Rossi took responsibility for his team's errors and passive first-half performance.", "Granit Xhaka was named player of the match for his vital role in controlling the pace of play and delivering pinpoint passes.", "An impressive, deserved victory for Switzerland in Cologne. They had a 20-minute wobble when Barnabas Varga made it 2-1, but overall they were much the better team. Kwadwo Duah and Michel Aebischer scored their first international goals during a dominant first-half performance, and the substitute Breel Embolo – who barely kicked a ball for Monaco last season because of injury – settled matters in added time."], "ranking": [10, 14, 7, 12, 16, 3, 11, 5, 9, 13, 15, 8, 6, 4, 2, 1, 17, 18]}
{"candidates": ["Location: RheinEnergieStadion, Cologne, Germany.", "Date & Time: Saturday, 15th June 2024 2pm.", "TV Channel: ITV."], "ranking": [3, 2, 1]}
{"candidates": ["Albion Rrahmani expressed his desire to be a starter in the match against Romania, stating that he is in good form and hopes to demonstrate his abilities.", "Rrahmani emphasized that the Kosovo team is well-prepared and focused on securing the first three points in the opening match of the Nations League group stage.", "Kosovo welcome Romania to Pristina on Friday in one of the standout fixtures in League C of the UEFA Nations League this week.", "This will be a first competitive fixture in charge for Kosovo boss Franco Foda, who signed up in February, and it will be against the toughest opponents in their section.", "Romania come in fresh off the back of reaching the knockout stages at Euro 2024.", "Kosovo have faced very tough opposition in the Nations League, including nations such as Slovenia and Greece.", "Kosovo have been drawn against the heavyweights of the entire tier in Romania.", "Kosovo held Romania and Switzerland to draws, while also beating Israel on home soil during Euro 2024 qualifying.", "Kosovo have lost just one of their last nine home games.", "Legendary manager Mircea Lucescu is back at the helm for Romania, replacing Edward Iordanescu.", "Romania went unbeaten across their Euro 2024 qualifying section, taking 22 points and keeping six clean sheets in 10 games.", "Romania's 3-0 win over Ukraine in the Euro 2024 group opener is considered one of their finest days since the 90s.", "Vedat Muriqi, a player from Kosovo, expressed high respect for the Romanian national team, highlighting their unexpected strength and good performance in the previous year.", "Vedat Muriqi mentioned that the match against Romania will be mentally challenging for both teams.", "Vedat Muriqi acknowledged the importance of Mircea Lucescu, the Romanian coach, and his significant experience in Turkish football.", "Vedat Muriqi emphasized the need for fans to improve their behavior, referencing an incident in a previous match that led to a suspension.", "Sparkles will be flying when Kosovo and Romania square off against each other at Stadiumi Fadil Vokrri on Friday evening.", "The two teams faced each other in some very tensed clashes in the past and yet another exciting encounter is on the cards.", "The likes of Edon Zhegrova (Lille), Milot Rashica (Besiktas), and Vedat Muriqi (Mallorca) are the most notable players in the home team.", "The Romanians were producing fine performances at the EURO 2024, with the team making it to the last 16 of the showpiece tournament in Germany.", "Kosovo are a real force to be reckoned with at home and we predict that they are going to prove their worth on the field.", "The good news for the away team is that defender Vasile Mogos has overcome the injury he suffered in the EURO 2024 clash with Netherlands."], "ranking": [14, 10, 6, 12, 8, 16, 18, 4, 2, 1, 5, 3, 7, 9, 11, 15, 13, 17, 19, 20, 21, 22]}
{"candidates": ["This victory provides a strong start for Romania in the Nations League and offers a promising beginning for Mircea Lucescu’s new tenure as head coach."], "ranking": [1]}
{"candidates": ["The match marked the debut of Mircea Lucescu as Romania’s national team coach after a 38-year hiatus.", "The referee for the match was Aghayev A. from Azerbaijan.", "The match was held at Stadiumi Fadil Vokrri in Pristina with an attendance of 12,872.", "The match was held at Stadiumi Fadil Vokrri with an attendance of 12,872 spectators"], "ranking": [1, 4, 3, 2]}
{"candidates": ["Sunil Chhetri retired as the fourth highest goal-scorer in international football.", "Sunil Chhetri played his 151st and last match for India."], "ranking": [1, 2]}
{"candidates": ["The match ended in a hard-fought, often physical, goalless draw — which jeopardises India’s goal of reaching a historic third round."], "ranking": [1]}
{"candidates": ["Arup Biswas, the state minister for sports and youth affairs, praised Chhetri's passion, discipline, and commitment, stating that it will remain a shining example to aspiring footballers.", "Biswas also noted the significance of witnessing Chhetri's last international fixture in Kolkata, where he started his professional career as a teenager."], "ranking": [1, 2]}
{"candidates": ["The match took place at the Salt Lake Stadium in Kolkata.", "India will next face Qatar in the final fixture of this round.", "Nearly 59,000 fans attended the match in Kolkata.", "Fans flocked to the stadium hours before gates opened to chant, sound bullhorns, and dance in the baking afternoon heat.", "Banners in the stands showed support for Chhetri, including one that read 'Referee don’t blow the whistle, otherwise Sunil Chhetri will leave us.'", "The match was played under an overcast sky at Salt Lake Stadium in Kolkata.", "The draw severely dents India's chances of advancing to the next stage of the World Cup qualifiers.", "Sunil Chhetri ended his international career with 94 goals in 151 matches.", "The match took place at the Salt Lake Stadium in Kolkata.", "The game ended in a 0-0 draw with both teams having good chances but unable to convert them.", "India's hopes for qualifying for the third round of the FIFA World Cup 2026 and AFC Asian Cup 2027 Preliminary Joint Qualification took a hit with the draw.", "India remains in second place with five points, while Kuwait stays alive with four points.", "India will hope for Qatar's victory over Afghanistan and a draw between Kuwait and Afghanistan on June 11."], "ranking": [12, 11, 9, 8, 7, 10, 5, 2, 12, 6, 4, 3, 1]}
{"candidates": ["The FIFA World Cup 2026 qualifier match between India and Kuwait will telecast live on the Sports18 Network and will also be streamed live on Jio Cinema.", "The 58,000-plus crowd at Salt Lake Stadium, Kolkata, turned out to watch Sunil Chhetri in his last match before retirement.", "The arterial road running in front of the stadium, as well as the other approach roads, were clogged by fans wearing blue shirts with 'Chhetri' emblazoned across the back.", "A banner read 'Thanks, captain, leader, legend', appreciating Chhetri's contributions to Indian football.", "The match will be broadcast on Sports 18 1, Sports 18 1 HD, Sports 18 3, and streamed live on JioCinema on June 6, 2024, at 19:00 IST.", "The match between India and Kuwait will be broadcast on Sports 18 1, Sports 18 1 HD, Sports 18 3, and streamed live on JioCinema, on June 6, 2024, at 19:00 IST."], "ranking": [6, 2, 3, 1, 5, 4]}
{"candidates": ["Sunil Chhetri scored 94 goals for India over a career spanning nearly two decades, placing him among the world’s all-time leading scorers.", "Igor Stimac handed out a full India debut to left-back Jay Gupta.", "Edmund Lalrindika made his debut, replacing Jay Gupta in the last seven minutes."], "ranking": [1, 2, 3]}
{"candidates": ["Sunil Chhetri will be playing his final match for India on June 6, 2024, marking the end of his 19-year international career.", "Chhetri expressed his desire to see the Indian team compete against Asia's elite in the third round.", "Chhetri's retirement marks the end of an era, with him being one of the top international goal scorers in football history."], "ranking": [1, 2, 3]}
{"candidates": ["India played out a goalless draw against Mauritius in the Intercontinental Cup 2024 opener.", "Manolo Marquez's first match as India coach ended in a 0-0 draw.", "Nikhil Poojary got some minutes on his birthday as Asish Rai came off.", "Mauritius made a double change with Alex Ferre and Louis Rita coming on.", "Jay Gupta was substituted for Subasish Bose.", "Mauritius created more chances in the second half, forcing Amrinder to make saves.", "India made several substitutions including Apuia for Suresh and Thapa for Sahal Abdul Samad.", "Chhangte made a notable run down the right flank at the start of the second half.", "Manvir Singh's attempt was saved by Mauritius goalkeeper Kevin Obrian.", "India had more ball possession but struggled to create clear chances.", "India's match against Mauritius ended in a stalemate with a clean sheet.", "Rahul Bheke led the national team as captain for the first time.", "India settled for a goalless draw in Manola Marquez's first match as head coach against Mauritius.", "India dominated possession but lacked creativity in front of goals, managing just one shot on target.", "Mauritius looked more dangerous in front of goal and exploited the Indian defense on a couple of occasions.", "Chhangte produced a moment of magic in the second half but couldn't break the deadlock.", "Rain hampered India's training session before the match.", "Manolo Marquez's stint as Indian football team's head coach began with a goalless draw against lower-ranked Mauritius.", "Jeremy Villeneuve of Mauritius won a set-piece and unleashed the ball into the box, but Jeakson Singh made the clearance.", "Jay Shah cleared the ball to safety after another opening for the visitors.", "In the 34th minute, Manvir Singh was sent through on goal by Anirudh Thapa but Mauritius goalkeeper Kevin Obrian made an important save.", "Lallianzuala Chhangte made a fine cross from the right wing, but Thapa could not come up with an accurate header.", "Mauritius came close to scoring but missed the target by a whisker.", "In the 51st minute, Sahal Abdul Samad ran down the flank but Mauritius had defenders in numbers to deny India.", "India kept the lion's share of the possession but lacked the cutting edge in attack against the 179th-ranked visitors.", "The game had few chances, with only one shot on target by each side in the entire 90 minutes.", "Anirudh Thapa's sixth-minute corner skimmed the back of Manvir Singh's head and almost fell for Chinglensana Singh.", "In the 20th minute, a slip from Asish Rai allowed Yannick Aristide to drill a low ball from the left but there was no Mauritian shirt to tap it in.", "In the 35th minute, Thapa picked out Manvir Singh in the box, who took a touch and stung the gloves of Jean-Louis with a left-footed shot.", "Mauritius had their best chance of the first half when Emmanuel Vincent blasted a first-time shot a few inches above Amrinder Singh's crossbar.", "In the 54th minute, Jérémy Villeneuve slipped the ball for Lalsing who dragged a left-footed effort wide from 12 yards out.", "Substitute Aurélien François missed a couple of chances, first heading wide a Gabriel Caliste cross before blazing over a pin-point cutback from Adrien Botlar.", "In the 79th minute, Nandhakumar found space to squeeze a cross from the left but Collard hacked it clear before it could reach Chhangte.", "Mauritius held on for a vital point, and their skipper and defender Lyndsay Rose was named the player of the match."], "ranking": [14, 12, 20, 18, 22, 16, 24, 10, 8, 6, 4, 2, 26, 28, 30, 11, 15, 17, 19, 21, 23, 25, 27, 29, 31, 32, 33, 34, 1, 3, 5, 7, 9, 13]}
{"candidates": ["The match will mark the debut of the Blue Tigers under their new coach, Manolo Marquez, following the retirement of the country’s top scorer, Sunil Chhetri.", "Mauritius, aiming to build on their recent win, will be striving to secure a victory against India.", "Based on recent form and expert analysis, India is likely to have the upper hand in this match.", "Anirudh Thapa and Mehtab Singh are considered top picks for Dream11 fantasy leagues.", "Manolo Marquez emphasized a balanced approach, not compromising defense for attack.", "India's match against Mauritius marked the beginning of a new era under coach Manolo Marquez.", "The match was India's first competitive outing since their 1-2 defeat against Qatar in the 2026 FIFA World Cup qualifiers.", "Manolo Márquez emphasized the importance of finding the right combinations in different areas of the pitch.", "Márquez highlighted the strong performance of centre-backs Rahul Bheke and Sana Konsham Chinglensana Singh.", "Manola Marquez's tenure as Indian football team head coach started with this match.", "India is preparing for life after Sunil Chhetri's retirement.", "The match served as a dress rehearsal for the AFC Asian Cup Qualifiers.", "Mauritius' recent form included a 2-1 home win over Eswatini and a 0-0 draw versus Angola.", "The match was head coach Manolo Márquez's first in charge of the Indian team.", "The Hyderabad crowd witnessed the Blue Tigers after 16 years.", "India men's football team will be taking on Mauritius in the opening match of Inter-Continental Cup on Tuesday in Hyderabad.", "The Indian senior men's team is coming to the Telangana capital for the first time in 16 years as the city plays host to Mauritius and Syria from September 3 to 9.", "The coach has termed the tournament a dress rehearsal for bigger tasks ahead -- AFC Asian Cup Qualifiers.", "Chinglensana Singh Konsham and Yasir Mohammad are back for the first time since last year's Tri-Nation Series triumph.", "Defenders Asish Rai and Roshan Singh Naorem return after almost an year-long hiatus, while Kiyan Nassiri Giri, Lalthathanga Khawlhring and Prabhsukhan Singh Gill will be eyeing their senior India debut."], "ranking": [1, 5, 4, 18, 7, 2, 3, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20]}
{"candidates": ["Manolo Márquez expressed excitement about playing the first game in Hyderabad, highlighting the new facilities at the stadium.", "Márquez emphasized the importance of player attitude and readiness despite limited training sessions.", "The Intercontinental Cup is seen as a preparation for the AFC Asian Cup Qualifiers, with a focus on playing good football and preparing for the future.", "Mauritius is also using the Intercontinental Cup as preparation for their competitive matches, aiming for stability and efficiency.", "India are set to play Mauritius (Tuesday, September 3, 2024) and Syria (Monday, September 9, 2024) in the Intercontinental Cup at the Gachibowli Stadium in Hyderabad."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Manolo Marquez described his managerial debut for India as a 'boring game' and noted that the team created no chances throughout the 90 minutes.", "Manolo Marquez praised the center-back pairing of Chinglensana Singh and Rahul Bheke for their role in keeping a clean sheet.", "Manolo Márquez acknowledged the effort of the players and the need for improvement.", "Rahul Bheke expressed pride in leading the team and emphasized the need to focus on goal conversion.", "Manola Marquez will take the positives from the clean sheet but acknowledged the lack of clear chances and creativity.", "Mauritius would be happy with their performance as they managed to exploit the Indian defense.", "AIFF President Shri Kalyan Chaubey presented Mauritius' skipper and defender Lyndsay Rose with a cheque of Rs. 1,00,000 for being named the player of the match."], "ranking": [7, 4, 3, 2, 5, 6, 1]}
{"candidates": ["The weather is anticipated to be clean and devoid of any chances of rain, creating ideal conditions for the game.", "The match took place at the GMC Balayogi Stadium in Hyderabad.", "The Indian national football team returned to Hyderabad for a match after 16 years.", "The match was played at Gachibowli Stadium.", "India's defensive line looked shaky at times.", "The Indian team missed retired Sunil Chhetri in front of goal."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Both China and Lebanon were seeking a win to keep their chances of advancing to the knockout stage alive.", "China PR face Lebanon on Wednesday.", "Lebanon and China PR will continue their AFC Asian Cup 2023 campaign when they square off at the Al Thumama Stadium on Wednesday.", "Lebanon kick-started their tournament with a comprehensive 3-0 defeat to hosts and defending champions Qatar in the tournament opener last Friday.", "China PR, meanwhile, shared the spoils in a goalless draw against Tajikistan in their opener.", "The stalemate left them joint-second in Group A on one point while Lebanon are bottom of the standings on zero points.", "Qatar lead the way in the group on three points.", "This will be the seventh meeting between the two sides. China PR have not lost a head-to-head game, winning five and drawing one.", "Their last meeting came in the Asian Cup 2011 qualifiers when China claimed a 1-0 home win.", "China have kept a clean sheet in five of the six head-to-head games.", "Three of Lebanon's last four games have produced more goals in the second half than the first.", "Lebanon have won just one of their last seven games (four losses). China, meanwhile, have won just one of their last six games (four losses).", "Lebanon (ranked 107th in the world) have never made it out of the group stage in the Asian Cup in any of their previous two campaigns. They suffered an early ouster in 2000 and 2019.", "China's goalless draw against Tajikistan was highly entertaining, with the two sides having 30 shots between them.", "China have never lost a game against Lebanon and we are backing this unbeaten run to continue with a narrow victory and clean sheet."], "ranking": [5, 15, 4, 10, 9, 7, 6, 3, 12, 2, 11, 8, 13, 14, 1]}
{"candidates": ["Both teams will be hoping to record their first win of the AFC Asian Cup 2023.", "Lebanon and China will face each other in their next Group A fixture of the 2023 AFC Asian Cup on 17 January 2024.", "Lebanon fought bravely but eventually came up short against a strong Qatar side in a 3-0 defeat.", "China played a gritty goalless draw with Tajikistan and sit with just a point.", "Both teams are direct competitors for the second qualifying spot that offers direct qualification into the Round of 16, making the upcoming game essential for them.", "Kick-off is scheduled for Wednesday, 17 January 2024, 5:00 PM IST (11:30 GMT) at the Al Thumama Stadium in Doha, Qatar.", "Lebanon's form in all competitions is D-D-W-L-L.", "China's form in all competitions is L-W-L-L-D.", "Hassan Maatouk is Lebanon’s top creative threat and had a shot on target and completed 80% of his passes against Qatar.", "Yang Liu gave a brilliant account of himself in the draw versus Tajikistan, dominating the left flank and winning nine out of 12 duels.", "Lebanon have scored more than one goal in only one of their last five matches.", "Lebanon (107) are the lowest-ranked team in Group A.", "China are winless in their last three matches.", "Head-to-Head: Total Matches Played – 6, Lebanon wins – 0, China wins – 5, Draws – 1.", "Predicted Line-up for Lebanon (3-5-2): Matar (GK), Michel, Nour, El Zein, Nassar, Shour, Haidar, Tneich, Zein, Jradi, Maatouk.", "Predicted Line-up for China (5-3-2): Yan (GK), Liu, Zhang, Browning, Zhu, Yang Liu, Wang, Shangyung Wang, Tsun, Tan, Wu Lei.", "Match Prediction: Lebanon 2-2 China.", "Telecast for Lebanon vs China: India – Sports 18, Jio Cinema; China PR – Iqiyi, Miguvideo; Qatar, Bahrain, Jordan, Kuwait, Lebanon, Palestine, Syria, Yemen, Oman – BeinSports, Alkass; United Kingdom, Ireland, France, Belgium, Netherlands – Triller TV; Australia – Network 10.", "Lebanon and China are both looking to secure a win in their second match of the 2024 AFC Asian Cup Group A.", "Lebanon's coach, Miodrag Radulović, emphasized the need to improve their performance and convert opportunities into goals.", "China's coach, Aleksandar Janković, highlighted the importance of winning against Lebanon to boost their chances of advancing from the group stage.", "Lebanon's performance against Qatar showed they could create opportunities but struggled to convert them into goals.", "China had a goal disallowed by VAR in their match against Tajikistan, indicating the need for better finishing and defensive stability."], "ranking": [10, 8, 14, 12, 16, 4, 6, 18, 15, 7, 11, 9, 13, 5, 3, 2, 1, 17, 19, 20, 21, 22, 23]}
{"candidates": ["Chinese team head coach Aleksandar Jankovic praised his team's mentality and attitude despite the draw.", "Chinese goalkeeper Yan Junling noted that Asian football has been improving and emphasized the need to score.", "Jankovic attributed the goalless matches to bad luck and expressed satisfaction with the team's improvements in dealing with stress.", "Lebanon coach Miodrag Radulovic remained positive, stating, 'It’s a very important point for us especially after a tough defeat against Qatar. We hit two posts, but unfortunately we didn’t score again. I’m satisfied with this point because we are still in the game to the end for the next round.'", "China coach Aleksandar Jankovic emphasized the importance of self-reliance, acknowledging the challenge posed by Qatar’s World Cup experience when they take on the hosts next Monday. He said, 'We know that we depend on ourselves and that is something that every team would like to be in that position before the last game. So we depend on ourselves. No matter if we play against a host country... Qatar with their World Cup experience, we still depend on ourselves and I always like to be in this kind of situation.'"], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["The match will be held at Al Thumama Stadium in Doha and will be broadcast live on iNews TV and Vision+.", "Lebanon may be without Walid Shour due to injury, with Hasan Srour or Jihad Ayoub likely to replace him.", "China is expected to maintain their lineup with key players like Wu Lei, Tan Long, and captain Zhang Linpeng.", "Lebanon and China have not met in the final stages of the AFC Asian Cup before, with their last encounters being in the 2011 qualifiers where China won both matches."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Yellow Card: R. Rasethuntša (Lesotho) at 53'", "Goal by W. Shavy (Gabon) at 55'", "Substitution: Out T. Malane, In N. Mokhachane (Lesotho) at 69'", "Substitution: Out T. Bereng, In T. Phatsisi (Lesotho) at 69'", "Substitution: Out J. Thaba-Ntšo, In T. Letsema (Lesotho) at 69'", "Substitution: Out D. Sambissa, In J. Allevinah (Gabon) at 71'", "Substitution: Out S. Martinsson-Ngouali, In C. Loufilou (Gabon) at 72'", "Substitution: Out W. Shavy, In R. Effaghe (Gabon) at 72'", "Substitution: Out U. Mboula, In J. Oyono Omva Torque (Gabon) at 81'", "Goal by R. Effaghe (Gabon) at 84'", "Substitution: Out S. Motebang, In K. Makateng (Lesotho) at 85'", "Substitution: Out L. Lebokollane, In L. Matsau (Lesotho) at 85'", "Substitution: Out G. Kanga Kaku, In M. Biteghe (Gabon) at 90'", "Rasethuntsa scored for Lesotho in the 53rd minute", "Babicka scored for Gabon in the 55th minute", "Junior Effaghe scored for Gabon in the 84th minute"], "ranking": [14, 2, 13, 13, 13, 12, 12, 12, 11, 1, 10, 10, 9, 3, 4, 5]}
{"candidates": ["Rasethuntsa scored for Lesotho in the 53rd minute", "Babicka scored for Gabon in the 55th minute", "Junior Effaghe scored for Gabon in the 84th minute"], "ranking": [2, 1, 3]}
{"candidates": ["Sports Mole previewed the Africa Cup of Nations Qualifying clash between Lesotho and Gabon, including predictions, team news, and possible lineups", "Without Aubameyang leading the line, Gabon could struggle to finish many of their chances in front of goal", "If Lesotho are as defensively resilient as they were in their previous encounter with Gabon, it is plausible that they can earn their second point of their qualifying campaign"], "ranking": [3, 2, 1]}
{"candidates": ["Jamaica defeated Honduras 2-1 on September 10, 2024, in Group B action of the CONCACAF Nations League.", "An own goal by Denil Maldonado in the 49th minute and a 76th penalty by Michail Antonio secured Jamaica's victory.", "David Ruiz scored for Honduras in the 50th minute.", "Jamaica won the match with a final score of 2-1 against Honduras.", "The over/under was 2.5 and the teams scored 3 goals, so people who bet the over won.", "Jamaica won at +243 odds so a bet of $100 won $343 total."], "ranking": [2, 1, 5, 3, 6, 4]}
{"candidates": ["Reggae Boyz head coach Steve McClaren emphasized the importance of winning the game to avoid a bad situation after a disappointing 0-0 stalemate against Cuba.", "Honduras will be looking to maintain their perfect record in the CONCACAF Nations League when they face Jamaica at Estadio Nacional Chelato Ucles on Tuesday.", "While La H began with a 4-0 thrashing of Trinidad and Tobago, Jamaica are also unbeaten following a goalless draw with Cuba.", "As Juan Carlos Obregon was handed his debut in the previous game, Jesus Batiz remains the only player in the current Honduras squad without a senior international appearance to his name.", "Alexander Lopez will continue featuring from the bench despite his screamer against the Soca Warriors, while the other scorers Kervin Arriaga, Edwin Rodriguez and David Ruiz should start from the first whistle.", "With Leon Bailey missing out through injury, Shamar Nicholson can be brought into the XI to partner Michail Antonio from the onset on Tuesday.", "Andre Blake will look to register another clean sheet, while Di'Shon Bernard may start ahead of Damion Lowe alongside Ethan Pinnock at centre-back.", "Honduras made an emphatic statement in their tournament debut, cruising to a dominant 4-0 win over Trinidad and Tobago.", "Jamaica stumbled in their opening match, settling for a disappointing draw against Cuba.", "Honduras vs Jamaica is seen as a primary competition for group supremacy in the 2024-25 Concacaf Nations League group stage.", "Jamaica has made two changes to the Reggae Boyz starting team that will play Honduras in Tuesday’s Concacaf Nations League A Group B game at the Nacional Chelato Ucles in Tegucigalpa.", "Wingback Greg Leigh comes in for Dexter Lembikisa and midfielder Norman Campbell will replace Jamal Lowe in the team selected by head coach Steve McClaren.", "The Reggae Boyz were held 0-0 by Cuba in Friday’s opening game played in Kingston and are fourth in the standings going into the game.", "Honduras, who beat Trinidad and Tobago 4-0 in their first game, which was also played at home are second on the points table that are being led by Nicaragua who have four points from their two games played.", "Michail Antonio, Bobby Reid and Demarai Gray return to lead the attack, while Kasey Palmer, who had arguably his best game for Jamaica against Cuba, is named in the midfield."], "ranking": [5, 2, 3, 12, 9, 8, 10, 1, 6, 4, 11, 13, 14, 7, 15]}
{"candidates": ["Honduras needs to secure a victory against Jamaica to move closer to qualifying for the quarterfinals, where the United States, Mexico, Canada, and Panama are already waiting.", "The match will be held at José de la Paz Herrera 'Chelato' Uclés Stadium in Tegucigalpa, Honduras, on September 10, 2024, at 20:00-08:00 PM.", "Honduras previously faced Jamaica in the 2023-24 edition of the Concacaf Nations League, where Jamaica won 1-0 at Independence Park in Kingston."], "ranking": [1, 3, 2]}
{"candidates": ["Steve McClaren praised his team's performance, highlighting their bravery and control in possession.", "McClaren expressed pride in his players' team spirit and resilience.", "McClaren noted the importance of good players coming off the bench to finish the game."], "ranking": [2, 1, 3]}
{"candidates": ["Jamaica made strategic changes to the starting team, bringing in Greg Leigh for Dexter Lembikisa and replacing Jamal Lowe with Norman Campbell.", "Norman Campbell's performance was instrumental in the first goal, and substitute Kaheim Dixon assisted in the second goal."], "ranking": [2, 1]}
{"candidates": ["The match will be broadcasted on various channels including Canal 8 & Canal 20, TSi & Canal DEPORTES TVC in Honduras, Televisa in Mexico, CBS, Paramount+, TUDN, and Telemundo in the United States, and Concacaf GO & YouTube Concacaf for the rest of the world."], "ranking": [1]}
{"candidates": ["The CONCACAF Nations League match between Honduras and Jamaica will be played at Estadio Nacional Chelato Ucles in Tegucigalpa, Honduras.", "It will kick off at 7 pm PT / 10 pm ET on Tuesday, September 10, in the US.", "In the United States (US), the CONCACAF Nations League match between Honduras and Jamaica will be available to watch and stream online live through Paramount+ (sign up for a free 7-day trial), CBS Golazo Network and Amazon Prime Video.", "If you are abroad, you may need to use a virtual private network (VPN) in order to watch games using your usual streaming service. A VPN, such as NordVPN, allows you to establish a secure connection online when streaming.", "The match between Honduras and Jamaica is scheduled to kick off at 10:00 PM (ET) on Tuesday, September 10, 2024.", "The Concacaf Nations League clash between Honduras and Jamaica will be available for viewers in the USA on Paramount+."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Iceland claimed three points with a 2-0 victory over Montenegro in Reykjavik.", "O Óskarsson scored in the 39th minute for Iceland.", "J Thorsteinsson scored in the 58th minute for Iceland.", "O. Óskarsson scored a goal for Iceland in the 39th minute.", "J. Þorsteinsson scored a goal for Iceland in the 58th minute.", "Oskarsson scored in the 39th minute", "Dagur Thorsteinsson scored in the 58th minute", "Berg Gudmundsson received a yellow card in the 18th minute", "Dagur Thorsteinsson received a yellow card in the 53rd minute", "Radunovic received a yellow card in the 20th minute", "Osmajic received a yellow card in the 24th minute", "Erakovic received a yellow card in the 50th minute", "Jovetic received a yellow card in the 89th minute", "Jon Dagur Thorsteinsson scored a goal, assisted by Gudmundur Sigurdsson.", "Orri Oskarsson scored a goal, assisted by Jon Dagur Thorsteinsson.", "J. Gudmundsson (ISL) received a yellow card at 18'.", "R. Radunovic (MNE) received a yellow card at 19'.", "M. Osmajic (MNE) received a yellow card at 24'.", "N. Erakovic (MNE) received a yellow card at 49'.", "J. Thorsteinsson (ISL) received a yellow card at 53'.", "S. Jovetic (MNE) received a yellow card at 89'.", "Orri Óskarsson scored in the 39th minute.", "Jon Dagur Thorsteinsson scored in the 58th minute.", "Vladimir Jovovic (Montenegro) was shown the yellow card in the 90'+5' minute."], "ranking": [1, 5, 5, 4, 4, 6, 6, 10, 10, 11, 11, 12, 13, 14, 15, 16, 16, 17, 17, 18, 19, 20, 20, 21]}
{"candidates": ["Oskarsson scored in the 39th minute", "Dagur Thorsteinsson scored in the 58th minute", "Berg Gudmundsson received a yellow card in the 18th minute", "Dagur Thorsteinsson received a yellow card in the 53rd minute", "Radunovic received a yellow card in the 20th minute", "Osmajic received a yellow card in the 24th minute", "Erakovic received a yellow card in the 50th minute", "Jovetic received a yellow card in the 89th minute"], "ranking": [1, 2, 5, 6, 7, 8, 3, 4]}
{"candidates": ["Sports Mole and data analysis correctly predicted Iceland's victory"], "ranking": [1]}
{"candidates": ["The match was part of the UEFA Nations League Group B4.", "The attendance for the match was 4,683.", "The match was held at Laugardalsvöllur with an attendance of 4,683.", "Iceland had 41.3% possession while Montenegro had 58.7%.", "Iceland had 12 shots with 5 on target, while Montenegro had 10 shots with 4 on target.", "Iceland had 23 total touches in the box compared to Montenegro's 19.", "Iceland's goalkeeper made 4 saves, while Montenegro's goalkeeper made 1 save.", "Iceland committed 17 fouls, while Montenegro committed 15.", "Iceland had 7 corners, while Montenegro had 4.", "Match ended with Iceland 2, Montenegro 0.", "The match took place at Laugardalsvöllur, Reykjavik, Iceland with an attendance of 4,683."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11]}
{"candidates": ["Lameck received a yellow card in the 43rd minute.", "Chembezi received a yellow card in the 72nd minute.", "Banega Aaron received a yellow card in the 90+5th minute.", "Mane scored the winning goal for Senegal in the 90+6th minute.", "Jackson received a yellow card in the 59th minute.", "Gueye received a yellow card in the 72nd minute.", "Koulibaly received a yellow card in the 76th minute.", "The Flames will host Senegal in the 2025 TotalEnergies Africa Cup of Nations (Afcon) qualifiers at Bingu National Stadium on Tuesday.", "The Lions of Teranga beat the Flames 4-0 in Dakar on Friday night.", "Goalkeeper Brighton Munthali is suspended for the match against Senegal after he received a red card in the first leg.", "Mabedi has recalled Mighty Mukuru Wanderers goalkeeper William Thole.", "Mabedi has also beefed up the squad with Silver Strikers defender Maxwell Paipi and Zambia-based striker Chifundo Mphasi.", "Kalidou Koulibaly produced one of the first attempts at goal in the 18th minute.", "Mane scored from a direct free-kick in the 96th minute to secure Senegal's 1-0 win.", "Patrick Mwaungulu produced a rare shot at goal for Malawi early on.", "Pape Gueye, Nicolas Jackson, and Boulaye Dia produced scoring chances in quick succession after the hour mark.", "Sadio Mané (Senegal) scored a goal at 96'", "Lloyd Aaron (Malawi) received a yellow card at 95'", "A 96th-minute winner from Sadio Mane earned Senegal a 1-0 win over Malawi and a place at the Africa Cup of Nations finals in Morocco next year.", "Sadio Mane sealed victory with a 25-yard free-kick that curled around the wall and into the bottom corner of the net.", "Malawi's goalkeeper Brighton Munthali received an early red card for a foul on Senegal's Sadio Mane in the previous match.", "George Chikooka will replace the ineligible Brighton Munthali as goalkeeper for Malawi.", "Senegal's Mane, who now plays for Al Nassr, will lead the attack with hopes of increasing his national team goal tally which is currently at 45."], "ranking": [14, 10, 12, 1, 11, 10, 9, 18, 16, 17, 15, 13, 5, 2, 7, 3, 4, 6, 8, 19, 20, 21, 22]}
{"candidates": ["Lameck (43'), Chembezi (72'), Banega Aaron (90+5')", "Mane (90+6')", "Jackson (59'), Gueye (72'), Koulibaly (76')"], "ranking": [1, 3, 2]}
{"candidates": ["Sports Mole's data analysis correctly predicted a 0-1 win for Senegal.", "Sports Mole's team correctly predicted the win for Senegal."], "ranking": [1, 2]}
{"candidates": ["The match will be played on Mother’s Day, and the Flames aim to give local fans a perfect gift on the holiday.", "Malawi are bottom of the group without a point while Burundi is third with three points from four matches."], "ranking": [1, 2]}
{"candidates": ["Sports Mole previews Tuesday's World Cup Qualifying - Asia clash between Kyrgyzstan and North Korea, including predictions, team news and possible lineups.", "Both teams are desperate to earn their first wins of the section, with an attacking affair expected between Kyrgyzstan and North Korea.", "The analysis suggests the most likely outcome of this match is a North Korea win with a probability of 37.49%. A win for Kyrgyzstan has a probability of 35.99% and a draw has a probability of 26.5%.", "The most likely scoreline for a North Korea win is 0-1 with a probability of 9.91%. The next most likely scorelines for that outcome are 1-2 (8.23%) and 0-2 (6.46%). The likeliest Kyrgyzstan win is 1-0 (9.66%), while for a drawn scoreline it is 1-1 (12.61%).", "Our AI algorithms have meticulously crunched the numbers, dissecting team performance, player form, and historical data to offer you a precise match prediction.", "Discover which players hold the key to their team's success. Our AI analysis highlights standout performers and their potential influence on the match's dynamics.", "Gain insights into the historical performance of both Kyrgyzstan and North Korea, including head-to-head statistics, recent encounters, and trends that may impact the forthcoming clash."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Both aiming to pick up their first wins of the third round, Kyrgyzstan and North Korea will clash at Stadion Im in Bishkek on Tuesday night for an AFC Cup World Cup qualifier.", "Kyrgyzstan are one of two sides in the third round of AFC World Cup qualifying who are yet to collect any points from their opening three section matches.", "North Korea's senior men are failing in their attempts to qualify for a first World Cup finals since South Africa in 2010.", "Chollima have recorded respectable back-to-back draws with Qatar and United Arab Emirates since a narrow loss to leaders Uzbekistan on September 5.", "Sitting in fifth place - five points behind second-placed Iran - Chollima will be viewing Tuesday night's trip to Kyrgyzstan as a major opportunity to record their maiden victory of the third round.", "Both Kyrgyzstan and North Korea are aiming to pick up their first wins of the third round in the AFC Cup World Cup qualifier.", "Kyrgyzstan suffered a heavy defeat at the home of Qatar last time out, while North Korea played out a draw with the United Arab Emirates.", "Kyrgyzstan are one of two sides in the third round of AFC World Cup qualifying who are yet to collect any points from their opening three matches.", "North Korea have recorded back-to-back draws with Qatar and the United Arab Emirates since a narrow loss to Uzbekistan on September 5.", "North Korea are viewing the match against Kyrgyzstan as a major opportunity to record their maiden victory of the third round."], "ranking": [5, 8, 9, 4, 2, 6, 7, 8, 4, 3]}
{"candidates": ["India is all set to host Qatar in a FIFA World Cup 2026 Qualifier match today, November 21, at the Kalinga Stadium in Bhubaneshwar.", "Indian team ‘The Blue Tigers’ will be entering the game following their spectacular win in the first match in the group stage against Kuwait on November 16 at Jaber Al-Ahmad International Stadium in Kuwait City.", "Qatar is one of the strongest teams in Asia and dominated against Afghanistan in an 8-1 win at the home ground.", "Although Qatar is the clear favourite going into the match, an invigorated Indian team supported by their home crowd has the potential to pull off a win against them.", "Winning against Qatar will significantly increase India's chances of qualifying, but the Blue Tigers will have to face a formidable opponent today.", "In the FIFA World Cup Qualifiers in 2019, India famously held Qatar to a 0-0 draw and will be expecting a solid game today as well to strengthen their position in Group A further.", "Carlos Queiroz - 'Happy to be in India, we are excited about this match and I realize the difficulty and significance of it for the Indian national team, especially being on their home ground.'", "Rahul Bheke: 'This year, you’ll see that we have played well, have maintained ball possession and have won trophies. Somewhere, I feel the work that Igor Stimac has done here over the years, except during the pandemic period when there was hardly any time for preparation, is bearing fruits now.'", "Qatar coach Carlos Queiroz expressed excitement about the match and acknowledged its significance for the Indian team.", "India coach Igor Stimac urged his players to give their all, stating that there was nothing to lose but a lot to win."], "ranking": [8, 6, 5, 4, 3, 2, 9, 1, 7, 10]}
{"candidates": ["India will take inspiration from their famous goal-less draw against Asian champions Qatar four years ago when they face the same opponents in a 2026 FIFA World Cup second round qualifiers match in Bhubaneswar on November 21.", "Indian football team confidence boosted after the 1-0 away win against Kuwait on November 16 and will hope to give a tough fight to Qatar, though the fancied visiting side will start as firm favourites.", "India registered a stunning draw against Qatar in 2019 and will aim to replicate the same.", "India have a tremendous home record this year and are unbeaten so far on their home soil.", "India come into this game on the back of a motivating 0-1 away win over Kuwait.", "Qatar began their campaign with a win over Afghanistan, handing them an 8-1 defeat.", "Both sides are expected to field the same line-up as they did in their first match.", "Brandon Fernandes (India) was injured for the previous game and is likely to make a comeback.", "Manvir Singh is injured and is expected to not feature in the game.", "Indian Captain Sunil Chhetri is going to play a huge role in India's game against Qatar.", "Almoez Ali is Qatar’s man in form at the moment, having scored four goals against Afghanistan in the last encounter."], "ranking": [8, 5, 3, 6, 4, 2, 10, 9, 7, 1, 11]}
{"candidates": ["Qatar cruises past India and extends its lead in the top of the table. Qatar kept asking questions of a struggling Indian backline that just wasn’t sharp enough to stop the away side’s attackers. The back-line was not tight enough in its marking and failed to read the large amount of plays made by Qatar. India too made a few decent chances but in the end, couldn’t find the net. A disappointing night for the underdogs.", "Arsene Wenger says 'India needs to take the hand-brakes off and play with a little bit more tempo in the second half. They should also be a bit more tighter in marking attackers and go for it in the second half.'"], "ranking": [1, 2]}
{"candidates": ["The FIFA World Cup 2026 qualifier match between India and Qatar will take place at the Kalinga Stadium in Bhubaneswar on Tuesday, November 21, at 07:00 pm IST.", "The face-off between the two teams will be live telecasted on Sports18 1, Sports18 1HD, and Sports18 3.", "The match will also be live-streaming on the Jio Cinema app and website.", "The Kalinga stadium is sold-out!!!!", "Arsene Wenger is in attendance tonight!", "Qatar obtained 10 corners in the first half while India got none.", "Suresh Singh made a notable turn in the midfield in the 65th minute and found Sahal Abdul Samad, who missed a scoring opportunity."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The game between India and Qatar will be played on November 21, 2023 at the Kalinga Stadium in Bhubaneswar.", "The match will kick off at 7:00 PM IST and will be broadcasted on the Sports18 network and livestreamed on JioCinema.", "India has never defeated Qatar.", "India has conceded just one goal against Qatar in their last two matches.", "Both India and Qatar are level on points in Group A (3)."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["India's expected squad includes: Gurpreet Singh Sandhu; Nikhil Poojary, Rahul Bheke, Sandesh Jhingan, Akash Mishra; Lalengmawia, Suresh Wangjam, Sahal Abdul Samad; Lallianzuala Chhangte, Sunil Chhetri, Mahesh Naorem Singh.", "Qatar's expected squad includes: Al Sheeb; Hassan, Khoukhi, Al Rawi, Haddadi; Hatem, Boudiaf, Al Ahraq, Al Haydos; Mohammad, Ali."], "ranking": [2, 1]}
{"candidates": ["Duckens Nazon scored a hat-trick in the match against Sint Maarten.", "Goalkeeper Jhony Placide got his first clean sheet in this group stage.", "Duckens Nazon scored a hat trick in the match against Sint Maarten.", "Christopher Attys netted his first goal for Haiti."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Haiti won 6-0 against Sint Maarten.", "Attys scored in the 40th minute.", "Nazon scored a hat-trick with goals in the 59th, 75th, and 82nd minutes.", "Cantave scored twice in the 77th and 85th minutes.", "Jean scored in the 12th minute.", "Pata received a yellow card in the 25th minute.", "Christopher Attys scored in the 41st minute.", "Duckens Nazon scored in the 59th, 75th, and 82nd minutes.", "Mikael Cantave scored in the 76th and 84th minutes.", "Match ended with Haiti defeating Sint Maarten 6-0.", "C. Attys scored a goal at 41 minutes.", "D. Nazon scored goals at 59, 75, and 82 minutes.", "M. Cantave scored goals at 76 and 84 minutes.", "Christopher Attys scored the first goal at 41' with an assist from Louicius Don Deedson.", "Duckens Nazon scored the second goal at 59' with an assist from Dany Jean.", "Duckens Nazon scored the third goal at 75' with an assist from Christopher Attys.", "Mikael Gabriel Cantave scored the fourth goal at 76' with an assist from Fafá Picault.", "Duckens Nazon scored the fifth goal at 82' with an assist from Bryan Labissiere.", "Mikael Gabriel Cantave scored the sixth goal at 84' with an assist from Martin Experience.", "Christopher Attys scored the first goal for Haiti in the 41st minute.", "Duckens Nazon scored a hat-trick with goals in the 59th, 75th, and 82nd minutes.", "Mikael Cantave scored two goals in the 76th and 84th minutes.", "Attys Christopher opened the scoring for Haiti with a header from a corner in the 40th minute.", "Duckens Nazon scored with a header in the 59th minute and added two more goals in the 75th and 82nd minutes.", "Mikael Cantave scored for Haiti in the 77th and 85th minutes.", "Duckens Nazon scored a hat trick.", "Mikaël Cantave scored a brace.", "Christopher Attys scored his first goal for Haiti.", "Martin Expérience assisted the third goal.", "Fafa Picault assisted the fourth goal.", "Dany Jean assisted the second goal.", "Bryan Labissière assisted a goal.", "Haiti won the match with a final score of 6-0 against Sint Maarten.", "Haiti scored 1 goal in the first half and 5 goals in the second half."], "ranking": [1, 14, 2, 3, 5, 30, 4, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31, 32, 33, 34]}
{"candidates": ["Data analysis predicted a 73.68% probability of a Haiti win.", "The most likely scoreline predicted was 2-0 for Haiti.", "French coach Sébastien Migné revealed his starting 11 with several changes to allow several players to prove their ability.", "Haiti will face Sint Maarten on September 9, 2024, as part of the CONCACAF Nations League.", "The match is scheduled to take place at 5:00 p.m. at the Estadio Centroamericano in Mayagüez, Puerto Rico.", "Haiti's team, the Grenadiers, are coming off a 4-1 victory against Puerto Rico.", "French coach Sébastien Migné discussed the team's state of mind and preparation for the match against Sint Maarten, emphasizing an ambitious project that extends to the World Cup qualifiers."], "ranking": [4, 3, 6, 2, 1, 5, 7]}
{"candidates": ["Haiti vs Sint-Maarten, Monday, September 9 2024 at 5:00 p.m."], "ranking": [1]}
{"candidates": ["This victory consolidates the Grenadiers' leadership in Group C.", "Coach Sébastien Migné aimed to get as many points as possible during this September gathering in Puerto Rico."], "ranking": [1, 2]}
{"candidates": ["Haiti had 69% possession compared to Sint Maarten's 31%.", "Haiti had 9 shots on target while Sint Maarten had 2.", "The match was part of the CONCACAF Nations League - League B, Group C.", "The match took place at Estadio Centroamericano de Mayagüez.", "The referee for the match was Carly Marissa Shaw-MacLaren.", "Haiti won 6-0 against Sint Maarten in the Concacaf Nations League.", "Haiti is now in first place in Group C of League B with six points.", "Monday night’s win was Haiti’s fourth consecutive victory.", "The over/under was 4.5 and the teams scored 6 goals, so people who bet the over won.", "Haiti won at -2381 odds so a bet of $2381 won $2481 total."], "ranking": [8, 7, 5, 4, 3, 1, 2, 6, 9, 10]}
{"candidates": ["Couturier scored for Madagascar in the 45+2 minute.", "Raveloson scored for Madagascar in the 25th minute.", "Minteh scored for Gambia in the 90+7 minute.", "Manneh scored for Gambia in the 85th minute.", "Yankuba Minteh (Gambia) scored a goal at 97'", "Rojolalaina Andriamanjato (Madagascar) substitution at 96'", "Alasana Manneh (Gambia) received a yellow card at 85'"], "ranking": [4, 3, 6, 5, 7, 2, 1]}
{"candidates": ["Rayan Raveloson scored for Madagascar in the 25th minute.", "Couturier scored for Madagascar in the 45+2 minute.", "Manneh scored for Gambia in the 85th minute.", "Minteh scored for Gambia in the 90+7 minute."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Sports Mole predicted a 1-1 draw for the match.", "Both Madagascar and Gambia were seeking their first win in Group A of the Africa Cup of Nations Qualifying.", "Madagascar, who are winless in their previous 12 matches, will scuffle to beat The Gambia to end their winless run in the continent’s biennial biggest football fiesta qualifiers.", "The Gambia must defeat Madagascar to maintain their chances of qualifying for the 2025 Africa Cup of Nations to be hosted in Morocco, despite their slow start to the continent’s bi-annual biggest football showpiece qualifiers.", "Madagascar and The Gambia are both with a point each after two qualifier matches."], "ranking": [5, 4, 2, 1, 3]}
{"candidates": ["Madagascar and Gambia will be looking to secure their first win in Group A of the 2025 Africa Cup of Nations qualifiers.", "Romuald Rakotondrabe's men have failed to win any of their last 12 AFCON qualifying matches since November 2019.", "Gambia were denied their first win in their race for a place in Morocco as they fell to a 2-1 defeat against Tunisia.", "Madagascar Gambia Nuirobkg Africa Cup Of Nations match preview and predictions: This exciting matchup in the soccer / football Africa Cup Of Nations league / tournament, held in Africa, is set to deliver thrilling Soccer/ football action."], "ranking": [2, 1, 3, 4]}
{"candidates": ["If Hungary avoids defeat, they will extend their unbeaten streak to 13 games, surpassing the record set in the early 2000s."], "ranking": [1]}
{"candidates": ["Dominik Szoboszlai scored a penalty in the 48th minute.", "Nagy received a yellow card in the 86th minute.", "Kleinheisler received a yellow card in the 90+6th minute.", "Akaydin received a yellow card in the 57th minute.", "D. Szoboszlai scored the only goal of the match at the 48th minute."], "ranking": [1, 4, 5, 3, 2]}
{"candidates": ["Both Hungary and Turkey qualified for Euro 2024 as group winners.", "Hungary have been in fine form under manager Marco Rossi, winning nine, drawing five, and losing only two of their last 16 internationals.", "Turkey, under new coach Vincenzo Montella, have won three and drawn one of his first four games in charge.", "Hungary have not lost any of their last seven matches on home soil.", "Turkey have failed to win any of their last four meetings with Hungary.", "The match between Hungary and Turkey is scheduled for Friday, March 22, 2024, at 20:45.", "Hungary has a stable form with two victories, three draws, and no defeats in their last five matches, scoring 10 goals and conceding 7.", "Turkey has a slightly better record with three wins, one draw, and one loss in their last five matches, scoring 11 goals and conceding 7.", "Historically, Hungary has won three matches against Turkey, with Turkey winning one and one match ending in a draw."], "ranking": [8, 2, 3, 5, 4, 9, 6, 7, 1]}
{"candidates": ["The last time the Hungarian national team enjoyed such a successful run was over 20 years ago, between March 2000 and April 2001, when they remained unbeaten for 12 matches.", "The 'Golden Team' had a comparable streak, winning 15 of 18 games and drawing three after losing the 1954 World Cup final. Their streak was halted in February 1956 by Turkey."], "ranking": [1, 2]}
{"candidates": ["The match was held at Puskas Arena in Budapest.", "The match ended with a score of Hungary 1-0 Turkey."], "ranking": [2, 1]}
{"candidates": ["Harambee Stars were held to a 0-0 draw by Zimbabwe in the opening Group J match of the 2025 Africa Cup of Nations qualifiers.", "Eric Ouma had a scoring opportunity eight minutes to time which was saved by the Zimbabwean keeper.", "Defender Alphonce Omija limped out injured after a collision with keeper Bryne Omondi.", "Prince Dube had a close chance to score in the 41st minute but his shot sailed straight to keeper Omondi.", "In the second half, Prince Dube's shot curled inches over the bar.", "Austin Odhiambo sent left back Ouma through with a pass, but Ouma's low effort was saved by the keeper."], "ranking": [6, 4, 3, 5, 2, 1]}
{"candidates": ["Coach Engin Firat is exploring injury alternatives ahead of the AFCON qualifier against Zimbabwe on September 6, 2024.", "Firat emphasized the importance of the initial matches but noted that the team's ultimate success depends on their performance throughout the entire campaign.", "Firat expressed frustration at not being able to field a full-strength squad due to injuries and fitness issues.", "Firat revealed his intention to invite two players from England, Australia, and Ireland to strengthen the squad.", "Firat cited difficulties with Kenya’s passport and immigration procedures, which have hampered efforts to bring in international talent.", "Firat remains optimistic about the upcoming fixtures, hoping for a strong start in the qualifiers.", "Firat mentioned that the real performance level of Kenya Premier League players typically emerges after 5-6 weeks of preparation.", "Firat highlighted the strength of their opponents, particularly Zimbabwe, noting their fitness and the return of previously absent players.", "Firat also mentioned Namibia's recent form and their ability to compete against top-tier African teams.", "Kenya will begin their quest to qualify for a seventh Africa Cup of Nations tournament when they welcome Zimbabwe to the Mandela National Stadium on Friday.", "Both teams have had an extra two days of rest after their meeting—initially scheduled to be played on Wednesday—was postponed by a further 48 hours.", "Kenya were denied an opportunity to add to their six AFCON appearances, having been banned by FIFA from taking part in the last qualifying campaign due to 'governmental interference' in footballing matters.", "The Harambee Stars have been drawn in Group J of the AFCON qualifiers, where they will battle it out with Namibia, Cameroon and Zimbabwe for two spots at next year's showpiece in Morocco.", "A positive start to proceedings would certainly be a welcome boost for Kenya, whose record against Zimbabwe makes for good reading with three wins and a draw from four previous meetings between the teams.", "Friday's hosts are also without defeat in six of their last seven matches across all competitions and now set out to win consecutive matches for the second time since the turn of the year.", "Like Kenya, Zimbabwe were also banned by FIFA from taking part in the last AFCON qualifying campaign, denying them a shot at a fourth straight continental campaign after three consecutive group-stage exits.", "Off the back of ending 2023 with three draws on the bounce, the Warriors have blown hot and cold since the turn of the year having won three and lost four of their seven outings so far.", "Two of those four defeats have come at the hands of Kenya, who first beat Michael Nees's men 3-1 in March's friendly encounter before claiming a 2-0 triumph in the COSAFA Cup four months later.", "Nees will be hoping that third time is the charm for his side against their East African counterparts as they look to kick off their AFCON qualifiers on a high amid what has been a disappointing World Cup qualifying journey so far.", "Heading into Friday's affair, the away side are yet to win any of their World Cup qualifying matches and are already five points off the pace in Group C after just four rounds of matches."], "ranking": [14, 15, 18, 19, 20, 10, 13, 12, 11, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17]}
{"candidates": ["Stars coach Firat tried to rejig his forward line, bringing in John Avire for Eric Johannah who had started as a false nine.", "Stars will now look to improve offensively ahead of match day two next Tuesday, when they take on Namibia in South Africa."], "ranking": [2, 1]}
{"candidates": ["Kenya's recent track record against Zimbabwe includes a 2-0 victory in the COSAFA Cup on July 2, 2024, and a 3-0 win in a World Friendly International on March 26, 2024."], "ranking": [1]}
{"candidates": ["Kenya's Michael Olunga is doubtful for this one despite being included in the squad as he continues to battle with an injury that has seen him fail to feature since early August.", "Olunga's potential unavailability is certainly a big blow for the home side, who saw their skipper net a hat-trick against Friday's opponents back in January.", "Collins Sichenje and Ian Otieno are both guaranteed absentees for this one as the pair sustained respective injuries during a training session.", "Brendan Galloway has pulled out of the Zimbabwe camp and will not be able to add to his two caps after recently picking up a hamstring injury.", "Star attacker Khama Billiat is back in contention for the away side, having sensationally announced his return to the international scene after a three-year absence due to retirement.", "Kenya possible starting lineup: Matasi; Omar, Omurwa, Omija, Okumu; Muguna, Akumu, Odada; Avire, Ayunga, Omune", "Zimbabwe possible starting lineup: Arubi; Hadebe, Murwira, Takwara, Mbeba; Munetsi, Rinomhota, Hachiro, Chirewa; Kadewere, Mapfumo", "We say: Kenya 1-0 Zimbabwe", "Kenya's dominance in this fixture will give them a bit of a psychological edge and coupled with the added advantage of playing in front of their fans, we are backing them to carry the day, albeit by only a narrow margin."], "ranking": [8, 2, 6, 5, 1, 9, 10, 4, 3]}
{"candidates": ["Sunil Chhetri became the first player to score in his first, 25th, 50th, 75th, 100th, 125th, and 150th matches.", "Sunil Chhetri became the 8th player in the world and the first Indian footballer to play 150 or more international matches.", "Sunil Chhetri played his 150th International match and scored his 94th international goal. He holds the unique record of scoring at least one goal in his first, 25th, 50th, 75th, 100th, and 125th matches."], "ranking": [1, 2, 3]}
{"candidates": ["Sunil Chhetri is expected to play his 150th Senior International match for India.", "Sunil Chhetri is set to rack up his 150th international cap on Tuesday and would become only the 41st male player in history to reach that milestone."], "ranking": [2, 1]}
{"candidates": ["Sunil Chhetri scored his 94th international goal in the 38th minute.", "Rahmat Akbary equalized for Afghanistan in the 70th minute.", "Sharif Mukhammad scored the winning penalty for Afghanistan in the 88th minute.", "Sunil Chhetri scored the only goal for India, his 94th international goal.", "India lost to Afghanistan 2-1 in the FIFA World Cup 2026 Qualifier.", "Sunil Chhetri scored a penalty in the 38th minute to give India the lead.", "Rahmat Akbari equalized for Afghanistan in the 70th minute with a deflected shot.", "Sharif Mukhammad scored the winning goal for Afghanistan with a penalty in the 88th minute.", "Sunil Chhetri scored a penalty at the 38th minute.", "Rahmat Akbari scored at the 70th minute.", "Sharif Mukhammad scored a penalty at the 88th minute.", "Vikram Partap Singh (India) was shown the yellow card for a bad foul at the 90+6 minute."], "ranking": [1, 5, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12]}
{"candidates": ["India and Afghanistan are set to clash in Guwahati, Assam, on Tuesday, March 26, following a goalless draw in their first encounter in Saudi Arabia on March 21.", "India's coach Igor Stimac emphasized the importance of winning to secure a place in the third round of the FIFA World Cup qualifiers 2026.", "Sahal Abdul Samad is ruled out due to a hamstring injury, while Brandon Fernandes and Liston Colaco are expected to start.", "Afghanistan's coach Ashley Westwood is likely to make minimal changes to the team that secured a point in the first game."], "ranking": [4, 2, 3, 1]}
{"candidates": ["India played out a goalless draw against hosts Afghanistan at the Damac Stadium.", "India currently sit second in Group A that also consists Qatar and Kuwait.", "In their match against Afghanistan, Sunil Chhetri-led side missed the chance to take top spot in the group with a tame draw.", "Subhasish Bose’s header in the 79th minute saw India coming ever so close to scoring in the second half.", "Milestone man Sunil Chhetri will be the cynosure of all eyes as India hope to overcome their struggles in front of the goal in the return leg of the 2026 FIFA World Cup Qualifier against Afghanistan in Guwahati on March 26.", "Igor Stimac's India fired a blank in a disappointing draw in the away leg Group A match in Abha, Saudi Arabia on March 22 against their lower-ranked opponents, extending their goalless run.", "In this backdrop, it will be imperative from India's point of view that Chhetri, who will be appearing in his 150th international match, rises to the occasion and make his landmark game memorable at the Indira Gandhi Athletic Stadium.", "Stimac has prioritised qualification to the third round of World Cup Qualifiers and secure a direct entry into the 2027 AFC Asian Cup but with his team coming off a disappointing campaign in the last continental showpiece, the Croatian will be under pressure and will want his wards to show a lot more desperation, composure and urgency upfront.", "India will need at least four points from their next three matches – against Afghanistan (Tuesday), Kuwait (June 6) and Qatar (June 11) to remain in control of their fate.", "Stimac hoped that Chhetri could make his landmark match all the more special with a performance befitting his stature in Indian football.", "\"Being chosen to represent your country is a dream of millions of kids when they start kicking the ball, and to make it 150 times is possible only for the GOATs (greatest of all times),\" said Stimac.", "\"We hope our captain will make it memorable on March 26 for all Indian fans and himself.\"", "Two teams who could certainly do with a victory go head-to-head at the Indira Gandhi Athletic Stadium on Tuesday as India entertain the challenge of Afghanistan in World Cup qualifying.", "India had to make do with a share of the spoils from their meeting against Afghanistan, which ended goalless at the Damac Club Stadium on Thursday evening.", "Igor Stimac's men were in the ascendancy for large spells of the contest but failed to find the cutting edge in a nervy and cagey affair.", "While the Blue Tigers may be disappointed not to have claimed all three points, they have now snapped a three-game losing streak since the turn of the year.", "Next up is the task of facing off against an opposing outfit who have managed just one victory from the 12 previous editions of this fixture.", "Having not won a game in front of their fans since June 2023, Tuesday's hosts will be aiming to get back to winning ways on home turf.", "Afghanistan were under fire for the majority of their clash against India last time out but avoiding defeat for the first time since November is certainly a welcome outcome.", "Ashley Westwood's men will now seek to kickstart their World Cup qualifying journey, which has been underwhelming to say the least so far.", "The Lions of Khorasan currently sit bottom of Group A with just one point picked up from three outings heading into Monday's clash in Guwahati.", "Off the back of an 8-1 thrashing against Qatar in their last away involvement, Tuesday's visitors will need to be wary of another defensive collapse on the road.", "Despite seeing his goalless streak extend to seven matches for club and country last time out, India's record goalscorer Sunil Chhetri is expected to lead the line in this one.", "Once again, Afghanistan will be without several key players who are currently taking a stand against the Afghanistan Football Federation due to alleged corruption.", "Omid Popalzay is one of only eight players from the Afghanistan squad that played against Mongolia in the first round of qualification, and the 28-year-old is all but guaranteed a start here."], "ranking": [14, 20, 10, 18, 1, 5, 3, 7, 12, 9, 16, 11, 4, 15, 6, 8, 2, 13, 21, 19, 22, 23, 24, 25, 17]}
{"candidates": ["Ashley Westwood, Afghanistan's coach, praised his team's resilience and fighting spirit.", "Igor Stimac, India's coach, criticized his team's lack of control and silly mistakes.", "Sunil Chhetri reflected on his scoring milestone despite the loss.", "India's defeat against Afghanistan has diminished its chances of qualifying for a place in the third round of the FIFA World Cup 2026 and AFC Asian Cup 2027 Preliminary Joint Qualifiers.", "India's loss left them with just four points from four matches in the four-team Round 2 group, jeopardizing their chances for the FIFA World Cup 2026 and AFC Asian Cup 2027 Preliminary Joint Qualifiers.", "India's hopes may now depend on their match against Kuwait on June 6, 2024."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["Afghanistan had four players on the pitch and one on the bench without clubs.", "India had seven shots compared to Afghanistan's twelve, with only one shot on target against Afghanistan's five.", "This was the first time India lost to Afghanistan in nearly five years under Igor Stimac.", "India drew the away match against Afghanistan goalless in Saudi Arabia.", "Sunil Chhetri's second-minute shot hit the post before Manvir Singh blew it over the bar.", "The match was held at Indira Gandhi Stadium, Guwahati, India.", "Attendance for the match was 8,932."], "ranking": [5, 2, 1, 4, 3, 7, 6]}
{"candidates": ["The match will be held at Indira Gandhi Athletic Stadium, Guwahati, India, at 7:00 PM IST on Tuesday, March 26.", "Sunil Chhetri's 150th appearance for the Blue Tigers adds to the significance of the match.", "The game will be telecast on Sports18 channel and live-streamed on JioCinema."], "ranking": [3, 1, 2]}
{"candidates": ["The India vs Afghanistan, FIFA World Cup Qualifiers will be played at the Indira Gandhi Athletic Stadium in Assam on 26 March.", "India vs Afghanistan, FIFA World Cup Qualifiers match will start from 7:00 pm IST onwards on 26 March.", "India vs Afghanistan, FIFA World Cup 2026 Qualifiers matches will be live-streamed online on FanCode."], "ranking": [3, 2, 1]}
{"candidates": ["Hong Kong lost 3-1 to the United Arab Emirates in their opening match on Sunday but the 32-year-old forward set up their goal.", "Everton Camargo came into the competition in pulsating international form with five goals in his first six games."], "ranking": [1, 2]}
{"candidates": ["AFC Asian Cup favourites Iran will be looking to build on their triumphant opening-day victory and book a place in the knockout stages when they take on Hong Kong at the Khalifa International Stadium on Friday.", "Hong Kong entered into this tournament as one of the weakest teams and while they started their campaign on Sunday with a 3-1 defeat at the hands of Group C rivals the United Arab Emirates, they put plenty on show to suggest they aren't just there to make up the numbers in what was their first Asian Cup finals game since 1968.", "Iran entered into the competition as one of the major favourites to go the whole hog and they began their group stage campaign with an impressive 4-1 demolition job of Palestine last Sunday.", "Iran was ranked 21st in the world, while Hong Kong was ranked 150th.", "Iran was among the favorites for the trophy, aiming for a record-equalling fourth continental crown.", "Hong Kong was playing in their first Asian Cup in more than 55 years."], "ranking": [5, 2, 4, 1, 3, 6]}
{"candidates": ["Hong Kong face Iran, one of the Asian Cup favourites, on Friday.", "Everton Camargo is a quick and strong right-sided forward, always looking to cut inside and work a shot on his left, in a style he likens to Netherlands great Arjen Robben or Liverpool star Mohamed Salah.", "Hong Kong's Norwegian coach Jorn Andersen says Everton is'maybe the best player in Hong Kong'.", "Everton says the team have 'improved a lot in the last two years, perhaps also with the arrival of foreigners to help the Hong Kong team along with the local, Chinese players'.", "Iran are determined to secure their place in the AFC Asian Cup 2023 knockouts.", "Hong Kong, China are set to take on football giants Iran on Thursday, January 19, 2024, in the second Group C clash.", "The stakes will be high for Hong Kong, China as they will try to fight back against a much superior opposition – Iran.", "Iran will look to seal their RO16 qualifications with an impressive win over Hong Kong, China.", "Kick-Off: Friday, 19 January 2024 at 11:30 GMT", "Location: Education City Stadium (Al Rayyan)", "Form: Hong Kong, China (in all competitions): L-L-D-L-L, Iran (in all competitions): W-D-W-W-W", "Players to Watch: Mehdi Taremi (Iran), Everton Camargo (Hong Kong, China)", "Match Facts: Hong Kong, China haven’t earned a win in their last six games.", "Iran emerged victorious in the two sides’ previous meeting.", "Injury and Team News: There is no news of injury in the Hong Kong, China squad whereas Iran will still miss the likes of Ali Gholizadeh who is injured.", "Head-to-Head: Total Matches – 3, Hong Kong, China wins – 0, Iran wins – 3, Draws – 0", "Predicted Lineup: Hong Kong (4-3-3): Yapp (GK), Law, Gerbig, Li, Sun, Lam, Chan, Tan, Camargo, Orr, Udebuluzor, Iran (4-4-2): H Hosseini (GK), Rezeaian, Pouraliganji, Hosseini, Mohammadi, Gholizadeh, Nourollahi, Ezatollahi, Hajsafi, Azmoun, Taremi", "Match Prediction for Hong Kong vs Iran: With a 90% likelihood of securing victory, Iran enter this match as the superior and more experienced side who will look to grab their second victory of the AFC Asian Cup 2023 campaign.", "Prediction: Hong Kong, China 0-3 Iran", "Telecast for Hong Kong vs Iran: India – Sports 18, Jio Cinema, Qatar, Bahrain, Jordan, Kuwait, Lebanon, Palestine, Syria, Yemen, Oman – BeinSports, Alkass, Hong Kong, China, China – Hoy TV, United Kingdom, Ireland, France, Belgium, Netherlands – Triller TV, Australia – Network 10"], "ranking": [18, 2, 4, 5, 7, 6, 8, 9, 15, 16, 11, 12, 13, 14, 10, 17, 19, 20, 1, 3]}
{"candidates": ["The AFC Asian Cup match between Vietnam and Indonesia will be played at the Khalifa International Stadium in Al Rayyan, Qatar.", "It will kick off at 12:30 pm ET on Friday, January 19, 2024, in the United States (US).", "The match was held at the Khalifa International Stadium in Doha.", "The attendance for the match was 36,412 spectators."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Hong Kong won 2-1 against China in a friendly behind closed doors in the build-up to the competition, a first victory over their mainland rivals in 29 years."], "ranking": [1]}
{"candidates": ["In the US, the game is available to watch and stream online live through Paramount+.", "Fans who are unable to watch the game can follow the live action on GOAL.", "Sean Tse missed Hong Kong's opening match owing to a thigh issue, while Helio was also out due to a muscle injury.", "Chan Siu Kwan scored his fourth career goal for the senior side last Sunday in what was the 1,000th goal in the history of the 2023 AFC Asian Cup.", "Iran were without the services of Ali Gholizadeh for their opener due to an injury.", "AS Roma striker Sardar Azmoun scored his 50th goal for the national team last weekend, taking him into joint second in the all-time scorer's list alongside Karim Bagheri, with Ali Daei holding the outright record with 108."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Malawi was defeated 1-0 by Tunisia in a World Cup Qualifiers Game held at Bingu National Stadium in Lilongwe.", "A late soft penalty was awarded to Tunisia in the 87th minute, which they converted to secure the victory.", "Despite 7 minutes of added time, Malawi couldn't find an equalizer.", "This defeat marks the end of Coach Mabedi’s unbeaten streak since taking over the leadership of the Flames.", "Y. Msakni scored a penalty in the 89th minute to secure a 1-0 victory for Tunisia.", "C. Idana received a yellow card in the 10th minute.", "C. Kumwembe received a yellow card in the 67th minute.", "L. Chaziya received a yellow card in the 78th minute.", "F. Sassi received a yellow card in the 59th minute.", "A late strike from the spot by Youssef Msakni handed Patrick Mabedi his first home defeat as the Malawi National Football Team was beaten 1-0 by Tunisia.", "Flames Captain John Banda almost broke the deadlock in the 26th minute with a thunderous shot that was saved by Said.", "Brighton Munthali made several key saves to keep Malawi in the game.", "Chaziya brought down Seifallah Ltaeif inside the penalty box, leading to the decisive penalty.", "Msakni scored the penalty in the 87th minute to secure the win for Tunisia.", "Msakini Youssef scored the only goal of the match from the penalty spot in the 87th minute after defender Lawrence Chaziya fouled Ltaief Sayfallah in the box.", "Goalkeeper Brighton Munthali kept the Flames in the match after he denied Khenisi Yassine.", "Mphasi had a great chance to level the scores in stoppage time but Tunisia’s goalkeeper Said Bechir was equal to the task.", "Tunisia earned a dramatic 1-0 victory over Malawi's Flames in a tense World Cup qualifier on November 21, 2023, courtesy of an 87th-minute penalty kick.", "The referee awarded Tunisia the decisive spot kick after Malawi defender Lawrence Chaziya received a yellow card for fouling an attacker in the box.", "Youssef Msakni calmly converted the penalty while goalkeeper Ernest Kakhobwe guessed incorrectly."], "ranking": [18, 10, 14, 4, 15, 6, 7, 8, 9, 1, 12, 11, 13, 16, 5, 3, 2, 19, 17, 20]}
{"candidates": ["Msakni scored an 88th-minute penalty to secure a 1-0 victory for Tunisia.", "Sassi received a yellow card in the 58th minute.", "Malawi missed several golden chances against Liberia, including shots by Idana, Chaziya, and Aaron.", "Substitute Chifundo Mphasi broke the deadlock 10 minutes after being introduced, securing the win for Malawi.", "Tunisia beat São Tomé e Principe 4-0 to take the lead of Group H.", "Malawi won 1-0 against Liberia in Monrovia.", "Equatorial Guinea won 1-0 against Namibia."], "ranking": [1, 6, 5, 2, 4, 3, 7]}
{"candidates": ["Tunisia's win puts them at the top of Group H with six points from two games, level with Equatorial Guinea.", "The Flames are third in the standings with three points.", "Despite the loss, Mabedi said there were several positives that could be drawn from the match.", "Banda, who was withdrawn due to injury, was disappointed with the loss.", "Tunisia Coach Jalel Kadri, through an interpreter, said they deserved the win.", "Tunisia coach Jalal Qaderi cited experience and tactical prowess as key factors in their victory.", "Malawi coach Patrick Mabedi expressed satisfaction with his team's performance, calling it valuable experience for future endeavors.", "Mabedi downplayed the absence of injured stars like Frank Mhango, emphasizing the importance of grooming replacements for the future."], "ranking": [5, 8, 4, 6, 3, 2, 7, 1]}
{"candidates": ["There is a need for the Football Association of Malawi (FAM) to intervene in the bad blood between coach Mabedi and player Gabadinho Mhango to ensure the player is available for the match against Tunisia.", "Congratulations were extended to coach Mabedi and his team for their win against Liberia."], "ranking": [2, 1]}
{"candidates": ["The 23rd edition of the FIFA World Cup will have 48 participating countries, giving an advantage for Africa to field more teams.", "The top team from each group after Match Day 10 will earn automatic qualification for the 2026 World Cup finals.", "The top team from each group after Match Day 10 shall earn an automatic qualification for the 2026 World Cup finals.", "The four best second-placed teams from all nine groups will engage in a continental playoff, determining a single victor who will then proceed to a second and final playoff.", "The final stage will comprise six teams from various confederations, with the top two emerging as qualified participants, ultimately making up the 48 competing teams."], "ranking": [5, 2, 3, 4, 1]}
{"candidates": ["Some observers questioned whether Malawi lacks attacking efficiency to truly compete in World Cup qualifying.", "Journalist Edwin Mbewe commented on Malawi's lack of a 'killer punch' upfront, indicating the current attackers have much to learn.", "In the qualifying standings, Tunisia leads the group with 6 points while Malawi sits third with 3 points after four matches."], "ranking": [2, 1, 3]}
{"candidates": ["Malawi won 3-1 against São Tomé and Príncipe in the World Cup Qualification - CAF Qualification: Group H on June 6, 2024."], "ranking": [1]}
{"candidates": ["Kawonga scored in the 6th minute", "Nkhoma scored in the 14th minute", "Silva scored for Sao Tome in the 67th minute", "Mphasi scored in the 78th minute"], "ranking": [1, 2, 3, 4]}
{"candidates": ["Malawi host Sao Tome and Principe at the Bingu National Stadium in Freetown on Thursday for the 2026 FIFA World Cup qualifiers, looking for their second win of the campaign and boosting their progression hopes.", "Ranked 125th in the world, Malawi have accumulated only three points in the bag from two games and sit in fourth position in Group H.", "In their opening match, the Flames beat Liberia 1-0 courtesy of a 78th-minute strike from Chifundo Mphasi but went down to Tunisia by the same scoreline.", "As much as Malawi will be hoping to return to winning ways here, their form this year hasn't been the best. A 4-0 loss to Kenya in a friendly was followed by a 2-1 defeat to Zambia.", "On the other hand, Sao Tome are looking for their first win of the campaign. The 188th-ranked side were crushed 4-0 by Tunisia in their opening game, followed by a 2-0 defeat to Namibia.", "It wrapped up a poor 2023 calendar year for them, as Sao Tome lost all five official games. This year, the Warriors of the Equator have drawn both their official clashes against South Sudan in the 2025 AFCON qualifiers.", "South Sudan's 1-1 draw away from home proved vital in their progression as a goalless stalemate in the return leg proved futile.", "Sao Tome are one of the weakest teams in the world. Their poor rankings and a dismal run of form are a testament to that. Malawi are no behemoths but have enough in the tank to secure the victory in this clash.", "Prediction: Malawi 2-0 Sao Tome"], "ranking": [8, 2, 5, 4, 3, 6, 7, 1, 9]}
{"candidates": ["Experts predicted a low-scoring affair with Malawi expected to win", "Malawi had won just one of their last seven matches", "Sao Tome & Principe were winless in 11 straight matches across all competitions", "Malawi aimed to get back to winning ways to secure a World Cup berth", "Sao Tome & Principe aimed to record their first away victory in five years", "Malawi will host São Tomé in a Group H duel on Thursday, June 6, 2024, at Bingu National Stadium in Lilongwe.", "Gabadinho Mhango, a key player for Moroka Swallows, has been dropped from Malawi's squad for the upcoming World Cup qualifying match against São Tomé and Príncipe on June 6, 2024.", "Coach Patrick Mabedi has not provided reasons for Mhango's exclusion.", "Richards Bay striker Khuda Muyaba has also been sidelined, with Brighton Munthali being the only South Africa-based player in the squad.", "The foreign-based players in the squad include Henri Kumwenda, Chawanangwa Kaonga, Chifundo Mphasi, John Banda, and Chembezi Denis."], "ranking": [8, 5, 3, 6, 4, 10, 2, 9, 7, 1]}
{"candidates": ["This is the first official clash between the sides in history.", "Sao Tome have not won a game since March 2022, a 1-0 victory over Mauritius in the 2023 AFCON qualifier. Since then, the Warriors of the Equator have gone 11 games without a win.", "Sao Tome have failed to score in six of their last seven games.", "Malawi have lost their last three official games.", "Sao Tome are one of the eight teams in the CAF zone who have lost both their qualifying matches so far."], "ranking": [5, 1, 2, 4, 3]}
{"candidates": ["Burundi’s opening goal came from Chimwemwe Idana’s own goal in the 22nd minute.", "Chawanangwa Kaonga equalized for Malawi in the 31st minute.", "Jean Claude Girumugisha scored for Burundi two minutes after Malawi's equalizer.", "Lanjesi Nkhoma scored for Malawi in the second half with an assist from Kaonga.", "Mokono Elie Eldhino scored the winning goal for Burundi in the 87th minute.", "Makono Eldinho’s late goal saw Burundi stun hosts Malawi 3-2 in a Group L opening match of the 2025 Africa Cup of Nations qualifiers.", "Malawi midfielder Chimwemwe Idana headed the ball past his goalkeeper George Chikooka in the 23rd minute.", "Striker Chawanangwa Kaonga scored the leveler for Malawi through a powerful free-kick.", "Defender Jean Claude Girumugisha scored for Burundi to restore their advantage.", "Forward Lanjesi Nkhoma scored for Malawi with 15 minutes remaining.", "Eldinho claimed the winner for Burundi in the 87th minute.", "Madjaliwa A. scored at 21 minutes.", "Idana C. scored an own goal at 22 minutes.", "Kaonga C. scored at 31 minutes.", "Girumugisha J. scored with an assist from Kanakimana B. at 33 minutes.", "Nkhoma L. scored with an assist from Kaonga C. at 75 minutes.", "Eldhino M. scored the winning goal at 87 minutes."], "ranking": [6, 5, 4, 3, 2, 1, 8, 7, 9, 10, 11, 15, 13, 14, 12, 16, 17]}
{"candidates": ["Idana scored an own goal in the 22nd minute.", "Claude Girumugisha scored for Burundi in the 33rd minute.", "Elie Eldhino scored for Burundi in the 87th minute.", "Kawonga scored for Malawi in the 31st minute.", "Nkhoma scored for Malawi in the 75th minute.", "Saizi scored for Malawi in the 83rd minute.", "Madjaliwa Mussa received a yellow card in the 21st minute.", "Nsabiyumva received a yellow card in the 90+4th minute.", "Ndayishimiye received a yellow card in the 90+4th minute."], "ranking": [6, 4, 3, 5, 2, 1, 8, 7, 9]}
{"candidates": ["Coach Patrick Mabedi’s charges trained for a day due to crammed domestic fixtures.", "Malawi host Burundi at the Bingu National Stadium in Lilongwe for their opening fixture in the 2025 Africa Cup of Nations qualifiers.", "Malawi are ranked 126th in the world and are looking to make their AFCON tournament comeback.", "Burundi begin their quest to qualify for the competition for a second time, having made their tournament debut in 2019.", "Burundi have won just once in their last six games but remain unbeaten in their last three.", "In four official games this year, Malawi have lost thrice and won once.", "Malawi are ranked 126th in the world, while Burundi are 13 places adrift of them according to the latest FIFA World Ranking."], "ranking": [5, 2, 6, 4, 3, 1, 7]}
{"candidates": ["Malawi and Burundi are looking to kick off their respective 2025 Africa Cup of Nations qualifying campaigns with a win.", "Both teams have had underwhelming performances since the turn of the year.", "Malawi missed out on the last AFCON tournament after a disappointing qualifying round.", "Burundi also missed the most recent AFCON tournament and have only made it to the finals once in their history.", "The upcoming match between Malawi and Burundi will take place on September 5, 2024, at the Bingu National Stadium in Lilongwe.", "This match is part of the Group Stage in the Africa Cup of Nations Qualification.", "Both teams aim to secure their spots in the prestigious tournament, promising a thrilling encounter.", "Malawi is looking to make an impression in this qualification round, counting on their home advantage at the Bingu National Stadium.", "Burundi is determined to prove that they can compete at a higher level, and a victory against Malawi would be a statement of intent.", "Malawi's recent form has shown improvement, with commendable performances in friendly matches leading up to this encounter.", "Burundi has been working hard on their tactical discipline and are keen to make a mark in the qualification rounds.", "The historical head-to-head record between Malawi and Burundi shows a competitive rivalry with closely contested matches."], "ranking": [7, 5, 9, 8, 2, 1, 6, 10, 11, 4, 3, 12]}
{"candidates": ["Burundi, ranked 13 places behind Malawi, lead the group heading into their next assignment against Senegal on September 9, 2024.", "Malawi face Burkina Faso in neutral Mali on September 10, 2024."], "ranking": [1, 2]}
{"candidates": ["Burundi is currently at the top of Group L as Senegal prepares to host Burkina Faso.", "Malawi will travel to Bamako, Mali for their second Group L match against Burkina Faso next week.", "Malawi will face Senegal back-to-back in October.", "Burundi will host Senegal at BNS.", "This is only the second official clash between the sides in history, with their last encounter in July 1987 ending in a 1-1 draw.", "Burundi overcame Seychelles 3-1 in a 2026 FIFA World Cup qualifier match on 11 June, ending a run of five consecutive games without a win.", "The match was held at Bingu National Stadium in Lilongwe with a capacity of 41,100.", "The referee for the match was Traore K. from Ivory Coast.", "Malawi had 56% ball possession compared to Burundi's 44%.", "Malawi had 24 goal attempts with 8 shots on goal, while Burundi had 12 goal attempts with 2 shots on goal."], "ranking": [8, 9, 7, 6, 5, 4, 3, 2, 1, 10]}
{"candidates": ["Starting XI for Malawi: George Chikooka, Stanley Sanudi, Gomezgani Chirwa, Chembezi Denis, Llyod Aaron, Nickson Mwase, Chimwemwe Idana, Chawanangwa Kaonga, Chifundo Mphasi, Lanjesi Nkhoma, Yamikani Chester.", "Starting XI for Burundi: Mateo Nkurunzinza, Aruna Madjaliwa, Abdoul Manirakoze, Ntibazonkiza Saidi, Jean Claude Girumugisha, Prince Musore, Hussein Shabani, Kanakimana Bienvenue, Tresor Mossi Irutingabo, Youssuf Ndayishimiye."], "ranking": [2, 1]}
{"candidates": ["Virgil van Dijk's red card against Hungary was his first with the Netherlands.", "Van Dijk received the first red card of his international career (77th appearance) in the draw against Hungary."], "ranking": [2, 1]}
{"candidates": ["Virgil van Dijk received his first red card in his Netherlands career during the 1-1 Nations League draw with Hungary.", "Denzel Dumfries scored a late equalizer for the Netherlands after Van Dijk's red card.", "Roland Sallai scored the first-half goal for Hungary.", "Roland Sallai scored the opening goal for Hungary in the 32nd minute.", "Denzel Dumfries headed in Cody Gakpo's free-kick to equalize for the Netherlands in the 83rd minute.", "Virgil van Dijk was sent off after receiving two yellow cards in the space of three minutes.", "Roland Sallai scored the opening goal for Hungary in the 32nd minute.", "Virgil van Dijk received a red card in the 79th minute for a second booking.", "Denzel Dumfries scored the equalizer for the Netherlands in the 83rd minute.", "The Netherlands struck late to rescue a 1-1 draw against Hungary in the UEFA Nations League.", "Roland Sallai opened the scoring for Hungary just after the half-hour mark.", "A bizarre mix-up from a Hungary goal-kick allowed the Netherlands the chance of an indirect free-kick from 10 yards out just before the break, but Cody Gakpo was denied.", "Virgil van Dijk picked up two quick-fire bookings and was sent off.", "Denzel Dumfries scored the equalizer for the Netherlands on 83 minutes with a header from Cody Gakpo’s free-kick.", "Roland Sallai gave Hungary the lead in the first half at the Puskas Arena.", "Virgil van Dijk was sent off after receiving two yellow cards in as many minutes.", "Denzel Dumfries scored the equalizer for Netherlands in the 83rd minute.", "Hungary came closest to breaking the deadlock when Roland Sallai struck a post from Dominik Szoboszlai’s corner.", "Zsolt Nagy delivered a cross to Sallai, who scored the opening goal.", "Denes Dibusz saved Cody Gakpo’s effort from an in-direct free-kick inside the penalty area.", "Stefan de Vrij and Tijjani Reijnders had efforts to equalize for Netherlands.", "Denzel Dumfries headed home from a Gakpo cross to equalize for Netherlands.", "Denzel Dumfries headed a late equaliser for the Netherlands to rescue a point in a 1-1 draw with Hungary.", "Virgil van Dijk was sent off after receiving two yellow cards in the space of three minutes.", "Roland Sallai scored for Hungary in the 32nd minute.", "Cody Gakpo's free kick led to Dumfries' equalising goal."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]}
{"candidates": ["Roland Sallai had been an injury doubt before kick-off.", "Roland Sallai was an injury doubt before kick-off."], "ranking": [1, 2]}
{"candidates": ["Hungary had been hoping for a first win over the Netherlands in 40 years but ended a run of nine straight defeats against the Dutch.", "The Netherlands had over 80% possession in the first half but struggled to create significant chances.", "Zsolt Nagy was named Man of the Match for his performance and assist.", "Hungary had only 26% possession but managed to score with their only shot on target.", "Netherlands had 74% possession and 16 shots but struggled to convert their chances.", "In five matches, Hungary are still winless against the Netherlands (zero wins, one draw and four defeats).", "Hungary ended a run of nine straight defeats against the Netherlands.", "The Netherlands had over 80 percent possession in the first half.", "Germany leads the Group A3 table with seven points, followed by the Netherlands with five points."], "ranking": [1, 5, 3, 2, 6, 8, 4, 7, 9]}
{"candidates": ["Virgil van Dijk will not be available for the Netherlands' next match against Germany and has returned to Liverpool.", "Koeman confirmed he will not add to his squad for the upcoming match against Germany.", "Flashscore Man of the Match: Denzel Dumfries (Netherlands)"], "ranking": [2, 3, 1]}
{"candidates": ["A well-worked first-half goal got Cyprus' League C campaign off to a winning start.", "I Pittas scored the only goal of the match in the 34th minute to secure a 1-0 victory for Cyprus.", "The Lithuanian men's national football team lost 0:1 at home to Cyprus in a Division C match.", "The decisive moment was the goal scored by I. Pittas in the 34th minute.", "I. Pittas scored the only goal of the match at the 35th minute.", "T. Kalinauskas received a yellow card at the 69th minute.", "H. Kyprianou received a yellow card at the 33rd minute.", "A. Panayiotou received a yellow card at the 45+3rd minute.", "A. Karo received a yellow card at the 57th minute.", "A. Chrysostomou received a yellow card at the 70th minute.", "S. Andreou received a yellow card at the 72nd minute."], "ranking": [1, 2, 3, 4, 5, 9, 8, 7, 6, 10, 11]}
{"candidates": ["Lithuania have kept clean sheets in three of their last four matches, showcasing strong defensive form.", "Cyprus have failed to win a competitive away match since 2019, losing 14 out of their last 17 such encounters.", "Both teams have struggled to score, with Cyprus averaging just 0.4 goals per game in their Euro 2024 qualification campaign.", "Lithuania, under Edgaras Jankauskas, are riding a wave of steady form after a respectable Euro 2024 qualifying campaign.", "Cyprus find themselves under increasing pressure following a dismal run in recent international competitions.", "Given the current dynamics between these two teams, the prediction of under 2.5 goals is the most likely outcome.", "Cyprus have struggled immensely in front of goal, managing just three goals in their eight Euro 2024 qualifying matches.", "Cyprus’ average of only 6 shots per game, with a meagre 2.8 on target, further highlights their struggles in the attacking third.", "Defensively, Cyprus have been vulnerable, conceding an average of 3.5 goals per game.", "Lithuania, despite showing improvement, have also not been prolific scorers, managing only four goals in their last eight UEFA Nations League matches.", "Lithuania’s improvement in defence has been a significant factor in their recent successes, keeping three clean sheets in their last four matches.", "Wolfgang Shotten from BettingTips4You.com states: 'With both sides demonstrating a lack of attacking potency and Lithuania’s recent defensive stability, backing under 2.5 goals offers a solid chance for value.'", "Experts predict a draw for the Lithuania vs Cyprus match with odds of 3.35.", "There is a 60% chance that the match will end with 2.5 goals or more.", "Lithuania is expected to score first based on their performance this year.", "Lithuania has two consecutive victories this year, while Cyprus recently won against San Marino after a series of losses.", "The last match between Lithuania and Cyprus ended with a 1-0 victory for Cyprus in an international friendly.", "Lithuania will be aiming to kick off their Nations League campaign in great manner when they take on Cyprus at S. Dariaus ir S. Girėno stadionas.", "Lithuania failed to impress in the EURO 2024 qualifiers, with the team collecting only six points in the process, but they are surely capable of matching Cyprus in front of home fans.", "Goalkeepers Deividas Mikelionis and Mantas Bertasius have received their first call-ups for the September matches.", "The Cypriotes aim to build on a routine 4-1 win over San Marino, but beating Lithuania on the road is easier said than done.", "A man to watch in the away team will be Verona forward Grigoris Kastanos."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]}
{"candidates": ["Lithuania have conceded in 18 of their last 20 home matches.", "Lithuania have not won 14 of their last 16 home matches.", "In 7 of the last 8 home matches Lithuania played, both teams scored.", "In 12 of the last 14 Lithuania matches in the UEFA Nations League C, the sum of goals was under 3.5.", "In the last 3 Lithuania matches in the UEFA Nations League C, the sum of goals was under 1.5.", "In the last 11 Cyprus away matches, the sum of goals was over 2.5.", "Cyprus have not won 22 of their last 24 away matches.", "Cyprus have not won their last 10 away matches in a row in the UEFA Nations League C.", "Cyprus have conceded in 23 of their last 25 away matches.", "In 9 of the last 10 Cyprus away matches, the sum of goals was over 3.5.", "The match was held at Arvi Futbolo Arena with an attendance of 4,905 spectators.", "Cyprus boast a superior record in the history of this fixture with three wins from the last four meetings.", "Lithuania have picked up one win in their last four meetings with Cyprus, which came in February 2001 when they won 2-1 in Limassol."], "ranking": [12, 11, 9, 8, 7, 6, 5, 4, 3, 2, 10, 1, 13]}
{"candidates": ["The match will be played on Friday, September 6, 2024, at 19:00 local time at the GSP Stadium.", "Lithuania's probable lineup includes Gertmonas; Lasickas, Utkus, Girdvainis, Lekiatas, Sirvys; Slivka, Vorobjovas, Gineitis, Cernych; Palauskas.", "Cyprus's probable lineup includes Mall; Karo, Gogic, Laifis; Andreou, Kyriakou, Kousoulos, Correia; Loizou, Pittas, Charampolous."], "ranking": [3, 2, 1]}
