{"candidates": ["Tyler Herro set a career best with his 39th consecutive game, including the playoffs, with double-digit points."], "ranking": [1]}
{"candidates": ["Miami Heat's last-second victory over Minnesota Timberwolves.", "Erik Spoelstra's clever inbounds play setup leading to a game-winning layup.", "Nickeil-Alexander Walker and Anthony Edwards' defensive switch mistake.", "Tyler Herro's efficient pick-and-roll performance.", "Tyler Herro's key defensive play against DeMar DeRozan.", "Miami's effective zone defense holding Minnesota to 0.87 points-per-possession.", "Miami scoring 26 fast-break points with 14 steals.", "Nikola Jovic made the tying layup and go-ahead foul shot with 7.8 seconds left to send the Miami Heat past the Minnesota Timberwolves 95-94.", "Mike Conley’s 3-point attempt at the buzzer was short, ending the Timberwolves' three-game winning streak.", "Jaden McDaniels gave the Timberwolves the lead with a putback of Conley’s miss with nine seconds left."], "ranking": [8, 6, 4, 3, 2, 5, 9, 1, 7, 10]}
{"candidates": ["Nikola Jovic made the tying layup and go-ahead foul shot with 7.8 seconds left to send the Miami Heat past the Minnesota Timberwolves 95-94.", "Mike Conley's 3-point attempt at the buzzer was short, ending the Timberwolves' three-game winning streak.", "Jaden McDaniels gave the Timberwolves the lead with a putback of Conley's miss with nine seconds left.", "Naz Reid hit a 3-pointer late in the third quarter to put the Timberwolves up 64-63 for their first lead since 10-9."], "ranking": [1, 2, 3, 4]}
{"candidates": ["Miami Heat (3-5, 10th in the Eastern Conference) vs. Minnesota Timberwolves (6-3, fourth in the Western Conference).", "Miami comes into the matchup with Minnesota as losers of three games in a row.", "Minnesota finished 56-26 overall a season ago while going 30-11 at home. The Timberwolves averaged 113.0 points per game while allowing opponents to score 106.5 last season.", "Miami finished 46-36 overall, 32-20 in Eastern Conference action and 24-17 on the road a season ago. The Heat averaged 110.1 points per game last season, 47.2 in the paint, 16.4 off of turnovers and 12.8 on fast breaks.", "Injuries: Timberwolves: None listed. Heat: Kevin Love: day to day (reconditioning), Jaime Jaquez Jr.: day to day (illness)."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Tyler Herro reflecting on his improved play and preparation for postseason.", "Herro's comments on learning from last year's playoffs and improving his game."], "ranking": [1, 2]}
{"candidates": ["Miami Heat's offensive and defensive ratings after the game.", "Minnesota's defensive setup compared to a football cover zero.", "Miami's strategic use of zone defense in the fourth quarter.", "Miami's shot selection focusing on upper paint shots and corner threes.", "Minnesota's low fast-break points despite having 13 steals.", "Tyler Herro had 26 points for the Heat, who played without star Jimmy Butler.", "Anthony Edwards scored 22 points on 8-for-24 shooting for the Timberwolves.", "The Heat overcame 23 turnovers with 14 steals and nine blocks, all season highs.", "Jaime Jaquez Jr. returned from a three-game absence due to illness.", "The Timberwolves had 20 turnovers and a season-best 16 offensive rebounds, six by Rudy Gobert.", "Naz Reid hit a 3-pointer late in the third quarter to put the Timberwolves up 64-63, their first lead since 10-9.", "Tyler Herro set a career best with his 39th consecutive game, including the playoffs, with double-digit points."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 12]}
{"candidates": ["The Heat overcame 23 turnovers with 14 steals and nine blocks, all season highs.", "Jaime Jaquez Jr. returned from a three-game absence due to illness.", "The Timberwolves had a season-best 16 offensive rebounds, six by Rudy Gobert."], "ranking": [1, 3, 2]}
{"candidates": ["Jalen Johnson matched a career high by scoring 29 points."], "ranking": [1]}
{"candidates": ["Jalen Johnson scored 29 points leading the Atlanta Hawks to a 126-111 victory over the New Orleans Pelicans.", "Zion Williamson was scratched from the lineup with right hamstring tightness shortly before the game.", "Brandon Ingram scored 32 points for the Pelicans.", "Trae Young scored 23 points for the Hawks.", "Former Pelican Dyson Daniels, back from a two-game injury absence, added 16 points for Atlanta.", "Larry Nance Jr. scored 14 points against his former team.", "The Hawks pulled away for good with a 14-0 run in the middle of the fourth quarter that made it 116-97.", "David Roddy ignited the 14-0 run with a 3-pointer and Jalen Johnson had three dunks during the spurt.", "The Pelicans were outscored 66-32 in the paint."], "ranking": [1, 8, 3, 5, 6, 7, 2, 4, 9]}
{"candidates": ["Pelicans star forward Zion Williamson was scratched from the lineup with right hamstring tightness shortly before the game.", "New Orleans was also without starters Dejounte Murray, CJ McCollum, and Herb Jones, along with prominent reserve Trey Murphy III.", "The Hawks played without starter De’Andre Hunter, plus rotation players Bogdan Bogdanovic, Vit Krejci and Kobe Bufkin due to injury.", "Jordan Hawkins is expected to have a significant role due to the absence of key players like Zion Williamson, CJ McCollum, Trey Murphy, and Herb Jones.", "Trae Young has been performing exceptionally well without Dejounte Murray, averaging career highs in rebounds and assists.", "The Pelicans have a strong record when making 15 or more three-pointers, while the Hawks have struggled defensively against three-pointers.", "Pelicans are adjusting their games due to early season injuries.", "Jim Eichenhofer and Gus Kattengell recap Sunday's game against the Atlanta Hawks.", "Jordan Hawkins and Brandon Ingram discuss their adjustments with the injuries the Pelicans have suffered."], "ranking": [5, 4, 3, 8, 2, 1, 6, 9, 7]}
{"candidates": ["The win for Atlanta snapped a four-game losing skid and moved them to 3-4 on the season.", "The NBA has fined players for similar gestures in the past, but it’s unclear if Daniels will be penalized.", "The game included chippy moments and a flagrant foul incident.", "Daniels and Nance were traded from New Orleans to Atlanta in the offseason as part of a deal involving Dejounte Murray."], "ranking": [1, 4, 3, 2]}
{"candidates": ["The Hawks snapped a four-game skid with this victory.", "New Orleans was without starters Dejounte Murray, CJ McCollum, and Herb Jones, along with prominent reserve Trey Murphy III.", "The Hawks played without starter De’Andre Hunter, plus rotation players Bogdan Bogdanovic, Vit Krejci and Kobe Bufkin due to injury."], "ranking": [2, 3, 1]}
{"candidates": ["Yuki Kawamura logged his first field goal for the Memphis Grizzlies in the NBA.", "Scotty Pippen Jr. got his first career triple-double."], "ranking": [1, 2]}
{"candidates": ["Scotty Pippen Jr. got his first career triple-double."], "ranking": [1]}
{"candidates": ["Zach Edey came off the bench for the first time in his NBA career.", "Edey and Jonas Valanciunas received double technical fouls for physical play.", "Edey contributed significantly with 14 points, 8 rebounds, 2 assists, 2 blocks, and 1 steal in 21:43 minutes.", "Yuki Kawamura nailed a step-back three-pointer to give the Grizzlies a 125-100 lead with 1:55 left in the fourth quarter.", "The Memphis Grizzlies won the game 128-104 against the Washington Wizards.", "Jaren Jackson Jr. scored 39 points.", "Memphis Grizzlies beat the Washington Wizards 128-104.", "Kyshawn George scored 17 points to lead the Wizards.", "Jonas Valanciunas added 16 points for the Wizards.", "Corey Kispert finished with 14 points for the Wizards.", "The Grizzlies maintained a lead of at least 20 points through the bulk of the second half.", "With 3:50 left in the third and Memphis leading by 24, Zach Edey got tangled with Jonas Valanciunas resulting in double-technicals."], "ranking": [9, 8, 5, 4, 2, 1, 3, 10, 11, 12, 6, 7]}
{"candidates": ["Jaren Jackson Jr. scored 39 points.", "Scotty Pippen Jr. had 11 points, 11 assists, and 10 rebounds.", "Rookie Zach Edey had 14 points, eight rebounds, and two blocks.", "Santi Aldama added 12 points.", "Kyshawn George scored 17 points to lead the Wizards.", "Jonas Valanciunas added 16 points.", "Corey Kispert finished with 14 points.", "The Grizzlies maintained a lead of at least 20 points through the bulk of the second half.", "With 3:50 left in the third and Memphis leading by 24, Zach Edey and Jonas Valanciunas got tangled, resulting in double-technicals."], "ranking": [3, 1, 5, 8, 2, 4, 6, 7, 9]}
{"candidates": ["A video of Kawamura's first bucket quickly racked up hundreds of thousands of views after it was posted on the NBA's official account on X, formerly Twitter.", "Kawamura has quickly become a favorite among Memphis fans, who have chanted 'We want Yuki!' to demand his insertion off the bench.", "Memphis continues to dominate the paint against its opponents, averaging 60 points a game inside."], "ranking": [2, 1, 3]}
{"candidates": ["Injuries for Memphis Grizzlies include John Konchar (day to day, quad), Desmond Bane (out, oblique), Luke Kennard (day to day, foot), Vince Williams Jr. (out, leg), Marcus Smart (out, ankle), GG Jackson II (out, foot), and Cam Spencer (out, ankle).", "Injuries for Washington Wizards include Saddiq Bey (out, knee), Malcolm Brogdon (out, thumb), Kyle Kuzma (day to day, groin), and Marvin Bagley III (day to day, illness).", "Memphis continues to dominate the paint against its opponents, averaging 60 points a game inside."], "ranking": [2, 3, 1]}
{"candidates": ["Giannis Antetokounmpo made NBA history with his 26th-straight game scoring at least 20 or more points on 50 percent shooting or better."], "ranking": [1]}
{"candidates": ["Antetokounmpo has scored at least 20 points while shooting at least 50% from the floor in each of his 26 games this season, the longest such streak in NBA history."], "ranking": [1]}
{"candidates": ["A furious 20-0 rally in the final six and a half minutes put the Milwaukee Bucks in position to steal a second-straight game with a sizable second-half comeback.", "With 23.1 seconds remaining, a challenge from coach Doc Rivers overturned a foul on Damian Lillard and gave the Bucks a chance to beat the Brooklyn Nets on the other end.", "After Ziaire Williams made two free throws, the Bucks had a chance to tie the score and force overtime, but Damian Lillard missed a good look at a 3-pointer.", "The Nets hung on and beat the Bucks 113-110.", "Cameron Johnson scored 26 points and Cam Thomas added 24 as the visiting Brooklyn Nets withstood a furious fourth-quarter rally to beat the Milwaukee Bucks 113-110.", "The Nets led 111-90 with 6:55 remaining before missing their next 12 field-goal attempts.", "Damian Lillard scored five straight points to cap a 20-0 run and cut the deficit to 111-110 with 37.4 seconds remaining.", "After Milwaukee star Giannis Antetokounmpo missed a layup with 6.1 seconds left, the Nets’ Ziaire Williams sank two foul shots to make it a three-point game.", "Lillard missed a 3-point attempt on the Bucks’ next possession. Milwaukee had one final chance with 0.6 seconds left, but Lillard’s 35-foot shot fell short, and Brooklyn escaped with the victory to snap a three-game losing streak.", "Nic Claxton had 16 points and 11 rebounds for Brooklyn, which won the season series against the Bucks 3-1.", "Antetokounmpo led Milwaukee with 27 points, 13 rebounds and seven assists. Lillard contributed 23 points and seven assists, Bobby Portis Jr. added 15 points and eight boards, Khris Middleton scored 12 points, and Gary Trent Jr. chipped in 10 points.", "Bucks guard Andre Jackson Jr. was ejected late in the second quarter after being assessed a flagrant-two penalty for slapping Claxton in the face."], "ranking": [7, 5, 4, 10, 9, 8, 3, 2, 1, 6, 11, 12]}
{"candidates": ["Cam Johnson scored 26 points, Cam Thomas had 24 and the Brooklyn Nets withstood a frantic Milwaukee comeback attempt down the stretch to beat the Bucks 113-110.", "Brooklyn led by as many as 24 and still owned a 111-90 advantage with less than seven minutes left before the Bucks scored 20 straight points.", "Giannis Antetokounmpo couldn’t finish on his drive to the basket with a chance to take the lead.", "Brooklyn’s Ziaire Williams got the rebound and hit two free throws with 6.1 seconds left.", "Damian Lillard missed two potential tying 3-point attempts in the last 4.1 seconds.", "Milwaukee’s Andre Jackson Jr. was ejected from the game with 9.9 seconds left in the first half for making unnecessary and excessive contact with Brooklyn’s Nic Claxton.", "D'Angelo Russell, who had 11 points and 12 assists, was carried to the locker room in the final minute with what Nets coach Jordi Fernandez said was cramps.", "Johnson tweaked his ankle in the final seconds."], "ranking": [1, 2, 5, 4, 3, 7, 6, 8]}
{"candidates": ["Heading into the game, the Bucks knew the Nets were going to try to be physical on the ball defensively and try to force them into turnovers and poor execution."], "ranking": [1]}
{"candidates": ["Giannis Antetokounmpo expressed disappointment in missing key layups and emphasized the need for better focus and execution.", "Coach Doc Rivers acknowledged the team's lack of preparation and focus against the Nets.", "Antetokounmpo highlighted the need for the team to be more locked in and focused to avoid early deficits.", "Antetokounmpo still believes the team is capable of building winning habits and competing at a high level."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The Nets played without forward Noah Clowney, who sat out with a left hip contusion."], "ranking": [1]}
{"candidates": ["The Nets' last basket came with 6:55 left, but they still found a way to win.", "Nets: Brooklyn went 3-1 against the Bucks this season, including two wins at Milwaukee over the last eight days. The last time the Nets beat the Bucks as many as three times within the same regular season is 2013-14."], "ranking": [2, 1]}
{"candidates": ["Antetokounmpo’s double-double was the 432nd of his career, passing Kareem Abdul-Jabbar for the most such games in Bucks history."], "ranking": [1]}
{"candidates": ["Khris Middleton scored just eight points against the Spurs after being moved to the bench.", "Doc Rivers explained his decision to bench Middleton following the game against the Spurs.", "Damian Lillard led the Bucks with 26 points in the victory.", "Victor Wembanyama had 10 points, 10 rebounds, and three blocks in one of his worst performances of the season.", "Antetokounmpo recorded a double-double with 25 points, 16 rebounds, and 8 assists.", "The Bucks won the game with a score of 121-105."], "ranking": [5, 6, 4, 3, 1, 2]}
{"candidates": ["Damian Lillard had 26 points and eight assists.", "Giannis Antetokounmpo had 25 points, 16 rebounds and eight assists.", "Brook Lopez scored 22 points, including 17 in the first half.", "AJ Green and Gary Trent each added 14 points.", "Damian Lillard had 26 points and eight assists.", "Giannis Antetokounmpo had 25 points, 16 rebounds and eight assists.", "Brook Lopez scored 22 points, including 17 in the first half.", "AJ Green and Gary Trent each added 14 points.", "Keldon Johnson scored 24 points to lead the Spurs.", "Chris Paul added 18 points, Harrison Barnes had 14 and Devin Vassell 11.", "Victor Wembanyama had 10 points, 10 rebounds and three blocks.", "With the score tied at 33 early in the second quarter, the Bucks went on a 32-13 run to close the first half.", "The Spurs opened the second half on a 16-5 run to pull within 10.", "Paul’s third 3-pointer of the quarter pulled San Antonio within eight.", "Milwaukee pushed the lead back to 13 by the end of the third quarter.", "The Bucks led by 26 in the fourth.", "Milwaukee shot 19 for 42 on 3s.", "Antetokounmpo had 11 points, five rebounds and three assists in the first quarter.", "Lillard didn’t score his first points until making a layup with 10:46 left in the second quarter.", "With 30 seconds left in the second quarter, Antetokounmpo blocked Vassell’s dunk attempt and Lopez made a 3 at the other end to close out the half and give Milwaukee a 19-point advantage.", "The Bucks were 12 for 24 on 3s in the first half with Green making 4 of 5, including a 30-footer.", "Milwaukee hosted the Spurs and sent them home with a 121-105 loss.", "The Bucks never found themselves behind San Antonio on the scoreboard after an AJ Green three-pointer with 3:09 left in the first quarter.", "Victor Wembanyama scored 10 points, grabbed 10 rebounds, and blocked three shots but finished with a -7 plus-minus stat.", "Damian Lillard led the Bucks with 26 points, Giannis Antetokounmpo scored 25 points, and Brook Lopez had 22 points."], "ranking": [14, 2, 10, 18, 14, 2, 10, 18, 12, 16, 20, 5, 7, 9, 11, 15, 4, 17, 1, 6, 8, 13, 3, 19, 21]}
{"candidates": ["The matchup featured two of the best international players, Antetokounmpo and Victor Wembanyama."], "ranking": [1]}
{"candidates": ["Milwaukee Bucks are looking to end their three-game home skid.", "The Bucks have gone 11-7 at home and have a 2-5 record in games decided by 3 points or fewer.", "The Spurs are 6-10 on the road and average 14.1 turnovers per game, with a 10-3 record when winning the turnover battle.", "The Bucks make 47.8% of their shots from the field this season, which is 2.5 percentage points higher than the Spurs have allowed to their opponents (45.3%).", "The Spurs are shooting 45.5% from the field, 0.2% higher than the 45.3% the Bucks' opponents have shot this season.", "Giannis Antetokounmpo is averaging 31.6 points, 11.6 rebounds, 6.1 assists, and 1.5 blocks for the Bucks.", "Chris Paul is scoring 9.4 points per game and averaging 4.3 rebounds for the Spurs.", "In their last 10 games, the Bucks are 5-5, averaging 111.1 points, 45.3 rebounds, 27.0 assists, 9.6 steals, and 4.2 blocks per game while shooting 46.2% from the field. Their opponents have averaged 107.9 points per game.", "In their last 10 games, the Spurs are 5-5, averaging 112.9 points, 48.3 rebounds, 30.0 assists, 7.0 steals, and 8.0 blocks per game while shooting 45.8% from the field. Their opponents have averaged 107.9 points.", "Bucks' Khris Middleton is out with an ankle injury."], "ranking": [6, 8, 5, 4, 3, 2, 9, 7, 1, 10]}
{"candidates": ["Doc Rivers stated that Middleton's health is not improving to the desired level, leading to the decision to cut his minutes and monitor his condition.", "The move to bench Middleton signals the end of his era as a key player for the Bucks.", "Damian Lillard expressed that Victor Wembanyama is'more different' than any player he has played against in the NBA.", "Lillard noted Wembanyama's ability to change or block shots as a significant factor during the game.", "Antetokounmpo's performance is contributing to his argument for a third MVP award.", "The Bucks have climbed back into the playoff picture after a dismal start to their season."], "ranking": [4, 2, 6, 5, 1, 3]}
{"candidates": ["The Bucks are playing their best basketball of the season and have built momentum since their NBA Cup Championship in December.", "Damian Lillard and Khris Middleton are finding their groove alongside Antetokounmpo."], "ranking": [1, 2]}
{"candidates": ["Starting forward Jeremy Sochan (back), averaging 13.4 points per game, sat for the Spurs."], "ranking": [1]}
{"candidates": ["Taurean Prince has been inserted into the starting lineup to help the Bucks on defense.", "More pressure will now be applied to Giannis Antetokounmpo and Damian Lillard to carry the offensive burden for the Bucks."], "ranking": [2, 1]}
{"candidates": ["The Dallas Mavericks fell 119-104 to the Memphis Grizzlies on Monday night, making it the fifth straight loss for the Mavs.", "Memphis was playing without Ja Morant, Desmond Bane, Marcus Smart, GG Jackson, and more.", "Dallas led by 10 for a decent chunk of the first half, but a 14-2 run toward the end of the first half gave the Grizzlies the lead.", "A strong start to the third quarter for Memphis would put them up by double-digits, and they wouldn't look back from there.", "The Mavs could get it down to five a few times in the fourth, but they ran out of offense and kept sending the Grizzlies to the free-throw line.", "Jaren Jackson Jr. continued to assert his dominance with 35 points and 13 rebounds in the win.", "Grizzlies win over the Mavericks", "Discussion on Jaren Jackson Jr. being an All NBA player", "Yuki's early minutes in the game", "Comparison between Edey and Steven Adams"], "ranking": [8, 6, 5, 4, 3, 1, 10, 2, 9, 7]}
{"candidates": ["Jaren Jackson Jr. had 35 points, 13 rebounds, and five assists to lead the Memphis Grizzlies to a 119-104 victory over the Dallas Mavericks.", "Scotty Pippen Jr. finished with 18 points, while Jaylen Wells added 17 points and 11 rebounds.", "P.J. Washington led the Mavericks with 17 points and 10 rebounds.", "Naji Marshall finished with 16 points, while Klay Thompson and Jaden Hardy added 15 points each.", "Dallas has lost five straight games.", "Memphis went on a 10-2 run to take the lead back to 13 with 2:12 left in the game.", "Daniel Gafford exited Monday's game against the Memphis Grizzlies in visible pain after sustaining an ankle injury in the second quarter.", "Gafford finished with five points on 2-of-3 shooting from the field, along with one rebound and one block before his injury.", "Jaren Jackson Jr. had 35 points, 13 rebounds and five assists to lead the Memphis Grizzlies to a 119-104 victory over the Dallas Mavericks.", "Scotty Pippen Jr. finished with 18 points, while Jaylen Wells added 17 points and 11 rebounds as Memphis won for the 10th time in the last 11 home games.", "P.J. Washington led the Mavericks with 17 points and 10 rebounds.", "Naji Marshall finished with 16 points, while Klay Thompson and Jaden Hardy added 15 points each.", "The Mavericks lost Daniel Gaffor to a left ankle sprain in the second quarter.", "Memphis went on a 10-2 run to take the lead back to 13 with 2:12 left."], "ranking": [1, 6, 7, 8, 3, 2, 4, 9, 1, 5, 7, 8, 10, 2]}
{"candidates": ["Dallas Mavericks guard Kyrie Irving is expected to miss one to two weeks with a bulging disk in his back.", "Mavericks coach Jason Kidd did not provide a specific timeline for Irving's return.", "Irving is the Mavericks’ second-leading scorer at 25.6 points per game, shooting close to 50% from the field, including 41.1% from 3-point range.", "Leading scorer Luka Doncic, who is averaging 28.1 points, 8.3 rebounds and 7.8 assists, is also out due to a left calf strain.", "With Irving and Doncic out, the Dallas offense is missing 52.4 points per game.", "Dallas is 20-15 and enters the game in third place in the Southwest Division, three games behind first place Houston."], "ranking": [5, 6, 3, 2, 1, 4]}
{"candidates": ["Dallas Mavericks (20-15, sixth in the Western Conference) vs. Memphis Grizzlies (23-13, third in the Western Conference)", "Dallas comes into the matchup with Memphis after losing four games in a row.", "The Grizzlies are 2-2 against Southwest Division teams.", "Memphis ranks second in the NBA with 30.5 assists per game led by Desmond Bane averaging 5.2.", "The Mavericks are 4-2 against the rest of the division.", "Dallas ranks fourth in the Western Conference shooting 37.3% from 3-point range.", "The Grizzlies average 14.1 made 3-pointers per game this season, 1.2 more made shots on average than the 12.9 per game the Mavericks give up.", "The Mavericks average 13.3 made 3-pointers per game this season, 0.3 fewer makes per game than the Grizzlies allow.", "Jaren Jackson Jr. is averaging 22.3 points, 6.2 rebounds and 1.6 blocks for the Grizzlies.", "Kyrie Irving is averaging 24.3 points and 4.9 assists for the Mavericks.", "Grizzlies: 5-5, averaging 124.8 points, 50.7 rebounds, 30.7 assists, 9.2 steals and 5.4 blocks per game while shooting 46.5% from the field. Their opponents have averaged 118.6 points per game.", "Mavericks: 4-6, averaging 112.3 points, 42.2 rebounds, 23.3 assists, 7.7 steals and 7.1 blocks per game while shooting 47.0% from the field. Their opponents have averaged 113.0 points."], "ranking": [10, 8, 6, 9, 5, 7, 4, 3, 2, 1, 11, 12]}
{"candidates": ["Dallas Mavericks coach Jason Kidd addressed Kyrie Irving's latest injury setback, stating that he would need a couple of days before providing further comments on Irving's condition."], "ranking": [1]}
{"candidates": ["The Mavericks were without leading scorer Luka Doncic due to a left calf strain and Kyrie Irving due to a bulging disk in his back.", "Both teams were without their starting backcourts as injuries kept Ja Morant and Desmond Bane out for the Grizzlies.", "Memphis, which is second in the league in points in the paint, finished with 52 points inside and outrebounded Dallas 55-50, including 13 offensive boards.", "Memphis, which is second in the league in points in the paint, finished with 52 points inside and outrebounded Dallas 55-50, including 13 offensive boards."], "ranking": [2, 3, 1, 4]}
{"candidates": ["The Grizzlies shot 27/35 from the free-throw line, while Dallas was 11/15.", "Jay Huff's floor-spacing ability, evidenced by a 3/6 performance from three-point range, opened things up for Jaren Jackson Jr., who had a monster game.", "Dallas' biggest issue without Luka Doncic and Kyrie Irving is they have no one who can consistently get a bucket."], "ranking": [3, 1, 2]}
{"candidates": ["Grizzlies Injuries: Luke Kennard: day to day (hamstring), Marcus Smart: out (finger), John Konchar: day to day (shoulder), Santi Aldama: out (ankle), Yuki Kawamura: day to day (shoulder), Vince Williams Jr.: out (ankle), Ja Morant: out (ac joint), GG Jackson II: out (foot).", "Mavericks Injuries: Dante Exum: out (wrist), Luka Doncic: out (calf), Kyrie Irving: day to day (illness)."], "ranking": [2, 1]}
{"candidates": ["The victory against the Raptors marked head coach Tom Thibodeau's 200th win for the franchise, becoming the fifth coach in its history to reach this mark."], "ranking": [1]}
{"candidates": ["Karl-Anthony Towns delivered a monster double-double with 27 points and 13 rebounds to lead the Knicks to a 112-98 victory over the Raptors.", "Josh Hart finished three assists shy of a triple-double with 21 points, 11 rebounds, and seven assists.", "OG Anunoby tied Towns with a game-high 27 points against his former team.", "Immanuel Quickley scored 22 points on 7-of-12 shooting and was active enough to finish with a plus-7.", "Chris Boucher had a three-minute, 10-point, plus-11 run in the game.", "Scottie Barnes finished with 18 points, five rebounds, five assists, and four blocks, shooting 7-of-15 from the floor.", "Ochai Agbaji left the game in the second quarter after suffering a lower back contusion in a rebounding collision with Josh Hart.", "RJ Barrett and Immanuel Quickley played well but it wasn't enough for the Raptors.", "OG Anunoby had a strong performance against his former team at Madison Square Garden."], "ranking": [1, 3, 2, 5, 6, 4, 8, 7, 9]}
{"candidates": ["The New York Knicks convincingly beat the Toronto Raptors 112-98.", "Karl Anthony-Towns tallied 27 points and 13 rebounds.", "OG Anunoby recorded 27 points.", "The Knicks snapped a three-game losing streak with this victory.", "Karl-Anthony Towns and Josh Hart each posted double-doubles for the New York Knicks.", "Karl-Anthony Towns finished with 27 points and 13 rebounds in his 31st double-double of the season.", "Josh Hart had 21 points, 11 rebounds, and seven assists.", "OG Anunoby scored 27 points against his former team, the Toronto Raptors.", "Immanuel Quickley scored 22 points for the Raptors.", "Scottie Barnes had 18 points and RJ Barrett finished with 16 for the Raptors.", "Chris Boucher added 10 points for the Raptors, all in the final four minutes of the fourth quarter.", "The Knicks mounted a 19-7 run to take the lead for good in the first quarter.", "The Knicks led 55-51 at halftime.", "The Knicks ended the third quarter on a 25-18 run and scored 15 unanswered points in the fourth quarter.", "Karl-Anthony Towns had 27 points and 13 rebounds.", "OG Anunoby scored 27 points.", "Josh Hart added 21 points and 11 rebounds.", "Jalen Brunson had 13 points.", "Immanuel Quickley scored 22 points against his former team.", "Scottie Barnes had 18 points for the Raptors.", "RJ Barrett, another former Knick, had 16 points.", "Mikal Bridges had 10 points as all five Knicks starters scored in double digits.", "New York led 91-81 with 9:22 left in the fourth quarter after a basket from Barnes and followed with a 15-0 run during a five-minute stretch in which the Raptors missed eight shots and had two turnovers."], "ranking": [1, 5, 10, 4, 3, 2, 6, 8, 14, 15, 16, 7, 11, 12, 9, 13, 17, 18, 19, 20, 21, 22, 23]}
{"candidates": ["Karl-Anthony Towns was questionable to play due to patellar tendinopathy in his right knee but decided to play with Patrick Ewing in attendance.", "The Knicks aimed to snap their season-worst three-game losing streak."], "ranking": [2, 1]}
{"candidates": ["New York heads into the matchup against Toronto after losing three in a row.", "The Knicks are 5-1 against division opponents.", "New York scores 117.2 points while outscoring opponents by 6.7 points per game.", "The Raptors are 5-17 in conference play.", "Toronto is second in the Eastern Conference with 12.4 offensive rebounds per game led by Jakob Poeltl averaging 3.7.", "The Knicks score 117.2 points per game, 1.8 fewer points than the 119.0 the Raptors allow.", "The Raptors are shooting 46.2% from the field, 0.3% lower than the 46.5% the Knicks' opponents have shot this season.", "Karl-Anthony Towns is averaging 25.3 points, 14 rebounds and 3.4 assists for the Knicks.", "RJ Barrett is averaging 23.5 points, 6.9 rebounds and 6.1 assists for the Raptors.", "Knicks: 7-3 in their last 10 games, averaging 117.6 points, 44.1 rebounds, 25.8 assists, 8.1 steals and 2.9 blocks per game while shooting 49.6% from the field.", "Raptors: 1-9 in their last 10 games, averaging 108.5 points, 39.7 rebounds, 28.9 assists, 8.0 steals and 3.8 blocks per game while shooting 46.1% from the field.", "Knicks injuries: Karl-Anthony Towns (hamstring), Miles McBride (hamstring), Mitchell Robinson (ankle)."], "ranking": [10, 6, 8, 4, 9, 5, 3, 2, 1, 7, 11, 12]}
{"candidates": ["Karl-Anthony Towns expressed his admiration for Patrick Ewing, calling it a humbling experience to play in front of him.", "Coach Tom Thibodeau emphasized the importance of continuous improvement and learning from each game.", "Thibodeau expressed confidence in his team's ability to meet challenges despite recent struggles.", "The Raptors' starting lineup had only played 19 minutes together over the past year, while the Knicks' starting lineup had played 19 minutes per game over 33 games this season.", "The Raptors showed positive signs in the first half and early in the third quarter but ultimately lost their footing and saw the Knicks run away with the game.", "The Raptors' inattention to detail and lack of consistent effort were highlighted as key issues in the loss."], "ranking": [5, 3, 4, 2, 1, 6]}
{"candidates": ["In the post-game press conference, Tom Thibodeau expressed his satisfaction at his players' hustle, a huge improvement upon their 'low-energy' defeat to Orlando on Monday Night.", "Tom Thibodeau complimented his players' mental fortitude and seemed to have an optimistic outlook for the season ahead."], "ranking": [1, 2]}
{"candidates": ["Patrick Ewing, the best center in Knicks franchise history, was in attendance.", "The Knicks improved to a 25-13 record, the third-best in the East.", "Darko Rajakovic used his challenge at the end of the second quarter to try to save Jakob Poeltl from a third foul, which was a low-leverage use of the challenge.", "Eugene Omoruyi is joining the Raptors on a 10-day contract, replacing Bruno Fernando who was waived."], "ranking": [2, 1, 4, 3]}
{"candidates": ["A brutal fight broke out in the bleachers between two fans during the game.", "The Raptors now have the second fewest wins in the NBA and remain prime contenders to land premium lottery picks Cooper Flagg and Ace Bailey in the 2025 NBA Draft.", "The Knicks have won their last seven meetings against Toronto dating back to last season. New York’s last loss to the Raptors was Jan. 22, 2023, at Madison Square Garden."], "ranking": [2, 3, 1]}
{"candidates": ["The Pelicans defeated the Bulls, 123-111, with Brandon Ingram leading the way with 33 points and C.J. McCollum adding 23.", "Lonzo Ball played 13 minutes and 39 seconds, tallying five points and four assists in his return to regular-season action.", "Dejounte Murray sustained a fractured left hand during the Pelicans' 123-111 season-opening win against the Chicago Bulls.", "Murray delivered a double-double performance with 14 points, 8 rebounds, 10 assists, and a steal in his debut for the Pelicans."], "ranking": [1, 3, 4, 2]}
{"candidates": ["Bulls coach Billy Donovan noted that Lonzo Ball would be limited to 14-16 minutes of playing time as the team continues to monitor his recovery.", "The New Orleans Pelicans start the season at home against the Chicago Bulls.", "The Pelicans finished 49-33 overall with a 21-19 record at home during the 2023-24 season.", "The Bulls went 39-43 overall, 22-29 in Eastern Conference action and 19-22 on the road last season.", "The Pelicans gave up 110.7 points per game while committing 18.4 fouls last season.", "The Bulls averaged 112.3 points per game last season, 48.4 in the paint, 17.2 off of turnovers and 12.5 on fast breaks.", "BETMGM SPORTSBOOK LINE: Pelicans -7.5; over/under is 224.5."], "ranking": [5, 7, 3, 4, 6, 2, 1]}
{"candidates": ["The guard's comeback story was nothing short of impressive, considering the career-threatening injuries he faced.", "Fans expressed shock and concern on social media after news of Dejounte Murray's injury broke.", "A doctor commented that Murray might need 4-6 weeks to heal if surgery is required.", "Fans noted the significant setback for the Pelicans due to Murray's injury."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Lonzo Ball's troubles began with a torn meniscus, which caused him to miss part of the 2021-22 season. He later had an arthroscopic debridement to remove debris from that procedure. In March 2023, Ball underwent a revolutionary third surgery — a cartilage transplant to replace the damaged meniscus.", "During the offseason, the Bulls traded Alex Caruso for young guard Josh Giddey from the OKC Thunder.", "Pelicans injury update: Trey Murphy III is out with a hamstring injury.", "Bulls injury update: Julian Phillips is day to day with a rib injury."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Karl Anthony Towns set the tone for the game by making the first two baskets for New York, both of which were three-pointers.", "Six players scored in double figures for the Knicks.", "The Knicks held Milwaukee’s dynamic duo to a combined 43 points and limited them to 0-for-5 from beyond the arc.", "The Knicks scored 21 fast break points, marking their second-highest total this season.", "OG Anunoby showcased some of the best perimeter defense in the league by consistently putting a former MVP out of his comfort zone and switching onto Damian Lillard.", "The New York Knicks defeated the Milwaukee Bucks 116-94.", "Karl-Anthony Towns led the Knicks with 32 points.", "Giannis Antetokounmpo finished with 24 points and 12 rebounds.", "Damian Lillard had 19 points but missed all four of his three-point attempts."], "ranking": [3, 8, 2, 6, 5, 9, 1, 4, 7]}
{"candidates": ["Karl-Anthony Towns had 32 points, 11 rebounds and five assists.", "Jalen Brunson chipped in 15 points and nine assists.", "Josh Hart had 11 points, nine rebounds and seven assists.", "Giannis Antetokounmpo had 24 points and 12 rebounds.", "Damian Lillard had 19 points.", "The Knicks led by as many as 30 points after starting the fourth quarter on a 22-11 run, keyed by guard Miles McBride (14 points) and rookie Tyler Kolek (8 points).", "Towns fired up the home crowd by slamming home two one-handed dunks in the second quarter, one over Milwaukee center Brook Lopez.", "Towns scored 27 points in the first half as New York built a 66-47 lead at halftime."], "ranking": [7, 3, 4, 5, 2, 1, 6, 8]}
{"candidates": ["The New York Knicks will take on the Milwaukee Bucks in NBA action at Madison Square Garden on Saturday, starting at 11:30am AEDT.", "Led by star players Jalen Brunson, Karl-Anthony Towns and Mikal Bridges, the Knicks are aiming to beat a Bucks team that includes Giannis Antetokounmpo, Damian Lillard and Bobby Portis.", "Stats Insider's predictive analytics model currently gives the Knicks a 68% chance of beating the Bucks at Madison Square Garden.", "The Knicks are listed as 6.5-point favourites against the Bucks, with odds of $1.91 available at Bet365.", "According to Stats Insider's model, the Bucks (+6.5) are predicted to cover the line 54% of the time, while the 223.5-point over/under is expected to go over 51% of the time.", "Stats Insider's predicted final score for Knicks vs Bucks at Madison Square Garden on Saturday is the Knicks winning 114-109.", "Jalen Brunson is expected to lead the Knicks with 36 points, 4 rebounds and 8 assists, while Giannis Antetokounmpo is projected to finish with 31 points, 11 rebounds and 9 assists for the Bucks.", "Milwaukee Bucks are looking to break their four-game road losing streak when they face the New York Knicks.", "The Knicks are favored to win with a -7.5 point spread according to BETMGM Sportsbook.", "The over/under for the game is set at 225.5 points.", "New York Knicks had a strong previous season with a 50-32 overall record and 35-17 in Eastern Conference games.", "Milwaukee Bucks finished the previous season with a 49-33 overall record and 34-18 in Eastern Conference action.", "Key injuries for the Knicks include Cameron Payne (day to day with a hamstring injury), Precious Achiuwa (out with a hamstring injury), and Mitchell Robinson (out with an ankle injury).", "Key injuries for the Bucks include Khris Middleton (out with an ankle injury) and Giannis Antetokounmpo (day to day with an adductor injury)."], "ranking": [12, 5, 8, 10, 9, 4, 3, 2, 11, 7, 6, 1, 13, 14]}
{"candidates": ["The Knicks have returned to a.500 record and have no days off ahead, with their next six games against teams with records below.500.", "Winning all six games decisively could ignite a momentum that lasts throughout the season.", "Towns playing like an All-NBA talent while Anunoby locks down an opposing team’s best player is one of the variations of attack New York presents with this roster when healthy.", "Giannis Antetokounmpo expressed frustration with the Bucks' effort, stating the team didn't compete.", "Antetokounmpo highlighted the importance of competing to have a chance to win.", "Antetokounmpo mentioned the upcoming game against the Boston Celtics and the need to compete to avoid another loss."], "ranking": [3, 2, 5, 6, 4, 1]}
{"candidates": ["The Bucks were playing the second night of a back-to-back after defeating the Utah Jazz.", "Khris Middleton remains out indefinitely after offseason surgery on both ankles."], "ranking": [2, 1]}
{"candidates": ["Karl-Anthony Towns and Josh Hart achieved a 20/20 game and a triple-double together, a feat last accomplished by Willis Reed and Clyde Frazier in the 1970s.", "Karl-Anthony Towns became the last Knicks player since Patrick Ewing to collect over 30 points and 20 rebounds in multiple games in a single season.", "Josh Hart became the first Knicks player since Michael Ray Richardson in 1981 with consecutive triple-doubles.", "Josh Hart has four triple-doubles this season and became the fourth player to have 10 triple-doubles with the Knicks.", "Karl-Anthony Towns became just the third player in New York Knicks history to record at least 30 points and 10 rebounds in three consecutive games."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Josh Hart became the first Knicks player since Michael Ray Richardson in 1981 with consecutive triple-doubles.", "Josh Hart has four triple-doubles this season and became the fourth player to have 10 triple-doubles with the Knicks."], "ranking": [1, 2]}
{"candidates": ["Jalen Brunson was announced out before the game, leading to Miles McBride starting and Cameron Payne taking over point guard duties due to McBride's hamstring tightness."], "ranking": [1]}
{"candidates": ["Coach Tom Thibodeau praised Tyler Kolek's ability to play two games in one day, highlighting his dedication and work ethic."], "ranking": [1]}
{"candidates": ["New York Knicks are on a nine-game winning streak and are just half a game behind the second seed in the standings.", "The Knicks will face a significant challenge against the Oklahoma City Thunder, who are on a seven-game winning streak.", "The New York Knicks won their ninth straight game.", "The Knicks are now just 0.5 games behind the Atlantic Division-leading Boston Celtics.", "The Knicks have won 14 of their last 16 games."], "ranking": [1, 5, 2, 4, 3]}
{"candidates": ["The Knicks have won 14 of their last 16 games."], "ranking": [1]}
{"candidates": ["Ja Morant recorded one of the fastest triple doubles in NBA history.", "Ja Morant's 12th career triple-double"], "ranking": [1, 2]}
{"candidates": ["Ja Morant recorded a triple-double and had some impressive highlights during the game.", "The Memphis Grizzlies won against the Milwaukee Bucks with a score of 122-99.", "Ja Morant scored 26 points with 10 rebounds and 14 assists", "Giannis Antetokounmpo scored 37 points and grabbed 11 rebounds", "Damian Lillard was held to four points on 1-of-12 shooting", "Brook Lopez scored 12 points for Milwaukee", "Seven Grizzlies players, including all five starters, scored in double figures"], "ranking": [1, 2, 3, 4, 5, 6, 7]}
{"candidates": ["Ja Morant had 26 points, 14 assists, and 10 rebounds, helping the Memphis Grizzlies build a 31-point second-half cushion and beat the Milwaukee Bucks 122-99.", "Giannis Antetokounmpo led the Bucks with 37 points and 11 rebounds, connecting on 17 of 22 shots.", "Damian Lillard struggled with his shooting, going 1 for 12 in the game, including missing all six of his 3-pointers."], "ranking": [1, 2, 3]}
{"candidates": ["Milwaukee Bucks have a 1-3 record to start the year, featuring stars Giannis Antetokounmpo and Damian Lillard.", "Memphis Grizzlies have a 2-3 record and recently got Ja Morant back but are expected to be without several key rotation pieces.", "The Bucks are 6.5-point road favorites as of Thursday morning with a total set at 232.", "Memphis Grizzlies and Milwaukee Bucks are set to play in a non-conference matchup on November 1, 2024.", "Memphis Grizzlies finished the 2023-24 season with a 27-55 overall record and a 9-32 record at home.", "Milwaukee Bucks finished the 2023-24 season with a 49-33 overall record, 34-18 in Eastern Conference action, and 18-22 on the road.", "Grizzlies averaged 105.8 points per game while shooting 43.5% from the field and 34.6% from deep last season.", "Bucks gave up 116.4 points per game while committing 19.2 fouls last season.", "Injuries for the Grizzlies include Ja Morant (day to day, thigh), John Konchar (day to day, foot), Luke Kennard (out, foot), Zach Edey (day to day, calf), Vince Williams Jr. (out, leg), GG Jackson II (out, foot), and Cam Spencer (out, ankle).", "Injury for the Bucks includes Khris Middleton (day to day, ankle)."], "ranking": [8, 6, 5, 10, 9, 7, 4, 3, 2, 1]}
{"candidates": ["Ja Morant: 'I just came out being aggressive, took what the defence gave me'", "Ja Morant: 'Everybody was kind of in a good rhythm, we got it going early'", "Ja Morant: 'We got stops. We were boxing out, we were getting out running, playing our game. That's how we want to play. If we want to do something in this league, that's what we've got to do each and every night.'", "Bucks coach Doc Rivers: 'I thought we played with the right spirit. We didn't make shots and you're going to have nights like that. But on those nights we have to find a way to get stops.'"], "ranking": [3, 2, 1, 4]}
{"candidates": ["Morant expressed some frustration after Wednesday’s loss to the Nets."], "ranking": [1]}
{"candidates": ["The Bucks are clearly missing the contribution of injured Khris Middleton, who has yet to play this season as he recovers from an ankle injury"], "ranking": [1]}
{"candidates": ["The Bucks were 9 for 42 from 3-point range, while Memphis finished the night at 52%.", "The Grizzlies snapped a two-game skid with this victory.", "Milwaukee has lost four straight games."], "ranking": [2, 1, 3]}
{"candidates": ["Turnovers were the main reason the Grizzlies struggled to get over the hump in the game against the Rockets.", "In a major road win, the Houston Rockets defeated the Memphis Grizzlies last night, 119-115.", "Houston Rockets guard Fred VanVleet dribbled as Memphis Grizzlies guard Luke Kennard defended during the fourth quarter at FedExForum.", "The Memphis Grizzlies lost to the Houston Rockets on January 10, 2025.", "Turnovers were a significant issue for the Grizzlies, impacting their performance.", "Desmond Bane returned to action Thursday after missing one game due to a left ankle sprain.", "The Memphis Grizzlies guard scored 16 points on efficient shooting (6-of-10 from the field, 2-of-5 from three), adding four rebounds, four assists, and two steals in 27 minutes during a close 119-115 loss to the Houston Rockets.", "Desmond Bane finished as the team’s third-leading scorer behind Ja Morant (27 points) and Jaren Jackson Jr. (21 points)."], "ranking": [5, 2, 8, 7, 6, 4, 1, 3]}
{"candidates": ["The win proved that Houston could be a legitimate title contender in the NBA with an impressive resume thus far.", "The Chris Vernon Show panel discussed how turnovers were the main reason the Grizzlies struggled in the game against the Rockets.", "The panel also discussed potential solutions to fix the turnover issue and its impact on the team's results.", "Though the Grizzlies fell to Houston, Bane’s presence is a major boost as they push for the playoffs and improve their standings.", "His consistency on both ends is vital for a team fighting for a top spot in the West.", "With Memphis in a tight race, Bane’s scoring, playmaking, and defensive impact will be crucial moving forward."], "ranking": [1, 5, 6, 2, 3, 4]}
{"candidates": ["The Rockets maintained their No. 2 spot in the Western Conference standings.", "The Rockets' defense, led by Dillon Brooks, set the tone for the game.", "The Rockets' head coach Ime Udoka emphasized the team's toughness and grit.", "The Rockets are considering adding help at the trade deadline to make a deep postseason run.", "Morant and Aldama returned to action Thursday after brief injury-induced absences.", "Morant had been out since Dec. 27 with a shoulder injury, and Aldama hadn’t played since Dec. 26 because of an ankle sprain.", "Desmond Bane also returned after missing Monday’s win over Dallas with an ankle injury. He scored 16 points.", "Grizzlies head coach Taylor Jenkins spoke on his decision to bench Morant for a good chunk of the fourth quarter, citing the need for players coming back from injury to find a rhythm.", "Jenkins admitted his costly mistake of calling a timeout before Bane's game-tying shot."], "ranking": [6, 4, 3, 8, 2, 1, 5, 7, 9]}
{"candidates": ["Houston and Memphis are in a tight race for the No. 2 seed in the Western Conference, as the Grizzlies are 24-14.", "The Rockets lead the season series over the Grizzlies 2-0."], "ranking": [1, 2]}
{"candidates": ["The Grizzlies and Rockets, who have the second- and third-most wins in the Western Conference teams behind Oklahoma City, met in the first of three games against each other this month.", "The Rockets moved 1 1/2 games ahead of the Grizzlies.", "The two teams will play Monday in Houston and Jan. 30 back in Memphis."], "ranking": [2, 3, 1]}
{"candidates": ["Grizzlies Injuries: Desmond Bane: day to day (ankle), Marcus Smart: out (finger), Santi Aldama: out (ankle), Vince Williams Jr.: out (ankle), Ja Morant: out (ac joint), GG Jackson II: out (foot).", "Rockets Injuries: Tari Eason: day to day (injury management), Jabari Smith Jr.: out (hand)."], "ranking": [2, 1]}
{"candidates": ["Nikola Jokic missed a game-tying 3-pointer at the buzzer.", "The Nuggets mounted a fourth-quarter comeback to wipe out Minnesota’s 16-point lead and establish a 10-point advantage.", "The Timberwolves closed out the game with a 10-0 run, ultimately winning 119-116.", "Jamal Murray was placed in the concussion protocol after a collision with Minnesota Timberwolves forward Julius Randle during the game.", "The Nuggets lost the game by a score of 119-116."], "ranking": [3, 2, 1, 5, 4]}
{"candidates": ["Denver entered the game hoping for a win over their conference rivals in the rematch after losing to Minnesota in seven games during last season's Western Conference Semifinals."], "ranking": [1]}
{"candidates": ["Both teams have undergone changes since their Western Conference Semifinals matchup, particularly the Timberwolves, who traded Karl-Anthony Towns and brought in Julius Randle and Donte DiVincenzo.", "Minnesota Timberwolves and Denver Nuggets are set to face off in a Western Conference matchup on November 2, 2024.", "Minnesota Timberwolves finished the previous season with a 56-26 overall record and 37-15 in Western Conference play.", "The Timberwolves averaged 16.9 points off of turnovers, 13.5 second-chance points, and 32.3 bench points last season.", "Denver Nuggets finished the previous season with a 57-25 overall record, 10-6 in Northwest Division games, and 24-17 on the road.", "The Nuggets gave up 109.6 points per game while committing 18.2 fouls last season.", "Timberwolves have no listed injuries for the upcoming game.", "Nuggets' player DaRon Holmes II is out for the season due to an Achilles injury."], "ranking": [5, 8, 2, 3, 1, 4, 6, 7]}
{"candidates": ["Anthony Edwards made a strong statement on the rivalry between Minnesota and Denver, expressing mutual dislike and respect for the competition.", "Edwards showed respect to Nikola Jokic, calling him the best player in the NBA.", "Christian Braun took responsibility for halting the Nuggets' momentum with his technical foul.", "Braun stated he needs to be more responsible and control himself better in such situations.", "Nikola Jokić's miscues in crunch time were highlighted despite his overall strong performance.", "Jamal Murray's continued struggles were noted, with poor shooting percentages.", "Russell Westbrook's performance was criticized, highlighting his turnovers and poor shooting.", "The Nuggets were described as a deeply flawed team despite having a superstar like Jokić."], "ranking": [5, 3, 6, 4, 2, 7, 1, 8]}
{"candidates": ["Nuggets forward Michael Porter Jr. acknowledged the possibility that the team could be broken up if they continue to struggle this year."], "ranking": [1]}
{"candidates": ["The Nuggets' bench was outscored 31-13.", "The Timberwolves, who led the league in defense last season, allowed 22 fast-break points.", "Christian Braun's dunk has been going viral on social media, with several major sports outlets posting the highlight play.", "Braun's teammates immediately ran to defend him after Gobert made contact with the 23-year-old guard."], "ranking": [3, 2, 1, 4]}
{"candidates": ["Ja Morant recorded his 60th career point-assist double-double, tying the Memphis Grizzlies franchise record held by Mike Conley."], "ranking": [1]}
{"candidates": ["Memphis Grizzlies secured a 124-111 victory over Orlando Magic.", "Yuki Kawamura made his appearance in the last two minutes of the game but missed both 3-point attempts and had a turnover.", "Ja Morant played 25 minutes despite being listed as questionable with right thigh soreness.", "Morant scored 16 points and made 10 assists in the game.", "Ja Morant was twisting in the air and catching alley-oops.", "Memphis was blocking balls and intercepting passes.", "Jay Huff threw down multiple reverse dunks.", "The Grizzlies finished with 38 assists, their most since April 2023.", "Five players were tied with a team-high 11 points at the end of the third quarter.", "Jaren Jackson Jr. returned from a hamstring injury and finished with 13 points and four rebounds.", "Santi Aldama scored 22 points, leading the team in scoring for the second time in three games.", "Scotty Pippen Jr. finished with 11 points and 12 assists.", "Ja Morant finished with a double-double, scoring 16 points with 10 assists.", "Morant's energy was infectious in the Grizzlies' 124-111 home-opening win over the Orlando Magic.", "Jay Huff and Scotty Pippen Jr. had career nights thanks to Morant's involvement."], "ranking": [5, 12, 9, 8, 11, 10, 7, 4, 14, 6, 3, 2, 1, 13, 15]}
{"candidates": ["Zach Edey played his third NBA game against the undefeated Orlando Magic.", "Edey scored seven points and grabbed one rebound in 13 minutes of play.", "Edey committed four personal fouls, which limited his playing time.", "Santi Aldama led the Grizzlies off the bench with 22 points.", "Jay Huff added 18 points while Ja Morant contributed 16 points.", "Ja Morant had a double-double performance with 16 points and 10 assists.", "Santi Aldama was Memphis’ best scorer, putting up 22 points.", "Jay Huff scored 18 points with 60% shooting from long-distance and 77.8% overall.", "Franz Wagner was the Magic’s top scorer with 23 points.", "Jalen Suggs scored 21 points for the Magic."], "ranking": [8, 5, 9, 2, 6, 1, 3, 4, 7, 10]}
{"candidates": ["Yuki Kawamura expressed his delight at the crowd's support and acknowledged he could have done more.", "Ja Morant encouraged Kawamura to score his first NBA points.", "Desmond Bane emphasized the importance of a balanced attack and involving everyone.", "Bane and Morant discussed getting more teammates involved after the loss to the Houston Rockets.", "Jaren Jackson Jr. reflected on the significance of playing with Morant and Bane again.", "Desmond Bane mentioned that the team is still missing key players but expects them to return soon."], "ranking": [5, 2, 4, 3, 6, 1]}
{"candidates": ["Taylor Jenkins commented on Edey's mindset, stating that Edey is learning a lot and will improve over time."], "ranking": [1]}
{"candidates": ["Yuki Kawamura is the second Japanese player in Grizzlies' history, following Yuta Watanabe.", "The Memphis Grizzlies improved to 2-1 on the NBA season with their win over the Orlando Magic.", "Ja Morant's achievement took him just 260 career games to tie Mike Conley's record.", "The Memphis Grizzlies wore throwback white Vancouver jerseys to commemorate the franchise’s 30-year anniversary.", "The Grizzlies showcased solid depth through three games despite being short-handed."], "ranking": [3, 5, 1, 4, 2]}
{"candidates": ["Giannis Antetokounmpo missed two dunks and 20 other attempts within five feet of the rim over a three-game stretch, including the game against the Portland Trail Blazers.", "Giannis Antetokounmpo ended the game against the Portland Trail Blazers 11-for-20 around the rim, contributing to Milwaukee's 105-102 loss at home.", "The Milwaukee Bucks lost a home game to the Portland Trail Blazers with a score of 105-102.", "Numerous Bucks stars struggled, including Damian Lillard (16 points on 5-of-15 shooting against his ex-team), Khris Middleton (two points in 26 minutes), and Brook Lopez (five points on 2-of-9 shooting).", "The Milwaukee Bucks fell to the Portland Trail Blazers on Saturday.", "Late-game execution doomed the Bucks.", "Giannis Antetokounmpo missed a lot of layups and felt the toll of an illness.", "Anfernee Simons scored 28 points and Deni Avdija 19 as the Portland Trail Blazers beat the Milwaukee Bucks 105-102.", "Giannis Antetokounmpo hit two free throws to give the Bucks a 102-100 lead.", "Simons was fouled on a scoring drive and completed the three-point play, giving Portland a 103-102 lead with 23.5 seconds remaining.", "The Milwaukee Bucks lost 105-102 to the Portland Trail Blazers on January 4, 2025.", "Giannis Antetokounmpo, despite averaging 32 points, 11.6 rebounds, and just under six assists per game, felt the need to improve his performance following the loss."], "ranking": [7, 5, 12, 9, 11, 10, 8, 3, 2, 1, 4, 6]}
{"candidates": ["Anfernee Simons scored 28 points and Deni Avdija 19 as the Portland Trail Blazers beat the Milwaukee Bucks 105-102.", "Giannis Antetokounmpo hit two free throws to give the Bucks a 102-100 lead.", "Simons was fouled on a scoring drive and completed the three-point play, giving Portland a 103-102 lead with 23.5 seconds remaining.", "Milwaukee turned it over on its next possession without getting a shot, giving Portland possession with 8.4 seconds remaining.", "Simons hit two more free throws with 5.4 seconds left, giving Portland a 105-102 lead.", "Damian Lillard missed a 3-point try from the left side on the Bucks' final possession.", "Antetokounmpo finished with 31 points and 11 rebounds, and AJ Green added 21 points on seven 3-pointers."], "ranking": [3, 5, 1, 6, 2, 7, 4]}
{"candidates": ["The frustrations have been visible for Giannis Antetokounmpo and the Bucks, with playoff disappointments and major roster changes weighing on the franchise.", "Giannis Antetokounmpo's recent struggles at the rim are seen as a rare reminder that even the league’s most unstoppable force is human.", "Bucks head coach Doc Rivers expressed frustration with his team's performance, emphasizing the need to play right and get back to their successful strategies.", "Rivers responded to questions about adjusting his messaging to players, stating that the team is aware of their issues and is addressing them daily.", "Doc Rivers expressed frustration with the media and the team's performance.", "Giannis Antetokounmpo acknowledged the need to be more aggressive and get back in rhythm.", "Giannis Antetokounmpo offered a strange analogy about his play, comparing it to a savings account where he is currently in the minus and needs to build back up.", "Antetokounmpo acknowledged that an illness that kept him out of four straight games may have affected his performance.", "Antetokounmpo emphasized the importance of being more aggressive to help the Bucks win more games."], "ranking": [7, 9, 5, 3, 2, 8, 1, 6, 4]}
{"candidates": ["Green’s seven 3-pointers matched his career high."], "ranking": [1]}
{"candidates": ["Indiana Pacers defeated Miami Heat 128-115.", "Tyrese Halliburton led the Pacers with 33 points, 15 assists, and 5 rebounds.", "Pascal Siakam recorded a double-double with 18 points and 11 rebounds.", "Myles Turner contributed 21 points for the Pacers.", "Kel’el Ware led the Heat with a career-high 25 points on 9 of 11 shooting.", "Tyler Herro scored 17 points on 50% shooting.", "Bam Adebayo added 20 points and 8 rebounds.", "The Miami Heat lost to the Indiana Pacers 128-115 on January 2, 2025.", "Jimmy Butler scored exactly nine points and played zero seconds in the fourth quarter for the second consecutive game."], "ranking": [8, 2, 6, 5, 1, 7, 4, 3, 9]}
{"candidates": ["Tyrese Haliburton combined 33 points with a season-high 15 assists without a turnover to steer the Indiana Pacers to a convincing 128-115 win over the host Miami Heat.", "Haliburton set the tone with a 16-point, five-assist first quarter.", "Rookie Kel’el Ware contributed a career-best 25 points on 9-of-11 shooting and added three blocks in 21 minutes off the bench for the Heat.", "Jimmy Butler started with a layup in the opening seconds, but that was his only score of the first half.", "Indiana reeled off the next 12 points, then went on another 12-2 run en route to a 38-25 cushion going into the second quarter.", "The Pacers shot 7-of-15 from deep and attacked the paint with precision, going 8-of-8 inside the arc in the opening period.", "Adebayo and Herro stemmed some of the bleeding for the Heat in the second, but not enough to prevent them from being outscored 28-25 for the quarter to trail 66-50 at the break.", "Indiana’s advantage ballooned to 107-83 after scoring 41 points in the third quarter.", "Haliburton continued to facilitate expertly, chalking up 12 points and six assists for the period, while Turner added 11 points.", "Rookies Ware and Keshad Johnson piloted a spirited 11-1 run, helping the Heat close the gap to 12 midway through the fourth, before Indiana went on a 9-2 burst to snuff out any chance of a comeback.", "Following a 128-115 loss to the Indiana Pacers on Thursday, Jimmy Buckets glumly faced reporters in the press conference.", "Tyrese Haliburton scored 33 points and handed out 15 assists, leading the Pacers to a 128-115 win over the Heat.", "Myles Turner added 21 points for the Pacers.", "Pascal Siakam had 18 points and 11 rebounds for the Pacers.", "Kel’el Ware led the Heat with 25 points.", "Bam Adebayo scored 20 points for the Heat.", "Tyler Herro added 17 points for the Heat.", "Terry Rozier had 16 points for the Heat.", "Jimmy Butler scored nine points and didn’t play in the fourth quarter for a second consecutive night.", "Indiana made 17 3-pointers and the Pacers are now 8-2 this season when connecting at least 15 times from beyond the arc.", "Thursday was the 25th anniversary of Miami's first game at what is now called Kaseya Center.", "Miami Heat was dominated by the Indiana Pacers with a final score of 128-115.", "Jimmy Butler scored just nine points with two rebounds, four assists, and two steals in 27 minutes in Miami’s 13-point loss to the Pacers."], "ranking": [1, 5, 3, 18, 4, 6, 10, 2, 7, 9, 15, 8, 11, 12, 13, 14, 16, 17, 19, 20, 21, 22, 23]}
{"candidates": ["Tyler Herro and the Miami Heat host Tyrese Haliburton and the Indiana Pacers.", "The Heat are 11-10 in Eastern Conference games. Miami ranks fifth in the Eastern Conference with 33.6 defensive rebounds per game led by Bam Adebayo averaging 7.5.", "The Pacers are 9-14 in conference matchups. Indiana is fourth in the Eastern Conference scoring 50.6 points per game in the paint led by Pascal Siakam averaging 9.0.", "The Heat score 111.3 points per game, 5.6 fewer points than the 116.9 the Pacers allow. The Pacers average 12.7 made 3-pointers per game this season, 0.6 fewer makes per game than the Heat allow.", "Herro is averaging 24.3 points, 5.6 rebounds and 5.2 assists for the Heat.", "Myles Turner is scoring 14.9 points per game and averaging 7.2 rebounds for the Pacers.", "Heat: 6-4 in their last 10 games, averaging 110.3 points, 43.3 rebounds, 24.0 assists, 8.1 steals and 3.1 blocks per game while shooting 46.4% from the field. Their opponents have averaged 107.8 points per game.", "Pacers: 6-4 in their last 10 games, averaging 115.6 points, 44.3 rebounds, 29.1 assists, 7.1 steals and 5.6 blocks per game while shooting 49.0% from the field. Their opponents have averaged 113.1 points."], "ranking": [8, 5, 4, 2, 6, 7, 1, 3]}
{"candidates": ["Jimmy Butler requested a trade postgame, indicating he is open to playing anywhere but Miami.", "Jimmy Butler expressed a desire to regain his joy for playing basketball, suggesting it would not happen in Miami.", "Jimmy Butler expressed his desire to find joy in playing basketball again, indicating that he may not find it in Miami.", "Butler mentioned his frustration with his current role and performance, stating he wants to be back to a dominant position.", "Heat coach Erik Spoelstra and teammate Bam Adebayo commented on Butler's frustration and the team's focus on winning.", "Butler has not reached double figures in scoring for three consecutive games, a first since November 2013."], "ranking": [1, 3, 2, 5, 4, 6]}
{"candidates": ["In the press conference, Butler said that he was happy 'off the court' in Miami, but wanted to get his 'joy back.' He added that he wants to be 'dominant' but told a reporter he probably would not get that with the Heat.", "Following Jimmy Butler’s comments after the loss to the Indiana Pacers, Shams Charania and Brian Windhorst doubled down on the former’s exclusive news in December about Butler asking for a trade.", "Six-time All-Star Jimmy Butler has indicated to the Miami Heat he wants the team to trade him, league sources told ESPN.", "Butler does not plan to furnish the Heat with a list of favored destinations, sources told ESPN. He is open to playing anywhere other than Miami and feels he can make any team a contender -- no matter where he is moved, sources said. He does plan to take part in all team activities and will plan to do whatever the Heat ask of him during this process, sources said.", "Jimmy Butler commented that he doesn’t have any joy playing for the Heat anymore and hinted at a possible departure.", "Heat president Pat Riley released a statement that they won’t trade the six-time All-Star, but there’s still a non-zero chance they move him before the Feb. 6 trade deadline."], "ranking": [2, 5, 1, 4, 3, 6]}
{"candidates": ["Thursday was the 25th anniversary of Miami's first game at what is now called Kaseya Center. The Heat beat Orlando 111-103 on opening night, Jan. 2, 2000. They're now 736-395 in the building, including 86-36 in playoff games."], "ranking": [1]}
{"candidates": ["ESPN reported that Butler has indicated to the Heat that he wants a trade, although he has not publicly confirmed this.", "Butler has a $52 million player option for next season or could leave Miami in free agency if he remains with the team past the trade deadline."], "ranking": [1, 2]}
{"candidates": ["Heat injuries: Dru Smith out for season (achilles), Josh Richardson day to day (heel).", "Pacers injuries: Aaron Nesmith out (ankle), Isaiah Jackson out for season (calf), James Wiseman out for season (calf)."], "ranking": [1, 2]}
{"candidates": ["Anthony Edwards moved past Trae Young and D'Angelo Russell for the most career games with 6+ made threes by a player aged 23 or younger in NBA history."], "ranking": [1]}
{"candidates": ["The result of the contest saw Edwards and the Timberwolves get the best of the matchup with a 108-106 win over the Clippers.", "Edwards finished tonight's contest with 37 points, eight assists, seven rebounds, and attempted 29 shots.", "Anthony Edwards scored 28 of his 37 points in the second half.", "The Minnesota Timberwolves overcame a 19-point first-half deficit to beat the Los Angeles Clippers 108-106.", "Edwards swished a step-back 3 with 1:12 to play.", "Edwards drained another 3 with 34.4 seconds left for a 106-101 lead.", "Naz Reid scored 18 off the bench and Donte DiVincenzo added 15 for Minnesota.", "Rudy Gobert had eight points and a game-high 18 rebounds.", "Norman Powell led Los Angeles with 25 points, James Harden added 22 and Ivica Zubac had 17 points and 16 rebounds.", "The Clippers led 96-91 with 4:07 to go, but a three-point play and a 3 by Edwards put the Timberwolves up by one a minute later."], "ranking": [5, 8, 6, 2, 9, 1, 7, 10, 3, 4]}
{"candidates": ["Prior to facing the Clippers, Edwards shared an intimate moment with a young fan named Luca who was battling cancer. Edwards proclaimed that he'd wear an orange wristband for the rest of his career in dedication to Luca.", "Ty Lue told reporters pregame that Kawhi Leonard would not close the game no matter the score."], "ranking": [1, 2]}
{"candidates": ["This was an impressive showing from Edwards, and more importantly a big win for Minnesota at home.", "Sweeping their season series with the Clippers, the Timberwolves now have that tiebreaker should it come into play."], "ranking": [1, 2]}
{"candidates": ["James Harden commented on Anthony Edwards' performance, stating, 'He's aggressive, he gets his teammates open. Obviously he scores the ball at the highest level. He gets his teammates shots and that's what he's gonna have to do.'"], "ranking": [1]}
{"candidates": ["Anthony Edwards is known for being one of the most brash trash-talkers in the NBA but showed a different side of himself after the game against the Clippers.", "For one reason or another, Edwards seems to really light up when facing the Clippers. In 17 career games against them, he's averaged 22.1 points, 5.1 rebounds, and 3.9 assists.", "Kawhi Leonard scored eight points on 3-of-11 shooting in his second game back after a right knee injury.", "DiVincenzo started at point guard in place of Mike Conley, who came off the bench for the first time in his 131 games with the Timberwolves.", "Julius Randle had five points for Minnesota on 2-of-10 shooting."], "ranking": [2, 1, 4, 3, 5]}
{"candidates": ["Kawhi Leonard scored eight points on 3-of-11 shooting in his second game back after missing the team’s first 34 while recovering from a right knee injury.", "DiVincenzo started at point guard in place of Mike Conley, who came off the bench for the first time in his 131 games with the Timberwolves.", "Julius Randle had five points for Minnesota on 2-of-10 shooting."], "ranking": [2, 1, 3]}
{"candidates": ["Timberwolves injuries: Rob Dillingham (out, ankle), Luka Garza (day to day, ankle), Josh Minott (day to day, illness).", "Clippers injury: P.J. Tucker (out, personal)."], "ranking": [2, 1]}
{"candidates": ["Karl-Anthony Towns delivered an outstanding performance with 26 points, 15 rebounds, and six assists.", "Josh Hart averaged 14 points, 9.4 rebounds, and 7.8 assists over his last five games.", "OG Anunoby has been improving offensively, averaging 22 points per game over his last five outings.", "Mikal Bridges scored over 20 points in back-to-back games against his former team.", "OG Anunoby and Mikal Bridges spearheaded the Knicks' offense.", "Cam Thomas, who exploded for 27 points in the first half of the Nov. 15 loss, posted rather pedestrian numbers.", "Brooklyn conceded a pair of runs, 7-0 and 11-2, respectively, but never found itself down more than 10 points through 24 minutes of action.", "Bridges scored 14 first-half points.", "OG Anunoby scored 18 points through just 20 minutes of action.", "Karl Anthony-Towns added 12 points in his return.", "Brooklyn's grit resulted in a three-point halftime hole.", "Karl Anthony-Towns added another 14 points in the third quarter, dominating the Nets' interior.", "Johnson and Finney-Smith attempted to lead the comeback charge, but the supporting cast couldn't follow suit.", "The game was chippy, with a shoving match between Dorian Finney-Smith and OG Anunoby.", "Nets guard Dennis Schroder attacked the basket with less than 30 seconds in the game and met Knicks center Ariel Hukporti.", "The L2M Report determined that the referees did not make any mistakes in the final two minutes of the game.", "The Knicks beat the Nets twice in three days.", "New York hosted Brooklyn on Friday and narrowly escaped a fourth-quarter scare.", "The Knicks defeated the Nets on Sunday with a final score of 114-104."], "ranking": [1, 5, 4, 3, 6, 10, 14, 8, 9, 11, 2, 12, 15, 16, 13, 7, 17, 18, 19]}
{"candidates": ["Mikal Bridges stated that the Knicks' starting unit is 'definitely better' after the win against the Nets and emphasized the need for improvement in defense and communication.", "Bridges reflected on the team's journey and the need to continue growing and improving."], "ranking": [1, 2]}
{"candidates": ["The Knicks held Cam Thomas to 16 points on 4-for-11 shooting after he scored a season-high 43 points on Friday.", "The Knicks completed a two-game weekend sweep of the Brooklyn Nets."], "ranking": [1, 2]}
{"candidates": ["Knicks injuries: Precious Achiuwa: out (hamstring), Miles McBride: day to day (knee), Mitchell Robinson: out (ankle), Karl-Anthony Towns: day to day (knee).", "Nets injuries: Bojan Bogdanovic: out (foot), Day'Ron Sharpe: out (hamstring), Trendon Watford: day to day (hamstring), Nic Claxton: out (back)."], "ranking": [2, 1]}
{"candidates": ["Domantas Sabonis scored off an offensive rebound with 0.7 seconds left, and the Sacramento Kings rallied from 15 points down to beat the Miami Heat 111-110.", "DeAaron Fox scored 28 for Sacramento, while DeMar DeRozan finished with 26.", "Sabonis finished with 16 points, 16 rebounds, and seven assists.", "Jimmy Butler scored 15 of his 27 points in the fourth quarter and Tyler Herro added 27 for the Heat.", "Bam Adebayo scored 16 for Miami, which got 13 from rookie Pelle Larsson.", "Terry Rozier's 30-footer at the buzzer missed for the Heat.", "Miami was up by five with 1:11 left when DeRozan got a four-point play that started a game-ending 8-2 Kings run.", "Domantas Sabonis shot the game-winning basket over Bam Adebayo during the fourth quarter.", "The Miami Heat were outscored 37-17 in the third quarter after having a 15-point lead.", "Domantas Sabonis secured an offensive rebound and put up the game-winning shot.", "Domantas Sabonis' game-winning putback with 0.7 seconds left secured the Sacramento Kings a 111-110 comeback win over the Miami Heat.", "Sacramento Kings completed a 15-point comeback against the Miami Heat.", "Miami Heat were outscored by 20 points in the third quarter for the second time this season.", "Jimmy Butler and Tyler Herro both tallied a game-high 27 points each.", "Jimmy Butler played nearly 36 minutes, scoring 21 points, making nine-of-19 shots, and adding six assists and two steals.", "DeMar DeRozan scored a team-best 26 points for the Sacramento Kings, making 10-of-18 shots and all five of his free throws.", "Bam Adebayo contributed with 14 points, eight rebounds, five assists, four blocks, and three steals.", "De’Aaron Fox scored a game-high 28 points, making 11-of-21 shots and three-of-four free throws.", "Tyler Herro made a game-high five three-pointers, scoring 27 points in total."], "ranking": [1, 5, 10, 3, 14, 16, 4, 7, 2, 6, 8, 12, 11, 15, 9, 13, 17, 18, 19]}
{"candidates": ["Sacramento improved to 6-31 all-time at Miami.", "The Heat led by 15 early in the third but were outscored 37-17 in that quarter.", "The Heat have been outscored 137-71 in four third quarters at home this season.", "The Heat have been outscored by 20 or more points in third quarters eight times in 1,119 games at their current home arena — twice this season.", "The Miami Heat lost the rebounding edge in every game this season besides against the Wizards.", "The Heat struggled with free throws, making only 71.6 percent this season compared to 80.8 percent in the previous five seasons.", "Pelle Larsson took advantage of his first meaningful minutes of the season, finishing with 13 points, two rebounds, and two assists on 66.7 percent shooting and 60 percent from three-point range."], "ranking": [4, 2, 5, 1, 6, 3, 7]}
{"candidates": ["Sacramento was without Kevin Huerter (illness). He took part in the team's morning shootaround but remained at the team hotel for the game. Keon Ellis started in his place.", "Kevin Love was back on the bench after being away for the first five games while dealing with a personal matter. He did not play, and Miami was also without Jaime Jaquez Jr. (gastroenteritis).", "Sacramento hosts Toronto on Wednesday. Miami opens a six-game road trip in Phoenix on Wednesday."], "ranking": [2, 1, 3]}
{"candidates": ["The Bulls tied their franchise record on Monday night as they knocked down 25 threes."], "ranking": [1]}
{"candidates": ["Chicago hit 25 threes in their 126-123 victory over the Memphis Grizzlies.", "Grizzlies struggled in the 3rd quarter against the Bulls.", "Discussion on Taylor Jenkins' rotations during the game.", "Ja Morant had a rest day during the match.", "Jay Huff's new contract was mentioned.", "The Bulls came out in the second half and erased a 14-point halftime deficit to escape with a narrow win.", "Jalen Smith, Julian Phillips, Lonzo Ball, and Ayo Dosunmu combined for 36 points off the bench, contributing significantly to the comeback.", "The bench was crucial in the middle of the third quarter, helping the Bulls take care of the basketball and generate good shots.", "Scotty Pippen Jr. delivered a double-double performance with 14 points, 10 assists, 4 rebounds, 1 steal, and 1 block in the Memphis Grizzlies' 126-123 loss to the Chicago Bulls."], "ranking": [1, 8, 5, 9, 6, 2, 3, 4, 7]}
{"candidates": ["Zach LaVine scored 30 points, including 11 in the fourth quarter to key a Chicago comeback.", "Nikola Vucevic finished with 22 points for the Bulls.", "Coby White scored 20 points.", "Josh Giddey finished with 12 points, eight assists, and 13 rebounds, including a key offensive rebound in the final seconds.", "Desmond Bane led Memphis with 30 points, making 11 of 19 shots, including 6 of 10 from 3-point range.", "Jaren Jackson Jr. had 19 points.", "Jake LaRavia finished with 17 points.", "Scotty Pippen Jr. had 14 points and 10 assists.", "The Bulls led 126-123 after Giddey split a pair of free throws with 8.9 seconds left.", "Memphis had the last shot, but Bane's 3-point attempt was off the mark.", "Zach Edey ended the first quarter with two points, four rebounds, and altered multiple shots around the rim.", "Edey ended the first half with six points and five rebounds.", "Edey made a 3-pointer on Saturday against the Orlando Magic but missed both attempts against the Bulls.", "The Chicago Bulls, which trailed 68-54 at halftime, cut the deficit to 100-93 before the fourth quarter started."], "ranking": [1, 7, 9, 3, 2, 8, 10, 6, 4, 5, 12, 11, 13, 14]}
{"candidates": ["Tony Allen explained who was at fault and why the Bulls were having so much success in the second half.", "Billy Donovan praised the bench players for their performance, highlighting their role in the comeback.", "Lonzo Ball commented on the team's new approach to shooting more three-pointers and the importance of staying the course through four quarters.", "Larsa Pippen reacted positively to her son Scotty Pippen Jr.'s performance, sharing her pride and celebrating his efforts on Instagram."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Zach Edey has been a non-factor for the Memphis Grizzlies in the second half this season.", "Edey hasn't gained Jenkins' trust yet, particularly when games get tight in the second half."], "ranking": [2, 1]}
{"candidates": ["Chicago used a fourth-quarter rush starting with about nine minutes left, outscoring the Grizzlies 33-23 in the fourth quarter.", "Memphis continues to squander leads in the third quarter, giving up a big run to let the Bulls back into the game.", "The Bulls were trailing 106-98 when LaVine and Vucevic returned to the floor with about nine minutes left, starting Chicago's comeback.", "The Bulls would outscore Memphis 22-6 over the next four minutes, capped by a 3-pointer by LaVine.", "Both teams have had trouble early in the season holding onto the ball, but the Bulls committed only nine turnovers, and Memphis had 10."], "ranking": [3, 5, 2, 1, 4]}
{"candidates": ["LeBron James passed John Stockton for fifth on the all-time games played list.", "It was a career-best night for rookie sensation Dalton Knecht, who finished with 27 points and five threes."], "ranking": [2, 1]}
{"candidates": ["Dalton Knecht recorded a career-high 27 points."], "ranking": [1]}
{"candidates": ["The Los Angeles Lakers defeated the New Orleans Pelicans, making it five-straight wins for the Lakers.", "The Pelicans, despite being shorthanded, battled down to the wire with the Lakers.", "The NBA's Last Two Minute Report included one missed call with 1:33 remaining, where possession should have been awarded to the Pelicans.", "The Pelicans had an opportunity to attempt a game-tying three on their final possession but turned the ball over, sealing the game for the Lakers.", "Christian Koloko had a standout performance with six points, six rebounds, an assist, a steal, and a block in 11 minutes.", "Koloko was involved in a critical turnover on the last play.", "The Lakers won by a score of 104-99.", "LeBron James' 21 points helped pave the way to the fifth consecutive victory for the Lakers.", "With 38 seconds remaining and Los Angeles up by one point, James pulled up at the top of the key to drain a huge three.", "Anthony Davis recorded his third 30-plus point game in his last five appearances.", "Anthony Davis had 31 points and 14 rebounds.", "LeBron James highlighted a 21-point performance with a pair of pivotal 3-pointers in the final minutes.", "Rookie Dalton Knecht hit five 3s to finish with a career-high 27 points in a spot start for the Lakers.", "Brandon Ingram scored 32 points, and reserve Jaylen Nowell scored 16 points for the Pelicans.", "Right after a clutch 3 by Ingram gave the Pelicans a late two-point lead, James responded with consecutive 3s to put the Lakers up 101-97 with 37 seconds left.", "The Lakers outscored the Pelicans in the paint, 52-40.", "Anthony Davis dominated with 31 points and 14 rebounds.", "Dalton Knecht had 27 points, seven rebounds, and five 3-pointers as a starter.", "LeBron James had 21 points, seven rebounds, and five assists.", "Brandon Ingram led the Pelicans with 32 points.", "The Pelicans were without key players like Zion Williamson, Jordan Hawkins, Dejounte Murray, CJ McCollum, and Herbert Jones.", "The first quarter was a back-and-forth affair, ending with the Pelicans leading 30-21.", "Jaylen Nowell contributed 11 points in the second quarter, helping the Pelicans to a 56-46 lead at halftime.", "The Lakers edged ahead in the third quarter, finishing up 75-71.", "The Lakers secured a dramatic 104-99 victory with clutch defense and free throws by Dalton Knecht."], "ranking": [1, 5, 10, 4, 14, 15, 20, 2, 3, 6, 7, 8, 9, 11, 12, 13, 16, 17, 18, 19, 21, 22, 23, 24, 25]}
{"candidates": ["Anthony Davis had 31 points and 14 rebounds to lead the Lakers to a 104-99 victory over the Pelicans.", "LeBron James highlighted a 21-point performance with a pair of pivotal 3-pointers in the final minutes.", "Rookie Dalton Knecht hit five 3s to finish with a career-high 27 points in a spot start for the Lakers.", "Brandon Ingram scored 32 points for the Pelicans.", "Jaylen Nowell scored 16 points for the Pelicans.", "Dalton Knecht scored 16 points in the second half, including 10 points in the third quarter, leading a 29-15 third-quarter surge.", "The Lakers turned the game around from trailing by 15 points to winning 104-99."], "ranking": [1, 3, 2, 5, 6, 4, 7]}
{"candidates": ["Head coach JJ Redick praised Koloko for his performance and highlighted the importance of building confidence.", "Redick mentioned the potential long-term impact of Koloko's performance on the team's roster decisions.", "LeBron James expressed pride in his team's effort, making it clear that he's still the most reliable scorer down the stretch.", "The Lakers improve to 9-4 under head coach JJ Redick."], "ranking": [3, 2, 1, 4]}
{"candidates": ["Dalton Knecht's performance is increasing his prospects of getting significant minutes in the lineup."], "ranking": [1]}
{"candidates": ["The Lakers extended their winning streak to five games with a 104-99 victory over the New Orleans Pelicans.", "LeBron James' career-long four-game triple-double streak came to an end.", "Despite having just 10 players in uniform, the Pelicans led 56-46 at halftime but couldn’t quite get the win."], "ranking": [1, 2, 3]}
{"candidates": ["The Lakers extended their winning streak to five games.", "LeBron James' career-long four-game triple-double streak came to an end.", "The Pelicans led 56-46 at halftime but couldn't secure the win.", "The Lakers outscored the Pelicans in the paint, 52-40."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Brice Sensabaugh scored a career-high 34 points.", "Brice Sensabaugh scored a career-high 34 points against the Miami Heat on January 4, 2025.", "Brice Sensabaugh made a career-high seven three-pointers in the game against the Miami Heat."], "ranking": [2, 3, 1]}
{"candidates": ["Brice Sensabaugh scored 34 points off the bench, a career-high for him.", "Bam Adebayo recorded his first game without a single made field goal in over 25 minutes of playing time.", "Bam Adebayo did not make a single field goal out of six attempts, which is the first time in his career with at least 25 minutes played.", "Miami Heat was out-rebounded by a large margin, 57-32, which is the sixth time in team history that another team had at least 25 boards more."], "ranking": [1, 3, 2, 4]}
{"candidates": ["Brice Sensabaugh's 34 points were both a game-high and a career-high.", "Utah Jazz defeated the Miami Heat with a score of 136 to 100.", "Sensabaugh had a blistering 7/11 performance from three-point range.", "Brice Sensabaugh scored 20 points in the fourth quarter against the Miami Heat.", "Sensabaugh's diverse shot chart included seven 3-pointers and five baskets inside the arc.", "Sensabaugh contributed to Utah's offense with two assists against the Miami Heat."], "ranking": [1, 6, 2, 3, 4, 5]}
{"candidates": ["Brice Sensabaugh led the Utah Jazz with 34 points off the bench on 12 of 18 shooting.", "The Miami Heat shot an abysmal 26% from 3-point range and 44% from the field.", "The Utah Jazz had a 57-32 rebounding advantage over the Miami Heat.", "Tyler Herro finished the game with 15 points on four of 12 shooting from the field, including only connecting on one from beyond the arc out of eight attempts.", "Miami Heat lost by 36 points to the Utah Jazz."], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["Sensabaugh's performance is a sign that he is starting to put things together during his sophomore campaign.", "Sensabaugh has made improvements defensively this year.", "Sensabaugh could see a bigger role down the season's stretch run.", "Jazz head coach Will Hardy praised Sensabaugh's work ethic and decision-making after the game against Miami.", "Sensabaugh credited his teammates and coaches for putting him in the right spots and emphasized efficiency and execution."], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["The Heat organization has officially hit rock bottom, as they drop Saturday’s game to a tanking 7-25 Jazz squad at home by 36 points.", "The Heat fell to 17-16 on the season after the loss, although remained in the East’s sixth seed with a Milwaukee Bucks loss.", "The entire franchise just has zero direction now and it isn’t fair to anybody involved.", "Miami was already struggling to find a consistent identity all season, and Butler’s fiasco didn’t help that notion.", "Tyler Herro spoke about putting the Jimmy Butler situation past the team and focusing on the players in the locker room.", "Erik Spoelstra downplayed the situation with Butler as having any impact on the team and emphasized not making any excuses for the loss."], "ranking": [1, 5, 2, 4, 6, 3]}
{"candidates": ["The Heat began the post-Jimmy Butler era by suffering an embarrassing 36-point blowout loss at the hands of the Utah Jazz at home.", "The Utah Jazz entered the game with a 7-25 record, good for the 14th seed in the Western Conference and a bottom-three team in the entire association."], "ranking": [1, 2]}
{"candidates": ["Antetokounmpo had six offensive rebounds to increase his career total to 1,469 and become Milwaukee’s career leader. Marques Johnson, now part of the Bucks’ television broadcast team, had 1,468 offensive rebounds with the Bucks from 1977-84."], "ranking": [1]}
{"candidates": ["Antetokounmpo had six offensive rebounds to increase his career total to 1,469 and become Milwaukee's career leader."], "ranking": [1]}
{"candidates": ["Damian Lillard scored 34 points.", "Giannis Antetokounmpo had 31 points and 16 rebounds.", "The Bucks snapped a six-game skid with a 123-100 victory over the Jazz.", "Utah led 71-70 before the Bucks took command with a 17-1 run late in the third quarter.", "Antetokounmpo picked up his fourth foul with 10:26 left in the third quarter but didn't pick up another foul during that stretch and helped spark the 17-1 run."], "ranking": [3, 2, 1, 4, 5]}
{"candidates": ["Damian Lillard expressed relief and optimism after the win, stating the team needs to use this momentum going forward."], "ranking": [1]}
{"candidates": ["The Bucks hadn’t lost six straight games since March 2015. They avoided their first seven-game skid since March 2014, when they dropped eight in a row.", "Jazz: Utah entered the night ranked 27th in the NBA in 3-pointers per game (11.3) and 29th in 3-point percentage (30.3%), but the Jazz went 14 of 26 from beyond the arc in the first half to lead 61-57 at the break. They were 3 of 15 in the second half.", "Bucks: Milwaukee coach Doc Rivers shuffled his lineup by giving Andre Jackson Jr. his first start of the season and moving Gary Trent Jr. to a bench role."], "ranking": [2, 1, 3]}
{"candidates": ["The Bucks hadn’t lost six straight games since March 2015 and avoided their first seven-game skid since March 2014.", "Jordan Clarkson had 18 points off the bench to lead the Jazz.", "Milwaukee coach Doc Rivers shuffled his lineup by giving Andre Jackson Jr. his first start of the season and moving Gary Trent Jr. to a bench role."], "ranking": [1, 3, 2]}
{"candidates": ["Tyler Herro extended his streak of double-figure games to 61 and continued his impressive run of scoring three-pointers, breaking the Heat’s previous record set by Tim Hardaway.", "Bam Adebayo reached a personal milestone with his 8,000th career point.", "Nikola Jovic achieved his 100th career three-pointer."], "ranking": [1, 2, 3]}
{"candidates": ["Tyler Herro scored 32 points to lead five Miami scorers in double figures.", "Bam Adebayo added 23 points, 10 assists, and nine rebounds.", "Duncan Robinson scored 17 points.", "Jaime Jaquez Jr. put up 12 points.", "Kel’el Ware added 10 points.", "Jimmy Butler returned from a five-game absence caused by a flu-like illness and finished with nine points in 25 minutes.", "Trey Murphy III scored 34 points – one off his season high.", "CJ McCollum added 22 points.", "Brandon Boston had 14 points.", "Dejounte Murray added 12 points.", "Miami scored the first five points of the second half to take a 61-51 lead.", "McCollum made three consecutive Pelicans field goals to pull them within three points.", "Robinson answered with seven consecutive Heat points to give them an 80-70 lead.", "Miami finished with a 10-2 run that gave it a 90-76 lead at the end of the third quarter.", "The Pelicans crept within 111-104 on a 3-pointer by McCollum with 2:47 left, but they didn’t get any closer.", "The Heat scored the first seven points of the game and raced to a 20-5 lead.", "Nikola Jovic beat the buzzer with a 3-pointer that gave the Heat a 36-24 lead at the end of the first quarter.", "Miami expanded the lead to 17 points before Murphy scored 13 points to help New Orleans close within 50-49.", "Butler and Herro each made a 3-pointer and the Heat took a 56-51 lead at halftime.", "Tyler Herro scored 32 points for the Heat who completely dominated the out of form New Orleans Pelicans in Miami.", "The Miami Heat defeated the New Orleans Pelicans by a final score of 119-108.", "Jimmy Butler was benched for the entire fourth quarter despite being reinserted into the starting lineup after a five-game absence.", "Erik Spoelstra noted that Butler's benching was due to his 13-day absence and the strong performance of the group on the floor.", "The hosts registered a 119-108 victory.", "Trey Murphy scored 25 of his team's 51 first-half points in Miami.", "Kel’el Ware capitalized on the opportunity to showcase his potential, particularly in the third quarter where his size and skills were pivotal in maintaining the Heat’s lead.", "Jimmy Butler and Duncan Robinson returned to the lineup, contributing to the team's performance.", "Tyler Herro continued his impressive run of scoring three-pointers.", "Jimmy Butler returned to the Miami Heat after a five-game absence and contributed to the 119-108 win over the Pelicans.", "Despite off-the-court distractions, Butler's performance against the Pelicans included nine points on just five shots.", "Tyler Herro scored 32 points.", "Bam Adebayo finished with 23 points, nine rebounds, and 10 assists.", "Trey Murphy III scored 34 points for the Pelicans.", "Jimmy Butler returned after a five-game absence due to illness and scored nine points.", "Herro made five straight three-pointers after missing his first four attempts."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Tyler Herro scored 32 points.", "Bam Adebayo finished with 23 points, nine rebounds, and 10 assists.", "Trey Murphy III scored 34 points for the Pelicans.", "Herro made five straight three-pointers after missing his first four attempts.", "The Pelicans have dropped 15 in a row on the road, marking the 100th time in NBA history that a team has had a road losing streak of 15 or more in the same season."], "ranking": [3, 2, 4, 5, 1]}
{"candidates": ["The game saw two promising rookies face off: Kel’el Ware of the Miami Heat and Yves Missi from the Pelicans.", "Coach Erik Spoelstra emphasized the importance of consistency and momentum despite earlier sanctions faced by the team.", "Heat coach Erik Spoelstra remained confident that Butler would give Miami a boost before the game against the Pelicans.", "The team maintained its intense walkthroughs upon returning from its three-game road trip."], "ranking": [3, 2, 1, 4]}
{"candidates": ["The Miami Heat will face the New Orleans Pelicans in NBA action at Kaseya Center on Thursday, beginning at 11:30am AEDT.", "Led by star players Jimmy Butler, Tyler Herro and Bam Adebayo, the Heat are looking to overcome a Pelicans team that includes Trey Murphy, Dejounte Murray and CJ McCollum.", "Stats Insider's independent predictive analytics model gives the Heat a 76% chance of winning against the Pelicans at Kaseya Center.", "The Heat are 9-point favourites against the Pelicans, with odds of $1.91 available at Bet365.", "According to Stats Insider's model, the Pelicans (+9) are predicted to cover the line 53% of the time, while the 220.5-point over/under is considered an equal 50-50 chance of hitting.", "Stats Insider's predicted final score for Heat vs Pelicans at Kaseya Center this Thursday is the Heat winning 114-105.", "Jimmy Butler is expected to lead the Heat with 21 points, 5 rebounds and 5 assists, while Trey Murphy is projected to finish with 21 points, 6 rebounds and 2 assists for the Pelicans."], "ranking": [7, 5, 4, 3, 2, 1, 6]}
{"candidates": ["Erik Spoelstra explained his decision to bench Jimmy Butler, citing Butler's long absence and the effective play of the group on the floor.", "Watch postgame video reaction from Willie Green and Trey Murphy (34 points).", "Spoelstra expressed his trust in Butler’s readiness, acknowledging the team’s efforts to build a consistent performance.", "The Miami Heat’s victory highlighted Kel’el Ware’s emerging talent and underscored the team’s resilience and focus on consistency.", "The Heat's focus remains on the court to maximize hopes of a sixth consecutive playoff appearance.", "Butler's presence is still productive enough to swing the Heat’s net rating by 7.6 points."], "ranking": [4, 6, 5, 1, 3, 2]}
{"candidates": ["The New Orleans Pelicans lost their 11th consecutive game and fell for the 20th time in 21 games.", "Guard Terry Rozier served a one-game suspension for his role in a skirmish in the final minute of a 104-100 victory at Houston on Sunday.", "The New Orleans Pelicans suffered their 11th-straight loss, making them the NBA's worst team with a 5-29 record.", "The Miami Heat improved their overall record to 17-14, placing them sixth in the Eastern Conference standings.", "The reunion of former teammates Corey Brewer, Butler, and Highsmith added a personal touch to the evening.", "Butler's scoring average is down to 18.5 points per game, but he has a career-high 55.2 percent shooting.", "Defensively, Butler remains among Miami’s leaders in loose balls recovered and deflections.", "The Pelicans have lost 15 consecutive road games, marking the 100th time in NBA history a team has had a road losing streak of 15 or more in the same season."], "ranking": [1, 5, 2, 6, 8, 4, 7, 3]}
{"candidates": ["The Pelicans lost for the 29th time in their last 32 games and are 1-20 in their last 21 contests.", "Jimmy Butler returned after a five-game absence due to illness and scored nine points."], "ranking": [1, 2]}
{"candidates": ["Anthony Edwards highlighted a 32-point performance with seven 3-pointers.", "Minnesota Timberwolves beat the New Orleans Pelicans 104-97.", "Zion Williamson returned from a 27-game absence.", "Julius Randle had 16 points, 6 rebounds, 3 assists, and 2 steals, going +21 during his 35 minutes.", "Randle played solid defense on New Orleans' Zion Williamson.", "Zion Williamson returned to play after missing 27 games with a hamstring injury and scored 22 points in 28 minutes.", "The New Orleans Pelicans lost 104-97 to the Minnesota Timberwolves.", "Zion Williamson scored 22 points in 28 minutes against Minnesota.", "The Timberwolves held on late for a 104-97 victory over the Pelicans.", "Dejounte Murray scored a team-best 29 points."], "ranking": [5, 8, 9, 4, 6, 1, 10, 3, 7, 2]}
{"candidates": ["Anthony Edwards highlighted a 32-point performance with seven 3-pointers.", "Zion Williamson returned from a 27-game absence and had 22 points, six rebounds, four assists, three steals, and a block in 27 minutes.", "Former Pelican Julius Randle scored 16 points and ex-LSU star Naz Reid had 13 points and 12 rebounds for Minnesota.", "Rudy Gobert had 14 rebounds and six blocks.", "Dejounte Murray scored 29 points for New Orleans.", "CJ McCollum, who scored 50 points just two games earlier, shot 1-of-14.", "Donte DiVincenzo started at point guard for a second straight night in place of Mike Conley.", "Edwards hit a free throw and a pair of 3s during a 19-2, third-quarter run that helped Minnesota turn a 64-57 deficit into a 75-66 lead in less than four minutes.", "Edwards shot 63.6% from 3-point range."], "ranking": [3, 1, 8, 6, 2, 5, 9, 4, 7]}
{"candidates": ["The Minnesota Timberwolves visit Yves Missi and the New Orleans Pelicans in Western Conference play Tuesday.", "The Pelicans are 3-17 in Western Conference games.", "New Orleans ranks fifth in the league with 12.4 offensive rebounds per game led by Missi averaging 3.8 offensive boards.", "The Timberwolves have gone 15-10 against Western Conference opponents.", "Minnesota is 9-7 in games decided by 10 points or more.", "The Pelicans are shooting 44.2% from the field this season, 1.7 percentage points lower than the 45.9% the Timberwolves allow to opponents.", "The Timberwolves average 15.1 made 3-pointers per game this season, 1.0 more made shot on average than the 14.1 per game the Pelicans allow.", "Missi is averaging 9.6 points and 8.4 rebounds for the Pelicans.", "Anthony Edwards is averaging 25.6 points, 5.7 rebounds and 4.1 assists for the Timberwolves.", "Pelicans' last 10 games: 2-8, averaging 113.7 points, 41.5 rebounds, 27.9 assists, 10.0 steals and 5.8 blocks per game while shooting 45.1% from the field. Their opponents have averaged 120.1 points per game.", "Timberwolves' last 10 games: 4-6, averaging 107.7 points, 43.9 rebounds, 24.7 assists, 6.4 steals and 4.4 blocks per game while shooting 45.6% from the field. Their opponents have averaged 114.0 points.", "Injuries for Pelicans: Brandon Ingram: out (ankle), Zion Williamson: day to day (hamstring), Dejounte Murray: day to day (elbow), Karlo Matkovic: day to day (back).", "Injuries for Timberwolves: Rob Dillingham: out (ankle).", "Zion Williamson will play against Minnesota tonight, marking his first game since November 6 due to a left hamstring strain.", "Dejounte Murray highlighted the impact of Williamson's return, noting that it will help open up shots for other players and himself.", "Murray expressed happiness for Williamson's return and acknowledged the challenges of recovering from an injury.", "Murray praised CJ McCollum for his recent performances, including a 50-point game against Washington.", "Minnesota's Anthony Edwards scored a career-high 53 points in a recent game against Detroit and followed it up with 37 points in a win over the Clippers.", "Edwards is tied for second in the NBA in clutch points with 70, trailing only Nikola Jokic."], "ranking": [15, 12, 10, 11, 9, 8, 7, 6, 5, 4, 3, 2, 1, 14, 13, 16, 17, 18, 19]}
{"candidates": ["Timberwolves head coach Chris Finch was pleased with Julius Randle's performance in Minnesota's win over the Pelicans.", "Finch noted that he has a lot of respect for how Randle has handled the different things the Wolves have asked him to do this season.", "Zion Williamson expressed his love for playing basketball and emphasized working hard despite trade rumors.", "Williamson acknowledged the need to quickly get back into playing rhythm for the team's benefit.", "Watch postgame video reaction from Williamson, Dejounte Murray, and Willie Green."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Minnesota is an elite perimeter shooting team, ranking in the top six in all major categories, including fifth in three-point makes and third in percentage.", "The Timberwolves have enjoyed lineup continuity with four starters appearing in all 35 games this season.", "The Pelicans have used 17 different starting lineups due to numerous injuries."], "ranking": [2, 3, 1]}
{"candidates": ["Isaiah Joe scored a career-high 31 points on 11-of-16 shooting and 8-of-11 from 3. The eight outside makes were also a career-high.", "Shai Gilgeous-Alexander passed Gary Payton for the second most games in franchise history with 30+ points on 70%+ shooting, behind Kevin Durant's 14 games"], "ranking": [1, 2]}
{"candidates": ["Isaiah Joe fired a career-high 31 points off the bench."], "ranking": [1]}
{"candidates": ["Isaiah Joe snapped out of a slump and scored a career-high 31 points.", "The Oklahoma City Thunder defeated the New York Knicks 126-101 at Madison Square Garden.", "The Thunder have won seven games in a row at MSG since 2017.", "Shai Gilgeous-Alexander scored 39 points.", "Isaiah Joe scored 31 points, including eight 3-pointers.", "The Knicks lost 126-101 to the Thunder.", "The Knicks allowed 126 or more points for the sixth time this season.", "Mikal Bridges struggled defensively against Gilgeous-Alexander.", "OG Anunoby missed all of his shots during the first half.", "Jalen Brunson has converted multiple 3s in a game just once since Dec. 21.", "Thunder 126, Knicks 101: Sparked by a 30-9 run spanning the 1st and 2nd quarters and a combined 70 points from Shai Gilgeous-Alexander (39 pts, 71.4% FG) and Isaiah Joe (31 pts, career-high 8 3pm)", "Isaiah Hartenstein received a warm reception in his return to MSG, before finishing with six points, nine boards, six dimes, two steals and two blocks", "Shai Gilgeous-Alexander scored 39 points in 29 minutes.", "Isaiah Joe added 23 of his 31 points in the first half.", "Oklahoma City Thunder had a 36-12 run in the first half en route to a 70-43 lead.", "Shai Gilgeous-Alexander racked up 39 points in three quarters.", "Isaiah Joe scored a season-high 31 points on 11-for-16 shooting.", "Oklahoma City Thunder's 126-101 road victory against the New York Knicks.", "The Thunder drained 10 3-pointers on 15 first-half attempts.", "Isaiah Joe shot 6-for-7 from three-point range before halftime.", "Joe finished with twice as many 3-pointers as the Knicks on 16 fewer attempts.", "Oklahoma City shot 14-for-27 from downtown on the night."], "ranking": [11, 5, 18, 7, 9, 4, 16, 14, 20, 1, 10, 6, 8, 3, 2, 15, 13, 12, 17, 19, 21, 22]}
{"candidates": ["Shai Gilgeous-Alexander scored 39 points in 29 minutes.", "Isaiah Joe added 23 of his 31 points in the first half.", "Oklahoma City had a 36-12 run in the first half en route to a 70-43 lead.", "Jalen Brunson scored 27 points and Karl-Anthony Towns had 23 for the Knicks.", "Oklahoma City closed the first quarter with a 12-0 spurt to lead 31-17.", "The Thunder unleashed a 19-5 run over more than six minutes of the second quarter to extend a 12-point lead to 55-29.", "Adding Oklahoma City's 37-19 advantage in the decisive fourth quarter last Friday to its 31-17 lead after the first period of this game, the Thunder outscored the Knicks 68-36 over consecutive quarters.", "Shai Gilgeous-Alexander scored 39 points in 29 minutes.", "Oklahoma City Thunder had a 36-12 run in the first half en route to a 70-43 lead.", "Isaiah Joe added 23 of his 31 points in the first half for the Thunder.", "Shai Gilgeous-Alexander scored 39 points in Oklahoma City's victory over the New York Knicks.", "Isaiah Joe contributed 31 points, including eight three-pointers, off the bench.", "Oklahoma City Thunder defeated the New York Knicks with a score of 126-101.", "The Thunder surged into a 31-17 lead after the first quarter and maintained their dominance throughout the game.", "Shai Gilgeous-Alexander scored 39 points in 29 minutes.", "Isaiah Joe added 23 of his 31 points in the first half.", "Oklahoma City Thunder had a 36-12 run in the first half en route to a 70-43 lead.", "Shai Gilgeous-Alexander outdueled Jalen Brunson as the Thunder rolled to a 126-101 rout of the Knicks.", "Alexander played like an MVP, dropping 39 points in just 29 minutes.", "A 3-pointer by Joe capped a 12-0 run by the Thunder to end the first quarter with a 14-point lead.", "Boos started to rain on the Knicks toward the end of the first half after they could only cough up 43 points, their second-lowest scoring first half this season.", "Oklahoma City extended it to as many as 30 in the second half to cruise to a West-best 31st victory in 37 games.", "Alexander blocked Brunson in one sequence in the second half, which epitomized the kind of rough night the Knicks had at the hands of the Thunder."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]}
{"candidates": ["Mark Daigneault expressed happiness for Isaiah Joe's performance, noting his confidence and consistency.", "Isaiah Joe emphasized the importance of staying consistent and having confidence in himself.", "Shai Gilgeous-Alexander praised Joe's shooting ability and predicted his slump would end.", "Jalen Williams highlighted Joe's hard work and dedication in the gym.", "Mikal Bridges emphasized the need to improve defense despite offensive struggles.", "Tom Thibodeau highlighted the need for multiple defensive efforts.", "Josh Hart mentioned the importance of executing and maintaining intensity.", "Jalen Brunson acknowledged the potential of the Knicks' defense.", "Karl-Anthony Towns noted that not all games will be perfect.", "Thunder coach Mark Daigneault commented on Isaiah Joe's performance, saying it opened up the game wider than usual.", "Isaiah Joe mentioned that the shots came within the flow of the game and offense."], "ranking": [8, 6, 5, 4, 3, 2, 9, 10, 11, 1, 7]}
{"candidates": ["Oklahoma City made it clear quickly it wasn't letting Wednesday's loss linger.", "Coach Mark Daigneault had an easy game despite not feeling well and wearing a mask at times.", "The Knicks were booed multiple times in the first half of perhaps the low point of their season, which featured an 0-for-9 night by Mikal Bridges.", "New York coach Tom Thibodeau said after the beatdown, 'We got into a big hole right away. We started flat. Our defense wasn’t very good.'", "Thibodeau owned the Knicks’ lackluster performance, saying, 'We have to be a lot better defensively, and it requires a lot more than what we did today. That's my responsibility. I gotta make sure we're ready to go.'", "Thibodeau reflected, 'I always have the belief that we can do better no matter what we do. And so, when you fall short, you have to take a look and start with yourself, and we ask yourself, ‘What you could do better?’ And then you go from there.'", "Thibodeau added, 'As a coach, that's what I have to do. As a player, that's what they have to do. And then we have to do it collectively. It's ‘We got into this together, we got to get out of it together.’"], "ranking": [5, 2, 6, 3, 1, 4, 7]}
{"candidates": ["Oklahoma City's win stretched their lead to 31-6 at the top of the Western Conference standings.", "Former Knicks backup center Isaiah Hartenstein, who left them in the offseason to sign a three-year, $87 million deal with the Thunder, returned to the Garden to a loud ovation and a video tribute.", "Hartenstein helped Oklahoma City with six points, nine rebounds, six assists, two steals and two blocks in his first game back in New York since he left.", "Karl-Anthony Towns saw his 32nd double-double (23 points and 10 rebounds) of the season go down the drain with the Knicks’ 14th loss in 39 games.", "The Knicks remained third in the Eastern Conference despite the loss.", "The Knicks have more firepower now after their couple of big trades in the offseason to land Towns and Bridges. But it cost them their depth and the Thibodeau signature defense.", "Entering the midway point of the season, their defense currently ranks 15th, six rungs below where they finished last season with less talent.", "Giannis Antetokounmpo and the Milwaukee Bucks will provide another litmus test for the Knicks on Sunday (Monday Manila time)."], "ranking": [3, 6, 5, 2, 8, 4, 7, 1]}
{"candidates": ["Deni Avdija scored 26 points, Shaedon Sharpe added 21 points, and the Portland Trail Blazers led wire to wire in a 119-100 victory over the New Orleans Pelicans.", "Anfernee Simons scored 17 points and Toumani Camara 15 for Portland.", "Deandre Ayton scored 11 points and grabbed 13 rebounds for the Blazers.", "CJ McCollum scored 23 points and Dejounte Murray 20 for New Orleans.", "Pelicans forward Herb Jones left the game in the third quarter because of a right shoulder injury.", "Pelicans' blowout loss to Trail Blazers marked another low point in their season."], "ranking": [1, 4, 5, 3, 6, 2]}
{"candidates": ["Zion Williamson is out for the game against Portland due to return to competition reconditioning.", "Brandon Ingram and Trey Murphy are also out for the mid-week Western Conference matchup due to left ankle sprains.", "Dejounte Murray is questionable for the Pelicans with right elbow soreness and right shin contusion.", "For Portland, Jerami Grant and Matisse Thybulle are out due to face contusion and right ankle injury respectively.", "Deni Avdija and Donovan Clingan are questionable for Portland with right wrist sprain and rest respectively.", "Stats Insider's prediction model gives the Pelicans a 57% chance of defeating the Trail Blazers at Smoothie King Center.", "The Pelicans are listed as 2-point favourites against the Trail Blazers, with odds of $1.91 available at Bet365.", "The over/under for total points scored is set at 223.5 with Bet365, which has odds of $1.91 for the over and $1.91 for the under.", "Stats Insider's predicted final score for Pelicans vs Trail Blazers at Smoothie King Center is the Pelicans winning 112-110.", "Dejounte Murray is expected to lead the Pelicans with 23 points, 6 rebounds and 9 assists.", "Deandre Ayton is projected to finish with 20 points, 13 rebounds and 2 assists for the Trail Blazers.", "Yves Missi and the New Orleans Pelicans host Deni Avdija and the Portland Trail Blazers in Western Conference play.", "The Pelicans are 3-18 in Western Conference games.", "The Trail Blazers have gone 10-20 against Western Conference opponents.", "Portland is seventh in the league with 12.3 offensive rebounds per game led by Deandre Ayton averaging 2.8.", "The Pelicans average 11.6 made 3-pointers per game this season, 2.4 fewer makes per game than the Trail Blazers give up (14.0).", "The Trail Blazers' 44.9% shooting percentage from the field this season is 3.5 percentage points lower than the Pelicans have allowed to their opponents (48.4%).", "CJ McCollum is shooting 44.9% and averaging 22.1 points for the Pelicans.", "Avdija is averaging 13.7 points, 6.1 rebounds and 3.2 assists for the Trail Blazers.", "Pelicans: 2-8 in their last 10 games, averaging 113.0 points, 41.2 rebounds, 28.4 assists, 10.1 steals and 5.9 blocks per game while shooting 44.9% from the field. Their opponents have averaged 118.6 points per game.", "Trail Blazers: 4-6 in their last 10 games, averaging 111.4 points, 44.6 rebounds, 25.6 assists, 7.2 steals and 4.5 blocks per game while shooting 47.6% from the field. Their opponents have averaged 118.7 points."], "ranking": [14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 15, 18, 17, 19, 20, 21]}
{"candidates": ["Portland shot 67.4% (31 of 46) through the first 24 minutes, setting a season high for a first half with 75 points."], "ranking": [1]}
{"candidates": ["Zion Williamson did not play due to a night off as he regains his conditioning after returning from a 27-game absence due to a strained hamstring.", "Portland shot 67.4% (31 of 46) through the first 24 minutes, setting a season high for a first half with 75 points.", "New Orleans played without Zion Williamson and Brandon Ingram due to injuries."], "ranking": [2, 1, 3]}
{"candidates": ["Injuries: Pelicans: Brandon Ingram: out (ankle).", "Injuries: Trail Blazers: Matisse Thybulle: out (ankle), Donovan Clingan: day to day (rest), Deni Avdija: day to day (wrist), Jerami Grant: out (face)."], "ranking": [2, 1]}
{"candidates": ["Magic center Wendell Carter Jr. scored a season-high 19 points against the Knicks at Madison Square Garden.", "The New York Knicks lost 103-94 to the Orlando Magic.", "The Knicks were 4-of-22 from three-point range, just over 18 percent.", "The Knicks hit three of their first six three-point attempts but missed their next 15.", "Cameron Payne hit a meaningless triple toward the end of the game.", "The three threes the Knicks had were tied for the lowest any team has hit in a single NBA game this season.", "Cole Anthony, Kentavious Caldwell-Pope, and Wendell Carter Jr. united to go 9-of-11 from deep for the Magic.", "The New York Knicks lost their third straight game to the injured Orlando Magic at Madison Square Garden by a 103-94 final.", "Orlando limited New York to just 17 points in the third quarter.", "Jalen Brunson tied for a team-high with 24 points but shot 8 of 21 from the field.", "Mikal Bridges also scored 24 points but struggled from three-point range, shooting 1-for-7.", "The Knicks shot 4 of 22 from three-point land.", "Cole Anthony scored a team-high 24 points for the Magic on 50% shooting, including 3 of 6 from beyond the arc.", "Kentavious Caldwell-Pope contributed 15 points for the Magic.", "Cole Anthony scored 24 points, Wendell Carter Jr. had a season-high 19 off the bench.", "The Orlando Magic limited the Knicks to 4-for-22 shooting from 3-point range and didn’t allow a make in the second half until Cam Payne’s basket with 8.2 seconds remaining.", "Jalen Brunson and Mikal Bridges each scored 24 points for the Knicks.", "The Knicks were held to their lowest point total of the season in their season-high third straight loss.", "The Knicks scored four straight points to get within six, then won a challenge to overturn a foul that was called on Josh Hart and get the ball back. But they didn’t score, and Caldwell-Pope and Carter made 3s in a 7-2 spurt that pushed it to 95-84 with 3:05 remaining."], "ranking": [1, 5, 3, 4, 18, 2, 6, 8, 10, 11, 12, 13, 14, 15, 7, 9, 16, 17, 19]}
{"candidates": ["Cole Anthony scored 14 out of a total of 24 points in the second half as Orlando Magic won over New York Knicks with a score of 103-94.", "Total Carter Jr. scored 19 points from the bench, while Kentavideny Badminton-Pope added 15 points and Jonathan Isaac contributed 13 points to Magic.", "Josh Hart recorded double-doubles with 15 points and 14 rebounds for the Knicks.", "Jalen Brunson and Mikal Bridges each contributed 24 points for the Knicks.", "Knicks recorded their lowest three-point shot percentage this season, only 18.2 percent (4 out of 22).", "Knicks failed to score three points in 15 consecutive attempts before Cameron Payne slotted a three-point shot at the last second.", "Jett Howard gave Magic a lead that was no longer overtaken by a three-point shot before the buzzer, making the score 53-51.", "Anthony scored eight points in the third quarter as Magic outperformed Knicks 22-17.", "Mikal Bridges brought the Knicks closer with a score of 83-78 through a jump shot at 7:53 in the fourth quarter.", "Badminton-Pope answered with a three-point shot, and Carter added two points after Bridges failed to score.", "Cole Anthony scored 24 points, Wendell Carter Jr. had a season-high 19 off the bench.", "The Magic limited the Knicks to 4-for-22 shooting from 3-point range and didn't allow a make in the second half until Cam Payne's basket with 8.2 seconds remaining.", "Jalen Brunson and Mikal Bridges each scored 24 points for the Knicks.", "The Knicks were held to their lowest point total of the season in their season-high third straight loss.", "The Magic outscored the Knicks 50-18 in bench points.", "The Knicks scored four straight points to get within six, then won a challenge to overturn a foul that was called on Josh Hart and get the ball back. But they didn't score, and Caldwell-Pope and Carter made 3s in a 7-2 spurt that pushed it to 95-84 with 3:05 remaining."], "ranking": [1, 5, 8, 2, 14, 15, 10, 6, 9, 4, 3, 2, 12, 11, 7, 13]}
{"candidates": ["Prior to the game, Jalen Suggs sent a text message to his coach emphasizing the need to change their mentality as they were 0-3 against the Knicks.", "Orlando was aware that they had failed in all their matchups against the Knicks in the past 34 days.", "Karl-Anthony Towns warmed up before the game but decided to sit out due to a hamstring injury.", "Duece McBride also missed the game due to injury.", "Karl-Anthony Towns is sidelined Monday night with a sore right knee, leaving the New York Knicks without the NBA's leading rebounder for their game against the Orlando Magic.", "Towns appeared to be hurting near the end of the Knicks' loss in Chicago on Saturday and was listed as questionable to play Monday. The Knicks decided before the game that he wouldn't.", "Towns is averaging 25.3 points and 14 rebounds in his first season with the Knicks.", "Jericho Sims was set to start at center.", "Orlando's injury problems are far worse, with the Magic still missing Paolo Banchero, Jalen Suggs, Franz Wagner and Moritz Wagner."], "ranking": [8, 6, 4, 3, 2, 5, 9, 1, 7]}
{"candidates": ["Karl-Anthony Towns is sidelined Monday night with a sore right knee, leaving the New York Knicks without the NBA's leading rebounder for their game against the Orlando Magic.", "Towns appeared to be hurting near the end of the Knicks' loss in Chicago on Saturday and was listed as questionable to play Monday. The Knicks decided before the game that he wouldn't.", "The New York Knicks will square off with the Orlando Magic in NBA action at Madison Square Garden on Tuesday, beginning at 11:30am AEDT.", "Led by star players Jalen Brunson, Mikal Bridges and Josh Hart, the Knicks are looking to overcome a Magic line-up that includes Cole Anthony, Goga Bitadze and Tristan da Silva.", "Stats Insider's prediction and tips for the Knicks vs Magic game include the latest betting odds and player props.", "Based on trusted computer power and data, Stats Insider has simulated the result of Tuesday's New York vs Orlando NBA match-up 10,000 times.", "Stats Insider's leading predictive analytics model gives the Knicks an 80% chance of winning against the Magic at Madison Square Garden.", "The latest betting odds in Australia for Tuesday's NBA game at Madison Square Garden are: Knicks $1.18, Magic $5.00.", "The Knicks are 10.5-point favourites against the Magic, with odds of $1.91 available at Bet365.", "For the underdog Magic (+10.5) to cover the line, Bet365 offers odds of $1.91.", "The over/under for total points scored is set at 207 with Bet365, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's model, the Magic (+10.5) are predicted to cover the line 55% of the time, while the 207-point over/under is expected to go over 52% of the time.", "Stats Insider's predicted final score for Knicks vs Magic at Madison Square Garden this Tuesday is the Knicks winning 109-99.", "This prediction is based on each team's average score from 10,000 game simulations.", "Jalen Brunson is expected to lead the Knicks with 27 points, 3 rebounds and 7 assists, while Cole Anthony is projected to finish with 12 points, 4 rebounds and 4 assists for the Magic.", "New York hosts the Orlando Magic after Karl-Anthony Towns scored 44 points in the New York Knicks' 139-126 loss to the Chicago Bulls.", "The Knicks are 17-8 in Eastern Conference games. New York has a 9-6 record against opponents over.500.", "The Magic are 17-10 in Eastern Conference play. Orlando is 2-2 in games decided by less than 4 points.", "The Knicks average 13.6 made 3-pointers per game this season, 2.3 more made shots on average than the 11.3 per game the Magic give up.", "The Magic average 11.5 made 3-pointers per game this season, 2.3 fewer made shots on average than the 13.8 per game the Knicks give up.", "Towns is averaging 25.3 points, 14 rebounds and 3.4 assists for the Knicks.", "Jalen Suggs is scoring 16.4 points per game and averaging 4.1 rebounds for the Magic.", "In their last 10 games, the Knicks are 8-2, averaging 121.5 points, 46.0 rebounds, 28.1 assists, 8.7 steals and 2.8 blocks per game while shooting 50.2% from the field. Their opponents have averaged 112.1 points per game.", "In their last 10 games, the Magic are 4-6, averaging 98.8 points, 39.7 rebounds, 23.8 assists, 9.2 steals and 6.3 blocks per game while shooting 42.8% from the field. Their opponents have averaged 102.8 points.", "Karl-Anthony Towns is sidelined Monday night with a sore right knee, leaving the New York Knicks without the NBA's leading rebounder for their game against the Orlando Magic."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["Josh Hart emphasized the importance of team focus and energy, stating, 'We've got to make sure we are focused, that we give off the right energy. We can't have our own individual agendas, can't do any of that. We've got to make sure we're locked in on this team, sacrificing on this team, and go out there and play.'", "Jalen Brunson reflected on the need to impact the game in other areas when shots aren't falling, saying, 'The ball's not going in for us but that shouldn't be the reason why we're not winning games. We've got to find a way to impact the game in other areas when we're not making shots and it starts with me.'", "The New York Knicks look tired and have played a heavy schedule recently.", "Tom Thibodeau's bench is thin, and the team needs reinforcements.", "Leon Rose must hit the phones for some reinforcements, while Thibodeau has to expand his bench."], "ranking": [2, 1, 5, 4, 3]}
{"candidates": ["Orlando avoided a four-game sweep by winning the final meeting, keeping the lead in the all-time series at 68-66."], "ranking": [1]}
{"candidates": ["Orlando avoided a four-game sweep by winning the final meeting, keeping the lead in the all-time series at 68-66."], "ranking": [1]}
{"candidates": ["Injuries for the Knicks: Karl-Anthony Towns: day to day (hamstring), Miles McBride: day to day (hamstring), Mitchell Robinson: out (ankle), Jalen Brunson: day to day (calf).", "Injuries for the Magic: Gary Harris: out (hamstring), Paolo Banchero: out (oblique), Jalen Suggs: out (back), Franz Wagner: out (oblique), Moritz Wagner: out for season (knee)."], "ranking": [2, 1]}
{"candidates": ["New Orleans (5-28) closed out the 2024 calendar year with a 116-113 defeat to the Los Angeles Clippers on Monday, also wrapping up a five-game homestand.", "Norman Powell scored 35 points.", "James Harden hit go-ahead free throws with 17.9 seconds left.", "Yves Missi missed a crucial free throw with 4.3 seconds left.", "Ivica Zubac won the tip back to Harden, who made two more free throws with less than two seconds remaining.", "CJ McCollum shot from half court and hit the front rim.", "Zubac finished with 20 points and 16 rebounds.", "McCollum hit eight 3s and led New Orleans with 33 points.", "Dejounte Murray had 13 points, 10 rebounds and six steals.", "Norman Powell scored 35 points, James Harden added 27, including four decisive free throws in the final minute, and the visiting Los Angeles Clippers defeated the New Orleans Pelicans 116-113.", "Ivica Zubac had 20 points and 16 rebounds and Derrick Jones Jr. scored 11 for the Clippers.", "CJ McCollum scored 33, Trey Murphy III and Herbert Jones had 18 each and Yves Missi scored 12 for the Pelicans.", "Dejounte Murray amassed 13 points, 10 rebounds, eight assists and six steals.", "Harden broke a tie by making two free throws with 17.9 seconds left. Missi was fouled with 4.3 seconds to go and made the first free throw but missed the second. Harden sank two more at the line with 1.8 seconds left.", "McCollum started the third-quarter scoring with back-to-back 3-pointers to give New Orleans a 68-56 lead.", "Powell’s 3-pointer and layup pushed the Clippers in front 112-108 with 3:01 remaining.", "Jones sank two free throws and McCollum made a layup to tie the score with 2:16 left.", "Powell and Harden lift the Clippers to a 116-113 comeback victory over the skidding Pelicans.", "The New Orleans Pelicans lost to the Los Angeles Clippers 116-113 on December 30, 2024.", "Dejounte Murray had one of his best games in a New Orleans uniform with 13 points, 10 rebounds, eight assists, and six steals."], "ranking": [10, 6, 4, 14, 5, 18, 7, 9, 3, 8, 11, 2, 15, 12, 16, 1, 17, 13, 19, 20]}
{"candidates": ["Norman Powell scored 35 points.", "James Harden hit go-ahead free throws with 17.9 seconds left.", "Ivica Zubac won the tip back to Harden, who made two more free throws with less than two seconds remaining.", "CJ McCollum shot from half court and hit the front rim.", "Zubac finished with 20 points and 16 rebounds.", "McCollum hit eight 3s and led New Orleans with 33 points.", "Trey Murphy's 3 made it 59-45 late in the second quarter.", "Dejounte Murray had 13 points, 10 rebounds and six steals."], "ranking": [5, 1, 2, 8, 6, 3, 7, 4]}
{"candidates": ["The New Orleans Pelicans will take on the Los Angeles Clippers in NBA action at Smoothie King Center on Tuesday, starting at 12:00pm AEDT.", "Led by star players Dejounte Murray, CJ McCollum and Trey Murphy, the Pelicans are looking to overcome a Clippers line-up that includes Norman Powell, James Harden and Ivica Zubac.", "Stats Insider's predictive analytics model gives the Clippers a 66% chance of winning against the Pelicans at Smoothie King Center.", "The current betting odds in Australia for Tuesday's NBA game at Smoothie King Center are: Pelicans $2.60, Clippers $1.53.", "The Pelicans are 4.5-point underdogs against the Clippers, with odds of $1.95 available at Bet365.", "For the favourite Clippers (-4.5) to cover the line, Bet365 offers odds of $1.87.", "The over/under for total points scored is set at 218.5 with Bet365, which has odds of $1.91 for the over and $1.91 for the under.", "Stats Insider's predicted final score for Pelicans vs Clippers at Smoothie King Center this Tuesday is the Clippers winning 111-106.", "Dejounte Murray is expected to step up for the Pelicans with 24 points, 6 rebounds and 8 assists, while Norman Powell is projected to have 21 points, 4 rebounds and 2 assists for the Clippers.", "New Orleans enters the matchup against Los Angeles as losers of nine straight games.", "The Pelicans are 3-16 against conference opponents.", "New Orleans has a 1-18 record in games decided by 10 points or more.", "The Clippers are 13-12 against Western Conference opponents.", "Los Angeles averages 109.4 points and has outscored opponents by 2.3 points per game.", "The Pelicans average 106.5 points per game, 0.6 fewer points than the 107.1 the Clippers allow.", "The Clippers are shooting 46.8% from the field, 1.7% lower than the 48.5% the Pelicans' opponents have shot this season.", "Brandon Ingram is shooting 46.5% and averaging 22.2 points for the Pelicans.", "James Harden is averaging 21.9 points, 6.4 rebounds, 8.1 assists and 1.5 steals for the Clippers.", "Pelicans: 1-9 in their last 10 games, averaging 113.4 points, 42.8 rebounds, 25.8 assists, 10.9 steals and 5.4 blocks per game while shooting 44.7% from the field. Their opponents have averaged 122.3 points per game.", "Clippers: 6-4 in their last 10 games, averaging 111.2 points, 40.7 rebounds, 23.2 assists, 10.3 steals and 5.1 blocks per game while shooting 47.7% from the field. Their opponents have averaged 108.9 points."], "ranking": [10, 8, 7, 6, 5, 4, 3, 2, 1, 14, 13, 12, 11, 9, 16, 15, 18, 17, 19, 20]}
{"candidates": ["Watch postgame reaction from Willie Green, CJ McCollum and Dejounte Murray.", "Dejounte Murray addressed the media postgame, stating, 'No excuses. A lot of things going on. Still trying to get healthy, dealing with little things, but at the end of the day I'm not that guy that's going to come to media when we lose, 'Oh I'm hurt and dealing with this or that'. That's the cop-out way.'"], "ranking": [2, 1]}
{"candidates": ["Clippers had advantages of 40-35 in rebounding, 56-44 in paint points and 21-11 in made free throws.", "Pelicans hit a season-best 18 3s in a game.", "The Clippers converted 14 offensive rebounds into 20 second-chance points."], "ranking": [2, 1, 3]}
{"candidates": ["Officials prematurely blew the whistle because they thought Missi's foul shot missed the rim.", "The Clippers converted 14 offensive rebounds into 20 second-chance points.", "The Clippers had advantages of 40-35 in rebounding, 56-44 in paint points and 21-11 in made free throws.", "The Pelicans hit a season-best 18 3s in a game."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The Pelicans have lost 10 straight games and all five games on their home stand.", "New Orleans is without key players Zion Williamson, Brandon Ingram, and Jose Alvarado due to injuries."], "ranking": [1, 2]}
{"candidates": ["Pelicans injuries: Brandon Ingram (ankle), Zion Williamson (hamstring), Karlo Matkovic (back), Jose Alvarado (hamstring).", "Clippers injuries: Terance Mann (finger), Kevin Porter Jr. (illness), Kobe Brown (back), Kawhi Leonard (knee), P.J. Tucker (personal)."], "ranking": [2, 1]}
{"candidates": ["Yuki Kawamura became the fourth Japanese born player to score in an NBA game."], "ranking": [1]}
{"candidates": ["Yuki Kawamura tallied his first NBA points at the free throw line.", "Ja Morant had a great reaction to Kawamura's first NBA points.", "The Memphis Grizzlies picked up a win over the Los Angeles Lakers.", "Ja Morant scored 20 points before leaving in the third quarter with a right hamstring injury.", "Rookie Jaylen Wells and Jaren Jackson Jr. also scored 20 points each for the Grizzlies.", "LeBron James led the Lakers with 39 points.", "Austin Reaves added 19 points despite going 2 for 9 from 3-point range.", "Memphis held a 72-68 lead in the third quarter when reserve Jay Huff connected on three consecutive 3-pointers, then capped the run off with an offensive rebound leading to a reverse dunk."], "ranking": [5, 6, 8, 3, 4, 2, 7, 1]}
{"candidates": ["Los Angeles Lakers (4-3, fifth in the Western Conference) vs. Memphis Grizzlies (4-4, 10th in the Western Conference).", "Memphis went 27-55 overall, 14-37 in Western Conference games and 9-32 at home during the 2023-24 season.", "The Grizzlies shot 43.5% from the field and 34.6% from 3-point range last season.", "Los Angeles went 47-35 overall and 27-25 in Western Conference action during the 2023-24 season.", "The Lakers averaged 118.0 points per game while shooting 49.9% from the field and 37.7% from deep last season.", "The Lakers played without starting center Anthony Davis, who was suffering from left heel soreness.", "Rui Hachimura was also out with an illness, giving rookie Dalton Knect from Tennessee his first NBA start.", "Grizzlies coach Taylor Jenkins missed the game because of a death in the family. Assistant coach Tuomas Iisalo led the team."], "ranking": [8, 5, 4, 6, 7, 3, 2, 1]}
{"candidates": ["Ja Morant clapped back at the Lakers' photo on social media, which went viral with over 570,000 views on X.", "Ja Morant expressed his disdain for the Lakers, stating, 'I don't like them. They knocked me out of the playoffs.'", "LeBron James downplayed the altercation, attributing it to competitive spirit.", "Morant celebrated the victory by posting a GIF of a man doing a Griddy dance, further taunting the Lakers after their defeat."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Ja Morant has been very supportive of Kawamura since they became teammates, and fans have loved the duo.", "This was a special night for Kawamura, and a big game for the Grizzlies.", "Lakers: With Davis out, Los Angeles was missing 32.6 points and 11.6 rebounds a game and a dominant force in the middle. James tried to make up for the scoring but got little help.", "Grizzlies: Davis' absence in the middle helped the Grizzlies stay right at their average scoring 60 points in the paint."], "ranking": [3, 2, 1, 4]}
{"candidates": ["The rivalry between the Memphis Grizzlies and Los Angeles Lakers continues to grow.", "The Grizzlies and the Lakers will meet again on November 13.", "The rivalry between the two teams has intensified after the Lakers defeated Memphis in the 2023 playoffs.", "The Lakers struggled in the absence of Anthony Davis and Rui Hachimura, finishing their road trip at 1-4.", "Memphis' victory marks a continuation of their strong performances, improving their season record to 5-4, while the Lakers fell to 4-4."], "ranking": [5, 1, 4, 3, 2]}
{"candidates": ["Memphis was shooting 48% from outside the arc at the midway point of the fourth period, while the Lakers were stuck at 25%."], "ranking": [1]}
{"candidates": ["Injuries for Grizzlies: John Konchar: day to day (quad), Desmond Bane: out (oblique), Luke Kennard: day to day (foot), Vince Williams Jr.: out (leg), Marcus Smart: out (ankle), GG Jackson II: out (foot), Cam Spencer: out (ankle).", "Injuries for Lakers: Jarred Vanderbilt: out (foot), Christian Wood: out (knee)."], "ranking": [2, 1]}
{"candidates": ["CJ McCollum tied a career-high with 50 points.", "CJ McCollum tied his career-high with 50 points.", "CJ McCollum made 10 three-pointers, tying his franchise high."], "ranking": [1, 2, 3]}
{"candidates": ["CJ McCollum delivered 50 points in one of the greatest offensive performances in Pelicans history.", "McCollum produced the fifth game of 50-plus points in 23 seasons of New Orleans basketball.", "CJ McCollum highlighted a career high-tying 50 points with 10 3-pointers.", "CJ McCollum tied a career-high with 50 points in just 30 minutes of play, tying an NBA record for 50 or more points and 10+ three-pointers in less than 35 minutes, joining Steph Curry and Klay Thompson to accomplish that."], "ranking": [1, 3, 2, 4]}
{"candidates": ["A moment of silence was held before the game in New Orleans due to a deadly New Year’s Day attack in the French Quarter."], "ranking": [1]}
{"candidates": ["CJ McCollum entered the game at 34 percent from beyond the arc this season.", "New Orleans was playing at home for the first time since a deadly New Year’s Day attack in the French Quarter, and a moment of silence was held before tipoff."], "ranking": [2, 1]}
{"candidates": ["Pelicans forward Trey Murphy expressed excitement over McCollum's performance, stating it was like watching the CJ McCollum he saw playing when he was in elementary school.", "Head coach Willie Green praised McCollum's performance, noting the variety and difficulty of the shots he made.", "McCollum reflected on his hard work and dedication, mentioning his motivation from his family.", "CJ McCollum reflected on his career night and the effort it took to get the Pelicans the victory.", "McCollum expressed the sacrifices he makes, including missing time with his family, to achieve success.", "McCollum acknowledged the season has not gone as expected but emphasized his commitment to leadership and hard work."], "ranking": [2, 5, 4, 1, 3, 6]}
{"candidates": ["The Pelicans tied a season-high with 18 made three-pointers, going 18 of 41.", "New Orleans benefitted from the return of reserve guard Jose Alvarado, who contributed five points, three assists, and three steals in 20 minutes after missing 23 games."], "ranking": [1, 2]}
{"candidates": ["The Pelicans snapped an 11-game losing streak with a 132-120 victory over the Washington Wizards.", "New Orleans benefitted from the return from injury of reserve guard Jose Alvarado, who contributed 5 points, 3 assists and 3 steals in 20 minutes after missing 23 games.", "The Wizards scored a season-high 72 points in the paint, only to have it virtually negated by shaky outside shooting and porous defense that allowed New Orleans a season high in points."], "ranking": [1, 3, 2]}
{"candidates": ["The Pelicans have the NBA's worst record at 6-29, now sharing the fewest victories in the league with Washington (6-26)."], "ranking": [1]}
{"candidates": ["Anthony Edwards set a record for the most three-pointers made in the first nine games of a season, with 50.", "Anthony Edwards becomes only the second player after Stephen Curry to sink 50 threes in the first nine games of the season.", "Anthony Edwards became only the second player after Stephen Curry to make 50 threes in the first nine games of the season.", "Anthony Edwards matched his season high with 37 points.", "Rudy Gobert grabbed his 9,000th career rebound."], "ranking": [2, 1, 3, 5, 4]}
{"candidates": ["The Minnesota Timberwolves will face the Portland Trail Blazers in NBA action at Target Center on Saturday, beginning at 1:00pm AEDT.", "With star players Anthony Edwards, Julius Randle and Naz Reid, the Timberwolves are up against a Trail Blazers side that includes Jerami Grant, Deandre Ayton and Anfernee Simons.", "Stats Insider's prediction and tips for the Timberwolves vs Trail Blazers game, as well as the latest betting odds and player props.", "Based on trusted computer power and data, Stats Insider has simulated the outcome of Saturday's Minnesota vs Portland NBA game 10,000 times.", "Our independent predictive analytics model gives the Timberwolves an 82% chance of winning against the Trail Blazers at Target Center.", "The current betting odds in Australia for Saturday's NBA game at Target Center are shown here: Head to Head: Timberwolves $1.13, Trail Blazers $6.25. Line: Timberwolves -12 ($1.91), Trail Blazers +12 ($1.91). Total (Over/Under 220 Points): Over $1.91, Under $1.91.", "According to Stats Insider's model, the Trail Blazers (+12) are predicted to cover the line 55% of the time, while the 220-point over/under is expected to go over 51% of the time.", "Stats Insider's predicted final score for Timberwolves vs Trail Blazers at Target Center this Saturday is the Timberwolves winning 115-104.", "Anthony Edwards is expected to lead the Timberwolves with 25 points, 6 rebounds and 5 assists, while Jerami Grant is projected to have 19 points, 3 rebounds and 3 assists for the Trail Blazers.", "The NBA game between the Timberwolves and Trail Blazers at Target Center is scheduled to begin at 1:00pm AEDT on Saturday."], "ranking": [10, 8, 6, 5, 4, 3, 2, 1, 9, 7]}
{"candidates": ["Anthony Edwards addressed concerns about taking too many threes per game, expressing confidence in his shot selection.", "Edwards expressed surprise at the defensive strategy of the Blazers, who allowed him to shoot over a dozen three-point attempts.", "Anthony Edwards expressed his surprise and satisfaction with teams leaving him open for 3-point shots, stating he will continue to take advantage of it.", "Anthony Edwards expressed surprise at the defensive strategy of the Portland Trail Blazers, which allowed him to take numerous three-point shots.", "Edwards emphasized his commitment to continue shooting if defenders keep going under screens.", "Anthony Edwards commented on his performance, saying, 'I'm not like shocked or anything because I worked so hard for it.'"], "ranking": [4, 5, 2, 3, 6, 1]}
{"candidates": ["Portland was playing its eighth game in seven different cities in 13 days.", "The Timberwolves made a season-high 22 3-pointers on 50 attempts.", "The Blazers were held scoreless for the first 5:12 of the game, missing 11 field-goal attempts in that stretch.", "The game was played at Target Center in Minneapolis.", "The sold-out Target Center crowd was electric when Rob Dillingham drilled a 3-pointer."], "ranking": [3, 1, 2, 5, 4]}
{"candidates": ["Victor Wembanyama scored 34 points for the San Antonio Spurs.", "Donte' DiVincenzo scored 26 points for the Minnesota Timberwolves.", "San Antonio Spurs only netted 12 points in the second quarter.", "San Antonio Spurs won the third quarter 37-25.", "Minnesota Timberwolves out-rebounded the San Antonio Spurs by 15 rebounds.", "Chris Paul recorded 14 assists for the San Antonio Spurs.", "Donte DiVincenzo scored 26 points as the Minnesota Timberwolves defeated the San Antonio Spurs 112-110.", "Rudy Gobert had 17 points and 15 rebounds for the Timberwolves.", "Julius Randle had 16 points, while Jaden McDaniels added 12 points and 10 boards for Minnesota.", "Anthony Edwards was held to 14 points, 11 below his season average.", "Wembanyama led San Antonio with 34 points and eight rebounds.", "Harrison Barnes had 24 points, Devin Vassell had 22 and Chris Paul dished out 14 assists.", "With 4:44 to play and the game tied at 101, Randle made a driving layup against Wembanyama that was initially whistled for an offensive foul. Timberwolves coach Chris Finch challenged the call, and the basket was allowed to stand.", "After DiVincenzo made one of two free throws with 12.1 seconds left, the Spurs had one more possession down 112-110. San Antonio found a wide-open Jeremy Sochan for 3, but he came up short.", "Donte DiVincenzo scored 26 points as the Minnesota Timberwolves defeated the San Antonio Spurs 112-110.", "Rudy Gobert had 17 points and 15 rebounds for the Timberwolves.", "Julius Randle had 16 points, while Jaden McDaniels added 12 points and 10 boards for Minnesota.", "Victor Wembanyama led San Antonio with 34 points and eight rebounds.", "Harrison Barnes had 24 points, Devin Vassell had 22 and Chris Paul dished out 14 assists.", "Victor Wembanyama missed a free throw late in the second half."], "ranking": [10, 9, 18, 16, 14, 12, 1, 8, 11, 15, 2, 5, 3, 4, 6, 8, 11, 2, 13, 17]}
{"candidates": ["Donte DiVincenzo scored 26 points as the Minnesota Timberwolves defeated the San Antonio Spurs 112-110.", "Rudy Gobert had 17 points and 15 rebounds for the Timberwolves.", "Julius Randle had 16 points, while Jaden McDaniels added 12 points and 10 boards for Minnesota.", "Anthony Edwards was held to 14 points, 11 below his season average.", "Wembanyama led San Antonio with 34 points and eight rebounds.", "Harrison Barnes had 24 points, Devin Vassell had 22 and Chris Paul dished out 14 assists.", "With 4:44 to play and the game tied at 101, Randle made a driving layup against Wembanyama that was initially whistled for an offensive foul. Timberwolves coach Chris Finch challenged the call, and the basket was allowed to stand. Minnesota didn't trail the rest of the way."], "ranking": [7, 3, 4, 2, 6, 5, 1]}
{"candidates": ["Minnesota survived a brutal shooting night from 3-point range, making just 11 of 44 attempts from beyond the arc.", "In the first quarter, the Timberwolves made just 1 of 11 3-point attempts but went 9 for 9 inside the arc."], "ranking": [1, 2]}
{"candidates": ["Minnesota survived a brutal shooting night from 3-point range, making just 11 of 44 attempts from beyond the arc.", "In the first quarter, the Timberwolves made just 1 of 11 3-point attempts but went 9 for 9 inside the arc."], "ranking": [1, 2]}
{"candidates": ["Donovan Mitchell scored 30 points including a jumper with three-tenths of a second left to secure the victory.", "Damian Lillard had a brilliant performance with 41 points, nine assists, and shot 10 of 15 from 3-point range.", "Giannis Antetokounmpo contributed 34 points, 16 rebounds, and nine assists for the Bucks.", "The Bucks played without Khris Middleton, who is recovering from surgery on his ankles.", "Donovan Mitchell scored the game-winning basket at the buzzer.", "Damian Lillard scored 41 points for the Milwaukee Bucks.", "Donovan Mitchell scored 30 points including a jumper with three-tenths of a second left to secure the win for the Cleveland Cavaliers.", "Damian Lillard had a brilliant performance with 41 points, nine assists, and shot 10 of 15 from 3-point range.", "Giannis Antetokounmpo contributed 34 points, 16 rebounds, and nine assists for the Bucks.", "Lillard put Milwaukee ahead with a step-back jumper with 9.8 seconds remaining.", "Mitchell regained possession after briefly losing control and hit a 19-footer to win the game.", "Donovan Mitchell sank a jumper with only three-tenths of a second remaining, sealing the win for the Cavaliers.", "Damian Lillard and Giannis Antetokounmpo combined for 75 points, each shooting around 55 percent from the field.", "Milwaukee Bucks shot a remarkable 46% from beyond the arc."], "ranking": [7, 2, 3, 14, 6, 12, 1, 2, 3, 5, 4, 1, 9, 11]}
{"candidates": ["Damian Lillard finished with 41 points, four rebounds, and nine assists.", "Lillard went 13-for-24 from the field, including 10-for-15 from beyond the arc.", "Lillard hit the go-ahead jump shot with 9.8 seconds left to give the Bucks the lead.", "Donovan Mitchell made the game-winning shot with 0.3 seconds remaining to secure a 114-113 win for the Cavaliers.", "Donovan Mitchell scored 30 points including a jumper with three-tenths of a second left to secure the win for the Cavaliers.", "Damian Lillard had a brilliant performance with 41 points and nine assists, shooting 10 of 15 from 3-point range.", "Giannis Antetokounmpo contributed 34 points, 16 rebounds, and nine assists for the Bucks.", "Lillard put Milwaukee ahead with a step-back jumper with 9.8 seconds remaining.", "Mitchell regained possession after briefly losing control and hit a 19-footer to win the game."], "ranking": [6, 5, 8, 1, 2, 7, 4, 3, 9]}
{"candidates": ["Eastern Conference foes Cleveland and Milwaukee face off.", "Cleveland finished 48-34 overall, 11-5 in Central Division play and 26-15 at home last season.", "The Cavaliers averaged 16.6 points off of turnovers, 13.6 second-chance points and 34.4 bench points last season.", "Milwaukee finished 49-33 overall and 34-18 in Eastern Conference games during the 2023-24 season.", "The Bucks averaged 119.0 points per game last season, 47.1 in the paint, 14.5 off of turnovers and 12.7 on fast breaks.", "Cavaliers' injuries: Caris LeVert (day to day, knee), Emoni Bates (out, knee), Max Strus (out, ankle).", "Bucks' injury: Khris Middleton (out, ankle)."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["The Milwaukee Bucks will take on the Cleveland Cavaliers in NBA action at Fiserv Forum on Sunday, starting at 11:00am AEDT.", "With star players Giannis Antetokounmpo, Damian Lillard and Bobby Portis, the Bucks are aiming to beat a Cavaliers team that includes Donovan Mitchell, Darius Garland and Evan Mobley.", "Stats Insider's predictive analytics model currently gives the Bucks a 59% chance of beating the Cavaliers at Fiserv Forum.", "The Bucks are 2-point favourites against the Cavaliers, with odds of $1.95 available at Bet365.", "The over/under for total points scored is set at 230.5 with Bet365, which has odds of $1.91 for the over and $1.91 for the under.", "Stats Insider's predicted final score for Bucks vs Cavaliers at Fiserv Forum this Sunday is the Bucks winning 116-113.", "Giannis Antetokounmpo is expected to step up for the Bucks with 35 points, 12 rebounds and 8 assists, while Donovan Mitchell is projected to finish with 26 points, 5 rebounds and 6 assists for the Cavaliers."], "ranking": [7, 5, 4, 3, 2, 6, 1]}
{"candidates": ["The Milwaukee Bucks endured a heartbreaking defeat against the Cleveland Cavaliers, losing 114-113.", "This marks the Bucks' fifth consecutive loss, leaving them with a disappointing 1-5 record through six games.", "Head coach Doc Rivers made a notable change to the rotation, giving rookie Andre Jackson Jr. extended minutes over Pat Connaughton."], "ranking": [2, 1, 3]}
{"candidates": ["Damian Lillard's 41-point effort was wasted as the Milwaukee Bucks suffered their fifth-straight defeat.", "The Bucks will need to play much better to get out of their losing streak as they face the Cavaliers again on Monday."], "ranking": [1, 2]}
{"candidates": ["The Cleveland Cavaliers are now 7-0 and one win away from matching their best start in franchise history.", "The Milwaukee Bucks have lost five straight games since winning their opener.", "Lillard's 10 3-pointers were his most since joining the Bucks last season.", "The teams are set to meet again on Monday in Cleveland.", "Cleveland Cavaliers remain undefeated in the current NBA season with a 7-0 record.", "The Cleveland Cavaliers are one win away from matching their best start in franchise history, having won their first eight games in 1976-77.", "Milwaukee Bucks have lost five straight games since winning their opener.", "The Bucks played without Khris Middleton, who is recovering from surgery on his ankles."], "ranking": [1, 7, 4, 8, 2, 3, 6, 5]}
{"candidates": ["The Cavaliers are one win away from matching their best start in franchise history, having won their first eight games in 1976-77.", "Milwaukee has lost five straight games since winning its opener.", "The Bucks played without Khris Middleton, who is recovering from surgery on his ankles.", "The teams will meet again on Monday in Cleveland."], "ranking": [1, 3, 2, 4]}
{"candidates": ["Cleveland Cavaliers improved to a franchise-record 9-0 via a 131-122 victory.", "For the first time in its 55-year history, the Cleveland Cavaliers have kicked off an NBA season with an impressive 9-0 record.", "Coach Kenny Atkinson became the first coach in league history to achieve a 9-0 record in his first year with a new team.", "The Cavaliers are leading the NBA in field goal percentage with 52.6% so far this season.", "The Cavaliers have scored 110 points or more in each of their first nine games, a feat previously accomplished only by the 1960-61 Warriors.", "The Cavs' 9-0 start to the 2024-25 season is the best in franchise history, surpassing any start during LeBron James' tenure."], "ranking": [2, 1, 3, 6, 5, 4]}
{"candidates": ["Zion Williamson scored 29 points.", "Jose Alvarado scored 27 points with a perfect 7/7 three-point shooting.", "The Cavaliers defeated the New Orleans Pelicans 131-122 to reach the historic 9-0 mark.", "Donovan Mitchell scored 29 points in the game against the Pelicans.", "The Cleveland Cavaliers defeated the New Orleans Pelicans 131-122 on the road.", "The Cavs made 17 three-pointers as a team, with significant contributions from Sam Merrill, Georges Niang, and Caris LeVert off the bench."], "ranking": [3, 5, 1, 4, 2, 6]}
{"candidates": ["The New Orleans Pelicans will take on the favoured Cleveland Cavaliers in NBA action at Smoothie King Center on Thursday, beginning at 12:00pm AEDT.", "With star players Zion Williamson, Brandon Ingram and Jordan Hawkins, the Pelicans are looking to overcome a Cavaliers line-up that includes Donovan Mitchell, Darius Garland and Evan Mobley.", "Stats Insider's independent predictive analytics model gives the Cavaliers a 72% chance of defeating the Pelicans at Smoothie King Center.", "The latest betting odds in Australia for Thursday's NBA game at Smoothie King Center show the Pelicans at $3.10 and the Cavaliers at $1.38.", "The Pelicans are 6.5-point underdogs against the Cavaliers, with odds of $1.91 available at Bet365.", "For the favourite Cavaliers (-6.5) to cover the line, Bet365 offers odds of $1.91.", "The over/under for total points scored is set at 225 with Bet365, which has odds of $1.91 for the over and $1.91 for the under.", "Stats Insider's predicted final score for Pelicans vs Cavaliers at Smoothie King Center on Thursday is the Cavaliers winning 115-109.", "Zion Williamson is expected to lead the Pelicans with 26 points, 6 rebounds and 6 assists, while Donovan Mitchell is projected to finish with 22 points, 4 rebounds and 5 assists for the Cavaliers.", "New Orleans Pelicans (3-5, 14th in the Western Conference) will face Cleveland Cavaliers (8-0, first in the Eastern Conference) in a non-conference matchup on November 7, 2024.", "The Pelicans had a 49-33 overall record with a 21-19 home record during the 2023-24 season.", "The Cavaliers had a 48-34 overall record, 31-21 in Eastern Conference play, and 22-19 on the road last season.", "Key injuries for the Pelicans include Trey Murphy III (hamstring), CJ McCollum (adductor), Herbert Jones (shoulder), Dejounte Murray (hand), and Zion Williamson (hamstring).", "Key injuries for the Cavaliers include Dean Wade (illness), Caris LeVert (knee), Emoni Bates (knee), Max Strus (ankle), and Jaylon Tyson (hip)."], "ranking": [12, 2, 8, 10, 11, 9, 7, 1, 3, 4, 5, 6, 13, 14]}
{"candidates": ["Watch postgame video reaction from Willie Green, Zion Williamson, and Jose Alvarado.", "Coach Kenny Atkinson highlighted his team's consistency in all aspects of the game and acknowledged the contribution of each player.", "Donovan Mitchell emphasized teamwork and a focus on consistency, praising Atkinson's leadership style.", "The Cavs' role players have been phenomenal, and the team hopes to remain healthy and maintain their strong start.", "The 9-0 start indicates that the Cavs should be considered serious championship contenders."], "ranking": [5, 3, 4, 2, 1]}
{"candidates": ["Anthony Edwards expressed frustration after the 118-115 loss to the Boston Celtics due to being double-teamed and forced to pass the ball.", "Derrick White scored 26 points, shooting 5-of-10 both from inside and outside the arc.", "White grabbed two rebounds, handed out two assists, and blocked two shots in 37 minutes of action.", "White limited Anthony Edwards to 15 points on 5-of-16 shooting, including 2-for-9 from 3-point range.", "White scored 13 points in the fourth quarter, including a fadeaway bank-shot dagger that put Boston ahead by eight points with two minutes remaining.", "Jayson Tatum flirted with a triple-double, racking up 33 points, nine assists, and eight boards to lift the Boston Celtics to a 118-115 win over the Minnesota Timberwolves.", "Derrick White scored 26 points for Boston, while Sam Hauser hit five three-pointers and scored 15 points.", "Julius Randle led Minnesota with 27 points, eight rebounds and seven assists.", "Naz Reid added 20 points off the bench, while Jaden McDaniels had 19 points and eight boards.", "The Timberwolves trailed by eight with two minutes to play but had a chance to send it into overtime. However, Anthony Edwards’ three-pointer fell short at the buzzer.", "In a notable 118-115 victory against the Minnesota Timberwolves, Boston was led by Jayson Tatum's 33 points and Derrick White's 26 points.", "Jayson Tatum contributed significantly with nine assists and eight rebounds, showcasing his all-around game.", "Boston Celtics defeated Minnesota Timberwolves 118-115.", "Anthony Edwards was held to 15 points on 5-16 shooting by the Celtics' defense.", "Jrue Holiday effectively guarded Anthony Edwards, holding him to 2-9 from the 3-point line."], "ranking": [5, 10, 12, 8, 2, 1, 9, 7, 11, 6, 4, 15, 14, 3, 13]}
{"candidates": ["The Boston Celtics held Anthony Edwards to six shots in the second half and 15 points total in their tough 118-115 road win at the Timberwolves.", "Boston Celtics began 2025 with an elite performance against Anthony Edwards and the Minnesota Timberwolves.", "Boston entered another shorthanded situation with starters Jaylen Brown (right shoulder strain) and Kristaps Porzingis (left ankle sprain) both ruled out.", "Jayson Tatum had 33 points, nine assists, and eight rebounds.", "Derrick White scored 26 points for Boston.", "Sam Hauser hit five 3-pointers and scored 15 points.", "Julius Randle led Minnesota with 27 points, eight rebounds, and seven assists.", "Naz Reid added 20 points off the bench.", "Jaden McDaniels had 19 points and eight boards.", "Anthony Edwards' 3-pointer fell short at the buzzer.", "Boston committed just four turnovers while the Timberwolves turned it over 16 times.", "Jayson Tatum had 33 points, nine assists, and eight rebounds.", "Derrick White scored 26 points for Boston.", "Sam Hauser hit five 3-pointers and scored 15 points."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 4, 5, 6]}
{"candidates": ["Minnesota Timberwolves have gone 9-6 in home games and are 6-2 in games decided by less than 4 points.", "Boston Celtics are 11-3 on the road and 9-4 against opponents with a winning record.", "The Timberwolves average 14.9 made 3-pointers per game this season, 2.3 more than the Celtics allow.", "The Celtics average 12.2 more points per game (119.6) than the Timberwolves give up to opponents (107.4).", "Anthony Edwards is shooting 44.3% and averaging 24.8 points for the Timberwolves.", "Jayson Tatum is scoring 28.3 points per game with 9.5 rebounds and 5.5 assists for the Celtics."], "ranking": [3, 2, 5, 1, 4, 6]}
{"candidates": ["Anthony Edwards discussed his difficulty staying engaged when double-teamed, despite it being the right play to make.", "The Minnesota Timberwolves' offense has struggled this season after trading Karl-Anthony Towns, with Anthony Edwards facing increased defensive pressure.", "Boston's head coach Joe Mazzulla praised Derrick White for his ability to impact the game whether heavily involved on offense or not.", "White expressed in a postgame interview that he hadn't been pleased with his recent performances but felt he regained his confidence in this game.", "Mazzulla emphasized reminding White of his greatness to help him overcome shooting struggles.", "Anthony Edwards expressed frustration with the Celtics' defense, stating it was difficult to beat two NBA players.", "Edwards acknowledged that he had to pass the ball more than he wanted due to the Celtics' defensive tactics."], "ranking": [5, 2, 4, 3, 6, 1, 7]}
{"candidates": ["A victory in Minnesota was a great way for Boston to kick off a four-game road trip to start 2025.", "Minnesota began the week with a chance to test itself against one of the heavy hitters in each conference."], "ranking": [2, 1]}
{"candidates": ["The Celtics' victory against the Timberwolves marked the beginning of a four-game road trip, providing a much-needed boost after struggling with an 8-6 record in December."], "ranking": [1]}
{"candidates": ["With the Celtics leading 46-45 midway through the second quarter, Tatum hit the second of two free throws, then drained 3-pointers on Boston's next two possessions.", "That was part of a 16-6 run to close the second quarter, sending the Celtics into the locker room with a 62-51 lead."], "ranking": [2, 1]}
{"candidates": ["The New York Knickerbockers defeated the Charlotte Hornets by a final score of 111-105.", "Precious Achiuwa finished with 20 points and 16 rebounds.", "Deuce McBride scored 18 points and had 5 assists.", "Cam Payne contributed 16 points and 8 assists.", "New York Knicks guard Landry Shamet suffered a serious shoulder injury during their 111-105 preseason victory over the Charlotte Hornets.", "Shamet injured his right shoulder reaching for a steal on an entry pass during the third quarter and did not return to the game.", "TJ Warren scored 11 points and grabbed seven rebounds in 19 minutes of action against Charlotte.", "Tyler Kolek contributed seven points, nine assists, and eight rebounds in 24 minutes of action.", "Cameron Payne scored 16 points, adding eight assists and five rebounds.", "Miles McBride posted 18 points and five assists with a team-best +12 plus/minus in the 111–105 win over Charlotte."], "ranking": [5, 8, 9, 7, 2, 3, 10, 6, 4, 1]}
{"candidates": ["Head coach Tom Thibodeau praised Landry Shamet for having a terrific camp throughout the preseason.", "The Knicks will likely have to replace Shamet on the active roster and potentially his spot in the rotation due to his injury."], "ranking": [1, 2]}
{"candidates": ["Giannis Antetokounmpo scored the first four points of the game and made a massive chase-down block on LeBron James at the start of the second quarter.", "Bobby Portis made his first five 3-point attempts and tallied 23 points and three rebounds in 14 minutes in the first half.", "AJ Johnson used his speed to create an advantage and made a significant impact after entering the game earlier than expected.", "The Los Angeles Lakers won their third preseason game against the Milwaukee Bucks with a score of 107-102.", "Bronny James played for six minutes and finished scoreless, shooting 0/4 from the field.", "LeBron James helped the Lakers notch a 107-102 win against the Bucks.", "LeBron James finished with 11 points, six rebounds, and four assists.", "LeBron James, along with other starters, sat out after the first half, while Bronny James entered during the second half.", "Quincy Olivari stood out with his relentless energy, strong defense, rebounding, and impressive 3-point shooting in the Lakers' 107-102 win against the Milwaukee Bucks.", "Olivari hit crucial shots and showcased his relentless full-court defense and hustle, making a significant impact on both ends of the floor.", "In just 9 minutes and 24 seconds of play, Quincy Olivari scored 11 points on 4-of-6 shooting, including 3-of-6 from 3-point range, grabbed five rebounds, and handed out two assists.", "LeBron James contributed 11 points, six rebounds, and four assists in 16 minutes of action.", "Anthony Davis added 11 points, eight rebounds, and three blocks in his 25 minutes of play.", "Rui Hachimura put up 14 points and collected five rebounds.", "Dalton Knecht chipped in with 13 points and eight rebounds.", "Gabe Vincent scored eight points on efficient 3-of-5 shooting.", "The Lakers put together a 9-2 scoring run to even the game after Milwaukee rested Giannis Antetokounmpo and Damian Lillard.", "The Lakers' bench fought back from a 15-point deficit, with Quincy Olivari and Maxwell Lewis knocking down 3-pointers to regain the lead.", "The Lakers' scoring spree reached 20 unanswered points before the Bucks broke the drought."], "ranking": [1, 2, 3, 14, 15, 5, 6, 7, 4, 8, 9, 10, 11, 12, 13, 16, 17, 18, 19]}
{"candidates": ["LeBron James expressed some frustration about traveling to Milwaukee for the LA Lakers' third preseason game against the Bucks."], "ranking": [1]}
{"candidates": ["Doc Rivers expressed satisfaction with the effort level throughout the game despite it being a preseason match.", "Bobby Portis credited his strong preseason performance to his hard work over the summer.", "Portis emphasized the importance of finding the right speed to play effectively in the NBA.", "Many fans were critical of Bronny James' performance on social media, highlighting his poor statistics and decision-making.", "LeBron James shared how Bronny’s presence motivates him, stating, 'It's a pure joy to be able to come to work every day, put in the hard work, work with your son every day and be able to see him continue to grow.'", "JJ Redick praised Quincy Olivari for his exceptional effort and game-changing performance.", "LeBron James praised Quincy Olivari for his game-changing performance and acknowledged how the young guard made the most of his opportunity."], "ranking": [5, 4, 3, 2, 7, 6, 1]}
