{"candidates": ["New Zealand's highest World Cup total of 401 runs.", "Fakhar Zaman smashed Pakistan’s fastest-ever century in a World Cup.", "Fakhar Zaman hit 18 sixes in 3 innings, the third most in World Cup 2023 behind Rohit Sharma and David Warner.", "Rachin Ravindra went past 500 runs in the World Cup with a 94-ball 108.", "New Zealand recorded 401 for six, the highest total at the M. Chinnaswamy Stadium.", "Fakhar Zaman scored Pakistan's fastest-ever World Cup century off 63 balls.", "New Zealand made their highest score ever in a World Cup with 401 runs.", "Shaheen Afridi bowled the most expensive spell in Pakistan's World Cup history with figures of 10-0-90-0.", "Haris Rauf bowled the second most expensive spell in Pakistan's World Cup history with figures of 10-0-85-1.", "Fakhar Zaman made history by smashing the fastest century for Pakistan in World Cup history."], "ranking": [8, 1, 6, 9, 7, 2, 5, 4, 3, 10]}
{"candidates": ["New Zealand amassed 401 - their highest World Cup total.", "Shaheen Afridi's 10-0-90-0 is the most expensive spell by a Pakistani in World Cup history."], "ranking": [1, 2]}
{"candidates": ["Fakhar Zaman smashed an unbeaten 126 in 81 balls.", "Rachin Ravindra scored a century.", "Kane Williamson scored 95.", "Pakistan won by 21 runs (DLS method).", "Glenn Phillips propelled New Zealand in the death overs with 41 runs off 25 balls.", "Williamson took a brilliant catch to dismiss Abdullah Shafique.", "Hasan Ali broke the dangerous opening stand by dismissing Devon Conway."], "ranking": [1, 5, 4, 2, 6, 3, 7]}
{"candidates": ["Pakistan's decision to field first raised eyebrows on a flat wicket.", "Pakistan won the toss and chose to bowl first."], "ranking": [1, 2]}
{"candidates": ["Mumtaz on Fakhar's knock: 'Pakistan's dreams and hopes alive due to one man'.", "Fakhar Zaman described his century as one of his best.", "Babar Azam emphasized the importance of building a partnership with Zaman.", "Babar Azam praised Fakhar Zaman for his performance and emphasized the importance of building partnerships.", "Kane Williamson acknowledged Fakhar Zaman's exceptional knock and mentioned the impact of weather on the match.", "Fakhar Zaman expressed his satisfaction with his innings and highlighted the team's aggressive mindset.", "Pakistan skipper Babar Azam praised Fakhar Zaman and mentioned the importance of their partnership.", "Babar Azam reflected on the team's momentum and their positive approach for the remainder of the tournament.", "Kane Williamson acknowledged Fakhar Zaman's exceptional performance and expressed a desire to take positives into the next match.", "Babar Azam expressed belief in their batting and the importance of building partnerships.", "Kane Williamson acknowledged the difficulty of the result despite New Zealand's high total and praised Pakistan's performance.", "Fakhar Zaman highlighted the aggressive mindset and team meetings focusing on scoring more runs.", "Kane Williamson remarked that Pakistan deserved the result and praised Fakhar Zaman's performance.", "Fakhar Zaman expressed happiness about the 'do-or-die' nature of the game for Pakistan and considered his century one of his best."], "ranking": [1, 5, 8, 4, 2, 6, 3, 12, 7, 10, 9, 11, 13, 14]}
{"candidates": ["Pakistan's best-case scenario now is to win against England and hope Sri Lanka can beat New Zealand on November 9.", "New Zealand's fate is not in their hands anymore as they can only reach a maximum of 10 points."], "ranking": [2, 1]}
{"candidates": ["Rain interrupted play, leading to a DLS method decision.", "Pakistan's win levels them on points with New Zealand, putting a semi-final berth within realistic grasp.", "Rain interrupted play, affecting the match outcome.", "Pakistan's win means South Africa has gained a spot in the semifinals.", "The match was affected by numerous rain delays, impacting the potential for a full 50-over game.", "Pakistan and New Zealand are now level on points but Pakistan is behind on net run rate.", "The match was rain-hit and ended prematurely.", "Pakistan and New Zealand both have eight points and remain in contention for semifinal spots.", "India and South Africa have already secured two of the semifinal places.", "Pakistan needs to win their last match against England and hope New Zealand loses to Sri Lanka or the match is hit by rain.", "Pakistan won by 21 runs (DLS method).", "Rain interrupted play, affecting the match outcome.", "Fakhar Zaman was named Player of the Match.", "The match was interrupted by rain three times.", "Rain stopped play with Pakistan at 160 for one in their chase of 402 runs.", "Rain affected the match, leading to multiple interruptions and adjustments to the target.", "The match was played in Bengalaru with rain impacting the game conditions.", "Rain interrupted play multiple times, affecting the match conditions.", "New Zealand made 114 runs in the last 10 overs to set a challenging target for Pakistan.", "Shaheen Afridi became the most expensive Pakistani bowler in World Cup history during this match."], "ranking": [14, 2, 10, 18, 12, 6, 16, 8, 19, 5, 10, 3, 15, 11, 7, 13, 9, 1, 4, 17]}
{"candidates": ["Probable Playing XI for New Zealand: Devon Conway, Will Young, Rachin Ravindra, Daryl Mitchell, Tom Latham (c & wk), Glenn Phillips, James Neesham, Mitchell Santner, Tim Southee, Lockie Ferguson, Trent Boult.", "Probable Playing XI for Pakistan: Fakhar Zaman, Abdullah Shafique, Babar Azam (c), Mohammad Rizwan (wk), Saud Shakeel, Iftikhar Ahmed, Salman Ali Agha, Usama Mir, Mohammad Wasim Jr., Shaheen Afridi, Haris Rauf.", "The ICC World Cup 2023 game between Pakistan and New Zealand will be played on Saturday, November 04, 2023.", "The match between Pakistan and New Zealand will be played at the M. Chinnaswamy Stadium in Bengaluru.", "The ICC ODI World Cup 2023 game between Pakistan and New Zealand is scheduled to kickstart at 10:30 IST (+5:30 GMT).", "Star Sports Network has acquired the rights to broadcast the ICC ODI World Cup 2023. The Pakistan vs New Zealand match of the ODI World Cup will be broadcasted live in multiple languages (English, Hindi, and Vernacular) across the Star Sports Network.", "The live streaming of the game between Pakistan and New Zealand will be on Disney+ Hotstar. All the mobile users would be able to view the World Cup clash involving the hosts for free of cost on the Disney+ Hotstar mobile app."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["England bowled out for 156 - the lowest all-out total ever in an ODI in Bengaluru.", "Sri Lanka ensured the lowest all-out total in Bengaluru.", "This match registers as the shortest match of the tournament (59 overs).", "Pathum Nissanka has moved past a thousand ODI runs this year - the second to do so after India's Shubman Gill.", "England registered the lowest total on this ground in a one-day international with 156 all out.", "This has been the shortest match in the 2023 World Cup.", "England's 156 all out is the lowest ODI all-out team total in Bengaluru."], "ranking": [1, 5, 6, 3, 2, 7, 4]}
{"candidates": ["Sri Lanka won by 8 wickets (with 146 balls remaining)."], "ranking": [1]}
{"candidates": ["Jos Buttler confirmed three changes for England with Liam Livingstone, Chris Woakes, and Moeen Ali returning.", "Sri Lanka brought back Angelo Mathews and Lahiru Kumara.", "Jos Buttler decided England would bat first after winning the toss.", "Sri Lanka skipper Kusal Mendis welcomed Angelo Mathews back into the XI.", "Angelo Mathews was drafted in place of the injured Matheesha Pathirana.", "England made three changes to their team with the aim of bolstering their batting.", "England picked a team without any players younger than 30 for the first time in ODIs.", "England made three changes to their team.", "England won the toss and chose to bat."], "ranking": [7, 5, 3, 6, 4, 2, 1, 8, 9]}
{"candidates": ["Jos Buttler expressed his desire to stay on as skipper despite the loss.", "Angelo Mathews praised the team's all-round performance and emphasized the importance of attitude.", "Jos Buttler expressed disappointment and acknowledged the tough situation for England.", "England head coach Matthew Mott was disappointed and mentioned the need to salvage something in the next week.", "England's captain Jos Buttler admitted that the team hit a 'huge low' in the World Cup defeat by Sri Lanka.", "The defeat leaves England's World Cup defense in disarray and heading for an early exit.", "Matthew Mott, England’s coach, admitted that the team saved their worst form for this World Cup.", "Jos Buttler expressed disappointment in the team's performance, acknowledging they were far from their best.", "Sri Lanka moved up to fifth in the table, while England dropped to ninth.", "The performance by England brought out lots of extreme reactions from the English cricket community."], "ranking": [8, 6, 5, 4, 3, 2, 1, 7, 9, 10]}
{"candidates": ["The average first innings score at the M. Chinnaswamy Stadium in Bengaluru is 235, but recent matches in the ODI World Cup 2023 have produced totals in the range of 300 and beyond.", "The first innings score between England and Sri Lanka could be in the range of 210-230, while the powerplay score could be in the range of 60-70.", "The M Chinnaswamy Stadium has a reputation for high-scoring games.", "The city's climate tends to be more temperate, which might prevent England from running completely out of puff if fielding first.", "These teams have met 11 times at the ODI World Cup, with England 6-5 up on head-to-head, but Sri Lanka have won each of the last four meetings.", "Overall, since being beaten by nine wickets at the 2015 World Cup, England have won eight out of 11 ODIs between the sides, with one tie.", "England have played five ODIs at the Chinnaswamy Stadium but last won there on the 1993 tour of India.", "Sri Lanka's one appearance at the Chinnaswamy Stadium came back in 1982.", "Buttler needs 90 runs to become the fifth Englishman to 5000 in ODIs; Joe Root needs 70 for 1000 at World Cups.", "Maheesh Theekshana is four wickets shy of 50."], "ranking": [8, 7, 6, 5, 4, 3, 2, 1, 9, 10]}
{"candidates": ["Carse has linked up with the squad after being brought in for the injured Reece Topley, but is not expected to be in contention for this game.", "Chris Woakes seems likeliest to win a return as Topley's replacement with the new ball.", "England would look at the balance of their XI again after defeat in Mumbai, with Moeen Ali, Liam Livingstone and Sam Curran all offering different skillsets if they return to the allrounder blueprint.", "Sri Lanka have been granted permission to bring in vastly experienced former captain Angelo Mathews as a replacement for Matheesha Pathirana.", "Dunith Wellalage might come back into contention having sat out the win over Netherlands.", "The strip for Thursday's match is slightly off-centre, with an invitingly short boundary towards neighbouring Cubbon Park, and looks hard and dry despite a patchy covering of live grass."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Virat Kohli scored his 48th ODI century, his first in a successful World Cup run chase.", "Virat Kohli reached his 48th ODI hundred.", "Kohli's 48th ODI hundred is his 78th century across formats.", "Mushfiqur Rahim reached 1000 runs in World Cup fixtures.", "Virat Kohli scored his 48th ODI hundred.", "Virat Kohli scored his 48th ODI hundred, now one short of Sachin Tendulkar’s world record of 49 ODI hundreds."], "ranking": [1, 5, 3, 4, 6, 2]}
{"candidates": ["India won by 7 wickets with 51 balls remaining.", "India chased down the target of 257 in 41.3 overs.", "Jasprit Bumrah led India's bowling attack, taking 28 out of a possible 30 wickets in the tournament so far.", "Rohit Sharma's ultra-aggressive approach has been the highlight of India's batting performances."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Bangladesh won the toss and chose to bat first.", "Shakib Al Hasan was ruled out due to a quad injury.", "Bangladesh won the toss and chose to bat.", "Rohit Sharma mentioned the challenge of keeping everyone in a good space during the World Cup.", "India fielded the same team as their previous match.", "Bangladesh won the toss and chose to bat.", "Bangladesh's skipper Shakib-Al-Hasan missed the game, and Najmul Hossain Shanto took over as captain.", "Bangladesh won the toss and elected to bat first.", "India have a 3-1 record against Bangladesh in World Cups.", "In the last four ODIs played between the two teams, Bangladesh have beaten India thrice.", "India's Shubman Gill and Ravindra Jadeja attended a training session ahead of the match.", "Bangladesh won the toss and elected to bat first."], "ranking": [12, 9, 11, 8, 10, 11, 7, 12, 5, 4, 6, 12]}
{"candidates": ["The match was played in Pune.", "Hardik Pandya suffered a minor injury and his condition will be assessed day by day.", "India's next match is against New Zealand, while Bangladesh will face South Africa.", "Bangladesh's powerplay performance included a flurry of proactive boundaries.", "India's tight bowling from the outset, especially by Jasprit Bumrah.", "The absence of Shakib Al Hasan left a significant gap in Bangladesh's lineup.", "The match was played in Pune as part of the ICC Cricket World Cup 2023.", "Hardik Pandya suffered a minor injury but it is not considered serious.", "Shakib Al Hasan's injury affected Bangladesh's performance.", "India's required run-rate was an eminently reasonable 4.19.", "Rohit Sharma's strike rate in this competition is 143, and he is averaging 81.", "Rohit Sharma became the leading run-scorer in the tournament with 253 runs.", "India's innings had 83% of their runs in boundaries: 12x4, 3x6.", "India maintained their unbeaten streak in the World Cup with this victory.", "Bangladesh's recent track record against India includes three victories in their last four matches.", "The MCA Stadium in Pune was at full capacity with 33,610 fans.", "India stays second in the points table with eight points from four games, trailing New Zealand on net run-rate.", "Bangladesh stays seventh with just two points from one win in four games.", "The match was held at Maharashtra Cricket Association Stadium, Pune.", "India earned 2 points from the match while Bangladesh earned 0 points."], "ranking": [18, 14, 16, 10, 12, 11, 17, 15, 13, 7, 5, 2, 4, 1, 9, 8, 19, 6, 3, 20]}
{"candidates": ["Only 6 wickets have fallen to spin in the last three matches at Maharashtra Cricket Association Stadium.", "Rohit Sharma averages 69.66 against Bangladesh in ODIs as captain.", "Shakib Al Hasan has three 50+ scores in four World Cup games against India.", "The ICC World Cup 2023 game between India and Bangladesh will be played on Thursday, October 19, 2023.", "The match between India and Bangladesh will be played at the Maharashtra Cricket Association Stadium in Pune.", "The game between India and Bangladesh is scheduled to begin at 14:00 (IST) (+5:30 GMT).", "Star Sports Network has acquired the rights to broadcast the ICC ODI World Cup 2023. The India and Bangladesh match of the ODI World Cup 2023 will be broadcast live in multiple languages (English, Hindi, and Vernacular) across the Star Sports Network.", "The live streaming of the game between New Zealand and Afghanistan will be on Disney+ Hotstar. All the mobile users would be able to view the World Cup clash involving the hosts for free of cost on the Disney+ Hotstar mobile app.", "This was Bangladesh's first ODI against India in India in 25 years.", "Virat Kohli has an average of 67.25 and a strike rate of 101.25 in 15 ODIs against Bangladesh.", "Shakib, Taskin, and Mustafizur all have five-wicket hauls against India in ODIs.", "The match was played in Pune, where teams batting first have posted 300-plus totals in three out of five ODIs since 2017."], "ranking": [9, 2, 5, 11, 10, 12, 8, 7, 1, 3, 4, 6]}
{"candidates": ["Australia amassed their highest successful World Cup run chase in the win over Bangladesh during the ICC Men's Cricket World Cup 2023.", "Mitchell Marsh scored 177 not out, one of the highest scores in one-day international chases."], "ranking": [1, 2]}
{"candidates": ["Mitch Marsh scored an unbeaten 177, helping Australia pull off their biggest ever World Cup chase.", "Bangladesh posted their highest total in this World Cup with 306/8.", "Mitchell Marsh's 177* is his highest ODI score and the second-highest in this World Cup.", "Australia completed their biggest chase in World Cups with 307/2.", "Mitchell Marsh registered the second-highest individual score of this World Cup after Glenn Maxwell's 201*.", "Adam Zampa moved to the top of the wicket-takers' charts in this World Cup with 22 wickets.", "Adam Zampa now has the second-most wickets by a spinner in a World Cup, one behind Muthiah Muralidaran's 23 in 2007."], "ranking": [1, 5, 2, 3, 4, 6, 7]}
{"candidates": ["Mitch Marsh hit an unbeaten 177 from 132 balls.", "Australia chased down Bangladesh's 8-306 with 32 balls to spare.", "Steve Smith scored 63 not out in a 175-run third-wicket stand with Marsh.", "Marnus Labuschagne effected two smart run outs in Bangladesh's innings.", "Adam Zampa took 2-32, including the key wicket of Liton Das.", "Sean Abbott took 2-61 in his first World Cup match.", "Australia won by 8 wickets (with 32 balls remaining).", "Mitchell Marsh finished unbeaten on 177 off 132 balls, hitting 17 fours and nine sixes.", "Australia chased down the 307-run target set by Bangladesh with 32 balls remaining.", "Steven Smith brought up a half-century off 55 balls.", "Mitchell Marsh and Steven Smith brought up a 100-run stand in 85 balls.", "David Warner scored a 33rd ODI fifty and finished the league stage with 499 runs.", "Mitchell Marsh and David Warner added 102 runs off 92 balls for the second wicket.", "Mitchell Marsh brought up his third ODI century in 87 balls with 11 fours and four sixes.", "Towhid Hridoy scored 74 off 79 balls for Bangladesh.", "Mahmudullah was run out for 32, potentially marking the end of his ODI career.", "Bangladesh's top seven all crossed the 20-run mark.", "Sean Abbott picked up two wickets in his first game of the competition.", "Bangladesh posted their highest total in this World Cup with 306/8.", "Adam Zampa picked two wickets to move to the top of the charts in this World Cup.", "Litton Das and Tanzid Hasan got Bangladesh off to a strong start with a 76-run stand.", "Towhid Hridoy and Najmul Hossain Shanto put on 66 for the third wicket.", "Mehidy Hasan Miraz provided the push at the death with 29 off 20 balls.", "Mitchell Marsh and Steven Smith brought up the 100-run stand in 85 balls.", "Mitchell Marsh brought up his third ODI century in 87 balls.", "David Warner scored a 33rd ODI fifty.", "Mitchell Marsh and David Warner added 102 runs off 92 balls for the second wicket.", "Mitchell Marsh brought up his third ODI century in 87 balls.", "Towhid Hridoy scored 74 off 79 balls for Bangladesh.", "Mahmudullah was run out for 32, potentially marking the end of his ODI career.", "Bangladesh's top seven all crossed the 20-run mark.", "Sean Abbott picked up two wickets in his first game of the competition.", "Bangladesh posted their highest total in this World Cup with 306/8.", "Adam Zampa picked two wickets to move to the top of the charts in this World Cup.", "Litton Das and Tanzid Hasan got Bangladesh off to a strong start with a 76-run stand.", "Towhid Hridoy and Najmul Hossain Shanto put on 66 for the third wicket.", "Mehidy Hasan Miraz provided the push at the death with 29 off 20 balls."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37]}
{"candidates": ["Pat Cummins won the toss and opted to bowl first in Pune.", "Glenn Maxwell was handed a well-earned rest to get himself back into peak condition for the knockout stages.", "Mitchell Starc was also absent from the XI, with Steve Smith and Sean Abbott coming into the team.", "Australia with the toss and elect to field"], "ranking": [4, 2, 3, 1]}
{"candidates": ["Australia play Bangladesh in Pune, with the Aussies already sure of a place in the semi-final, while Bangladesh will be looking for a win to secure qualification for the 2025 Champions Trophy.", "Bangladesh will be led by Najmul Shanto, after their regular skipper Shakib Al-Hasan left the tournament with a fractured finger.", "Glenn Maxwell (Australia) is highlighted as the key player to watch, fresh off playing arguably the greatest innings in the history of cricket, with a double century against Afghanistan.", "Steven Smith is likely to return after missing the Afghanistan game, whereas Bangladesh will be without Shakib Al Hasan.", "Australia will hope Mitchell Starc finds better rhythm in the coming games.", "Australia look to fine-tune against Bangladesh ahead of semi-final.", "Bangladesh are in a fight to be among the top eight teams to qualify for the Champions Trophy.", "Bangladesh are dealing with several exits from their dressing room, including fast-bowling coach Allan Donald and computer analyst Shrinivas Chandrasekaran.", "Pat Cummins won the toss and opted to bowl.", "Steven Smith returned to Australia's XI, replacing Glenn Maxwell.", "Shakib Al Hasan was out with injury for Bangladesh.", "Australia have won all three previous ODI World Cup matches against Bangladesh."], "ranking": [9, 8, 1, 5, 10, 4, 7, 6, 11, 3, 2, 12]}
{"candidates": ["Defeat for Bangladesh sees them finish their tournament on four points and with qualification for the Champions Trophy now hinging on Netherlands' result against India.", "Australia's dominant start to their chase hit a bump when Warner clipped a catch to Najmul Hossain Shanto off Mustafizur Rahman for 53 from 61.", "Pat Cummins praised the team's performance and highlighted the importance of Marsh's innings.", "Najmul Hossain Shanto reflected on the crucial run outs and the need for improvement in the middle overs.", "Mitchell Marsh expressed his happiness about the win and mentioned his family's support.", "Pat Cummins: 'It was a great win leading to the semis and good to chase a total like that. We were not at our sharpest in the first innings, It was a really good wicket. We brought it back towards the end to a total that we could chase.'", "Pat Cummins: 'All 15 players have played this tournament now and I feel we can pick any one of them (For Thursdays semi-final v South Africa)'", "Pat Cummins: 'Outstanding. I thought it was impressive the way he finished off the innings. The tempo that he played at was sustainable and he is a scary prospect to have for the next week. We’ve won Seven games in a row, even when we were not at our best in some of those games, we came away with a win. Chasing 300-plus was something we did not do earlier so it feels like everything is clicking together.'", "Bangladesh captain Najmul Hossain Shanto: 'I think for me the two run outs were crucial, the way we started was good but after the two run outs, we lost momentum. If we score 340-350, it could have been different. We did not bowl well in the middle overs. The fast bowlers bowled well but we need to improve in the middle overs.'", "Bangladesh captain Najmul Hossain Shanto: 'We did not play our best at the World Cup as a team, in both bowing and batting. Want to look at what we can do better moving forward. Mahmudullah batted really well… Shakib bowled really well in a couple of matches. It is not about individual performances. We will look back at all nine matches and see where we have to improve as a team.'", "Mitch Marsh: 'It feels great! Obviously it is nice to chase this total down and now it is on to the semis.'", "Mitch Marsh: 'I sort of knew that when Head came back in I would go down to three. It’s important to play with the same intent and back myself. There were a few games where I lost my intent so it is good to get it back. You will fail sometimes but it’s important to get it right more times.'", "Mitch Marsh: 'I am sure my Nana and Mum and everyone will be watching at home, and hopefully they will have a smile on their faces. My grandfather was a great man and we celebrated his life. Nice to be able to perform and to get the win.'", "Mitch Marsh: 'Can’t wait, mate! It is going to be a ripper. The four best teams are playing in the semis and I cannot wait to get to Kolkata.'", "Mitchell Marsh dedicated his performance to his late grandfather, expressing that he hoped it brought a smile to his family's faces.", "Mitch Marsh dedicated his century to his late grandfather, Ross.", "Marsh expressed hope that his performance put a smile on his family's faces.", "Marsh felt honored to score 100 for Australia and was excited about the upcoming semifinal against South Africa.", "Marsh acknowledged the support from his teammates who wore black armbands to mark his grandfather's passing."], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17, 18, 19]}
{"candidates": ["The win ensures Australia will enter Thursday's semi-final against South Africa as one of the competition's form teams.", "Mitch Marsh's performance will please Australia most.", "Australia will now shift their focus to South Africa and the Eden Gardens.", "For Bangladesh, the defeat marks the end of a dour campaign, but they have ensured they get to the Champions Trophy.", "Australia lost their first two games but bounced back to win seven on the trot to seal a spot in the semi-finals."], "ranking": [1, 3, 5, 2, 4]}
{"candidates": ["Young Tawhid Hridoy was the top-scorer in Bangladesh innings with a classy half-century.", "Bangladesh's top five batters each made at least 30 but only Hridoy (74) could turn a start into a fifty.", "Bangladesh were able to pass 300 and push toward their highest total of the tournament while Australia picked up regular wickets at the death.", "Bangladesh avoided damage to their net run-rate and will likely qualify for the Champions Trophy.", "Australia's win marked their seventh consecutive victory in the tournament.", "The match was held at Maharashtra Cricket Association Stadium, Pune.", "Weather or pitch conditions affecting the match: 'It was a really good wicket.'", "Mitchell Marsh was named Player of the Match.", "Australia elected to field first after winning the toss.", "The match was held at Maharashtra Cricket Association Stadium, Pune.", "Australia's opening bowlers struggled, allowing Bangladesh to reach 170 for two at one point.", "Mitchell Starc was rested, and the rejig with Pat Cummins and Sean Abbott did not change the trend of early struggles.", "Marnus Labuschagne has become one of Australia's most valuable fielders, contributing significantly in the field.", "Marsh returned to the Australian squad after his grandfather's death to help Australia win the World Cup.", "Marsh's performance ensured Australia will go into the World Cup semi-finals on the back of seven straight wins."], "ranking": [7, 5, 9, 11, 1, 15, 13, 3, 14, 15, 8, 10, 12, 2, 4]}
{"candidates": ["Towhid Hridoy anchored Bangladesh's innings with 74 off 79.", "Josh Hazlewood bowled well with figures of 0-21 from seven overs.", "The Maharashtra Cricket Association surface has been batting-friendly with South Africa and England posting scores over 330 after batting first in the last two matches at the ground.", "Warm and sunny conditions are expected on Saturday with a maximum temperature of 32 degrees Celsius forecast.", "Australia and Bangladesh have not played against each other in ODIs since the 2019 World Cup.", "Australia have won 19 of 20 completed ODIs against Bangladesh and all three contested in World Cups.", "Glenn Maxwell is 108 runs away from becoming the 19th Australian to reach 4000 ODI runs.", "Rain did not affect the match.", "The pitch in Pune was good for batting, as evidenced by the high scores."], "ranking": [6, 5, 8, 9, 4, 2, 3, 7, 1]}
{"candidates": ["Trent Boult became the sixth New Zealand player to take 200 ODI wickets."], "ranking": [1]}
{"candidates": ["Towhid Hridoy became Trent Boult's 200th scalp in ODIs", "Mitchell Santner cemented his place at the top of the tournament wicket-takers' charts", "Mitchell Santner is on the prospect of his 100th ODI wicket", "Kane Williamson's sixth World Cup fifty in 24 matches", "Kane Williamson's average in excess of 60 in World Cups", "Kane Williamson's sixth World Cup fifty", "Kane Williamson's 1000 World Cup runs", "Bangladesh's new World Cup record for sixes"], "ranking": [5, 2, 3, 6, 8, 7, 1, 4]}
{"candidates": ["Kane Williamson scored a crucial 78 runs against Bangladesh.", "Daryl Mitchell scored an unbeaten 89 off 67 balls, helping New Zealand win with 43 balls to spare.", "Mustafizur Rahman removed Rachin Ravindra in the third over.", "Devon Conway scored 89* and formed significant partnerships with Williamson and Mitchell.", "Shakib Al Hasan and Mushfiqur Rahim added 96 runs for Bangladesh.", "Lockie Ferguson took 3 wickets for 49 runs.", "New Zealand won by 8 wickets against Bangladesh.", "Kane Williamson retired hurt on 78 after suffering a hand injury.", "Daryl Mitchell finished the game with an unbeaten 89, hitting a six to seal the victory.", "Mahmudullah hit a six in the final over of Bangladesh's innings.", "Trent Boult dismissed Litton Das for a golden duck on the first ball of the match.", "Lockie Ferguson took key wickets, including Tanzid Hasan and Mehidy Hasan Miraz.", "Mushfiqur Rahim scored a fifty for Bangladesh.", "Shakib Al Hasan hit a six but was dismissed shortly after by Lockie Ferguson.", "Kane Williamson and Daryl Mitchell led New Zealand to an 8-wicket victory against Bangladesh.", "Lockie Ferguson clinched 3 wickets, Trent Boult and Matt Henry got two wickets each while Glenn Phillips and Mitchell Santner have one wicket each.", "Shakib Al Hasan dismissed Devon Conway, ending a strong partnership.", "Mustafizur Rahman dismissed opener Rachin Ravindra early in New Zealand's run chase.", "Mahmudullah provided Bangladesh with crucial runs, scoring 41.", "Lockie Ferguson was named Player of the Match for his spell of 3/49.", "Daryl Mitchell finished the innings with a stylish SIX against Shoriful Islam.", "Kane Williamson retired hurt due to a hand injury but scored 78 runs.", "Daryl Mitchell scored 89 not out, contributing significantly to the win.", "New Zealand won by 8 wickets with 43 balls remaining.", "Lockie Ferguson was named Player of the Match for his 3/49.", "Trent Boult was Cricinfo's MVP with 96.21 points.", "Mushfiqur Rahim scored 66 off 75 balls for Bangladesh.", "Shakib Al Hasan scored 40 off 51 balls for Bangladesh.", "Mahmudullah remained not out with 41 off 49 balls for Bangladesh.", "Daryl Mitchell scored an unbeaten 89 off 67 balls for New Zealand.", "Kane Williamson scored 78 off 107 balls before retiring hurt.", "Mushfiqur Rahim scored a half-century, contributing 66 runs off 75 balls.", "Mushfiqur Rahim formed a crucial 96-run partnership with Shakib Al Hasan.", "Trent Boult dismissed Towhid Hridoy to claim his 200th ODI wicket.", "Trent Boult dismissed Liton Das off the first ball of the match.", "Shakib Al Hasan scored 40 runs before being caught by Tom Latham.", "Mahmudullah added a valuable undefeated 41 runs batting at number eight."], "ranking": [14, 1, 20, 5, 11, 16, 28, 18, 25, 22, 10, 7, 13, 4, 26, 21, 15, 23, 2, 30, 6, 9, 17, 8, 24, 3, 19, 12, 27, 29, 31, 32, 33, 34, 35, 36, 37]}
{"candidates": ["New Zealand face Bangladesh in ODI 11 of the ongoing 2023 World Cup, in Chennai on Friday.", "New Zealand are currently unbeaten, having defeated England and Netherlands in their previous matches.", "Bangladesh began their campaign with a six-wicket win vs Afghanistan but lost their next fixture against England by 137 runs.", "New Zealand are currently second in the 10-team standings with four points from two games, while Bangladesh are sixth with two points from two matches.", "A win will be crucial for both sides and fans are expecting a thrilling encounter.", "Kane Williamson returned to the New Zealand team, replacing Will Young.", "Shakib Al Hasan mentioned the focus on improving batting and bowling starts.", "The match was expected to be a close contest, with the spin challenge from Bangladesh spinners being a key factor.", "New Zealand won the toss and elected to field first.", "Captain Kane Williamson returned to action after recovering from a knee injury.", "New Zealand and Bangladesh are set to face each other in the 11th match of the ICC Cricket World Cup 2023.", "New Zealand have a strong record against Bangladesh, winning 30 out of the 41 ODIs they have played.", "New Zealand have won all five previous World Cup matches against Bangladesh.", "New Zealand will be boosted by the return of captain Kane Williamson.", "Bangladesh will look to their spinners for an advantage on the spin-friendly Chennai pitch.", "The Chepauk pitch should assist Bangladesh spinners as it will get slower as the game progresses.", "New Zealand batsmen will have their task cut out.", "Experienced fast bowler Tim Southee is expected to miss this match due to recovery from surgery on his fractured right thumb."], "ranking": [14, 12, 10, 9, 8, 13, 7, 11, 6, 15, 5, 2, 1, 4, 3, 16, 17, 18]}
{"candidates": ["Kane Williamson marked his return to international cricket with a significant contribution despite retiring hurt.", "Williamson's return was earlier than expected after a knee injury.", "Kane Williamson retired hurt and will undergo scans for his hand injury."], "ranking": [1, 3, 2]}
{"candidates": ["Mitchell Santner cemented his place at the top of the tournament wicket-takers' charts", "Kane Williamson's peerless pacing of an innings is as measured as ever"], "ranking": [1, 2]}
{"candidates": ["The Pitch of MA Chidambaram Stadium is good for bowlers, whereas batters can also play good innings at this venue.", "Generally, Spinners dominate the game in Chepauk, especially in the second inning when the pitch gets drier.", "We can expect a low-scoring match between both the teams.", "The weather was likely to be mostly dry with a low chance of rain.", "New Zealand snapped Bangladesh's long-standing home winning streak in ODIs last month.", "Bangladesh had never defeated New Zealand in five World Cup matches.", "Mahedi Hasan's 4 for 71 in the previous game was the most expensive four-wicket haul by a Bangladeshi spinner in ODIs.", "New Zealand had a chance to win their first three matches of a World Cup for the third consecutive edition.", "Bangladesh's batting average against short-pitched fast bowling is poor", "Bangladesh's strike rate against short-pitched fast bowling is the worst among all teams in the World Cup", "Bangladesh possess a clutch of the most experienced campaigners in all of World Cup history", "Shakib Al Hasan and Mushfiqur Rahim are both playing in their fifth tournament"], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 12]}
{"candidates": ["David Warner and Mitch Marsh set a record-breaking 259-run opening stand for Australia in World Cup history.", "Australia's highest ever opening partnership at a World Cup.", "David Warner maintained his perfect record of taking a wicket in each of the 22 World Cup matches he's played in.", "David Warner scored his fourth consecutive ODI century against Pakistan.", "Warner and Mitch Marsh's 259-run opening stand is the fourth highest partnership for Australia in ODIs.", "David Warner surpassed Adam Gilchrist to become Australia's second highest run-scorer at 50-over World Cups with 1220 runs.", "Warner's 21st ODI century makes him the second highest century-maker for Australia behind Ricky Ponting.", "Mitchell Marsh scored his maiden ODI World Cup century.", "Marsh and Warner registered Australia's highest first-wicket partnership in ODI World Cups.", "This is the first time that two Australian openers have scored centuries in ODI World Cups."], "ranking": [1, 5, 8, 4, 6, 3, 2, 9, 7, 10]}
{"candidates": ["David Warner scored 163 from 124 balls.", "Mitch Marsh scored 121 from 108 balls.", "Adam Zampa claimed 4-53, crucial in ending Pakistan's chase.", "Marcus Stoinis took pivotal wickets of Abdullah Shafique and Imam-ul-Huq.", "Josh Hazlewood bowled tightly with figures of 1-37.", "Shaheen Afridi took 5-54 for Pakistan.", "David Warner scored 163 runs off 124 balls with 14 fours and 9 sixes.", "Mitchell Marsh scored 121 runs off 108 balls with 10 fours and 9 sixes.", "Shaheen Shah Afridi took 5 wickets for 54 runs.", "Adam Zampa took 4 wickets for 53 runs.", "Australia won by 62 runs.", "David Warner scored 163 runs.", "Shaheen Afridi took 5 wickets for 54 runs.", "Imam-ul-Haq scored 70 runs.", "Adam Zampa took 4 wickets for 53 runs.", "Australia won by 62 runs.", "Pakistan collapsed, losing six wickets for 73 runs.", "David Warner scored 163 off 124 balls.", "Shaheen Shah Afridi took 5 wickets for 54 runs in 10 overs.", "Mitchell Marsh scored 121 off 108 balls.", "Adam Zampa took 4 wickets for 53 runs in 10 overs.", "Imam-ul-Haq scored 70 off 71 balls.", "Abdullah Shafique scored 64 off 61 balls.", "Australia won by 62 runs.", "David Warner scored 162 runs and was named player of the match.", "Mitchell Marsh scored 121 runs, contributing to a 259-run partnership with Warner.", "Australia defended their total of 367-9, bowling out Pakistan for 305.", "Adam Zampa took 4 wickets for 53 runs, including key dismissals of Iftikar and Rizwan.", "Pat Cummins took the final wicket, dismissing Shaheen Afridi to secure the win.", "Shaheen Afridi took 3 wickets for Pakistan, including the dismissals of Stoinis, Starc, and Hazlewood.", "David Warner scored a sensational 163 for man of the match honours.", "Shaheen Afridi took a five-wicket haul.", "Adam Zampa took his second successive four-wicket haul.", "Mitchell Starc maintained his perfect record of taking a wicket in each of the 22 World Cup matches he's played in.", "Australia won by 62 runs.", "David Warner scored an 85-ball century in a 259-run opening stand with Mitch Marsh.", "Warner hit 14 fours and nine sixes in his 124-ball knock, scoring 163 runs.", "Mitch Marsh scored a run-a-ball century on his 32nd birthday.", "Warner was dropped on 10 by Usama Mir, which allowed him to continue his innings.", "Warner's 98m six off Haris Rauf almost hit fine leg on the head.", "Mitchell Marsh scored 121 runs off 108 balls, hitting 10 boundaries and nine maximums.", "David Warner and Mitchell Marsh put up a record opening stand of 259 runs.", "Shaheen Shah Afridi broke the partnership in the 34th over."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43]}
{"candidates": ["Australia won by 62 runs", "Shaheen Shah Afridi c Labuschagne b Cummins 10 (8b 2x4 0x6 17m) SR: 125"], "ranking": [1, 2]}
{"candidates": ["Pakistan elected to field first after winning the toss.", "Pakistan won the toss and chose to bowl first.", "Pakistan won the toss and elected to bowl."], "ranking": [2, 3, 1]}
{"candidates": ["Australia's win lifts them into the top four finals-paying spots with a 2-2 record.", "Pakistan needed to pull off the highest successful chase in World Cup history but fell short.", "Haris Rauf conceded 3-83 from eight overs, including 24 runs in one over.", "The match was held at M Chinnaswamy Stadium, Bengaluru.", "Australia earned 2 points from the match.", "The match was part of the ICC Cricket World Cup 2023.", "Pakistan dropped Warner, which proved costly.", "Australia hit 19 sixes compared to Pakistan's 6.", "Pakistan lost their last five wickets for 36 runs, a worrying pattern in the tournament.", "The match was played at M Chinnaswamy Stadium, Bengaluru.", "The match was held at M. Chinnaswamy Stadium in Bengaluru.", "Australia's next match is against the Netherlands in Delhi.", "Pakistan's next match is against Afghanistan in Chennai.", "Australia were behind their required over rate and needed to finish the match quickly to avoid penalties.", "Australia's next match will be against the Netherlands in Delhi on Wednesday.", "Australia defeated Pakistan by 62 runs.", "Warner's strike rate of 115.29 in 2023 is the highest of any year in his 13-year career.", "Warner's 24 sixes in 2023 is his most productive year in clearing the rope."], "ranking": [1, 2, 5, 16, 15, 14, 3, 4, 6, 17, 18, 11, 12, 13, 7, 8, 9, 10]}
{"candidates": ["The ICC World Cup 2023 game between Australia and Pakistan will be played on Friday, October 20, 2023.", "The match between Australia and Pakistan will be played at the M. Chinnaswamy Stadium in Bangalore. This will be the first match to be played at the venue in the 2023 ODI World Cup.", "The game between Australia and Pakistan is scheduled to kickstart at 14:00 (IST) (+5:30 GMT).", "Star Sports Network has acquired the rights to broadcast the ICC ODI World Cup 2023. The Australia vs Pakistan match of the ODI World Cup 2023 will be broadcasted live in multiple languages (English, Hindi, and Vernacular) across the Star Sports Network.", "The live streaming of the game between Australia and Pakistan will be on Disney+ Hotstar. All the mobile users would be able to view the World Cup clash involving the hosts for free of cost on the Disney+ Hotstar mobile app.", "The pitch at the Chinnaswamy Stadium is expected to be flat and the boundaries short", "Zampa requires three wickets to reach 150 ODI scalps; the only other Australian legspinner to manage that is Shane Warne", "The 10 ODI World Cup encounters between Australia and Pakistan have been split 6-4 in favour of Australia", "The five-time champions have dominated the head-to-head of late, winning four of their last five World Cup matches stretching back to the 1999 final", "Each of the last six ODI World Cup matches between these two have been won by the side that lost the toss"], "ranking": [10, 8, 9, 6, 7, 5, 2, 3, 1, 4]}
{"candidates": ["Glenn Maxwell's ability to muscle the ball in the middle and death overs is well known, though - aside from a cameo against Sri Lanka - he hasn't lit up this World Cup", "Pakistan is Maxwell's favourite ODI side: in 16 innings against them, he has never been dismissed in single figures and averages 52.50 as opposed to a career average of 33.43", "Babar Azam's campaign began with two soft and cheap dismissals", "Against India Babar Azam fell, uncharacteristically, the next ball after reaching his half-century", "Pat Cummins confirmed Adam Zampa was fully fit", "A viral infection swept through the Pakistan camp over the past week, though almost everyone is on the mend now", "Fakhar Zaman, dropped earlier in the tournament, is unavailable for at least two games due to a knee injury", "Pakistan's middle-over struggles with the ball, combined with a flat wicket, mean they are contemplating ringing the changes", "One of Shadab Khan or Mohammad Nawaz may miss out, with legspinner Usama Mir primed to play his first World Cup game"], "ranking": [8, 2, 6, 5, 9, 7, 4, 3, 1]}
{"candidates": ["The 194 balls of spin was a record for Australia in a men's ODI.", "Harry Brook scored 312 runs as captain in a bilateral ODI series vs Australia, the most by any captain in such a series.", "Matt Short reached the fastest ODI half-century by an Australian against England, achieving it in just 23 balls.", "Harry Brook moved past Virat Kohli for the most runs by a captain in an ODI series against Australia; 312 to Kohli’s 310 in 2019."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Ricky Ponting said Australia would rate a series win very highly given the challenges within the squad.", "Australia won the toss and chose to bowl.", "Teams in brief: no Jofra Archer for England, no Alex Carey for Australia."], "ranking": [1, 3, 2]}
{"candidates": ["Australia's spinners squeezed the life out of England, leading to their collapse.", "The rain played a significant role, arriving just five balls too late to save England.", "Mitch Marsh praised the calmness and resilience of the team despite injuries and illness.", "Travis Head humorously commented on his unexpected role in death bowling.", "Marsh highlighted the challenge of playing five one-dayers in 12 days and expressed pride in the team's performance.", "Mitch Marsh, Australia's stand-in captain, expressed respect for England and noted the series was played in a good manner.", "Harry Brook claimed he had now discovered his tempo in 50-over cricket."], "ranking": [5, 3, 6, 2, 4, 1, 7]}
{"candidates": ["Victorious England captain Harry Brook asserted that even though England did not win the first two games, they took a lot of positives from those and then a lot of momentum came from the third ODI.", "Brook praised his seamers for bowling consistently and not giving anything loose.", "Brook expressed happiness to see Jofra Archer back at his best.", "Australia’s captain Mitchell Marsh admitted that Australia were a bit off the radar in this game.", "Marsh detailed that England did not give them early wickets while batting and then totally outplayed his team.", "Marsh expressed eagerness to put this loss behind and come out charging afresh for the decider on Sunday."], "ranking": [6, 4, 5, 2, 1, 3]}
{"candidates": ["ENG (64) – AUS (90)", "Weather forecasts keep changing and let’s hope for the same come Sunday.", "The first ball should be bowled at 10 am GMT."], "ranking": [1, 3, 2]}
{"candidates": ["Tristan Stubbs scored his maiden ODI century in 75 balls.", "Tristan Stubbs scored his first ODI century with an unbeaten 112 off 81 balls."], "ranking": [2, 1]}
{"candidates": ["South Africa won by 174 runs.", "Tristan Stubbs scored an unbeaten 112 off 81 balls.", "Kyle Verreynne scored 67 off 64 balls.", "Lizaad Williams took 3 wickets for 36 runs.", "Tristan Stubbs remained unbeaten at 112 runs off 81 balls, striking eight fours and three sixes.", "Tristan Stubbs built a notable partnership of 103 runs for the third wicket with Kyle Verreynne.", "Ryan Rickelton made 40 runs off 39 balls.", "Temba Bavuma retired hurt on 35.", "Kyle Verreynne scored 67 runs off 64 balls.", "Wiaan Mulder contributed 43 runs off 34 balls.", "South Africa finished their innings at 343/4 in the allotted 50 overs.", "Ireland lost Andrew Balbirnie for just one run off seven balls in the second over.", "Lungi Ngidi dismissed captain Paul Stirling for five runs off seven balls.", "Curtis Campher and Harry Tector formed a 37-run partnership for the third wicket.", "Curtis Campher was dismissed for 17 runs by Lizaad Williams.", "Lizaad Williams removed wicketkeeper Stephen Doheny for a golden duck.", "Harry Tector scored 20 runs off 28 balls, including two boundaries.", "Ireland was in a precarious position at 50/5 after 9.5 overs.", "South Africa won the toss and opted to bat first.", "Tristan Stubbs scored an unbeaten 112 off 81 balls.", "Wiaan Mulder contributed 43 valuable runs in the death overs.", "South Africa scored 61 runs in the final 5 overs.", "Ireland's bowling unit put in a collective effort with four bowlers chipping in with a wicket each.", "South Africa set a target of 344 runs for Ireland."], "ranking": [10, 1, 6, 8, 2, 3, 12, 14, 6, 9, 5, 16, 11, 15, 13, 17, 18, 4, 7, 19, 20, 21, 22, 23]}
{"candidates": ["South Africa win by 174 runs", "OUT! Bowled. Bjorn Fortuin to Graham Hume. Stock length ball, off stump on the back foot driving, missed.", "Wiaan Mulder to Craig Young. Slower length ball, middle stump on the front foot Slog, missed for no runs, fielded by Rickelton.", "SIX! Wiaan Mulder to Craig Young. Back of a length, outside off stump on the back foot Slog, well timed in the air under control over deep mid wicket for 6 runs.", "FOUR! Wiaan Mulder to Craig Young. Back of a length, outside off stump on the back foot Slog, thick edge in the air uncontrolled past third man for 4 runs.", "FOUR! Wiaan Mulder to Craig Young. Slower ball back of a length, to leg down the track driving, well timed in the air under control past long off for 4 runs."], "ranking": [1, 5, 6, 2, 3, 4]}
{"candidates": ["Paul Stirling emphasized the need for a strong start and better performance throughout the game.", "Temba Bavuma mentioned the wicket looked good and a bit on the drier side, which assisted their bowlers in the previous game.", "Kyle Verreynne reflected on the team's recent form and the importance of maintaining a positive mindset."], "ranking": [2, 3, 1]}
{"candidates": ["The second ODI match between South Africa and Ireland is crucial for both teams. South Africa aims to secure the series, while Ireland will try to level it. In the first match, South Africa defeated Ireland by 139 runs. South Africa won the toss and chose to bat first, scoring 271 runs for 9 wickets in 50 overs. Ryan Rickelton played a remarkable innings but missed his century by 9 runs. Ireland was all out for 132 runs in 31.5 overs, with George Dockrell scoring the highest for Ireland with 21 runs."], "ranking": [1]}
{"candidates": ["Kyle Verreynne emphasized the importance of maintaining a positive mindset and focusing on securing the win.", "Tristan Stubbs' performance was highlighted as a game-changer."], "ranking": [2, 1]}
{"candidates": ["If Ireland chases down 344 runs, it will be a record chase at this venue."], "ranking": [1]}
{"candidates": ["The second ODI match between South Africa and Ireland will be played on Friday, October 4, 2024, at the Zayed Cricket Stadium in Abu Dhabi. The match will start at 5 PM IST, with the toss taking place at 4:30 PM IST. The match will not be broadcast on TV in India but will be live-streamed on the FanCode app and website."], "ranking": [1]}
{"candidates": ["Kusal Perera slammed the fastest half-century of ICC World Cup 2023 on just 21 balls.", "The partnership for the final wicket between Dilshan Madushanka and Maheesh Theekshana made 42 runs in 81 balls, which is the longest partnership for the final wicket in the history of ICC World Cup.", "Maheesh Theekshana set a new World Cup record for most balls faced by a No. 9 batter, facing 91 balls.", "Madushanka-Theekshana partnership registered Sri Lanka’s highest 10th wicket partnership in a World Cup match.", "Trent Boult became the first New Zealander — and sixth man overall — to collect 50 World Cup scalps."], "ranking": [1, 3, 4, 2, 5]}
{"candidates": ["Rachin Ravindra is currently tied with Sachin Tendulkar for most runs at a World Cup before turning 25. He can go free and clear of an all-time great tomorrow.", "Dilshan Madushanka is seven wickets away from becoming the all-time highest wicket-taker in a single edition of a World Cup.", "Rachin Ravindra became the highest run-getter in this World Cup.", "Rachin Ravindra broke Sachin Tendulkar's record.", "Trent Boult became the first New Zealander to take 50 wickets in World Cups.", "Maheesh Theekshana and Dilshan Madushanka achieved their career-best scores in ODI cricket.", "Sri Lanka's 43-run partnership for the tenth wicket was their highest in all World Cups."], "ranking": [1, 3, 5, 2, 4, 6, 7]}
{"candidates": ["New Zealand needed to win to cement its place in the semifinals.", "Lockie Ferguson returned to the New Zealand XI after recovering from an achilles injury.", "There was an 80% chance of rain which could have affected the match."], "ranking": [1, 2, 3]}
{"candidates": ["New Zealand captain Kane Williamson sings praises for young Rachin Ravindra: 'We knew the talent was there, but to come out be one of the players of the tournament so far - not only with the bat, but he's also making really valuable contributions with the ball. Yeah, very, very special player, and great that he's on our side.'", "Trent Boult expressed satisfaction with his performance and reaching the milestone of 50 World Cup wickets.", "Angelo Mathews reflected on his campaign and the controversy surrounding his timed out dismissal."], "ranking": [1, 2, 3]}
{"candidates": ["Rachin Ravindra has hit three hundreds in this World Cup.", "Sri Lanka have won just three of their last 20 ODIs against New Zealand; they've lost seven of their last eight, with one game abandoned.", "Two of the three games at the Chinnaswamy Stadium in this World Cup have seen the side batting first score above 350, with only England - against Sri Lanka - failing to do so.", "Rain was a factor in Bengaluru, potentially affecting the match.", "Mitchell Santner's bowling was praised for its control and effectiveness.", "Ravichandran Ashwin commented on Santner's unique bowling style and effectiveness."], "ranking": [1, 2, 5, 6, 3, 4]}
{"candidates": ["Janith Liyanage scored his maiden ODI century with an unbeaten 101 off 102 balls."], "ranking": [1]}
{"candidates": ["Tanzid Hasan came on as a concussion substitute and struck a career-best 84.", "Rishad Hossain scored an unbeaten 48 off 18 balls, including four sixes and five fours.", "Taskin Ahmed took three wickets to restrict Sri Lanka to 235.", "Kumara took four wickets for 48 runs.", "Bangladesh won by 4 wickets with 58 balls remaining.", "Bangladesh uncapped wicket-keeper batter Jaker Ali was taken to hospital after an on-field collision with Anamul Haque while attempting to catch Pramod Madushan off Taskin Ahmed's bowling.", "Soumya Sarkar had a neck injury after striking the advertising board while stopping the ball.", "Mustafizur Rahman had to leave the game on a stretcher due to cramping.", "Tanzid Hasan was selected to replace Soumya Sarkar in cases of concussions.", "Umpire Tanvir Ahmed took over for Richard Kettleborough for the third ODI due to heat.", "Bangladesh uncapped wicket-keeper batter Jaker Ali was taken to hospital after an on-field collision with Anamul Haque while attempting to catch Pramod Madushan off Taskin Ahmed's bowling.", "Soumya Sarkar had a neck injury after striking the advertising board while stopping the ball.", "Mustafizur Rahman had to leave the game on a stretcher due to cramping.", "Umpire Tanvir Ahmed took over for Richard Kettleborough for the third ODI due to heat.", "Tanzid Hasan opened the batting for Bangladesh as Soumya Sarkar's concussion replacement.", "Soumya Sarkar suffered a neck injury when he crashed into the boundary board.", "Anamul Haque and Jaker Ali collided on the field while attempting a catch.", "Mustafizur Rahman was stretchered off after suffering cramps.", "Mushfiqur Rahim suffered a finger injury.", "Bangladesh's Soumya Sarkar injured his head while fielding and was replaced under concussion replacement rules by Tanzid Hasan Tamim.", "Substitute Bangladesh fielder Jaker Ali Anik was hospitalized after a collision with Anamul Haque.", "Bangladeshi pacer Mustafizur Rahman left the field on a stretcher with cramps and was unable to complete his 10 overs of bowling.", "Umpire Richard Kettleborough did not return to the field after the innings break due to excessive heat and was replaced by reserve umpire Tanvir Ahmed.", "Bangladesh bowled out Sri Lanka for 235 runs in 50 overs, despite Janith Liyanage hitting an unbeaten century for Sri Lanka."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Bangladesh won by 4 wickets.", "Bangladesh scored 237/6 in 40.2 overs.", "Sri Lanka scored 235/10 in 50 overs."], "ranking": [1, 2, 3]}
{"candidates": ["Predicted Playing XIs for Bangladesh vs Sri Lanka 3rd ODI", "Bangladesh’s Predicted Playing XI: Tanzid Hasan, Soumya Sarkar, Najmul Hossain Shanto (c), Towhid Hridoy, Mushfiqur Rahim (wk), Mahmudullah, Mehidy Hasan Miraz, Taijul Islam, Taskin Ahmed, Shoriful Islam, Tanzim Sakib", "Sri Lanka’s Predicted Playing XI: Pathum Nissanka, Avishka Fernando, Kusal Mendis (c & wk), Sadeera Samarawickrama, Charith Asalanka, Janith Liyanage, Wanindu Hasaranga, Dunith Wellalage, Dilshan Madushanka, Maheesh Theekshana, Lahiru Kumara", "Bangladesh axed seasoned batter Litton Das from the playing XI for the final ODI due to his failure to score any runs in the series.", "Dilshan Madushanka’s absence due to injury opened the door for Thekshana to make an appearance in the playing XI.", "Prediction favored Sri Lanka to win."], "ranking": [5, 4, 4, 2, 3, 1]}
{"candidates": ["Shanto lauded Rishad's performance, stating that a player like him makes life easier for a captain."], "ranking": [1]}
{"candidates": ["Following Sri Lanka’s ODI series loss to Bangladesh, all-rounder Wanindu Hasaranga is now under ICC scrutiny for his criticism of an umpire during the 3rd ODI.", "Reports indicate that the umpire has filed a complaint with the match referee regarding Hasaranga’s behavior.", "With previous demerit points accumulated from past infractions, Hasaranga could potentially face a suspension spanning multiple international games if found guilty.", "Three players got injured in the last three overs of the first innings.", "Umpire Tanvir Ahmed replaced Richard Kettleborough due to the latter falling sick from the heat.", "Richard Kettleborough opted to stay away from officiating in the second innings due to extreme heat.", "Jaker Ali was taken to the hospital after his collision with Anamul Haque.", "The series is tied 1-1 after Bangladesh won the opener by six wickets, with Sri Lanka taking the second by three wickets."], "ranking": [8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The match was held at Zahur Ahmed Chowdhury Stadium, Chattogram.", "The pitch was expected to be even and offer minimal assistance to the bowlers, advantageous for the batters.", "Weather conditions were mostly cloudy with a temperature of 28.7˚C and 78% humidity."], "ranking": [3, 2, 1]}
{"candidates": ["Travis Head's unbeaten 154 is his career-best in ODIs.", "Travis Head's strike rate of 116 is the highest of anybody who has scored at least 1000 ODI runs at the top of the order.", "Travis Head scored a career-best 154 not out, the highest individual score by an Australian in England.", "Australia achieved their highest successful ODI chase in England with a score of 317-3.", "Travis Head scored a career-best 154 not out.", "Travis Head scored his sixth century in ODIs and his second against England.", "Travis Head scored his highest ODI score of 154 not out."], "ranking": [3, 2, 1, 4, 6, 5, 7]}
{"candidates": ["England won the toss and chose to bat.", "Australia were missing key players like Pat Cummins, Josh Hazlewood, Mitchell Starc, and Glenn Maxwell due to rest and illness."], "ranking": [2, 1]}
{"candidates": ["The 1st ODI match of the Australia Tour of England 2024 will see England take on Australia at Trent Bridge, Nottingham on September 19, 2024.", "Trent Bridge in Nottingham is known for offering consistent bounce and support to both batsmen and bowlers, providing a well-balanced pitch.", "On the day of the game, there will be a 4.13 km/h breeze, 33% humidity, and a predicted temperature of 11°C.", "There are no injury updates from both sides.", "England Predicted Playing 11: Phil Salt (wk), Ben Duckett, Will Jacks, Harry Brook, Sam Jordan Cox, Liam Livingstone, Jacob Bethell, Olly Stone, Jofra Archer, Reece Topley, Adil Rashid.", "Australia Predicted Playing 11: Travis Head, Matthew Short, Steve Smith, Marnus Labuschagne, Glenn Maxwell, Mitch Marsh, Josh Inglis, Sean Abbott, Adam Zampa, Mitchell Starc, Josh Hazlewood.", "Captaincy Picks: Travis Head, Glenn Maxwell.", "Top Picks: Ben Duckett, Liam Livingstone.", "Budget Picks: Jofra Archer, M Starc.", "Australia to win: Looking at the squad strength of Australia, they are looking stronger and are the favorites to win the game.", "ENG vs AUS Win %: ENG=> 42 % AUS=> 58%", "Harry Brook is set to captain England for the first time in the one-day international series against Australia after Jos Buttler was ruled out because of his persistent calf injury.", "The first of five one-day internationals between England and Australia starts Thursday (September 19, 2024) at Trent Bridge.", "Brook's appointment also means England has had a new captain in each international format this summer."], "ranking": [14, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 13]}
{"candidates": ["Mitchell Marsh praised the team's performance and the decision to use part-time bowlers.", "Harry Brook reflected on England's performance, acknowledging they didn't rotate strike as much as they could have.", "Travis Head credited his environment and clear role for his form over the last three years.", "Travis Head expressed satisfaction with his performance, stating he plays the game more relaxed now.", "England stand-in captain Harry Brook reflected on the team's inability to rotate the strike effectively against spinners.", "Australia captain Mitchell Marsh praised the team's decision to bowl spin for the last 18 overs.", "Marcus Trescothick, England’s interim white-ball head coach, acknowledged the team's good efforts but noted the pitch improvement and the toss as significant factors.", "Harry Brook, the stand-in England captain, faced a challenging start to his captaincy.", "Eoin Morgan in the Sky commentary box considered England's approach to be'measured'.", "Ben Duckett expressed self-admonishment after giving away an international century for the second time this month.", "Harry Brook mentioned that England did everything they planned but it wasn't their day.", "Brook also reflected on the decision to bat first and the challenges faced during the middle period.", "Ricky Ponting praised the comprehensive run-chase and Travis Head's performance.", "Stuart Broad called Travis Head an incredible player and highlighted his strengths."], "ranking": [12, 8, 10, 11, 9, 7, 5, 6, 4, 3, 2, 1, 13, 14]}
{"candidates": ["The match was played at Trent Bridge.", "Jofra Archer bowled a challenging spell at the start of Australia's innings.", "Australia's partnership of 140 between Head and Labuschagne was almost flawless.", "Australia's Ben Dwarshuis sustained a suspected pectoral strain and did not return to the field.", "The second ODI of the five-match series is scheduled at Headingley on Saturday.", "The match was played at Trent Bridge, where England previously set two record one-day international totals.", "The pitch conditions improved as the match progressed, favoring the team batting second.", "Australia overcame a sickness bug that robbed them of key players like Josh Hazlewood and Mitchell Starc.", "Ben Dwarshuis was injured on debut with a strained pectoral muscle.", "Jofra Archer made his first ODI appearance in 18 months.", "Australia completed the chase with six overs to spare.", "Australia's win marked their 13th successive ODI victory and sixth in a row over England."], "ranking": [12, 8, 5, 10, 11, 4, 9, 6, 7, 3, 2, 1]}
{"candidates": ["Ben Stokes and Chris Woakes combined in an England-record stand to rescue their team from 192 for 6 to 339 for 9.", "Ben Stokes hits his first World Cup hundred", "Ben Stokes passed 10,000 international runs across all formats.", "Ben Stokes scored 108 off 84 balls.", "Chris Woakes has gone level with Ian Botham on 30 wickets, the joint-most for England at World Cups."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Ben Stokes and Chris Woakes added an England-record 129 for the seventh wicket.", "Ben Stokes scored his maiden World Cup century.", "Ben Stokes' 108 from 84 balls included 62 runs from his final 26 balls, with six sixes.", "England plundered 124 runs in the final 10-over powerplay.", "Chris Woakes' half-century was his sixth in ODIs and first since September 2020.", "The partnership between Stokes and Woakes was England's third highest for the seventh wicket in ODIs.", "England's highest stand for the seventh wicket or lower at ODI World Cups."], "ranking": [1, 2, 3, 5, 6, 4, 7]}
{"candidates": ["Ben Stokes scored 108 from 84 balls.", "Chris Woakes and Ben Stokes put on 129 runs for the seventh wicket.", "England posted a total of 339 for 9.", "Netherlands were bowled out for 179 in 37.2 overs.", "Moeen Ali took 3 wickets for 42 runs.", "Adil Rashid took 3 wickets for 54 runs.", "Paul van Meekeren was stumped by Buttler off Moeen Ali.", "England won by 160 runs.", "England moved from tenth to seventh in the tournament standings on net run-rate.", "Ben Stokes hit six sixes in his innings.", "England scored 124 runs in the final 10-over powerplay.", "Chris Woakes scored a half-century.", "Moeen Ali ran out Wesley Barresi.", "Chris Woakes and David Willey made early breakthroughs in the Netherlands innings.", "Aryan Dutt dropped Ben Stokes on 41.", "Ben Stokes survived a review for lbw off Aryan Dutt.", "Ben Stokes reverse-swept Paul van Meekeren for a boundary to reach his century.", "Ben Stokes and Chris Woakes' partnership was England's highest for the seventh wicket or lower at ODI World Cups.", "England won by 160 runs.", "Ben Stokes was named Player of the Match for his century and partnership with Chris Woakes.", "Chris Woakes contributed significantly with both bat and ball.", "Adil Rashid took three wickets.", "Moeen Ali took two wickets.", "Scott Edwards scored 38 runs for the Netherlands.", "Sybrand Engelbrecht scored 58 runs for the Netherlands in their previous match against Afghanistan.", "England won by 160 runs", "Paul van Meekeren st †Buttler b Ali 4 (3b 1x4 0x6 3m) SR: 133.33"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Jos Buttler won the toss and elected to bat first.", "Harry Brook and Gus Atkinson returned to the England side in place of Liam Livingstone and Mark Wood.", "Scott Edwards mentioned he would have batted first as well but wasn't concerned about fielding first.", "Teja Nidamanuru came in for Saqib Zulfiqar for the Netherlands.", "Buttler keen to remain England white-ball captain despite dismal World Cup", "Ben Stokes’ onslaught against Dutch a reminder of elite status as ODI batter", "There were questions about whether England could sink any lower against the Netherlands before the match."], "ranking": [5, 4, 3, 2, 6, 1, 7]}
{"candidates": ["Jos Buttler expressed relief at the win and praised the partnership between Stokes and Woakes.", "Scott Edwards acknowledged the recurring issues in the Netherlands' performance.", "Ben Stokes was happy to contribute to the win and praised Chris Woakes as a genuine allrounder.", "Woakes tells Sky the players are desperate to perform", "Buttler’s really happy with the win, saying any time you need someone to stand up, Stokes does that", "Scott Edwards says his team didn’t start well, giving away too many runs, and their innings was the same old story with the bat", "Ben Stokes is player of the match and of course tries to meh his debut World Cup ton, saying he’s more pleased to get a win – at last", "Ben Stokes expressed his pleasure in getting a victory and mentioned it was a tough World Cup.", "Stokes commented on the pitch conditions, describing it as a nice wicket to bat on with a bit of tennis-ball bounce.", "Jos Buttler on Stokes: 'Any time you need someone to stand up and take charge he seems to be the guy to do that so we’re delighted to have him in the team.'", "Jos Buttler on Woakes: 'He’s a class cricketer, he’s been a brilliant performer from us for a long period of time, that was a great start for us, and the two guys set the tone really well.'", "Jos Buttler: 'It’s nice for us to have a game that means a lot and we’ll prepare really well and go there and hopefully have a good game against Pakistan.'", "Scott Edwards: 'I thought the bowlers did really well to drag it back but again it got away from us, and same old story with the bat.'", "Scott Edwards: 'I think we held them quite well until the 43rd over, maybe we could have tried a couple of different plans but I thought they batted well.'", "Ben Stokes: 'I think more pleased for us to get a victory. A tough World Cup but nice to get back on winning terms today.'", "Ben Stokes: 'It was obviously a nice wicket to bat on but there was a bit of tennis ball bounce and I wanted to take it as deep as I could and then capitalise at the end.'", "The result lifted England to seventh place in the World Cup table.", "Pressure was building on England’s leadership pairing of Jos Buttler and Matthew Mott.", "A top-eight finish for a spot in the 2025 Champions Trophy could require a third victory against Pakistan.", "Netherlands captain Scott Edwards: 'We didn't start well, our bowlers did well to drag it back but they took it away from us and got just above par. Same old story with the bat.'", "England captain Jos Buttler: 'We were desperate for the win. We got off to a great start, had a bit of a speed bump in the middle. We needed someone to stand up and take charge. There was some very smart cricket between Stokes and Woakes to get us to that score.'", "Player of the match, England's Ben Stokes: 'I'm more pleased for us to get a victory over the line, it's been a tough World Cup and nice to get back to winning ways today.'"], "ranking": [1, 18, 5, 14, 2, 16, 3, 10, 12, 4, 7, 11, 15, 13, 9, 6, 20, 19, 17, 8, 21, 22]}
{"candidates": ["Ben Stokes' performance was crucial in reviving England's innings.", "England's win moved them off the bottom of the table and into the qualification spots for the Champions Trophy.", "England's victory was their first in six attempts.", "England's performance was seen as a pyrrhic success given their original tournament ambitions.", "Ben Stokes expressed more pleasure in the victory than his century, acknowledging the tough World Cup for England.", "Jos Buttler emphasized the importance of the win and praised the partnership between Stokes and Woakes.", "Scott Edwards reflected on the Netherlands' performance, acknowledging their struggle with the ball and bat."], "ranking": [5, 2, 4, 1, 6, 3, 7]}
{"candidates": ["The match was played in Pune.", "England's win probability was 100% according to Smart Stats.", "Netherlands needed to pull off their highest successful chase in ODIs to win.", "England's total of 70 for 1 from their first ten overs was their best effort at this World Cup.", "England's campaign has been an all-time stinker, but they aimed to qualify for the 2025 Champions Trophy.", "The match was held at the Maharashtra Cricket Association Stadium in Pune.", "England needs another win to book their place for the Champions Trophy 2025.", "England have not lost to Netherlands in six previous ODIs, three of which have come at World Cups, in 1996, 2003 and 2011", "In all global tournaments, the rivalry is significantly more intense with Netherlands pulling off shock victories at the T20 World Cups in 2009 and 2014", "Buttler needs another 71 runs to reach 5000 ODI runs", "David Willey needs five more wickets to reach 100 in ODIs", "Bas de Leede has struck more times in this tournament than any of England's bowlers", "England have lost five ODIs in a row", "England have not lost six in a row since the 2009 home series against Australia"], "ranking": [12, 5, 8, 6, 3, 11, 4, 9, 10, 2, 7, 1, 13, 14]}
{"candidates": ["Dawid Malan vs Bas de Leede: Malan has scored 286 runs in seven innings, with an average of 40 and a high score of 140. De Leede has 11 wickets in seven games with his best figure of 4/62.", "Joe Root vs Logan van Beek: Root has managed 188 runs in seven innings, with an average of 26. Van Beek has ten wickets and bowled crucial spells against Australia and South Africa.", "Sybrand Engelbrecht vs Chris Woakes: Woakes has eight wickets in six games, four of which came in one match. Engelbrecht has 222 runs in six innings with an average score of 37 and a high score of 70.", "Mark Wood will miss out with a left knee niggle", "Ben Stokes' various ailments could cause him to sit this one out", "Max O'Dowd and Wesley Barresi are likely to get another chance to settle as a new opening pair for Netherlands", "Saqib Zulfiqar may make way for fellow legspinner Shariz Ahmad", "There have been three World Cup matches to date in Pune, none of them especially close", "England have some recent experience of this venue, having played three ODIs on their 2020-21 tour of India"], "ranking": [1, 2, 3, 8, 7, 6, 5, 4, 9]}
{"candidates": ["It was the first time both Indian openers were dismissed for a duck since 1983 in a World Cup match.", "This marks the first instance in ODIs where India has seen three batters out of their top four dismissed without scoring.", "India's 2/3 is the lowest score at the fall of third wicket from which any team went on to win in men's ODIs."], "ranking": [2, 1, 3]}
{"candidates": ["The lowest score at the fall of third wicket from which any team has gone on to win in men’s ODIs. India, Rahul and Kohli, take a bow.", "This is the first match in India's entire history of playing ODIs that THREE of their top four have bagged ducks.", "50 wickets for Mitchell Starc in men's ODI World Cups. That puts him at No. 5 on the list. He's never gone wicketless in this tournament and that's a streak that goes back 19 matches."], "ranking": [1, 2, 3]}
{"candidates": ["India will open their ODI World Cup 2023 campaign at home against Australia at the MA Chidambaram Stadium in Chennai on October 8, Sunday.", "The Indian cricket team competed in a three-match ODI series prior to the quadrennial spectacle against the Australians, winning it by 2-1.", "The key players for India in their batting lineup in the ODI World Cup 2023 will be their two senior players, the captain Rohit Sharma and Virat Kohli, while KL Rahul and Hardik Pandya are going to play a key role in the middle order too.", "In the bowling department, the Men in Blue will be quite reliant on Jasprit Bumrah and Kuldeep Yadav to pick up a bag of wickets, while curtailing the rate of scoring at the same time.", "The Australian cricket team will look at their senior players in Steve Smith and David Warner to do the bulk of the scoring in the ODI World Cup 2023, along with the likes of Mitchell Marsh and Glenn Maxwell in the support role.", "The captain Pat Cummins and Adam Zampa are going to be two of the main bowlers for Australia in the ongoing flagship tournament.", "Australia won the toss and chose to bat first.", "Shubman Gill was ruled out due to dengue, and Ishan Kishan opened the batting.", "Experts highlighted the importance of spin in the match, with India having more spin options than Australia.", "India and Australia will clash in the fifth match of the ODI World Cup 2023 on October 8, 2023, at the MA Chidambaram Stadium.", "India enters the ICC World Cup 2023 as one of the frontrunners, bolstered by a talented squad and home advantage.", "Australia has a remarkable history of success in World Cup tournaments, having won the title five times.", "The Chepauk Stadium pitch traditionally favours spin bowlers, making it advantageous for teams with strong spin attacks.", "India might consider including Ravichandran Ashwin in the squad instead of Shardul Thakur to exploit the pitch conditions.", "Shubman Gill might miss the opening game due to health concerns, with Ishan Kishan potentially partnering Rohit Sharma as an opener.", "Australia's spin bowling department is a concern, with Adam Zampa being the primary spinner in conditions favouring spin.", "India’s march towards World Cup glory begins as it gears up to take on a flamboyant Australian side.", "The surface is likely to provide assistance to the spinners.", "Both teams will hope the rain stays away.", "Captain Rohit Sharma and Virat Kohli are seen during a practice session ahead of the ICC Cricket World Cup 2023 match against Australia in Chennai.", "Australia turned up at Chennai in March and used leg-spinner Adam Zampa to stun the Indians in an ODI and claim that series 2-1.", "Sanjay Bangar suggested that Shubman Gill shouldn't be rushed back into the playing XI after his illness.", "Gill's participation in the opening World Cup match against Australia on October 8th, 2023, at the MA Chidambaram Stadium in Chennai is uncertain due to health issues.", "India's coach, Rahul Dravid, provided an update on Gill's condition, stating that while his availability for the Australia game wasn't confirmed, he wasn't outrightly denied either.", "If Gill's recovery takes longer than expected, he might also miss the matches against Afghanistan on October 11 and Pakistan on October 14.", "If Gill remains unavailable for the clash on Sunday, Ishan Kishan could potentially replace him.", "Experts predicted India as the favorites given their home advantage.", "Spin is expected to be hugely influential at Chepauk, and India are better equipped in that regard.", "Shubman Gill is recovering from dengue and is a doubtful starter.", "Marcus Stoinis is in a race against time to recover from a hamstring injury."], "ranking": [28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 29, 30]}
{"candidates": ["Virat Kohli, known for his skill in uphill pursuits, found a fine ally in 'Player-of-the-Match' K.L. Rahul.", "The match was described as oscillating between agony and ecstasy, culminating in a winning note for India.", "Winning captain Rohit Sharma praised the team's fielding and bowling efforts and acknowledged the challenge of adapting to different conditions in future matches.", "Losing captain Pat Cummins reflected on the challenges of defending a low score and the need for the team to review their performance.", "KL Rahul expressed his happiness in contributing to the team's win and shared his experience of batting under pressure.", "Rohit Sharma mentioned that the team stood up to the challenge of a '10 for 3' situation, which he had previously emphasized as a preparation strategy.", "Australia captain Pat Cummins commented on the dropped catch by Mitch Marsh, stating it was not ideal, especially for someone of his calibre.", "Pat Cummins reflected that with another 50 runs on the board, the bowling innings would have looked different.", "Rohit Sharma expressed excitement and pride in the team's performance", "Pat Cummins expressed disappointment with Australia's batting and fielding performance", "KL Rahul shared his thoughts on his innings and the conditions"], "ranking": [5, 2, 8, 9, 6, 4, 10, 7, 3, 1, 11]}
{"candidates": ["KL Rahul expressed disappointment at missing out on a century but was pleased with the win.", "Rohit Sharma remarked that winning the series was a significant morale booster ahead of the World Cup.", "Australia's performance raised questions about their ability to handle spin in subcontinent conditions."], "ranking": [2, 1, 3]}
{"candidates": ["The dew in Chennai played a significant role in the match, affecting the bowlers.", "The crowd at Chepauk was highly supportive of the Indian team.", "Weather conditions were warm and sunny, with no rain interruptions.", "The Chepauk Stadium pitch tends to be slow and low, offering turn and grip to spinners as the match unfolds.", "Batting first is generally seen as an advantage at the Chepauk Stadium, as chasing becomes difficult due to the pitch's deteriorating condition.", "A total of 270-280 runs would be considered a competitive score at the Chepauk Stadium.", "Gill has been down with dengue and has been experiencing high fever since landing in Chennai.", "Gill amassed 1,230 runs from 20 matches at an average of 72.35 in ODIs this year.", "The weather is likely to be muggy, with a forecast maximum of 33 degrees Celsius. The North-East monsoon could bring scattered showers in the evening.", "The MA Chidambaram Stadium has hosted seven World Cup games. Australia have played three of them and won each time.", "India have played one other World Cup game at Chepauk apart from the 1987 loss to Australia. They beat West Indies by 80 runs here during their run to the title in 2011.", "India and Australia have met 12 times in ODIs since the end of the 2019 World Cup and won six games each."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 12]}
{"candidates": ["Rachin Ravindra became NZ's youngest World Cup centurion.", "Devon Conway's 83-ball century was the fastest for New Zealand at the men's ODI World Cup, beating Martin Guptill's 88 balls vs Bangladesh in 2015.", "Rachin Ravindra is the second-youngest player to score a century on debut in the men's ODI World Cup, behind Virat Kohli.", "The unbroken partnership of 273 off 211 balls between Devon Conway and Rachin Ravindra is the highest partnership for New Zealand in ODI World Cups."], "ranking": [2, 4, 3, 1]}
{"candidates": ["New Zealand won by 9 wickets with 82 balls remaining.", "England scored 282/9 in their innings.", "New Zealand chased the target of 283 in 36.2 overs, scoring 283/1.", "New Zealand won by 9 wickets with 82 balls remaining.", "Mitchell Santner bowled a 10-over spell without conceding a boundary, a feat not achieved against England in ODIs since 2018.", "Matt Henry produced a standout delivery that dismissed Jos Buttler.", "Devon Conway scored his fourth century in 11 innings in 2023.", "Rachin Ravindra scored a century in 82 balls.", "New Zealand's Conway and Ravindra's partnership included 30 fours and eight sixes.", "Sam Curran took a wicket with his first ball in ODI World Cups.", "England managed only 27 boundaries in their entire innings.", "New Zealand reached their 200 in just 26.5 overs."], "ranking": [12, 9, 8, 12, 2, 10, 5, 4, 3, 11, 7, 1]}
{"candidates": ["Tom Latham, New Zealand's stand-in skipper, won the toss and decided to field.", "New Zealand played without their regular captain Kane Williamson and pacer Tim Southee.", "England's star all-rounder Ben Stokes was ruled out of the opening encounter.", "Ben Stokes missed the World Cup opener with a hip injury.", "New Zealand won the toss and decided to bowl first."], "ranking": [3, 4, 2, 1, 5]}
{"candidates": ["Jos Buttler admitted that his England side had been 'completely outplayed'.", "Buttler mentioned that England were aiming for a score around 330 but fell short.", "Joe Root acknowledged that England were below par in all departments.", "Rachin Ravindra expressed his disbelief and joy at the performance, mentioning his close relationship with Conway.", "Rachin Ravindra expressed his disbelief and joy at having a great day out and praised the bowlers and his partnership with Devon Conway.", "Jos Buttler acknowledged that England was outplayed by New Zealand and reflected on the team's performance and execution.", "Tom Latham praised the partnership between Rachin Ravindra and Devon Conway and the team's adaptation to the conditions.", "Mitch Santner highlighted the importance of winning the toss and praised the performances of Devon Conway and Rachin Ravindra.", "Ravindra praised the bowlers for making his job easier.", "Tom Latham said the whole New Zealand team was proud of Ravindra.", "Jos Buttler indicated that while the loss hurt, he was not too concerned and emphasized it was just one loss at the start of a long tournament."], "ranking": [5, 8, 9, 6, 1, 4, 3, 2, 10, 7, 11]}
{"candidates": ["Ian Smith noted that Conway and Ravindra were likely instructed to boost their Net Run Rate during a drinks break.", "Jos Buttler expressed pride in England's achievement four years ago but emphasized a fresh start and attacking approach."], "ranking": [2, 1]}
{"candidates": ["New Zealand's victory was emphatic, winning by nine wickets.", "England's Jonny Bairstow hit a six off the second ball of the day.", "New Zealand's bowlers, despite injuries to Lockie Ferguson and Tim Southee, performed exceptionally well.", "The match was a rematch of the 2019 Cricket World Cup final, where England edged out New Zealand by the barest of margins to lift the trophy.", "The match was held at Narendra Modi Stadium, Ahmedabad.", "New Zealand played without key players like Williamson, Southee, Ferguson, and Bracewell.", "The pitch played better under lights, aiding New Zealand's chase.", "The defending champions, England, were comprehensively beaten by New Zealand.", "Joe Root's 77 stitched together a total of 282 for 9 for England.", "All 11 England batters reached double figures for the first time in an ODI innings.", "New Zealand's slower bowlers, particularly Mitchell Santner, played a crucial role in restricting England.", "Ben Stokes missed out on selection due to a hip issue.", "England's highest 10th wicket stand in seven years was fashioned by the final pair of Wood and Rashid.", "New Zealand's victory was a nine-wicket destruction of England.", "The match was held at Narendra Modi Stadium in Ahmedabad.", "New Zealand's win was seen as a measure of revenge for the 2019 World Cup final.", "New Zealand next play three games they will expect to win before encountering the hosts.", "Tom Latham managed the bowling group in the absence of Kane Williamson, Tim Southee, and Lockie Ferguson.", "It was a rematch of the heart-stopping 2019 final at Lord's in which England were declared winners via a now-scrapped boundary countback rule after the contest had ended in a tie.", "New Zealand will next play the Netherlands in Hyderabad on Monday.", "England will next play Bangladesh in Dharamasala on Tuesday."], "ranking": [1, 5, 4, 8, 20, 10, 12, 2, 7, 11, 15, 16, 9, 3, 18, 14, 6, 19, 13, 17, 21]}
{"candidates": ["Head-to-Head: There is not much to choose between these two sides as both have played 95 ODIs so far with 44 victories each for England and New Zealand. Three games ended in a tie while the remaining four in no result.", "Jos Buttler needs eight fours to complete 400 fours in ODIs.", "Buttler needs four more dismissals to complete 250 dismissals in ODIs.", "Trent Boult is three scalps away from reaching the milestone of 200 wickets in one-day internationals.", "Joe Root requires one more four to complete 500 fours in ODIs.", "Devon Conway needs 126 more runs to reach 1000 runs in ODI cricket.", "Root needs three more sixes to reach 50 sixes in ODIs.", "Will Young is one match away to complete 50 international matches.", "Moeen Ali needs five more fours to get to 200 fours in one-day internationals.", "Sam Curran requires one more six to get to 50 maximums in international matches.", "Ben Stokes is two maximums away from reaching 100 sixes in ODI cricket.", "Stokes is one grab away from completing 50 catches in the 50-overs format.", "James Neesham requires 30 runs to reach 3000 runs in international cricket.", "The Narendra Modi Stadium boasts a combination of six black soil pitches and five red soil pitches. While the red soil pitches are known to offer extra help to seam bowlers in comparison to the black ones, the black soil pitches still present favorable conditions for bowlers, including good bounce. Nevertheless, as the match unfolds, the pitch tends to lose its pace, becoming more spinner-friendly.", "The match was played at the Narendra Modi Stadium in Ahmedabad.", "The pitch conditions were a blend of red and black soil, offering both pace and carry as well as slower and lower traits.", "The match was played on the same strip prepared for the 2023 IPL final, which was a high-scoring game.", "The match was played at the 100,000-seater Narendra Modi Stadium, which was half full according to the ICC.", "The pitch conditions were dry and abrasive, affecting the match.", "New Zealand's spinners effectively restricted England's scoring rate.", "The ball moved around under lights, making batting challenging."], "ranking": [14, 10, 11, 9, 8, 13, 12, 16, 15, 7, 6, 5, 4, 3, 2, 1, 18, 17, 19, 20, 21]}
{"candidates": ["Match Details: Tournament: ICC Cricket World Cup 2023, Match: England (ENG) vs New Zealand (NZ), 1st Match, Date: Thursday, October 5, 2023, Time: 2:00 PM, Venue: Narendra Modi Stadium, Ahmedabad, Live Streaming: Hotstar, Star Sports Network", "Probable Playing XI: England: Jonny Bairstow, Harry Brook, Dawid Malan, Liam Livingstone, Moeen Ali, Jos Buttler (c), Ben Stokes, Reece Topley, Adil Rashid, Sam Curran, Mark Wood. New Zealand: Devon Conway, Tim Southee, Finn Allen, WA Young, DJ Mitchell, Glenn Phillips, Mitchell Santner, Rachin Ravindra, Tom Latham (C), MJ Henry, Trent Boult.", "Head-To-Head: Total Match Played: 95, England Won: 45, New Zealand Won: 44, Matches with No Result: 04, Tied Matches: 02.", "England and New Zealand's World Cup head-to-head record is close, with England winning four and losing five of their ten previous meetings.", "Trent Boult needs three more wickets to reach 200 in ODIs.", "England had won three consecutive ODIs against New Zealand prior to this match.", "Tom Latham captained New Zealand in the absence of Kane Williamson.", "England's lower middle-order was exposed earlier than expected due to New Zealand's effective bowling.", "New Zealand's bowlers had struggled to take wickets in the middle overs in recent ODIs but performed well in this match."], "ranking": [8, 7, 6, 5, 4, 3, 2, 1, 9]}
{"candidates": ["Quinton de Kock slammed the highest score so far in the ICC Men's Cricket World Cup 2023 with 174 runs.", "De Kock hits sublime 174 off 140 balls - highest score in tournament", "Quinton de Kock hit the highest score of the tournament so far with 174 runs.", "Quinton de Kock's 174 is the ninth-biggest total in men's World Cup history.", "Quinton de Kock became the sixth batter to score three hundreds in a single edition of the tournament", "Quinton de Kock overtook Virat Kohli as the highest run-getter with 407 runs in the tournament", "Quinton de Kock scored his 20th ODI century and his third of this World Cup.", "South Africa achieved their seventh consecutive 300-plus total batting first in ODIs.", "Quinton de Kock surpassed AB de Villiers in ODI centuries for South Africa.", "Quinton de Kock surpassed India's Virat Kohli for the most runs and also surpassed Australia's David Warner (163) for the highest individual score in this World Cup."], "ranking": [1, 2, 3, 5, 6, 4, 8, 9, 7, 10]}
{"candidates": ["Quinton de Kock scored 174 from 140 balls, including 22 boundaries.", "Heinrich Klaasen scored 90 from 49 balls, including eight sixes.", "David Miller scored 34 from 15 deliveries.", "Mahmudullah scored a run-a-ball 111 for Bangladesh.", "Shoriful Islam bowled Reeza Hendricks.", "Mehidy Hasan Miraz trapped Rassie van de Dussen leg before.", "Marco Jansen removed Tanzid Hasan and Najmul Hossain Shanto in consecutive deliveries.", "Gerald Coetzee removed Mushfiqur Rahim for 8.", "Kagiso Rabada trapped Litton Das leg before for 22.", "Keshav Maharaj had Mehidy Hasan Miraz caught in the deep for 11.", "Bangladesh bowled out for 233 to lose by 149 runs", "Mahmudullah makes excellent 111 off as many balls to defy South Africa", "South Africa post imposing 382-5 after late flurry", "Klaasen smacks 90 off 49, Markram adds 60 off 69 & Miller cracks 34* off 15", "Proteas move up to second in the table, Tigers now bottom", "Quinton de Kock scored 174 runs off 140 balls.", "South Africa scored 382 for five.", "Bangladesh was bowled out for 233 in 46.4 overs.", "Mahmudullah scored a run-a-ball 111 for Bangladesh.", "Aiden Markram scored 60 runs.", "Heinrich Klaasen scored 90 off 49 balls.", "David Miller made 34 not out off 15 balls.", "Marco Jansen removed Tanzid Hasan and Najmul Hossain Shanto with successive deliveries.", "Quinton de Kock scored 174 off 140 balls.", "Heinrich Klaasen smashed 90 off 49 balls.", "South Africa scored 144 runs in the final 10 overs.", "Mahmudullah scored a run-a-ball 111 for Bangladesh.", "Marco Jansen took 2 wickets for 39 runs.", "Kagiso Rabada took 2 wickets for 42 runs.", "Mahmudullah scored a century for Bangladesh", "Quinton de Kock scored 174 runs", "Heinrich Klassen scored a blitzkrieg 90", "South Africa scored 144 runs off the last ten overs", "South Africa posted a mammoth total of 382 for five", "Bangladesh were bundled out for 233", "South Africa handed a 149-run defeat to Bangladesh", "South Africa won by 149 runs.", "Mahmudullah scored a century for Bangladesh, his third in World Cups.", "Quinton de Kock scored 174 off 140 balls.", "Heinrich Klaasen scored a quick fifty off 34 balls.", "Marco Jansen took two wickets in two balls.", "Lizaad Williams took three catches.", "Mustafizur Rahman was dismissed by Lizaad Williams.", "Bangladesh were bowled out for 233 in 46.4 overs.", "South Africa defeated Bangladesh by 149 runs in the ICC World Cup 2023 group stage match.", "Quinton de Kock scored a record 174 runs.", "Heinrich Klaasen scored an explosive 90 off just 49 balls.", "Marco Jansen took two crucial wickets in the seventh over.", "Gerald Coetzee took 3 wickets for 62 runs.", "Mahmudullah scored a century for Bangladesh."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]}
{"candidates": ["South Africa won by 149 runs.", "South Africa scored 382/5 in their innings.", "Bangladesh were all out for 233 in 46.4 overs.", "Mustafizur Rahman was caught by Miller off Williams for 11 runs."], "ranking": [1, 2, 3, 4]}
{"candidates": ["South Africa was led by Aiden Markram in the absence of Temba Bavuma.", "Shakib Al Hasan returned to the Bangladesh squad, replacing Towhid Hridoy.", "Shakib Al Hasan mentioned he didn't mind bowling first to restrict South Africa to a reasonable total.", "Aiden Markram led the side in the absence of the unwell Temba Bavuma.", "Quinton de Kock had announced he would quit one-day internationals after the World Cup in India.", "Shakib Al Hasan returned to the Bangladesh team after an injury.", "Temba Bavuma was ruled out due to a gastric illness.", "Lungi Ngidi missed the match due to a knee niggle."], "ranking": [5, 7, 3, 4, 2, 6, 1, 8]}
{"candidates": ["South Africa has lost to Bangladesh twice in their four World Cup meetings so far — 2007 and 2019.", "The free live streaming for the ODI World Cup 2023 match between Bangladesh and South Africa will be available on Disney+ Hotstar.", "The match will start at 14:00 PM IST at the Wankhede Stadium in Mumbai.", "All the action from the match between Bangladesh and South Africa can be watched online on the Disney+ Hotstar app on your smart TV or PC.", "The ongoing ICC World Cup 2023 will be available on your mobiles too. The match between Bangladesh and South Africa will now be live-streamed for absolutely free. The viewers can watch the World Cup matches without paying a single penny. The Live Streaming will be available on the Disney+ Hotstar app.", "Star Sports Network has acquired the rights to broadcast the ongoing ICC ODI World Cup 2023. The World Cup fixture between Pakistan and Afghanistan will be telecasted live in multiple languages (English, Hindi, and Vernacular) across the Star Sports Network.", "South Africa and Bangladesh have previously played each other 24 times in ODI matches. Of these 24 games, South Africa have won 18 whereas Bangladesh have come out victorious on 6 occasions.", "The match was played at Wankhede Stadium on October 24, 2023.", "The weather was expected to be hot with high humidity.", "Bangladesh had outplayed South Africa in two of their three previous World Cup matches.", "This will be South Africa's first ODI clash against Bangladesh in Asia since 2015, when they lost a three-match series 1-2.", "The two teams have a 2-2 head to head record in the World Cup, with Bangladesh winning in 2019.", "The Wankhede has been a favourite hunting ground for South Africa, who posted 438 against India back in 2015 before posting the highest total by any team in an ODI against England a few days back.", "This will be Bangladesh's first match at the Wankhede Stadium since 1998 and also only their second game at this venue."], "ranking": [12, 14, 13, 14, 14, 11, 10, 9, 8, 7, 6, 5, 4, 3]}
{"candidates": ["Bas De Leede took four scalps against Pakistan at the ICC Men's Cricket World Cup 2023 to match Tim De Leede's efforts against India in 2003 and become the first father-son duo with four-wicket hauls at World Cups", "Saud Shakeel's half-century off 32 balls is the second-fastest fifty for Pakistan in the history of the Men's Cricket World Cup"], "ranking": [1, 2]}
{"candidates": ["Pakistan won by 81 runs", "Paul van Meekeren was bowled by Haris Rauf for 7 runs"], "ranking": [1, 2]}
{"candidates": ["Netherlands won the toss and elected to bowl.", "Netherlands skipper Scott Edwards called it right at the toss and the Dutch opted to field against Babar Azam's Pakistan", "Pakistan have a perfect head-to-head record of 6-0 over Netherlands in the ODI format", "Abdullah Shafique found no place as Pakistan went for their usual top three", "Netherlands have high hopes of making an impact at the ICC Men's Cricket World Cup 2023 starting with their clash against Pakistan"], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["There was rain in Hyderabad during a warm-up game the previous week, but none is expected on Friday, with the weather expected to be hot and dry", "Babar Azam is 26 runs away from becoming the first active Pakistan batter to make 500 ODI World Cup runs", "Pakistan have lost the first World Cup match at the last two tournaments, and four of the last five", "Netherlands have won just two of their 15 World Cup matches, their last success coming in 2007 against Scotland"], "ranking": [4, 1, 2, 3]}
{"candidates": ["Namibia are in the fifth spot of the table, with four wins and five defeats in their nine matches. They currently have eight points to their name and are coming off four successive defeats.", "UAE are struggling with a miserable run of form in the tournament, facing four successive defeats in all the four matches they have played so far. They will be eyeing registering their first win to get off the mark in the tournament.", "Namibia has shown resilience, securing four victories in nine outings to secure fifth position on the points table.", "The United Arab Emirates faces significant challenges, losing all four of their matches to sit at the bottom of the table.", "Namibia seeks to consolidate its position, while the United Arab Emirates strives to rediscover its winning formula."], "ranking": [3, 5, 2, 4, 1]}
{"candidates": ["Namibia and United Arab Emirates will lock horns in the 29th ODI of ICC CWC League 2 2024 on Friday, 20 September 2024, at Wanderers Cricket Ground, Windhoek.", "In Match 25 of the ICC CWC League 2, the United States of America defeated Namibia by 6 wickets. Namibia batted first and set a target of 200 runs. They posted 199/9 in their 50 overs. Jan Frylinck led the innings with a solid 70 off 88 balls. Jonathan Smit added 49 runs from 75 balls, and captain Gerhard Erasmus contributed 27 off 49 balls.", "In Match 27 of the ICC CWC League 2, the United States of America defeated the United Arab Emirates by 10 wickets. UAE batted first and struggled, managing to score only 106 runs before being bowled out in 31.2 overs. Rahul Chopra was the top scorer for UAE with 32 runs off 64 balls. Aryansh Sharma contributed 31 runs from 38 balls, while Ali Naseer added 23 runs off 28 balls.", "The 29th ODI of the ICC CWC League 2 2024 will see the clash between Namibia and United Arab Emirates at the Wanderers Cricket Ground, Windhoek on Friday, 20 September 2024.", "Namibia is determined to bounce back from their recent defeat and secure a win in their next match.", "The United Arab Emirates is gearing up for their next match after a recent defeat.", "Namibia’s recent form has been challenging with four consecutive losses followed by a single win.", "The United Arab Emirates has recently faced a series of challenges with four consecutive losses, but their latest match brought a victory.", "The Wanderers Cricket Ground in Windhoek offers a pitch with fast and bouncy conditions, favorable for both pace and spin bowlers.", "In Windhoek, the weather is expected to be sunny with a temperature of 29°C, no precipitation, and humidity at 12%. Winds are forecasted at 13 km/h.", "Winning the toss lets teams bowl first, which can be beneficial if the pitch supports bowlers initially."], "ranking": [10, 2, 3, 9, 5, 6, 7, 8, 4, 1, 11]}
{"candidates": ["The surface at the Wanderers Park in Windhoek is a bowling-friendly track, with a bit of help for the batters in the first half of the game. The average score here has been 204 runs, while the overall average score reduces to 190 runs. So, defending the target in the second innings could be a good choice here at this deck. The captain winning the toss will look ahead to bat first to post a troubling target for the opponent.", "The match is scheduled to be held at United Cricket Club Ground, Windhoek on 20th September at 1:00 PM IST.", "Weather forecast for the match is sunny with a temperature of 24°C.", "The pitch is expected to be balanced, suitable for both pace and spin, with an average first innings score of 204.", "The record of chasing teams at this venue is poor with a winning percentage of 45%."], "ranking": [1, 5, 4, 2, 3]}
{"candidates": ["South Africa equalled the record for most centuries hit by a team in a single edition of the World Cup with 8 centuries.", "Quinton de Kock equalled the record of Rohit Sharma and Kumar Sangakkara for most hundreds in a single edition of the tournament with 4 centuries.", "South Africa broke the record for most sixes hit in a single edition of the World Cup, surpassing England's record of 76 sixes from the 2019 edition.", "New Zealand suffered their second-heaviest defeat in World Cup history, losing by 190 runs to South Africa.", "Quinton de Kock hit his fourth century of the tournament, scoring 114 runs.", "Rassie van der Dussen made 133 runs.", "South Africa posted a total of 357-4, a significant team achievement.", "Quinton de Kock scored his fourth century of the Cricket World Cup.", "Rassie van der Dussen hit his second ton of the showpiece.", "Quinton de Kock went past 500 runs in the tournament.", "South Africa recorded their first win over New Zealand in the men's Cricket World Cup since 1999.", "Rassie van der Dussen's 133 was a significant contribution to the match.", "Quinton de Kock's fourth ton of the ICC Men's Cricket World Cup 2023.", "South Africa hit the most sixes in any edition of the ICC Men's Cricket World Cup.", "South Africa handed New Zealand their second heaviest defeat in World Cup history.", "South Africa handed New Zealand their second heaviest defeat in World Cup history.", "The last ODI World Cup where South Africa beat New Zealand was in 1999, ending a 5-game losing streak at ODI World Cups.", "South Africa set a new record for the most sixes hit by a team in one World Cup edition with 77 sixes.", "Quinton de Kock joined an elite list of only 3 players with 4+ centuries in one World Cup.", "South Africa achieved consecutive 300-plus totals while batting first in men's ODIs, making it 8 times in 2023."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]}
{"candidates": ["South Africa won by 190 runs.", "Glenn Phillips scored 60 off 50 balls with 4 fours and 4 sixes.", "South Africa scored 357/4 in their innings.", "New Zealand were all out for 167 in 35.3 overs."], "ranking": [1, 3, 2, 4]}
{"candidates": ["Tom Latham decided to field after winning the toss.", "Tim Southee returned to the lineup in place of Lockie Ferguson.", "Temba Bavuma expressed that they would've batted first anyhow.", "Kagiso Rabada came in for Tabraiz Shamsi.", "Kane Williamson was in contention to return from his thumb injury but did not play.", "South Africa and New Zealand were early pacesetters at the ICC Men's Cricket World Cup 2023.", "New Zealand hold a 6-2 advantage over South Africa at past ICC Men's Cricket World Cups.", "New Zealand won by four wickets in their last ODI encounter in 2019.", "New Zealand won the toss and chose to bowl.", "New Zealand won the toss and chose to bowl first.", "Tom Latham mentioned that New Zealand had been playing good cricket despite recent defeats.", "Temba Bavuma emphasized South Africa's momentum.", "South Africa brought in Kagiso Rabada, and New Zealand included Tim Southee for the first time in this World Cup.", "South Africa's white-ball coach Rob Walter has extensive coaching experience in New Zealand."], "ranking": [12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 11, 1, 13, 14]}
{"candidates": ["South Africa captain Temba Bavuma praised his team's clinical display with the bat and their execution with the ball.", "New Zealand captain Tom Latham did not regret fielding first despite the heavy defeat.", "Rassie van der Dussen reflected on the hard work required to build his century and the effective partnership with Quinton de Kock.", "New Zealand captain Tom Latham reflected on the heavy defeat, acknowledging the pressure from the South African partnership and the team's inability to build partnerships.", "Rassie van der Dussen expressed pride in the team's performance and highlighted the contributions from all players.", "Michael Vaughan commented on South Africa's superior performance and New Zealand's poor decisions.", "Henry Moeran described the victory as a statement win for South Africa.", "South Africa captain Temba Bavuma praised the team's clinical display.", "Rassie van der Dussen expressed satisfaction with the team's performance.", "New Zealand stand-in captain Tom Latham acknowledged the pressure from South Africa's massive partnership.", "South Africa captain Temba Bavuma praised the team's clinical display with both bat and ball.", "New Zealand captain Tom Latham expressed disappointment in their performance and emphasized the need for partnerships.", "New Zealand’s Tom Latham: 'Not our best performance, at the half way mark it was a big score but a decent surface. We weren’t able to build partnerships, disappointing.'", "South Africa’s Temba Bavuma: 'I think Quinnie and I tried to assess the wicket, I was able to get a couple away, Quinnie tried to get a couple away, but hung in there and cashed in at the end….in terms of the bowlers, look to be clinical, dominate the power play, the middle order, we knew they would come at us and be ready for opportunities. I think it is important we acknowledge that we have made the semi-finals and move on.'", "The player of the match is Rassie van der Dussen: 'If you hold a good length there is something in it for the bowlers, and we communicated that back to our bowlers. They did well to keep a lid on us for much of the innings but we knew if we could keep it deep we could keep momentum on our side. Miller and guys at the back did brilliantly, it wasn’t easy.'", "Quinton de Kock expressed satisfaction with his performance and mentioned his career nearing its end.", "De Kock hoped that the score of 357 would be enough to secure a win.", "South Africa outclassed New Zealand in all three departments.", "New Zealand's third loss in a row leaves them out of momentum.", "South Africa's win was significant as it ended a 5-game losing streak against New Zealand in ODI World Cups."], "ranking": [1, 14, 3, 12, 5, 2, 4, 10, 9, 11, 8, 13, 6, 7, 15, 16, 17, 18, 19, 20]}
{"candidates": ["Tom Latham expressed that his team can feel the support from back home despite the nation's obsession with the rugby World Cup.", "Rob Walter reflected on South Africa's ability to handle pressure, stating that winning key moments in pressure games is a positive sign."], "ranking": [2, 1]}
{"candidates": ["New Zealand have now lost three consecutive matches and face a crucial game against Pakistan next.", "South Africa moved to the top of the standings, a position India could reclaim in their next match.", "The match was played in Pune.", "South Africa's win has opened the door for Pakistan and potentially Afghanistan to compete for the fourth spot in the tournament.", "New Zealand had won their last five World Cup matches against South Africa before this defeat.", "South Africa dislodged India from the top of the points table based on net run rate.", "New Zealand lost the bowling services of seamer Matt Henry due to a right hamstring problem.", "James Neesham was struck on the hand but did not suffer broken bones.", "South Africa's victory helped them leapfrog India to the top of the standings.", "New Zealand are still in the hunt for a place in the semi-finals in fourth position.", "South Africa will likely avoid playing India in the semi-finals.", "New Zealand needed a quick breakthrough to pull things back after the 30-over mark.", "Matt Henry walked back into the pavilion without finishing his sixth over due to a hamstring injury.", "South Africa went at about 7.6 runs an over between overs 26-40.", "South Africa hit a total of nine sixes in the final Powerplay.", "South Africa moved to the top of the table.", "New Zealand dropped to fourth place, two points above Pakistan and Afghanistan.", "New Zealand have now lost three consecutive matches.", "New Zealand play Pakistan on Saturday in a crucial game.", "South Africa have realistically secured a spot in the semi-finals.", "The pitch conditions were discussed, with Simon Doull noting the impact of dew around the 25-over mark.", "South Africa scored 357/4 in 50 overs.", "New Zealand was all out for 167 in 35.3 overs.", "Player of the Match was Rassie van der Dussen.", "Crowd attendance was 31,914.", "Match was held at Maharashtra Cricket Association Stadium, Pune.", "South Africa earned 2 points from the match.", "The official attendance at the match was 31,914.", "South Africa's top order gave their bowlers room to express themselves.", "New Zealand's bowling was affected by Matt Henry's injury.", "South Africa's batting line-up was further beautified by Rassie van der Dussen's century."], "ranking": [14, 10, 28, 12, 16, 9, 20, 25, 8, 18, 22, 24, 11, 15, 7, 13, 19, 21, 5, 4, 2, 1, 27, 26, 23, 17, 6, 3, 29, 30, 31]}
{"candidates": ["Paul van Meekeren finished with 4 for 23, marking a significant performance in the match.", "This is the first time Netherlands have won multiple World Cup games.", "Netherlands have won twice at the same World Cup for the first time."], "ranking": [2, 1, 3]}
{"candidates": ["Bas de Leede's figures of 2 for 115 in ten overs against Australia is now the most expensive ten-over spell in ODIs, relieving Mick Lewis of this unwanted record after 17 years."], "ranking": [1]}
{"candidates": ["Netherlands won by 87 runs.", "Taskin Ahmed was caught by de Leede off van Meekeren for 11 runs.", "Mahmudullah scored a century in the previous match against South Africa."], "ranking": [1, 2, 3]}
{"candidates": ["Netherlands chose to bat first to make an impression in their weaker department.", "Bangladesh made changes with Taskin Ahmed returning after a niggle and Mahedi Hasan replacing Nasum Ahmed.", "The pitch was expected to be good for batting with cloudy conditions.", "Scott Edwards mentioned that the team aimed for a total of 220 plus, believing it would be competitive.", "Bangladesh aimed to revive their campaign after losing four consecutive games.", "Taskin Ahmed returned to the team after missing matches against India and South Africa due to a sore shoulder.", "Netherlands won the toss and opted to bat.", "The match was held at the revamped Eden Gardens, which recently underwent significant renovation.", "Bangladesh was looking to arrest its free fall after four successive losses.", "Netherlands aimed to recover from their previous loss against Australia and improve their World Cup record."], "ranking": [6, 8, 5, 4, 3, 9, 2, 10, 1, 7]}
{"candidates": ["Paul van Meekeren expressed confidence and pride in the team's performance, especially after bouncing back from a heavy defeat against Australia.", "The Dutch team celebrated their second win in six games, a significant achievement for them.", "There is a slim chance for both Bangladesh and Netherlands to make the semi-finals, but it is highly unlikely.", "Scott Edwards expressed satisfaction with the team's performance, especially with the ball and in the field.", "Scott Edwards, the Netherlands skipper, mentioned that they aimed for a total around 220+ and praised the bowlers for their brilliant performance.", "Bangladesh captain Shakib Al Hasan reflected on their poor batting performance and emphasized the need to finish the tournament on a high.", "Paul van Meekeren expressed happiness with the team's bounce back after the loss to Australia and highlighted the team's fielding efforts."], "ranking": [5, 3, 1, 4, 6, 2, 7]}
{"candidates": ["Eden Gardens has hosted just a single ODI in the last six years, and though the pitches there historically tend to be batting-friendly, Sri Lanka were bowled out for 215 by India in that ODI this January.", "The weather in Kolkata is expected to be hot and humid, with winter setting in only towards the middle or end of November.", "Bangladesh and Netherlands have met in an ODI only twice so far, with the last meeting during the 2011 World Cup.", "All of Mahmudullah's ODI centuries have come in ICC tournaments: three in the World Cup, and one in the Champions Trophy."], "ranking": [4, 2, 3, 1]}
{"candidates": ["Taskin Ahmed makes it known that Bangladesh are not done yet, stating that if they can win their remaining four games, anything can happen."], "ranking": [1]}
{"candidates": ["Sybrand Engelbrecht and Logan van Beek added 130 runs for the seventh wicket, which was a Cricket World Cup record for that wicket.", "Netherlands’ Logan van Beek and Sybrand Engelbrecht broke the record for the highest seventh wicket partnership in ODI World Cups during their side’s match against Sri Lanka at the Ekana Stadium in Lucknow on Saturday."], "ranking": [1, 2]}
{"candidates": ["The 130-run stand between Engelbrecht and van Beek is the highest partnership for the seventh wicket or lower at a men's ODI World Cup, going past Kapil Dev and Syed Kirmani's unbeaten 126-run stand in 1983."], "ranking": [1]}
{"candidates": ["The Netherlands won the toss and decided to bat first.", "This was the first time the Netherlands batted first against Sri Lanka in their ODI encounters.", "The pitch at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium was expected to benefit the bowlers.", "There was no chance of rain, with the temperature predicted to be 31 degrees with 82% humidity.", "Sri Lanka made two changes to their XI, bringing in Dushan Hemantha and Asitha Fernando.", "Netherlands were unchanged from the side that defeated South Africa.", "Sri Lanka had an unbeaten run through the ICC Men's Cricket World Cup Qualifier, including two wins over Netherlands.", "Scott Edwards: We are going to have a bat first. The pitch looks pretty good, hopefully put a score on and look to defend it. We played reasonably well the other night, still have some improvements to make. Every team that is here would be saying the same thing, you have to probably win 5 games and that’s what we are here to do. We have got some quality spinners and quicks as well, we just come into the game, make some plans and go from there.", "Kusal Mendis: We have three injuries. We have to do well in both batting and bowling, hope we do in today’s game. We have positive things in the previous matches, we have batted really well. And the bowling unit has to bowl in partnerships. I am enjoying my own game, enjoying the captaincy."], "ranking": [8, 6, 4, 3, 5, 2, 9, 1, 7]}
{"candidates": ["Netherlands carry all the momentum into World Cup clash against Sri Lanka.", "Sri Lanka had just racked up a clean sweep of the World Cup Qualifier and dispatched the Dutch twice over the course of the tournament.", "Netherlands followed up their initial defeats with an exhilarating 38-run triumph over South Africa.", "Sri Lanka leaked a World Cup record total to South Africa and abetted a World Cup record chase to Pakistan.", "Sri Lanka's bowling attack has been blunted due to the absence of Wanindu Hasaranga.", "Netherlands pride themselves on overcoming talent or experience deficits through fielding and running between the wickets.", "Sri Lanka will head into the game as nominal favourites due to player ceilings and big-game experience.", "Scott Edwards' exemplary sweep shot is expected to be front and centre against Sri Lanka's spinners.", "Dilshan Madushanka is Sri Lanka's best route to wickets with his swing.", "Kusal Perera is to have a late check-up after suffering a concussion in the game against Australia.", "Entering this fixture, Sri Lanka has lost three straight games in the tournament.", "The Netherlands registered their first win after defeating South Africa.", "The Ekana Cricket Stadium in Lucknow has produced balanced tracks with an average score of 226 where both batters and bowlers can dominate.", "The Scott Edwards-led Netherlands have emerged as one of the biggest surprise teams in the tournament.", "The Dutch so far have played great cricket and finally won their first match with a big win over South Africa.", "The batting may be the Netherlands’ biggest concern with the top-order failing to score runs.", "The bowling has looked good with the likes of Logan van Beek, Roelof van der Merwe and Aryan Dutt performing well.", "The Sri Lankan team has had a forgettable tournament with three back-to-back losses.", "The Lankans have shown flashes of brilliance but their mistakes have weighed them down.", "The batting has had a few great performances but has lacked consistency.", "The bowling has severely lacked control and failed to pick up wickets at regular intervals.", "Sri Lanka made two changes to their side, bringing in Dushan Hemantha and Kasun Rajitha.", "Netherlands were unchanged from their previous game against South Africa."], "ranking": [10, 8, 14, 1, 16, 12, 7, 5, 18, 15, 3, 2, 6, 9, 11, 13, 4, 17, 19, 20, 21, 22, 23]}
{"candidates": ["Sri Lanka moved up to number 9 in the ICC points tally with 2 points, despite being below the Netherlands due to Net Run Rate difference.", "Sri Lanka had played 4 matches and won just one in the tournament so far.", "Kusal Mendis, the winning captain, expressed happiness with the team's performance, highlighting the bowlers' efforts and the batting of Sadeera Samarawickrama, Pathum Nissanka, and Charith Asalanka.", "Scott Edwards, the Netherlands captain, reflected on the team's competitive total and praised Aryan Dutt's bowling performance.", "Sadeera Samarawickrama, the Player of the Match, expressed happiness in finishing the game and discussed the challenging wicket conditions.", "Sri Lanka garnered their first ICC Men's Cricket World Cup 2023 win in Lucknow.", "Digital Daily with former Sri Lanka all-rounder Russell Arnold and ICC Digital Insider Ridhima Pathak discussed Sri Lanka's five-wicket victory."], "ranking": [6, 2, 5, 4, 3, 1, 7]}
{"candidates": ["Samarawickrama mentioned that the wicket was gripping and turning, and Sri Lanka planned to take the chase deep.", "Scott Edwards praised Engelbrecht and van Beek for their rescue job and Aryan Dutt for his efforts.", "Kusal Mendis expressed happiness with everyone's contributions to the win."], "ranking": [2, 3, 1]}
{"candidates": ["The Netherlands had previously defeated South Africa by 38 runs in their last match on October 17.", "Sri Lanka had lost all 3 matches before this win, including a defeat by Australia by 5 wickets.", "The Netherlands and Sri Lanka had played 5 ODIs before this match, with the Netherlands failing to defeat Sri Lanka even once.", "Player of the Match: Sadeera Samarawickrama", "Sri Lanka's win probability was 100% at the end of the match.", "Sri Lanka scored 263/5 in 48.2 overs.", "Netherlands scored 262 in 49.4 overs.", "Sri Lanka's innings included significant contributions from Pathum Nissanka (54 off 52 balls) and Charith Asalanka (44 off 66 balls).", "Sri Lanka registered their first win in the ongoing ICC Men's ODI World Cup 2023.", "Sri Lanka moved up to number 9 in the ICC points tally with 2 points.", "Despite winning, Sri Lanka is below the Netherlands in the points table due to Net Run Rate (NRR) difference.", "Sri Lanka's seamers did early damage in the match.", "Sri Lanka's first win in the tournament.", "Sri Lanka are still ninth on the points table despite the win.", "The pitch started turning towards the end of the match.", "Sri Lanka's spinners controlled the middle overs, with Maheesh Theekshana claiming the key wicket of Netherlands skipper Scott Edwards.", "Sri Lanka quicks Rajitha and Madushanka moved the ball through the air effectively at BRSABVE Cricket Stadium.", "The landing area for bowlers is giving them trouble again. The groundsmen are looking into the area where the footmarks have become prominent.", "Theekshana continues to extract sharp turn off the surface.", "The pitch here has also started to look better as the early-morning moisture has almost disappeared."], "ranking": [14, 12, 10, 16, 18, 7, 8, 5, 2, 11, 15, 3, 13, 6, 9, 1, 4, 17, 19, 20]}
{"candidates": ["The Lucknow surface has shown a propensity for some uneven bounce, rewarding bowlers that stick to a good length or just short of one.", "Spinners have found some assistance on the Lucknow surface.", "The weather is expected to be clear and sunny, and with it being a day game both sides should get similar conditions to play with.", "Sri Lanka haven't lost the opening three games of a World Cup since 1987.", "Bas de Leede has seven wickets in the competition so far. Four more will see him equal the most for Netherlands in a World Cup, a record currently held by his father, Tim de Leede.", "Netherlands' 262 is their highest total against Sri Lanka, surpassing the 258 scored in 2006.", "Sri Lanka's win marked their first victory in this World Cup after three consecutive defeats.", "This was the first time Sri Lanka had lost their first three games in a World Cup since 1987."], "ranking": [5, 6, 8, 3, 2, 1, 4, 7]}
{"candidates": ["Sri Lanka's assistant coach Naveed Nawaz emphasized the need for young bowlers to learn from their mistakes.", "Netherlands batter Teja Nidamanuru noted the growing awareness of cricket in the Netherlands."], "ranking": [2, 1]}
{"candidates": ["Mitchell Santner became the first New Zealand spinner to take a five-wicket haul at a Cricket World Cup.", "Mitchell Santner became the first New Zealand spinner to take a five-wicket haul in a men's ODI World Cup.", "Mitchell Santner became the first New Zealand spinner to register a five-wicket haul in Men's Cricket World Cup history."], "ranking": [1, 3, 2]}
{"candidates": ["New Zealand won by 99 runs", "Aryan Dutt was bowled by Matt Henry for 11 runs"], "ranking": [1, 2]}
{"candidates": ["Scott Edwards opted to bowl first, citing better bowling conditions earlier in the day.", "Tom Latham mentioned that New Zealand played a practice game on the same wicket last week and were happy to put up runs on the board.", "Lockie Ferguson replaced James Neesham in the New Zealand lineup.", "Netherlands won the toss and chose to field first.", "New Zealand made one change with Lockie Ferguson replacing James Neesham.", "Netherlands made two changes with Sybrand Engelbrecht and Ryan Klein coming in.", "New Zealand captain Tom Latham emphasized putting runs on the board and defending later.", "Netherlands skipper Scott Edwards won the toss for the second time in a row and elected yet again to take the field.", "New Zealand were boosted by the return of Lockie Ferguson in place of James Neesham.", "Kane Williamson and Tim Southee weren't available for selection today."], "ranking": [8, 6, 5, 9, 4, 3, 2, 1, 7, 10]}
{"candidates": ["New Zealand are on a high after beating England in the first match of the ICC Cricket World Cup 2023.", "The Netherlands lost their opening fixture against Pakistan on Monday, 9 October 2023, in Hyderabad.", "The Black Caps and Netherlands have faced each other in 4 matches in ODI. Out of these 4 games, New Zealand have won all four against the Netherlands.", "The weather is likely to be hazy with humidity levels touching 50% in Hyderabad. The temperature will be 33°c for October 9, 2023.", "New Zealand will still be without Kane Williamson, but Lockie Ferguson and Tim Southee are likely to be fit and available according to head coach Gary Stead", "Netherlands' Logan van Beek might miss out due to a hamstring injury", "New Zealand have never lost a World Cup game - ODI or T20I - against an Associate nation in their history", "Devon Conway has a stellar record in India with 601 runs in 11 innings at an average of 66.77 in 2023", "Vikramjit Singh has been Netherlands' highest run-getter at the World Cup qualifiers with 326 runs in eight innings at 40.75"], "ranking": [8, 5, 6, 1, 4, 3, 9, 7, 2]}
{"candidates": ["Scott Edwards acknowledged New Zealand's quality bowling attack and emphasized the need for bigger partnerships.", "Tom Latham praised the team's batting partnerships and the performance of the bowlers, especially the spinners.", "Mitchell Santner was named Player of the Match."], "ranking": [2, 1, 3]}
{"candidates": ["New Zealand consolidated their position at the top of the points table.", "Netherlands showed promise in patches but struggled against New Zealand's bowling lineup.", "New Zealand didn’t feel the absence of captain Kane Williamson.", "Netherlands lost their second consecutive match after losing to Pakistan.", "New Zealand avenged their 2019 World Cup final defeat by beating England in their previous match.", "The match was played at Rajiv Gandhi International Stadium in Hyderabad.", "New Zealand registered their second win of the ICC ODI World Cup 2023.", "The match was part of the ICC World Cup 2023.", "Netherlands needed a record chase of 323 to win, their highest successful run chase in ODIs being 291 against Zimbabwe in 2019.", "New Zealand's innings was boosted by a strong finish, scoring 50 runs off the last three overs.", "Netherlands made two changes into their XI. Klein and Sybrand Engelbrecht made it into the playing XI.", "Logan van Beek was out due to a hamstring strain.", "New Zealand adopted an aggressive approach throughout their innings to belt out a big total in Hyderabad."], "ranking": [5, 8, 6, 10, 2, 13, 4, 12, 1, 3, 9, 11, 7]}
{"candidates": ["The Hyderabad surface has historically been a high-scoring one with an average first-innings score of 288", "The temperature should revolve around the mid-30s in the afternoon while the evenings will be slightly cooler with no chances of rain", "Devon Conway has scored 307 runs in four ODI innings in India, averaging 102.3 with a strike rate of 121 and has two centuries to his name", "Matt Henry has picked up the most wickets for New Zealand in ODIs since the start of 2022 - 35 in 21 innings at 26.20"], "ranking": [2, 4, 1, 3]}
{"candidates": ["The New Zealand vs Netherlands World Cup match will be played on Monday, 9 October 2023.", "The New Zealand vs Netherlands Cricket World Cup Match 2023 will start at 2:00 PM IST with the toss scheduled at 1:30 PM IST.", "The New Zealand vs Netherlands World Cup match will be played at the Rajiv Gandhi International Stadium in Hyderabad.", "The New Zealand vs Netherlands World Cup match will be broadcast live on the Star Sports Network.", "The New Zealand vs Netherlands World Cup match will be live streamed on Disney+ Hotstar app and website."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["India also go 8-0 against Pakistan in ODI World Cups.", "India have won all eight meetings against Pakistan at ICC Men's Cricket World Cups.", "India have failed to win just four of their last 29 Cricket World Cup games, a better record than any other nation.", "Pakistan’s collapse of eight wickets for just 36 runs is their worst such collapse at a World Cup and their third worst ever in One Day Internationals.", "India’s 43rd ODI wicket inside the first ten overs of this calendar year is the most of any full-member side.", "Rohit Sharma’s effort in this game took his ODI tally to 302 sixes, behind just Shahid Afridi and Chris Gayle in the format.", "Rohit Sharma’s latest efforts took him above AB de Villiers in the number of maximums at white-ball World Cups.", "India maintained their unbeaten World Cup record against Pakistan, making it 8-0 in ODI World Cups."], "ranking": [5, 4, 3, 2, 8, 6, 7, 1]}
{"candidates": ["India are now 8-0 against Pakistan in World Cups", "Rohit Sharma has made 217 runs in 147 balls over his last two trips to the crease", "Rohit Sharma is already the record holder for most World Cup centuries"], "ranking": [2, 1, 3]}
{"candidates": ["Jasprit Bumrah was named Player of the Match for his bowling figures of 2/19.", "Rohit Sharma scored 86 runs off 63 balls, including 6 fours and 6 sixes.", "Shreyas Iyer scored an unbeaten 53 off 62 balls.", "India won by 7 wickets with 117 balls remaining.", "Jasprit Bumrah's slower ball to dismiss Mohammad Rizwan will be talked about for years to come.", "Rohit Sharma scored 86 off 63 balls with six fours and six sixes.", "Shreyas Iyer scored 53* off 62 balls.", "India won by 7 wickets with 117 balls remaining.", "Pakistan lost 8 wickets for 36 runs in a stunning collapse.", "Jasprit Bumrah took 2 wickets for 19 runs.", "Kuldeep Yadav took 2 wickets for 35 runs.", "Jasprit Bumrah was named Player of the Match for his game-defining efforts with the ball, taking 2/19 in seven overs.", "Rohit Sharma and Shreyas Iyer hit half centuries to steer their team home with 19.3 overs remaining.", "Pakistan’s collapse saw eight wickets fall for just 36 runs.", "Rohit Sharma's quickfire fifty with six fours and six sixes steered India to victory.", "Babar Azam scored his first-ever half-century against India during their encounter in Ahmedabad.", "India win by seven wickets to extend winning start and end Pakistan's", "Rohit Sharma scored 86 off 63 balls, including six sixes", "Shreyas Iyer scored 53", "Shaheen Afridi took 2-36", "Pakistan slipped from 155-2 to 191 all out", "Bumrah, Siraj, Hardik, Kuldeep & Jadeja all took two wickets", "Babar Azam scored 50", "Mohammed Siraj bowled Babar Azam on 50", "Rizwan scored 49", "Imam scored 36", "Rohit Sharma led from the front with a significant performance.", "India chased down Pakistan's 191, scoring 192 for three in 30.3 overs to register a seven-wicket victory.", "India win by seven wickets with 117 balls remaining", "WICKET! India 156-3 (Rohit c Iftikhar b Afridi 86)", "WICKET! India 79-2 (Kohli c Babar b Hasan 16)", "WICKET! India 23-1 (Gill c Shadab b Afridi 16)", "PAKISTAN ALL OUT FOR 191", "Wicket! Hasan Ali c Gill b Jadeja 12 (Pakistan 187-9)", "Wicket! Mohammad Nawaz c Bumrah b Hardik 4 (Pakistan 187-8)", "Wicket! Shadab Khan b Bumrah 2 (Pakistan 171-7)", "WICKET!! Rizwan b Bumrah 49 (Pakistan 168-6)", "WICKET! Iftikhar b Kuldeep 4 (Pakistan 166-5)", "Wicket! Shakeel LBW b Kuldeep 6 (Pakistan 162-4)", "WICKET!! Babar b Siraj 50 (Pakistan 155-3)", "Fifty to Babar Azam", "WICKET! Imam-ul-Haq c Rahul b Hardik 36 (Pakistan 73-2)", "Wicket! Shafique LBW b Siraj 20 (Pakistan 41-1)"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43]}
{"candidates": ["Babar Azam says Pakistan will look to break India’s 7-0 record while Rohit Sharma wants to ‘play good cricket’.", "Pakistan have never beaten India in the ICC ODI World Cup in their seven meetings.", "Both teams go into Saturday’s match having won their two opening matches of the 50-over showpiece event.", "India’s captain, Rohit Sharma, said the team’s focus remains on playing a quality opposition and not on records.", "Rohit said his team weren’t favourites, neither were they underdogs, but they have'momentum' after two wins.", "Defiant Pakistan captain Babar Azam has declared ahead of the match that'records are meant to be broken'.", "Azam said he has told his players that the clash inside the 132,000-capacity Ahmedabad stadium is a 'golden opportunity' to write their names into World Cup folklore.", "Opener Shubman Gill, who missed the Australia and Afghanistan games because of dengue fever, has rejoined the team in Ahmedabad, and Gill is '99 percent available to play', according to his captain.", "India will also toy with the idea of bringing back off-spinner Ravichandran Ashwin.", "Pakistan’s batting change against Sri Lanka worked wonders with Abdullah Shafique scoring a fine century on his World Cup debut.", "It consigns out-of-form Fakhar Zaman to the bench at least in the short term while also adding strength to the batting lineup that is so dependent on captain Babar Azam and Mohammed Rizwan.", "Rohit vs Shaheen: Rohit has struggled against Shaheen Shah Afridi’s left-arm pace in a duel that began at the T20 World Cup in 2021 when Shaheen trapped Rohit lbw for a duck in the first over with his pace and swing in Dubai.", "But Rohit came back prepared when the rivals met in Colombo and remained cautious against the quick despite hitting a six off his first over.", "Kohli vs Rauf: The stakes were high when Virat Kohli came up against Haris Rauf in a challenging chase at the T20 World Cup in Melbourne last year but Kohli held his nerve to smash Rauf for two sixes to bring the house down at a packed MCG.", "Kohli later said the sixes were 'instinctive', but it began a great battle with the Pakistan quick.", "Babar vs Bumrah: Jasprit Bumrah experienced the Pakistan captain’s ability at the last T20 World Cup when Babar took on the Indian attack including Bumrah, a yorker king, with ease.", "But Bumrah beat Babar on a few occasions in Colombo before Hardik Pandya got the prized wicket.", "35 parking lots, 120 food stalls - How Motera is shaping up for Ind vs Pak", "Rohit: 'The guys in the team love big grounds'", "India vs Pakistan: What will be the deciding phase of the game?", "Does Imam-ul-Haq keep his place? Will Shardul be backed in Ahmedabad?", "Catching up with a Pakistan fan ahead of India vs Pakistan", "Babar: 'I've not been able to play the way I wanted to this World Cup'", "Why has Bumrah stood out? What's ailing Shaheen?", "Once the first ball is bowled, everything is back to normal"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["Fireworks went off in Ahmedabad as India won", "The crowd sang verses from Ma Tujhe Salaam", "Rohit Sharma expressed pride in the team's performance"], "ranking": [1, 3, 2]}
{"candidates": ["India elected to field first after winning the toss.", "The match was held at Narendra Modi Stadium, Ahmedabad.", "India earned 2 points from this match, while Pakistan earned 0 points.", "Tickets for the match were reportedly sold out within an hour of going on sale a few weeks ago. The organisers released another 14,000 tickets last week, but fans complained that those too disappeared within minutes.", "A capacity crowd is expected at the cauldron named after India’s prime minister.", "Tens of thousands of ticket-holders have reached the western Indian city from all over the world and some are even staying overnight in local hospitals, a cheaper option than hotels.", "Local hospitals have seen a sudden influx of patients booked in for check-ups involving a night’s stay to coincide with the most anticipated match of the World Cup.", "Several doctors told local media the rush for check-up packages was an ingenious way to find affordable accommodation as hotel costs have soared up to 20-fold ahead of the match.", "Cricket fans were left befuddled when the tournament got under way last week without the fanfare of a colourful opening ceremony.", "However, in an equally surprising move, Indian cricket officials have announced a star-studded show ahead of Saturday’s match.", "India make it three out of three and move to the top of the points table with a big win.", "The fireworks go off in Ahmedabad.", "India win by seven wickets with 19.3 overs to spare.", "India were always going to be on top after Pakistan's collapse.", "India maintained their unbeaten World Cup record against Pakistan.", "Sachin Tendulkar reacted to the love from the crowd as he brought out the ICC Men's Cricket World Cup 2023 trophy prior to India's match against Pakistan.", "India maintained their unbeaten World Cup record against Pakistan.", "India won with 117 balls remaining, although not their biggest victory over Pakistan in terms of balls left in ODIs", "Fireworks lit up the night sky in Ahmedabad after the match", "Fans created a surreal moment at the Narendra Modi Stadium by holding aloft their cellphones and switching on the torchlights.", "It’s now India 8-0 Pakistan at ODI World Cups, and this is the most emphatic win of the lot. Their captain Rohit Sharma was inspired with both brain and bat. First he presided over an almighty Pakistan collapse from 155/2 to 191 all out; then he pre-empted any new-ball ferocity from Pakistan by whacking six sixes in a 63-ball 86.", "India recorded the fastest ODI run chase against Pakistan, finishing with almost 20 overs to spare."], "ranking": [14, 10, 12, 16, 11, 15, 13, 17, 7, 9, 5, 6, 4, 3, 8, 2, 1, 18, 19, 20, 21, 22]}
{"candidates": ["Virat Kohli became the second India batter to score 3000 runs in international cricket against South Africa.", "Virat Kohli equalled Sachin Tendulkar in becoming only the second batter in the history of ODI cricket to reach 6000 runs at home.", "Virat Kohli equals Sachin Tendulkar's record of 49 ODI hundreds", "Ravindra Jadeja equalled Sachin Tendulkar's tally of ODI five-fors", "Marco Jansen's 9.4-0-94-1 is the most expensive spell by a South African at a World Cup", "Virat Kohli equalled Sachin Tendulkar's record with his 49th ODI century.", "Ravindra Jadeja achieved career-best bowling figures of 5 for 33.", "Virat Kohli equalled Sachin Tendulkar's record of 49 ODI centuries.", "Ravindra Jadeja achieved career-best figures of 5 for 33.", "South Africa recorded their joint second-lowest total in ODI cricket.", "Virat Kohli hit his 49th ODI century, equalling Sachin Tendulkar's record.", "Virat Kohli surpassed 500 runs in the tournament.", "Kohli equalled Tendulkar's record of 49 ODI hundreds", "Jadeja became the first Indian bowler to take a World Cup five-wicket haul", "Virat Kohli, on his 35th birthday, equals Sachin Tendulkar's record for most ODI centuries (49)", "India are the second team to bowl two opponents out for under 100 in a single men's World Cup (Sri Lanka 55, South Africa 83). India had never previously dismissed their opponents for <100 in a World Cup match."], "ranking": [5, 3, 2, 14, 15, 1, 12, 2, 12, 11, 1, 9, 2, 4, 6, 8]}
{"candidates": ["Virat Kohli is one short of equalling Sachin Tendulkar's record of most ODI hundreds.", "South Africa's 82 sixes in the tournament are the most by any team in a single edition of the World Cup."], "ranking": [1, 2]}
{"candidates": ["Virat Kohli grafted the Indian innings against South Africa at Eden Gardens after Rohit Sharma and Shubman Gill fell in quick succession inside 11 overs.", "Virat Kohli and Shreyas Iyer added 103 runs between themselves from 126 balls.", "Virat Kohli completed his half-century from 67 balls.", "Virat Kohli made a century on his birthday", "India bowled South Africa out for 83", "Ravindra Jadeja took five wickets", "India beat South Africa by 243 runs", "Jadeja's five wickets included Rabada, Jansen, Maharaj, Miller, and Klaasen", "Shami took key wickets including van der Dussen and Markram", "Siraj dismissed De Kock early in the innings", "Virat Kohli scored an unbeaten 101 runs.", "Ravindra Jadeja took 5 wickets for 33 runs.", "India scored 326 for 5.", "South Africa were bowled out for 83.", "India won by 243 runs.", "Virat Kohli scored an unbeaten 101.", "Ravindra Jadeja took 5 wickets for 33 runs.", "Shreyas Iyer scored 77 runs.", "India scored 326 for 5.", "South Africa was bowled out for 83.", "India won by 243 runs.", "Keshav Maharaj bowled a boundary-less spell of 10-0-30-1.", "Mohammed Shami dismissed Aiden Markram with a delivery that kissed the outside edge.", "Kuldeep Yadav took 2 wickets.", "Virat Kohli scored an unbeaten 101.", "Ravindra Jadeja took 5 wickets for 33 runs.", "India scored 326-5.", "South Africa were bowled out for 83 runs.", "Shreyas Iyer scored 77 runs.", "Rohit Sharma scored 40 runs off 24 balls.", "Mohammed Shami took 2 wickets for 18 runs.", "Kuldeep Yadav took 2 wickets for 7 runs.", "Marco Jansen was South Africa's highest scorer with 14 runs.", "Virat Kohli scored an unbeaten 101", "Ravindra Jadeja took 5 wickets for 33 runs", "India won by 243 runs", "South Africa were bowled out for 83 runs", "Kuldeep Yadav bowled Ngidi to finish the match", "Ravindra Jadeja takes 5-33 as South Africa subside to 83 all out in run-chase", "Virat Kohli scored a century", "Shreyas Iyer adds 77 to Kohli's ton", "Rohit Sharma hammers 24-ball 40 to get India off to a flier", "India won the toss and batted first in Kolkata", "India posted 326-5", "India won by 243 runs", "Kuldeep Yadav's googly sticks in the pitch and Marco Jansen can only chip it to the hands of Ravindra Jadeja at short cover", "Ravindra Jadeja has his five-wicket haul at a World Cup as Kagiso Rabada drives it low and straight back to the India spinner who takes the catch"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47]}
{"candidates": ["India won by 243 runs.", "Mohammed Shami took 5 wickets in the match.", "Lungi Ngidi was bowled by Kuldeep Yadav for 0."], "ranking": [1, 2, 3]}
{"candidates": ["India won the toss and chose to bat", "South Africa needed 327 to win"], "ranking": [1, 2]}
{"candidates": ["Experts predicted a high-voltage contest between India and South Africa.", "Rohit Sharma and Temba Bavuma faced a toss conundrum regarding whether to bat or bowl first.", "South Africa's top order has been strong when batting first, while India prefers chasing.", "India's five-bowler strategy will be tested in the absence of Hardik Pandya.", "Mohammed Shami has been impactful despite not being in the first-choice XI initially.", "Quinton de Kock is the leading run-scorer and century-maker at this stage of the World Cup.", "The top two teams of the ICC Men's ODI World Cup 2023, India and South Africa, will be facing off in Match 37 on Sunday in Kolkata.", "The highly anticipated game will take place at the iconic Eden Gardens on the day when former India skipper Virat Kohli will celebrate his 35th birthday.", "India has maintained an unbeaten record in the competition, while South Africa's only loss came against the Netherlands.", "India currently holds the top position on the points table, having played seven and won as many matches, becoming the 1st team to qualify.", "South Africa is not far behind and has also played seven matches having won six and a very healthy Net Run Rate (NRR).", "The Proteas, despite being in second place on the points table, boasts a superior NRR compared to India, standing at +2.290.", "The pitch for the upcoming match is expected to strike a balance between favoring both batsmen and bowlers. In the previous five matches on this pitch, the average first innings total has been approximately 225 runs. Therefore, the team that wins the toss might opt to field first to exploit the pitch conditions.", "India vs South Africa is a highly anticipated match at Eden Gardens on November 5, 2023.", "India has won seven consecutive matches and has already qualified for the CWC23 semifinals.", "South Africa has scored five 300-plus team totals in this World Cup and has the most wickets in the competition with 67.", "South Africa leads the overall head-to-head record with 50 wins in 90 games and has won three out of five World Cup meetings against India.", "India has won 17 out of 31 INDvSA matchups on home soil and two out of three ODI contests at Eden Gardens.", "Experts predicted India as the favorites given their home advantage.", "The pitch will be fast and skiddy, as it mostly is here in Kolkata. The batters should enjoy batting, with the pacers looking to hurry the batters with their speeds. A total of around 300 will be a fighting one.", "A temperature of 32°C, with no threat of rain, is forecast.", "Rohit Sharma enjoys batting at Eden Gardens. Moreover, he also likes pace on his bat and has been in terrific touch lately. Expect Rohit to score big.", "Virat Kohli has a tremendous record against South Africa, and he always scores runs against them. Virat can again play a big knock, given the kind of form he’s in.", "Quinton de Kock has a sensational record against India, and his recent form has also been very good. He likes playing on surfaces like Kolkata, where the ball gets extra bounce and comes nicely on the bat. Another big score might well be on the cards."], "ranking": [14, 18, 16, 20, 19, 5, 12, 11, 2, 3, 4, 15, 13, 6, 7, 8, 9, 10, 1, 17, 21, 22, 23, 24]}
{"candidates": ["Virat Kohli expressed his honor in equaling Tendulkar's record and his emotional connection to the achievement", "Kohli reflected on the importance of batting deep and the partnership with Shreyas Iyer", "Kohli mentioned the significance of the moment happening on his birthday", "Anil Kumble marveled at Virat Kohli's ODI numbers.", "Virat Kohli described equalling Tendulkar's record as'stuff of dreams'.", "Kohli expressed his enjoyment of playing cricket again and the special feeling of equalling Tendulkar's record on his birthday", "India captain Rohit Sharma: 'I think we are getting better. We look how we have played in the last three games. We played better in terms of adapting to the situation. Again today it was not an easy pitch. You needed some like Virat Kohi to bat the situation. Same with Shreyas Iyer. We knew we had the runs on the board to put the ball in the right areas and the pitch would do the rest.'", "South Africa skipper Temba Bavuma: 'Look we know it's a challenge. We know there's a narrative about us chasing. We didn't do that game a lot of justice. But I think we have our conversations as a batting group, we have discuss it unemotionally.'", "Player of the match Virat Kohli: 'It was a big game and we were playing the toughest team in the tournament who have played well so far. Because it's my birthday it becomes more special. I had the sense it's going to be something more than just one more game in the World Cup. I woke up with that excitement.'", "On equalling Sachin Tendulkar's record of 49 ODI centuries: 'For me it's too much to take in right now. To equal my hero's record is a huge honour. People like comparisons. I am never going to be as good as him. He is perfection with batting. It's an emotional moment. I know where I come from and to watch him on TV. His appreciation means a lot to me.'"], "ranking": [10, 4, 6, 3, 9, 8, 2, 1, 7, 5]}
{"candidates": ["Rahul Dravid acknowledged South Africa's strong performance in the tournament.", "Temba Bavuma emphasized dealing with pressure moments effectively."], "ranking": [2, 1]}
{"candidates": ["The pitch at Eden Gardens has balanced conditions for both fast bowlers and spinners.", "Dew could play a role in the second innings.", "Virat Kohli is yet to get out to spin in this World Cup.", "Jasprit Bumrah and Ravindra Jadeja have economy rates under four in this World Cup.", "Marco Jansen has picked up the most wickets in the powerplay in this World Cup.", "Lungi Ngidi has dismissed Shreyas Iyer four times in 30 balls in ODIs.", "Keshav Maharaj is two wickets short of 50 ODI wickets.", "A Virat Kohli birthday celebration is expected at Eden Gardens with 70,000 fans wearing his face masks.", "Notable players to watch include Rohit Sharma, Mohammed Shami, and Virat Kohli for India, and Temba Bavuma, Quinton de Kock, and Kagiso Rabada for South Africa."], "ranking": [8, 9, 4, 5, 3, 2, 6, 1, 7]}
{"candidates": ["Adam Zampa became the tournament’s leading wicket-taker.", "Adam Zampa moved to the top of the bowling charts at this World Cup with 18 dismissals, level with Sri Lanka's Dilshan Madushanka.", "England has lost six matches for the first time in a World Cup."], "ranking": [2, 1, 3]}
{"candidates": ["Australia won by 33 runs.", "Adam Zampa took 3/21 in his ten overs, scored 29 runs with the bat, and took a brilliant catch.", "Marnus Labuschagne scored 71 off 83 balls.", "Cameron Green scored 47 off 52 balls.", "Chris Woakes took 4/54 in 9.3 overs.", "Adil Rashid took 2/38 in 10 overs.", "Ben Stokes scored 64 off 90 balls.", "Dawid Malan scored 50 off 64 balls.", "Pat Cummins took 2/49 in 10 overs.", "England were all out for 253 in 48.1 overs.", "Hazlewood took the last wicket to end England's innings.", "Adil Rashid hit a six off a high full-toss.", "Cameron Green's trousers slipped while diving to save a boundary.", "Australia won by 33 runs", "Adil Rashid c †Inglis b Hazlewood 20 (15b 1x4 1x6 23m) SR: 133.33", "Glenn Maxwell, the recent compiler of the fastest century in World Cup history, is out of contention after his freakish golf injury", "David Willey's impending international retirement", "Adam Zampa wins Man of the Match for his 3/21.", "England all out for 253 runs.", "Australia won the match by 33 runs and inch closer to a place in the semi-final.", "England scored 44 runs off the last 3 overs with 2 wickets in hand.", "England were at 196/7 in 40.4 overs.", "England were 174/6 in 37 overs."], "ranking": [14, 1, 6, 8, 5, 9, 7, 10, 12, 13, 16, 18, 15, 2, 20, 19, 3, 11, 4, 17, 21, 22, 23]}
{"candidates": ["Jos Buttler won the toss and chose to field first.", "Jos Buttler won the toss and chose to bowl first.", "Australia made two changes: Marcus Stoinis and Cameron Green replaced Glenn Maxwell (concussion) and Mitchell Marsh (family reasons).", "David Willey's international retirement was a talking point before the match.", "Joe Root's form was under scrutiny, having scored 11, 3, 2, and 0 in his last four innings.", "England win the toss and elect to field", "Reigning champions England won the toss and decided to bat first at the Narendra Modi Stadium in Ahmedabad.", "Australia made two forced changes in their playing XI with Marcus Stoinis and Cameron Green coming in for Mitchell Marsh and Glenn Maxwell.", "England opted to go for the same side.", "England have had a miserable World Cup defense, winning just 1 of their 6 matches and sitting at the bottom of the ICC World Cup points table.", "Australia have had a decent campaign so far and are favorites to reach the semi-finals of the marquee event.", "A victory against England in Ahmedabad will all but cement the Kangaroos' position in the semi-final of the ODI World Cup."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 11, 1, 12]}
{"candidates": ["Australia's win sees them put one foot into the semi-finals.", "England's sixth defeat sees them mathematically out of contention to finish in the top four.", "Australia's win moved them into third place, two points above New Zealand, and closer to confirming their spot in the semi-finals.", "Mitchell Marsh is set to rejoin the squad after returning home due to a family bereavement.", "Adam Zampa's performance was highlighted as crucial in Australia's victory.", "Jos Buttler expressed disappointment and acknowledged that England did not do themselves justice in the tournament.", "Pat Cummins praised his team's performance and highlighted the improvement in their fielding and the contributions of different match-winners.", "Adam Zampa reflected on his performance, emphasizing his strategy of attacking the stumps and staying positive while batting.", "Jos Buttler expressed concern over his own form and performance.", "Buttler mentioned the team's disappointment and failure to meet expectations.", "Speculation about the future of coach Matthew Mott.", "Jos Buttler: 'It hurts a lot. We haven’t done ourselves justice. Coming into the tournament we fancied ourselves to have a real go and push whoever it was going to be all the way. It’s incredibly tough to reach those highs absolutely. Everyone knows how much hard work goes into that, and even when you come up short.'", "Moeen Ali: 'Obviously very disappointed, we just haven’t been good enough in this tournament, a lack of confidence in the side. A little better today. We tried so much, and as players tried to be really aggressive but we just couldn’t do it and lost wickets in clumps.'", "Pat Cummins: 'We knew at the start of the tournament we weren’t at our best, we’ve seen a marked improvement. Adam Zampa is a match-winner, and we’re lucky to have a few of them. We feel like we have a whole squad ready to play.'", "Jos Buttler expressed disappointment in his own form and the team's performance, acknowledging the low point and the need to improve.", "Pat Cummins praised his team's performance and highlighted Adam Zampa's contributions.", "Michael Vaughan commented on England's loss of form and poor decision-making.", "Adam Zampa reflected on his performance and the conditions, expressing hope for continued success.", "Jos Buttler expressed disappointment and described the loss as a low point.", "Pat Cummins praised his team's performance and their five-match winning streak.", "With the final wicket of Adil Rashid, Australia won the game by 33 runs and the defending champions England are officially knocked out of the ICC World Cup 2023.", "With these 2 points, Australia has increased their chances to enter the semi-finals and will maintain their hold on the third position of the points table."], "ranking": [10, 9, 8, 20, 7, 6, 5, 18, 17, 16, 15, 14, 13, 12, 11, 4, 3, 2, 1, 19, 21, 22]}
{"candidates": ["Jos Buttler expressed disappointment and acknowledged the team's shortcomings.", "Pat Cummins praised his team's performance and highlighted their improvement.", "Mitchell Starc commented on the team's momentum and Zampa's performance.", "Adam Zampa reflected on his performance and the conditions.", "Ben Stokes tells the media that their assessment of England's World Cup campaign is spot on"], "ranking": [3, 2, 4, 5, 1]}
{"candidates": ["The Australian team wore black armbands in memory of Mitchell Marsh's grandfather.", "Mitch Marsh will rejoin the squad in Mumbai by Monday.", "Australia wore black armbands during their fielding innings in memory of Mitchell Marsh's grandfather.", "The match was played in Ahmedabad with a temperature of 34°C.", "Australia's innings ended at 286 all out, with Chris Woakes and Adil Rashid being the standout bowlers for England.", "The match was held at Narendra Modi Stadium, Ahmedabad.", "Australia won by 33 runs, moving closer to the semi-finals.", "England's defeat marked their sixth loss in seven games, ending their title defense in the World Cup.", "The ground felt dewy and wet, affecting play conditions.", "England's World Cup defense ended with this match.", "The match took place at the Narendra Modi Stadium in Ahmedabad, India.", "The England vs Australia match aired live on Indian television via Star Sports channels and was available for free live streaming on the Disney+Hotstar app and website.", "Social media giant Meta partnered with the ICC for World Cup 2023 coverage on Instagram, WhatsApp, Facebook, and Threads.", "The match started at 2 PM."], "ranking": [12, 13, 11, 14, 8, 10, 2, 1, 9, 3, 6, 5, 4, 7]}
{"candidates": ["England, the defending champions, are now officially out of the World Cup.", "Australia solidified their position at the points table with five wins in seven games.", "Most consecutive defeats for a Full member side in WCs: 11 Afghanistan (2019-23), 7 Sri Lanka (1983-87), 6 Bangladesh (2023), 5 West Indies (2019), 5 England (2023).", "Most defeats for a Full member side in a World Cup: 9 Afghanistan (2019), 6 Sri Lanka (1987), 6 Bangladesh (2007), 6 West Indies (2019), 6 Bangladesh (2023), 6 England (2023).", "As so often in Ahmedabad, the soil type will be a key factor in how the pitch plays. Black soil promises slow and low, red soil promises quick and bouncy", "Australia have won six of their previous nine meetings with England at the 50-over World Cup, including four in a row from 2003 to the group stage in 2019", "Jos Buttler needs another 72 runs to become the third-fastest Englishman to 5000 ODI runs, in 150 innings", "David Willey, who has confirmed his retirement from international cricket at the end of the tournament, needs six more wickets in a maximum of three games to reach 100 in ODIs", "Australia and England have faced off on 155 occasions in ODIs, with Australia winning 87 of those matches."], "ranking": [1, 2, 8, 7, 9, 3, 5, 4, 6]}
{"candidates": ["Josh Hazlewood recorded the most economical figures of any Australian bowling eight overs or more since Nathan Bracken in 2006."], "ranking": [1]}
{"candidates": ["Travis Head scored 62 off 48 balls and took 2 wickets for 21 runs.", "David Miller scored 101 off 116 balls.", "Mitchell Starc took 3 wickets for 34 runs.", "Pat Cummins took 3 wickets for 51 runs.", "Josh Hazlewood took 2 wickets for 12 runs.", "Australia won by 3 wickets with 16 balls remaining.", "Travis Head broke a 95-run partnership by clean bowling Heinrich Klaasen.", "Travis Head trapped Marco Jansen leg before on the next ball.", "David Miller scored a century (101) and frequently attacked Adam Zampa.", "Mitchell Starc and Josh Hazlewood ripped through South Africa's top order.", "Mitchell Starc took 3-34 from 10 overs.", "Josh Hazlewood took 2-12 from eight overs.", "Pat Cummins removed Kagiso Rabada, ending South Africa's innings at 212.", "David Warner and Travis Head got Australia off to a flying start with a 60-run partnership.", "Rassie van der Dussen took a classic catch to dismiss Mitch Marsh.", "Tabraiz Shamsi and Keshav Maharaj bowled excellently to complicate Australia's chase.", "Travis Head scored 62 from 48 balls.", "Pat Cummins and Mitchell Starc guided Australia to a thrilling victory.", "Australia win by 3 wickets", "David Miller scored 101 runs for South Africa", "Mitchell Starc took 3 wickets for 34 runs", "Travis Head scored 62 runs for Australia", "Tabraiz Shamsi took 2 wickets for 42 runs", "Pat Cummins hit the winning boundary for Australia", "Australia move into their eighth World Cup final"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["Australia won by 3 wickets with 16 balls remaining.", "David Warner produced a significant performance as he enters the final weeks of his one-day career.", "Mitchell Marsh and Glenn Maxwell secured Australia each of the two highest individual scores of the tournament, and the fastest century too."], "ranking": [2, 3, 1]}
{"candidates": ["South Africa won the toss and elected to bat first."], "ranking": [1]}
{"candidates": ["Travis Head was named Player of the Match.", "Australia advanced to the final of the ICC Cricket World Cup.", "Pat Cummins expressed pride in the team's effort and highlighted the contributions of David Warner, Josh Inglis, and Travis Head.", "Tevemba Bavuma lamented South Africa's poor start and acknowledged Australia's outstanding performance.", "Travis Head reflected on his performance and the significance of playing in the World Cup final.", "Australian captain Pat Cummins expressed relief and pride in the team's fielding performance", "Travis Head reflected on the tense finish and his Player of the Match award", "Cummins mentioned the advantage of having players with previous final experience"], "ranking": [5, 8, 2, 6, 3, 4, 1, 7]}
{"candidates": ["Pat Cummins subtly hinted about South Africa's record in knockout matches.", "Temba Bavuma expressed a sense of calmness within the team despite the normal level of anxiety."], "ranking": [2, 1]}
{"candidates": ["The match was held at Eden Gardens, Kolkata.", "The match was a day-night 50-over game.", "The match was played under the lights at Eden Gardens.", "Australia will face India in the final in Ahmedabad.", "The match was held at Eden Gardens, Kolkata", "The game was described as low-scoring and full of tension", "Australia will face India in the final"], "ranking": [7, 6, 5, 4, 7, 2, 3]}
{"candidates": ["The pitch at Eden Gardens promised turn for the spinners and sluggish but true bounce for the quicks.", "Rain was a potential factor affecting the match, with a reserve day available.", "Australia and South Africa had played each other on seven previous occasions at World Cups, with three wins each and one infamous tie.", "In their overall head-to-head in ODIs, South Africa had a slight edge with 55 wins to Australia's 50.", "Maxwell needed 108 runs to reach 4000 in ODIs, while Warner needed 104 to reach 7000.", "Zampa needed six more wickets in a maximum of two games to set a new record for a single World Cup, beating the 27 that Mitchell Starc claimed in 2019.", "Australia and South Africa have faced off on 109 occasions in ODIs, with Australia winning 50 matches.", "South Africa has won 55 matches against Australia in ODIs.", "The match will begin at 2:00pm IST on 16 November 2023.", "TV/Live Stream information: India - Star Sports/Disney+ Hotstar, Australia - Fox Cricket/9Now, Kayo Sports, UK - Sky Sports/Sky Sports Go, Now TV, New Zealand - Sky Sport/Sky Sport Now, USA/Canada - Willow TV/ESPN+."], "ranking": [8, 9, 5, 6, 4, 1, 7, 3, 10, 2]}
{"candidates": ["Rohit Sharma became the leading century-maker in World Cup history with his 7th World Cup hundred.", "Rohit Sharma equalled David Warner's record for the quickest 1000 runs in World Cups.", "Rohit Sharma broke Chris Gayle's record for most sixes in international cricket across formats.", "Rohit Sharma broke Kapil Dev's record for the fastest hundred by an Indian in World Cups, reaching the landmark off 63 balls.", "Rohit Sharma's 131 was the highest score by an Indian batter in a successful run-chase in the World Cup.", "Rohit Sharma now has 31 ODI hundreds, surpassing Ricky Ponting.", "Rohit Sharma scored 131 off 84 balls, which is a significant performance in the match.", "Rohit Sharma reaches a seventh World Cup century in 19 innings, surpassing Sachin Tendulkar's six tons in 44 innings.", "Rohit Sharma broke Kapil Dev's record for India's fastest World Cup century, achieving it in 63 balls compared to Kapil Dev's 72 balls in 1983 against Zimbabwe.", "Rohit Sharma went past Sachin Tendulkar for the most hundreds at the ODI World Cup", "Rohit Sharma scored the fastest century by an Indian at an ODI World Cup, reaching it in 63 balls", "Rohit Sharma scored the fastest century for an Indian batsman in a World Cup game, finishing on 131.", "Rohit Sharma's seventh World Cup hundred is the most by an Indian batsman.", "Rohit Sharma is now third on the list of all-time ODI hundreds with 31, after Sachin Tendulkar (49) and Virat Kohli (47).", "Rohit Sharma surpassed Chris Gayle's tally of 553 for the most sixes in international cricket.", "Hashmatullah Shahidi and Azmatullah Omarzai's 121-run partnership is the second highest ever in the World Cup for Afghanistan.", "Hashmatullah Shahidi's third 50-plus score in World Cups is the most for an Afghanistan batsman.", "Rohit Sharma hit the fastest World Cup century by an India player off 63 balls.", "Rohit Sharma became the leading six-hitter in international cricket.", "Rohit Sharma scored his seventh World Cup century, the most of any player.", "Rohit Sharma's 131 included the fastest-ever Cricket World Cup hundred by an Indian.", "Rohit Sharma smashed the fastest century by an Indian player at a Cricket World Cup, reaching his century in just 63 balls, breaking a 40-year record set by Kapil Dev.", "Rohit Sharma has gone clear of Sachin Tendulkar with seven Cricket World Cup centuries.", "Rohit Sharma joined David Warner as the joint-fastest batters to reach 1000 Cricket World Cup runs, doing so in just 19 innings.", "Rohit Sharma is the only Cricket World Cup 2023 captain to score a century to this point of the tournament.", "Rohit Sharma made his 31st ODI hundred, overtaking Ricky Ponting in third place in the total ODI century list.", "Rohit Sharma became the batter with most international sixes across all formats, with 556 sixes, passing Chris Gayle."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Rohit Sharma scored 131 off 84 balls.", "Jasprit Bumrah took 4 wickets for 39 runs off 10 overs.", "Rohit Sharma was involved in a 156-run opening stand with Ishan Kishan.", "Ishan Kishan scored a run-a-ball 47.", "Virat Kohli scored his second successive half-century of the World Cup.", "India won by 8 wickets with 15 overs to spare.", "Rohit Sharma scored 131 off 84 balls.", "Virat Kohli scored 55 not out off 56 balls.", "Jasprit Bumrah took 4 wickets for 39 runs.", "India won by 8 wickets with 90 balls remaining.", "Rohit Sharma scored 131 runs off 84 balls, including 16 fours and 5 sixes.", "India chased down Afghanistan's 272 with 15 overs to spare, finishing at 273 for 2 in 35 overs.", "Jasprit Bumrah took four wickets.", "Afghanistan's Shahidi and Azmatullah scored half-centuries.", "Rohit Sharma scored 131 runs.", "Jasprit Bumrah took 4 wickets for 39 runs.", "Hashmatullah Shahidi scored 80 runs.", "India won by 8 wickets.", "Virat Kohli scored 55 runs and hit the winning runs.", "Rohit Sharma scored 131 runs", "Virat Kohli scored an unbeaten 55", "Jasprit Bumrah took 4 wickets for 39 runs", "Hashmatullah Shahidi scored 80 runs", "Azmatullah Omarzai scored 62 runs", "India won by 8 wickets with 90 balls remaining", "Rohit Sharma scored a quick hundred off only 63 balls, helping India earn a second straight win at the Cricket World Cup by beating Afghanistan by eight wickets.", "Rohit Sharma added 156 runs off 112 balls with Ishan Kishan as India steamrolled their way to 273-2.", "Hashmatullah Shahidi and Azmatullah Omarzai put on a 121-run partnership for Afghanistan, finishing on 272-8.", "Ishan Kishan scored 47 runs off 47 balls, with five fours and two sixes.", "Virat Kohli rounded up India’s night with 55 not out off 56 balls, including six fours, at his home ground.", "Mohammed Siraj finished with 0-76 from nine overs, his joint most expensive spell in ODIs.", "Jasprit Bumrah was India’s most successful bowler with 4-39.", "Shardul Thakur trapped Rahmat Shah lbw for 16.", "Kuldeep Yadav bowled with great control, taking 1-40 in 10 overs.", "Hardik Pandya finished with 2-43 from seven overs.", "India won by 8 wickets.", "Rohit Sharma scored 131 runs.", "Jasprit Bumrah took 4 wickets for 39 runs.", "Virat Kohli scored an unbeaten 55.", "Afghanistan set India a target of 273 runs.", "Rashid Khan took 2 wickets for Afghanistan.", "Rohit Sharma scored 131 in just 84 balls, hitting 16 fours and five sixes.", "Virat Kohli (55*) and Shreyas Iyer (25*) finished the chase, earlier set up by the opening partnership of Rohit Sharma and Ishan Kishan (47), who put on 156 in 18.4 overs.", "Rashid Khan took 2 wickets for 57 runs off eight overs for Afghanistan.", "India won the match against Afghanistan with 90 balls to spare."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45]}
{"candidates": ["India won by 8 wickets (with 90 balls remaining)."], "ranking": [1]}
{"candidates": ["Afghanistan won the toss and elected to bat first.", "Afghanistan won the toss and elected to bat first", "India and Afghanistan will face each other in match number 9 of the ICC Cricket World Cup 2023 at the Arun Jaitley Stadium in Delhi today.", "This will be the second match for both the teams in the 2023 World Cup.", "In its last match, India defeated Australia by six wickets, while Afghanistan lost to Bangladesh in its campaign opener.", "India and Afghanistan have played only three One Day Internationals (ODIs) against each other.", "The Men in Blue have registered two wins over Afghanistan, while one match ended in a tie.", "The last time the two sides met in an ODI was in the 2019 World Cup in England when Mohammed Shami's hat-trick saved India from an embarrassing defeat.", "India's probable playing 11: Rohit Sharma (C), Ishan Kishan, Virat Kohli, Shreyas Iyer, KL Rahul (WK), Hardik Pandya, Ravindra Jadeja, Kuldeep Yadav, Mohammad Shami, Jasprit Bumrah and Mohammed Siraj.", "Afghanistan's probable playing 11: Hashmatullah Shahidi (C), Ibrahim Zadran, Mohammad Nabi, Rahmat Shah, Najibullah Zadran, Azmatullah Omarzai, Rahmanullah Gurbaz (wk), Mujeeb Ur Rahman, Rashid Khan, Fazalhaq Farooqi, Naveen-ul-Haq.", "Afghanistan won the toss and chose to bat.", "Afghanistan aimed for a target above 300 runs."], "ranking": [12, 12, 8, 7, 9, 6, 5, 1, 4, 3, 11, 10]}
{"candidates": ["Rohit Sharma was named Player of the Match for his outstanding performance.", "Rohit Sharma emphasized the importance of focusing on controllable factors and not getting carried away by external factors ahead of their next match against Pakistan.", "Hashmatullah Shahidi reflected on Afghanistan's strategy and the impact of losing back-to-back wickets, expressing a desire to learn from their mistakes.", "Rohit Sharma expressed that it was a good win for India and emphasized the importance of gaining momentum at the start of the tournament.", "Rohit Sharma mentioned that it is crucial for India to not think too much about external factors and focus on things they can control for their next game against Pakistan.", "Rohit Sharma expressed happiness over his century but emphasized not losing focus.", "Hashmatullah Shahidi mentioned the need to work on issues and come back positively.", "Rohit Sharma highlighted the importance of momentum and different skillsets in the team.", "Rohit Sharma earned Player of the Match honours.", "India joined New Zealand and Pakistan as teams to start two from two at the tournament."], "ranking": [6, 8, 5, 4, 7, 3, 2, 9, 1, 10]}
{"candidates": ["Their head-to-head record stands at: 05/03/2014: Dhaka - India won by 8 wickets, 25/09/2018: Dubai - Match Tied, 22/06/2019: Southampton - India won by 11 runs.", "The Feroz Shah Kotla was the scene where World Cup records tumbled with South Africa and Sri Lanka aggregating the highest match total and Aiden Markram amassing the fastest century.", "Prior to 2022 and 2023, only once in his entire career had Rohit gone through a year's worth of work and come away with a strike rate of better than a run a ball - 100.09 from 19 innings in 2018.", "Having got there in 27 innings, Gurbaz is the quickest of the 13 Afghanistan batters to the mark of 1000 ODI runs.", "The Arun Jaitley Stadium has been a strong venue for India, winning six out of the last seven ODIs played there.", "The average first innings score at the Arun Jaitley Stadium is 230, while the average second innings score is 207.", "Head-to-head record: India has won 2 matches, Afghanistan 0, and 1 match was tied.", "World Cup face-offs: India has won 1 match, Afghanistan 0."], "ranking": [5, 8, 3, 2, 6, 7, 4, 1]}
{"candidates": ["India captain Rohit Sharma says he is prepared to play horses for courses.", "The Afghanistan captain Hashmatullah Shahidi wants a lot more from himself and the rest of his batting order."], "ranking": [1, 2]}
{"candidates": ["Virat Kohli hit his 50th ODI century, surpassing Sachin Tendulkar's record.", "Mohammed Shami took 7 wickets for 57 runs, becoming the quickest to 50 wickets in World Cup history in just 17 innings.", "Shreyas Iyer scored 105 off 70 balls, marking a significant middle-order performance.", "Rohit Sharma hit 50 sixes in men's ODI World Cups, surpassing Chris Gayle."], "ranking": [1, 2, 4, 3]}
{"candidates": ["Virat Kohli scored 117 off 113 balls.", "Shreyas Iyer scored 105 off 70 balls.", "Mohammed Shami took 7 wickets for 57 runs.", "Daryl Mitchell scored 134 off 119 balls for New Zealand.", "India won by 70 runs.", "Virat Kohli scored his 50th ODI century", "Shreyas Iyer hit a 67-ball century", "Mohammed Shami took 7 wickets for 57 runs", "Daryl Mitchell scored 134 for New Zealand", "India won by 70 runs", "India reached the World Cup final", "Key wickets included Williamson, Mitchell, and Latham", "Virat Kohli scored 117 runs.", "Daryl Mitchell scored 134 runs for New Zealand.", "Tim Southee took 3 wickets for 100 runs.", "India won the match by 70 runs.", "Shami took 7 wickets, including crucial ones of Williamson and Mitchell.", "Ferguson hit a six off Shami before getting out, giving Shami his seventh wicket.", "India win by 70 runs in Mumbai to reach final", "New Zealand bowled out for 327 - Mitchell hits superb 134; Shami takes brilliant 7-57", "Shreyas smacks 105 off 70, Gill makes 80* off 66", "Virat Kohli's historic century started it, Mohammed Shami finishes it with an incredible 7-57", "Shami has seven, and India march into the World Cup final!", "India beat New Zealand by 70 runs", "Mohammed Shami gets his seventh wicket and New Zealand are all out", "Tim Southee is on his way for 9 with Mohammed Shami grabbing another wicket", "Mitchell Santner is the next man out, hitting a slower ball bouncer high and straight to Rohit Sharma", "Mohammed Shami gets five wickets, removing Daryl Mitchell who finishes with 134 off 119 balls", "Mark Chapman departs as he's caught at deep square leg and Kuldeep Yadav gets a wicket", "Virat Kohli scored 117 runs, surpassing Sachin Tendulkar's record.", "Shreyas Iyer scored 105 runs off 67 deliveries.", "Mohammed Shami took 7 wickets for 57 runs.", "India scored a total of 4-397.", "Daryl Mitchell scored 134 runs for New Zealand.", "Kane Williamson scored 52 runs before being dismissed."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Virat Kohli scored 117 off 113 balls.", "Mohammed Shami took 7 wickets for 57 runs.", "Shreyas Iyer scored 105 off 70 balls.", "Kuldeep Yadav bowled crucial overs in the death, conceding just six runs and taking a wicket.", "Rohit Sharma's aggressive start set the tone for India's innings.", "Daryl Mitchell scored a century for New Zealand.", "India won by 70 runs, advancing to the World Cup final.", "India won by 70 runs", "Tim Southee c †Rahul b Mohammed Shami 9 (10b 1x4 0x6 14m) SR: 90", "Lockie Ferguson c †Rahul b Mohammed Shami 6 (3b 0x4 1x6 2m) SR: 200"], "ranking": [5, 2, 4, 8, 6, 9, 1, 10, 7, 3]}
{"candidates": ["India elected to bat first after winning the toss.", "India won the toss and chose to bat", "India were considered favorites given their performance in the tournament"], "ranking": [3, 2, 1]}
{"candidates": ["Rohit Sharma emphasized focusing on the present and controlling the controllables.", "Kane Williamson mentioned the challenge of playing against India and hoped for dew to assist them later in the game.", "India National Cricket Team head into the ICC Cricket World Cup 2023 semi-final on the back of a perfect record from the league stage.", "India vs New Zealand will be played on November 15, 2023, at Wankhede Stadium in Mumbai.", "The 2019 Manchester heartbreak might be lingering in a corner of the hosts' mind as an irritant.", "The Kiwis also had the measure of India in the ICC WTC Final in 2021.", "Captain Rohit and coach Rahul Dravid will have to keep their outfit calm, nestled away from the fear of failure in a crunch match.", "The teams batting second at this venue have invariably lost early wickets in clusters under lights with the new ball moving dangerously in the air and off the deck.", "Both India and New Zealand have bowlers who can inflict severe damage with the new ball.", "Virat Kohli is now the top run-getter in the tournament with 593 runs, and the landmark of 50 ODI hundreds is waiting to be reached.", "Kohli would also like to break the semifinal jinx after getting dismissed for one in the 2019 and 2015 edition.", "India will also be delighted to see their middle-order batters KL Rahul and Shreyas Iyer hitting top form ahead of the semis.", "Jasprit Bumrah and Kuldeep Yadav have been as lethal as they ever have been but the limelight has been stolen by Mohammed Shami and Mohammed Siraj.", "New Zealand's pace troika of Trent Boult, Tim Southee, Lockie Ferguson and left-arm spinner Mitchell Santner have enough experience and skill to make an impact.", "The young Rachin Ravindra (565 runs) is the find of the tournament, but Devon Conway is short of big scores.", "Captain Kane Williamson and Daryl Mitchell are the middle-order lynchpins for New Zealand.", "India are having the World Cup of their wildest dreams and it has nothing to do with the fact they are undefeated in it.", "The success of this campaign was built in the doctor's offices and the gyms and the training sessions that enabled Jasprit Bumrah and KL Rahul and Shreyas Iyer to come back from injury.", "New Zealand become what they need to be to win.", "Rachin Ravindra began scoring mountains of runs in the top order.", "Glenn Phillips has doubled the number of overs he had bowled in his entire ODI career during the course of this competition.", "New Zealand are masters at just staying in the game long enough until there is an opening to burst through.", "Jasprit Bumrah is the man that makes India unbeatable.", "New Zealand's best chance to win will be bowling under lights.", "Trent Boult has not always had the conditions in his favour at this World Cup but if the fates align to present him the opportunity to target the stumps and the pads of Rohit and Kohli and Shreyas and Rahul, he will sure as hell take it."], "ranking": [10, 8, 5, 2, 14, 12, 16, 18, 1, 3, 6, 7, 9, 11, 15, 4, 20, 22, 24, 13, 17, 19, 21, 23, 25]}
{"candidates": ["Mohammed Shami was named Player of the Match.", "India advanced to the final of the ICC Cricket World Cup.", "Rohit Sharma expressed pride in the team's performance despite some pressure moments", "Kane Williamson praised India's performance and acknowledged the tough conditions", "Rohit Sharma commented on the team's calmness under pressure and highlighted Shami's brilliance", "Mohammed Shami gave a cheerful interview, emphasizing simplicity in his approach", "Rohit Sharma emphasized the importance of staying calm under pressure.", "Shami reflected on his performance and the significance of not letting the opportunity slip away.", "New Zealand's effort was acknowledged, with credit given to Williamson and Mitchell for their partnership.", "India captain Rohit Sharma: 'I have played a lot of cricket here so I know with any score on this ground you cannot relax. Get the job done as quickly as possible and stay at. We knew there would be pressure on us at some stage, a partnership. We just had to stay collected. That's what we did. We were very calm even though we were sloppy in the field. That can happen.'", "New Zealand captain Kane Williamson: 'Firstly, congratulations to India. They've played outstandingly well throughout this competition and perhaps played their best game of the competition today. They're a top side at the top of their game. so at the halfway stage, with 400 on the board, it was naturally going to be tough.'", "Player of the match Mohammed Shami: 'I was waiting for my chances. I didn't play a lot of white-ball cricket. My return started against New Zealand in the group stage. We talk a lot of variations, but I still believe in pitching it up and getting wickets with the new ball.'", "Nasser Hussain praised Mohammed Shami's performance, saying 'What a cricketer, what an impact'", "Virat Kohli expressed his disbelief and joy at surpassing Tendulkar's record.", "Kane Williamson praised India's performance and acknowledged the difficulty of chasing 400 runs.", "Williamson reflected on the team's effort and the disappointment of exiting the tournament."], "ranking": [14, 1, 6, 8, 5, 12, 10, 9, 11, 3, 2, 4, 7, 15, 13, 16]}
{"candidates": ["Virat Kohli celebrated his 50th ODI century and his contribution to India's victory.", "Mohammed Shami expressed pride in his performance and his quick achievement of 50 World Cup wickets.", "Daryl Mitchell reflected on New Zealand's fighting spirit and their journey in the tournament."], "ranking": [1, 2, 3]}
{"candidates": ["The match was played at Wankhede Stadium, Mumbai.", "India scored 397/4 in their 50 overs.", "New Zealand were all out for 327 in 48.5 overs.", "The match was played under challenging conditions with the ball swinging a lot initially", "The crowd's reaction fluctuated with the game's high-pressure moments", "India's performance in the tournament included winning five games chasing and five games batting first", "India will face the winner of the Australia vs South Africa match in the final.", "The match was held at Wankhede Stadium, Mumbai.", "India will face either Australia or South Africa in Sunday's final", "For New Zealand, it's another missed opportunity. They played some fantastic cricket - demolishing England in the opener, the agonising five-run defeat by Australia, and pushing India more than any other team has managed in this semi-final and their group stage encounter.", "Injuries have played a big part in their campaign, losing Williamson for a few matches before seamer Matt Henry was ruled out. It feels like the end of an era for many players in a wonderful group that have constantly punched above their weight.", "But they have also unearthed a star in Rachin Ravindra, who scored three centuries in the tournament and I suspect we will be watching him score many more in the years to come.", "India remains undefeated in the World Cup and advances to the final.", "India's victory means they will play either Australia or South Africa in the final."], "ranking": [14, 5, 6, 10, 12, 8, 9, 15, 11, 2, 3, 4, 1, 7]}
{"candidates": ["The festive atmosphere at Wankhede with the crowd cheering for Indian players.", "Conditions in Mumbai favored India with no dew and a pitch offering swing, seam, spin, and bounce.", "Historical comparisons to previous World Cup performances and records.", "India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike rate (26.2) among all teams in the World Cup.", "New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament.", "Among opening pairs with at least 1000 runs in ODIs, Rohit and Shubman Gill have the second-highest average (74.8) behind only David Warner and Travis Head (80.1)."], "ranking": [6, 5, 4, 2, 3, 1]}
{"candidates": ["India (probable): 1 Rohit Sharma (capt), 2 Shubman Gill, 3 Virat Kohli, 4 Shreyas Iyer, 5 KL Rahul (wk), 6 Suryakumar Yadav, 7 Ravindra Jadeja, 8 Mohammed Shami, 9 Kuldeep Yadav, 10 Jasprit Bumrah, 11 Mohammed Siraj", "New Zealand (probable): 1 Devon Conway, 2 Rachin Ravindra, 3 Kane Williamson (capt), 4 Daryl Mitchell, 5 Tom Latham (wk), 6 Glenn Phillips, 7 Mark Chapman, 8 Mitchell Santner, 9 Tim Southee, 10 Lockie Ferguson, 11 Trent Boult", "The weather is set fair and even if not there is a reserve day for the semi-final."], "ranking": [3, 3, 1]}
{"candidates": ["Adil Rashid claimed his 200th ODI wicket."], "ranking": [1]}
{"candidates": ["England lurched to 65 for five in 9.3 overs.", "Jamie Smith spared England’s blushes with an encouraging 49 off 61 balls.", "England were all out for 202 in 40.2 overs.", "Alex Carey’s 74 off 67 balls lifted Australia to a competitive 270 all out.", "Josh Hazlewood and Mitchell Starc shared the first three wickets to take the wind out of the home side’s sails.", "Phil Salt was dropped in the second over but continued to flash hard at Hazlewood and nicked off for 12.", "Will Jacks departed for a golden duck after edging to Short in the cordon.", "Harry Brook’s head fell across the line after being served up a big inswinger from Starc.", "Ben Duckett was caught and bowled for 32, deceived by a slower delivery from Hardie.", "Liam Livingstone was strangled down the leg side first ball by Hardie.", "Jacob Bethell got a leading edge off Maxwell that looped to Starc to depart for 25.", "Smith fell one short of a maiden ODI fifty after flicking Hazlewood to midwicket.", "Brydon Carse and Adil Rashid each muscled two fours and a six in making 26 and 27 respectively.", "Starc ended proceedings, claiming his third wicket when Olly Stone was dismissed.", "Travis Head and Matthew Short were lethal with anything in their arc but were both dismissed for 29.", "Short flirted outside off through to Smith off Matthew Potts.", "Potts snaked one through Steve Smith’s defences and knocked back his off-stump.", "Mitch Marsh thumped three sixes off Carse and looked in good order until he was lbw for 60 after missing a sweep off Bethell.", "Glenn Maxwell became Rashid’s 200th ODI wicket when shovelling to Bethell.", "Rashid also took out Adam Zampa after Carse had snared Aaron Hardie and Starc with successive deliveries.", "Carey astutely farmed the strike with only Hazlewood for company.", "Hazlewood faced just 11 deliveries in a run-a-ball stand of 49 as Carey took sixes off Will Jacks, Potts and Stone before holing out to deep point off the latter.", "Australia were all out in 44.4 overs but had more than enough on the board.", "Mitchell Starc pinned Harry Brook lbw with a brilliant delivery.", "Alex Carey scored 74 runs providing crucial late runs for Australia.", "Aaron Hardie claimed two wickets in two balls, including a brilliant caught-and-bowled to remove Ben Duckett.", "Jamie Smith and Jacob Bethell had a stand of 55 runs.", "Josh Hazlewood impressed on his return, contributing to England's early problems.", "Mitchell Marsh scored 60 runs.", "Australia won by 68 runs."], "ranking": [14, 10, 12, 2, 6, 16, 18, 20, 22, 24, 26, 28, 30, 4, 8, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 1, 3, 5, 7, 9]}
{"candidates": ["Mitchell Starc caught Olly Stone at short third man.", "Glenn Maxwell took an LBW wicket against Adil Rashid."], "ranking": [1, 2]}
{"candidates": ["The second ODI of the Australia tour of England 2024 promises to be a thrilling encounter as the hosts look to bounce back from a defeat in the opener.", "England, led by Harry Brook, will be eager to level the series and set up a potentially decisive final match.", "The visitors have made a solid start to the series, showcasing their batting depth and bowling prowess.", "Travis Head, Cameron Green, and Marnus Labuschagne have been in impressive form, while the bowling attack led by Josh Hazlewood and Mitchell Starc has been effective.", "England will need to improve their performance in all departments to compete against a strong Australian side.", "Their batting lineup has shown glimpses of potential, but they will need to be more consistent.", "The bowling attack, led by Jofra Archer and Reece Topley, will be crucial in restricting Australia‘s scoring.", "The 2nd ODI match of the Australia Tour of England 2024 will see England take on Australia at Headingley, Leeds on September 21, 2024, at 3:30 PM IST.", "After winning the 1st ODI match, Australia were looking to win their second match and had a lead of 2-0.", "In the 1st ODI match, England was made a target of 316 runs while in reply Australia chased down this target easily in 44 overs with 7 wickets in hand.", "Trent Bridge in Nottingham is known for offering consistent bounce and support to both batsmen and bowlers, providing a well-balanced pitch.", "On the day of the game, there will be a 4.13 km/h breeze, 33% humidity, and a predicted temperature of 11°C. Visibility is expected to be at 8 km.", "There are no Injury Updates from both sides.", "England Predicted Playing 11: Philip Salt, Ben Duckett, Will Jacks, Harry Brook (c), Jamie Smith (wk), Liam Livingstone, Jacob Bethell, Brydon Carse, Jofra Archer, Matthew Potts, Adil Rashid", "Australia Predicted Playing 11: Travis Head, Mitchell Marsh (c), Steven Smith, Cameron Green, Marnus Labuschagne, Alex Carey (wk), Matthew Short, Aaron Hardie, Sean Abbott, Ben Dwarshuis, Adam Zampa", "Captaincy Picks: Travis Head, Ben Duckett", "Top Picks: Marnus Labuchagne, Will Jacks", "Budget Picks: M Short, A Zampa", "Looking at the squad strength of Australia, they are looking stronger and are the favorites to win the game.", "ENG vs AUS Win %: ENG=> 42 % AUS=> 58%"], "ranking": [14, 10, 12, 8, 11, 13, 9, 20, 16, 15, 7, 18, 19, 5, 6, 4, 3, 2, 1, 17]}
{"candidates": ["Australia welcomed back Hazlewood and Starc from illness.", "England's new-ball attack showed movement, particularly Olly Stone.", "Mitchell Marsh and Marnus Labuschagne took Australia to 145 for 3.", "Spin made an impact with Adil Rashid and Jacob Bethell taking crucial wickets."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The pitch at Headingley is expected to offer a balanced playing surface for both batters and bowlers.", "The grass cover is likely to be moderate, providing some assistance to the seamers, especially early on.", "As the match progresses, the pitch is expected to become more conducive to batting, with the ball likely to come onto the bat nicely.", "Spinners could also play a role, particularly if the match extends into the later stages.", "Overall, it is anticipated to be a good wicket for a competitive contest between England and Australia."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["South Africa have won the toss and opted to bat first against Ireland.", "Ryan Rickelton and Tristan Stubbs mounted a remarkable fightback with a 152-run partnership.", "Ryan Rickelton fell short of his century by just nine runs.", "Mark Adair and Craig Young were relentless with the new ball, leaving South Africa reeling at 39/3 inside Powerplay 1.", "South Africa's lower order chipped in with valuable contributions, pushing the total to a competitive score.", "Ireland need 272 runs to record their second ever victory against South Africa in ODIs."], "ranking": [5, 2, 4, 1, 3, 6]}
{"candidates": ["Bjorn Fortuin caught Graham Hume at mid off.", "Wiaan Mulder bowled a short ball that Graham Hume cut past third man for 4 runs."], "ranking": [2, 1]}
{"candidates": ["Temba Bavuma, SA Captain: We’re going to bat. It’s a good wicket, with nice grass covering on it. Want to make use of the good batting conditions. It might do a bit under the lights. We’re not used to this (heat) back home. The next couple of days is our focus. For now, we want to put our best foot forward. Quite a lot of cricket before the Champions Trophy. Some changes from the Afghanistan series. We have a debutant in Ottniel Baartman.", "Paul Stirling, IRE Captain: Very proud moment (to play 400 games), back to business though, we’ve got a game to win. It was a difficult decision at the toss, happy to have a bowl. With the dew coming in, it might get a bit difficult later, we’ll take it over by over. Gavin Hoey makes his debut today.", "Ireland vs South Africa ODI series will begin on Wednesday (October 2) afternoon at the Sheikh Zayed Stadium in Abu Dhabi.", "It will be a three-match series that will help the Proteas prepare for the upcoming Champions Trophy in Pakistan.", "South Africa suffered a shock defeat in a T20I against Ireland last month.", "Ireland will aim to repeat that performance in the longer format.", "South Africa have a massive 6-1 lead in the head-to-head record against Ireland in ODI cricket.", "This will be the first time the UAE will host an ODI between Ireland and South Africa.", "The previous bilateral series between these two teams ended 1-1."], "ranking": [5, 4, 9, 8, 2, 3, 1, 7, 6]}
{"candidates": ["Ireland and South Africa are set to face off in an ODI series in Abu Dhabi from October 2, 2024.", "The series kicks off on October 2 at 3:30pm local time in Abu Dhabi. All three matches will be at the same venue, with the second one on October 4 and third on October 7.", "Ireland drew the T20I series before this 1-1, winning the second game on the back of a hundred by Ross Adair and a four-for by Mark Adair.", "Andy Balbirnie, who was left out of the T20I squad, will return for the ODIs. Paul Stirling will lead the side. 21-year-old left-arm spinner Matthew Humphreys has also been included in both the squads.", "South Africa will be led by Temba Bavuma, who'll have a strong bowling attack at his disposal, including Lungi Ngidi, Nandre Burger, Ottneil Baartman, and Lizaad Williams among others."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Ryan Rickelton mentioned that they found themselves under pressure early on as the ball moved significantly, making batting challenging. Their focus was on building a partnership, and got great support from Tristan Stubbs. After losing three early wickets, the mindset had to shift to a more defensive, Test match mode approach to weather the storm."], "ranking": [1]}
{"candidates": ["Fans in the United Kingdom (UK) will be able to watch matches live on TV on TNT Sports.", "In India, the series will not be telecast live. However, live streaming is available on the Fancode app and its website (fancode.com).", "Pakistani viewers can watch the games on Tapmad.", "In the Middle East and North Africa, the series can be streamed on Etisalat.", "In Sub-Saharan Africa, SuperSport will telecast the series.", "Outside these regions, the series can be live streamed on Cricket Ireland's Live YouTube channel."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Only Imran Nazir has hit more sixes than Fakhar Zaman for Pakistan in an ODI World Cup game.", "Shaheen Shah Afridi became the joint-highest wicket-taker in the World Cup, with 16 wickets along with Adam Zampa.", "Shaheen Shah Afridi became the fastest to 100 ODI wickets for quick bowlers.", "Shaheen Shah Afridi became the fastest Pakistani to reach 100 ODI wickets."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Pakistan won by 7 wickets with 105 balls remaining."], "ranking": [1]}
{"candidates": ["Shakib Al Hasan wins the toss and opts to bat, citing the pitch is dry.", "Pakistan made three changes to their lineup, including Fakhar Zaman returning in place of Imam-ul-Haq."], "ranking": [2, 1]}
{"candidates": ["Bangladesh and Pakistan were at the bottom of the form table, having combined to lose their last nine matches in the competition.", "Shakib Al Hasan flew back home to Bangladesh to work on his batting technique after their game against South Africa.", "The ICC announced that the top eight finishers at this World Cup would secure qualification to the 2025 Champions Trophy.", "New Zealand's narrow defeat to Australia opened a tiny window of opportunity for Pakistan to still sneak through to the semi-finals.", "Shakib Al Hasan was in the spotlight due to his poor World Cup campaign and his recent trip to Dhaka for batting sessions.", "Mohammad Rizwan's success with the bat was crucial for Pakistan's performance.", "Fakhar Zaman was fully fit and could replace Imam-ul-Haq.", "Shadab Khan was not expected to be fit enough to play, giving Usama Mir another opportunity.", "Mohammad Nawaz's troubles with the ball meant Salman Ali Agha would replace him.", "Bangladesh had a minor scare during training when Shakib walked off with apparent neck pain but returned to bat without much discomfort.", "The weather was expected to be bright and sunny, and the match was played at the same venue where a low-scoring game occurred between Netherlands and Bangladesh.", "Both teams enter this fixture after suffering heart-breaking defeats in the previous games.", "Pakistan lost by one wicket to South Africa while Bangladesh were on the receiving end of a thumping 87-run defeat.", "The Eden Gardens in Kolkata has produced a balanced pitch with an average score of 236 runs.", "Fast bowlers can come into play early as the new ball tends to gain some movement.", "Spinners also love playing at Eden Gardens as the ball often finds a lot of turn and grip off the pitch.", "Pakistan's batting has failed to make a mark in the tournament with players struggling to bat for longer periods and scoring consistently.", "Pakistani bowling has gradually improved with the pacers seeming in rhythm while the spinners still struggling to make any headway.", "Shakib Al Hasan-led Bangladesh has emerged as one of the biggest letdowns of the tournament with consecutive poor performances.", "Bangladesh's batting has been a massive disappointment with the top order not being able to find runs across any fixture.", "These poor performances have put extra pressure and responsibility on the bowling unit, which similarly, hasn’t played well.", "Pakistan has a better chance to win this fixture and defeat Bangladesh to register their third win in the ICC ODI World Cup 2023."], "ranking": [14, 10, 6, 12, 8, 5, 16, 15, 18, 11, 7, 13, 9, 4, 3, 2, 1, 20, 19, 17, 21, 22]}
{"candidates": ["Pakistan captain Babar Azam praised his team and emphasized the importance of winning the next two matches to keep their semifinal hopes alive.", "Bangladesh captain Shakib al-Hasan expressed disappointment over losing early wickets and the team's overall performance.", "Fakhar Zaman, the Player of the Match, reflected on his performance and strategy during the game.", "Pakistan stay alive in the tournament, while Bangladesh are officially knocked out.", "Fakhar Zaman and Abdullah Shafique laid the groundwork for a resounding Pakistan victory.", "Pakistan have kept their hopes of a semi-finals spot alive with this seven-wicket victory.", "Bangladesh captain Shakib Al Hasan expressed disappointment with their batting and bowling performance.", "Pakistan captain Babar Azam congratulated his team for their performance and expressed confidence in winning the next two matches.", "Player of the match Fakhar Zaman reflected on his practice and performance, aiming to score big in the next game.", "Pakistan have kept alive their slim hopes of qualifying for the semifinals of the ICC Cricket World Cup.", "The defeat has ended Shakib al-Hasan’s team’s hopes of qualifying for the semifinals.", "Bangladesh have only won one match in the tournament.", "Pakistan have now won three matches from their seven and still have a mathematical chance of qualifying.", "Babar Azam’s men have moved to fifth place in the points table.", "The win lifted Pakistan to No. 5 on the points table, keeping their semi-final hopes alive.", "Fakhar Zaman expressed confidence in his ability to hit sixes anywhere on the pitch.", "The win ended Pakistan's longest World Cup losing run.", "Babar Azam praised the team's performance in all three departments and emphasized the importance of Fakhar Zaman's innings.", "Shakib Al Hasan expressed disappointment with Bangladesh's batting performance and acknowledged Pakistan's superior play.", "Fakhar Zaman reflected on his hard work and practice after the Asia Cup, which paid off in this match.", "Pakistan's third win keeps their semi-final hopes alive.", "Bangladesh are the first team to be mathematically out of contention for the top four."], "ranking": [10, 14, 16, 1, 3, 2, 15, 6, 18, 8, 19, 11, 12, 13, 4, 5, 7, 9, 17, 20, 21, 22]}
{"candidates": ["Bangladesh's sixth straight defeat confirmed their exit from the tournament.", "Pakistan ended their four-match losing streak with this win.", "Pakistan have now played seven matches at the Eden Gardens in Kolkata, and won six of them.", "The Cricket Association of Bengal hosted over 500 children at the Eden Gardens for the match.", "Pakistan boosted their net run-rate with the manner in which they chased the total down.", "Bangladesh became the first team to be officially eliminated from the tournament.", "Pakistan won by 7 wickets with 105 balls remaining.", "Bangladesh was officially knocked out of the tournament.", "The match was held at Eden Gardens on October 31, 2023.", "Bangladesh's batting never really clicked, and they have now lost six games on the trot after winning their opening game.", "Taskin Ahmed bowled well initially but later started to leak runs.", "Mehidy Hasan Miraz was the only bowler who created wicket-taking opportunities for Bangladesh."], "ranking": [2, 5, 8, 12, 4, 1, 6, 3, 11, 7, 10, 9]}
{"candidates": ["Since Bangladesh obtained Test status, they have qualified past the first round of the ODI World Cup as many times as Pakistan - twice in five attempts.", "Until last week, Pakistan hadn't lost to South Africa in the ODI World Cup since 1999, which was also the last time they lost to Bangladesh at an ODI World Cup.", "Three of Bangladesh's four all-time top ODI runscorers - Mushfiqur Rahim, Shakib al Hasan, and Mahmudullah - are part of the present squad."], "ranking": [2, 3, 1]}
{"candidates": ["Heinrich Klaasen hit his first World Cup hundred, and it was the second-quickest hundred in this tournament, after Aiden Markram's 100 off a record 49 balls against Sri Lanka.", "South Africa notched up the second-highest total in the tournament with 7-399.", "England conceded its highest total in ODIs.", "England faced its heaviest defeat by runs in ODIs.", "South Africa inflicted a record ODI defeat on England by 229 runs.", "England suffered their heaviest defeat by runs in ODIs.", "South Africa posted the second-highest total in the tournament with 399-7.", "Heinrich Klaasen hit the second quickest hundred in this tournament, after Aiden Markram’s 100 off 48 balls against Sri Lanka.", "This defeat marked the 14th largest margin of loss in the history of ODI World Cups.", "It became England's most substantial defeat in the ODI World Cup, surpassing their previous largest loss of 202 runs against India in the 1975 World Cup.", "South Africa posted a total of 399, which is one of the highest scores in the ICC Cricket World Cup 2023.", "Heinrich Klaasen scored 109 off 67 balls, a significant individual performance.", "South Africa won by 229 runs, a substantial margin of victory.", "England conceded their biggest ever ODI total.", "England fell to their biggest ever defeat in ODIs.", "England conceded a record number of runs and suffered their biggest losing margin in World Cup history.", "South Africa put on 399 for seven, the highest-ever ODI total against England and the second-highest at the venue."], "ranking": [5, 7, 3, 2, 1, 2, 8, 6, 11, 10, 9, 4, 3, 2, 1, 15, 14]}
{"candidates": ["South Africa won by 229 runs", "Gus Atkinson b Maharaj 35 (21b 7x4 0x6 31m) SR: 166.66"], "ranking": [1, 2]}
{"candidates": ["Heinrich Klaasen mentioned the team's familiarity with Indian conditions and their practice session before the game.", "England captain Jos Buttler won the toss and opted to field first.", "England made three changes to their lineup: Ben Stokes, David Willey, and Gus Atkinson replaced Liam Livingstone, Chris Woakes, and Sam Curran.", "South Africa's regular skipper Temba Bavuma missed out due to illness, with Aiden Markram captaining in his stead.", "Reeza Hendricks replaced Temba Bavuma in the lineup.", "Both teams came into the match after shock losses: England to Afghanistan and South Africa to Netherlands.", "Aiden Markram, South Africa captain, mentioned that they were slightly surprised by England's decision to field first.", "Jos Buttler, England captain, reflected on the tough conditions and the decision to bowl first.", "England won the toss and chose to bowl first."], "ranking": [6, 8, 5, 7, 4, 3, 2, 1, 9]}
{"candidates": ["The match was played in stifling conditions in Mumbai.", "South Africa's big win cemented their third spot with six points.", "England sank to ninth on the table, tied on two points with last-place Afghanistan.", "Reece Topley suffered a finger injury but returned to the field later.", "The match was held at Wankhede Stadium in Mumbai.", "South Africa's win cemented their third spot with six points.", "England sank to ninth in the table, tied on two points with last-place Afghanistan.", "South Africa's victory consolidated their position as the third-ranked team in the World Cup 2023 points table with a net run rate of +2.21.", "England's defeat caused them to plummet to the ninth position in the points table, tied with Afghanistan in terms of points and carrying a net run rate of -1.25.", "The match was played at Wankhede Stadium, Mumbai.", "The conditions were extremely tough with high heat and humidity.", "Reece Topley got injured during the match.", "South Africa's victory significantly boosted their campaign after a tough loss to the Netherlands.", "The match was played in extremely hot and humid conditions in Mumbai.", "Reece Topley has a suspected broken finger and will not be replaced by Jofra Archer.", "Adil Rashid, despite suffering from a stomach upset, was England's most effective bowler.", "David Willey went down with cramp, and Harry Brook called on the physio.", "Heinrich Klaasen's innings was marked by his physical discomfort, yet he managed to score rapidly.", "The match was played on a hot and humid Saturday afternoon at Wankhede Stadium in Mumbai.", "A near-capacity turnout at the stadium added to the high-voltage atmosphere."], "ranking": [14, 2, 3, 16, 18, 5, 6, 1, 4, 19, 15, 17, 8, 13, 10, 11, 9, 7, 12, 20]}
{"candidates": ["South Africa's win leaves England with no room for error in their remaining matches.", "The match was part of the ICC Cricket World Cup 2023."], "ranking": [1, 2]}
{"candidates": ["England: 1 Jonny Bairstow, 2 Dawid Malan, 3 Joe Root, 4 Ben Stokes, 5 Jos Buttler (capt/wk), 6 Harry Brook, 7 Chris Woakes/Gus Atkinson, 8 David Willey, 9 Adil Rashid, 10 Mark Wood, 11 Reece Topley", "South Africa (probable): 1 Quinton de Kock (wk), 2 Temba Bavuma (capt), 3 Rassie van der Dussen, 4 Aiden Markram, 5 David Miller, 6 Heinrich Klaasen, 7 Marco Jansen, 8 Kagiso Rabada, 9 Keshav Maharaj, 10 Lungi Ngidi, 11 Tabraiz Shamsi/Gerald Coetzee"], "ranking": [2, 1]}
{"candidates": ["United States won by 6 wickets.", "Saiteja Mukkamalla scored 59 not out off 71 balls.", "Monank Patel scored 72 off 82 balls.", "Gerhard Erasmus took 2 wickets for 34 runs.", "Jan Frylinck scored 70 off 88 balls for Namibia."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Namibia and United States of America will lock horns in the 25th ODI of ICC CWC League 2 2024 on Monday, 16 September 2024, at Wanderers Cricket Ground, Windhoek.", "In Match 18 of the ICC CWC League 2, Scotland defeated Namibia by 138 runs. Scotland set a strong total of 301/6 in their 50 overs. Shaun Fouche led the bowling for Namibia with 3 wickets for 60 runs in 10 overs. Tangeni Lungameni and Ben Shikongo each took 1 wicket, conceding 64 runs in 10 overs and 9 overs, respectively.", "In their innings, Namibia struggled to chase the target and were all out for 163 in 40.1 overs. Gerhard Erasmus, the captain, scored 53 runs off 73 balls. Zane Green contributed 28 runs from 35 balls, and Malan Kruger added 27 runs off 42 balls. Despite their efforts, Namibia couldn’t match Scotland’s total and faced a heavy defeat.", "In Match 24 of the ICC CWC League 2, the Netherlands defeated the United States by 27 runs. Netherlands was bowled out for 206 in 49.1 overs. Harmeet Singh led the USA bowling attack with 2 wickets for 25 runs in 10 overs. Shadley van Schalkwyk and Nosthush Kenjige also took 2 wickets each, conceding 32 runs in 8 overs and 33 runs in 8.1 overs, respectively.", "During their chase, the USA was all out for 179 in 45.5 overs. Monank Patel, the captain and wicketkeeper, top-scored with 66 runs off 79 balls. Harmeet Singh contributed 20 runs from 18 balls, and Shayan Jahangir added 20 runs off 37 balls. Despite their efforts, the USA fell short and lost the match by 27 runs.", "Namibia is eager to rebound from their recent loss and clinch victory in their next match.", "The United States is preparing for their next match after a recent loss.", "Namibia’s recent form has been inconsistent with three consecutive losses, but they had two victories prior to these defeats.", "The United States has had a mixed performance with alternating results of wins and losses.", "The Wanderers Cricket Ground in Windhoek features a pitch with fast and bouncy conditions, suitable for both pace and spin bowlers.", "The weather forecast in Windhoek shows a temperature of 13.0°C with broken clouds and a very low chance of rain.", "Winning the toss allows teams to bowl first, which can be advantageous if the pitch helps bowlers early on."], "ranking": [10, 8, 7, 6, 5, 4, 3, 2, 1, 9, 11, 12]}
{"candidates": ["The pitch at Wanderers Cricket Ground is a batting pitch with an average score of 251 and is good for pacers.", "The weather is expected to be rainy on the match day.", "The weather forecast for the match is rainy with a temperature of 23°C.", "The pitch behavior is expected to be balanced, suitable for both pace and spin.", "The average first innings score at the venue is 251, with a poor record for chasing teams, having a winning percentage of 34%.", "Match was held at Wanderers Cricket Ground, Windhoek.", "United States innings: 200-4 in 41.3 overs.", "Namibia innings: 199-9 in 50 overs."], "ranking": [5, 7, 8, 4, 2, 6, 1, 3]}
{"candidates": ["Rohit Sharma became only the 3rd cricketer to get out in the 80s as many as 4 times in a calendar year in ODI cricket.", "Sixth four-plus wicket haul for Mohammed Shami, the joint-most for any bowler in men's ODI World Cups, equalling Mitchell Starc.", "It is the first time England have lost five matches in a World Cup."], "ranking": [2, 1, 3]}
{"candidates": ["Mohammed Shami picked up a five-wicket haul in his first match at this World Cup.", "India won by 100 runs.", "Mark Wood was bowled by Jasprit Bumrah for 0."], "ranking": [1, 2, 3]}
{"candidates": ["England elected to field first after winning the toss."], "ranking": [1]}
{"candidates": ["Eoin Morgan commented on England's underperformance, suggesting something is unsettled within the team.", "Chris Woakes expressed disappointment and mentioned the lack of confidence in the team.", "Jos Buttler acknowledged the team's poor performance and the need to play for Champions Trophy qualification.", "Jasprit Bumrah mentioned the team's enjoyment of the tournament and their practice in evening conditions.", "Rohit Sharma, adjudged the player of the match, emphasized the importance of his partnership with KL Rahul and taking the game deep.", "Rohit Sharma felt India were 30-40 runs short but was pleased with the overall performance.", "India's victory will galvanize the team as they head into the business end of the tournament.", "England's captain Jos Buttler will have much to contemplate as their chances of progression look even more scant.", "Rohit Sharma was named Player of the Match for his 87 runs.", "India earned 2 points from the match.", "Rohit Sharma expressed pride in the team's character and experience, noting the challenge of batting first and the effectiveness of their bowling attack.", "Jos Buttler expressed disappointment in England's performance, particularly their batting, despite a good start by the bowlers.", "India captain Rohit Sharma: 'This was a game that showed a lot of character in our squad. When times were tough, our experienced players stood up at the right time and fought for us.'", "England captain Jos Buttler: 'Very disappointing. At the halfway stage chasing 230 we fancied ourselves. But it's the same old story.'", "Player of the match Rohit Sharma: 'Looking at where we were after the first 10 overs of our batting, it was important to put on a partnership like myself and KL Rahul did. It was a challenging pitch to start with but it got easier the longer you spent in the middle. We are very happy with the performance.'"], "ranking": [12, 11, 10, 15, 8, 9, 5, 6, 14, 13, 4, 3, 2, 1, 7]}
{"candidates": ["India maintained their 100% record at the Cricket World Cup.", "England's World Cup defense is in a dire state, needing to win all remaining games and hoping for other results to go their way.", "The stadium was emptying behind the commentators as the match concluded.", "India are not mathematically into the semi-finals, nor are England mathematically out of the tournament.", "India remain the sole undefeated team in the tournament with this win.", "India displaced South Africa at the top of the standings with 12 points in six matches.", "England's next match is against Australia on November 4, which is a must-win for them.", "England's bowlers and fielders showed commitment and quality, with Chris Woakes delivering a seven-over opening spell that went for just 23 runs.", "Virat Kohli was dismissed for a nine-ball duck by David Willey.", "Rohit Sharma scored 87 runs off 101 balls, stabilizing India's innings.", "The match was held at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow.", "The match was part of the ICC Cricket World Cup 2023.", "India stay unbeaten with six wins in as many games and regain the top spot.", "England remain at the bottom of the points table with their fifth defeat in six games.", "India's pacers Jasprit Bumrah and Mohammed Shami ripped through the England top-order in Lucknow.", "India's win leaves England rooted to the bottom of the standings.", "India's unchanged team took off at the back of Rohit Sharma's aggressive charge.", "England's spin-bowling all-rounders tried to rebuild but were undone by India's bowlers.", "England's last four innings have ended in scores of 215, 170, 156 and 129. Against Sri Lanka, they went from 45-0 to 156 all out. Today, it is 30-0 to 129."], "ranking": [5, 2, 18, 15, 1, 4, 12, 8, 11, 3, 19, 16, 6, 14, 7, 9, 10, 13, 17]}
{"candidates": ["Weather conditions are expected to be clear, not affecting the match.", "Historical head-to-head statistics show India has won 3 out of 8 World Cup matches against England.", "Astrological predictions suggest a score range of 250 to 310 runs for either team.", "The match was played on a red-soil pitch with light patches of grass, favoring seamers.", "The temperature in the afternoon was around 31°C, dropping by five degrees in the evening.", "Virat Kohli was one short of equalling Sachin Tendulkar's record of most ODI hundreds.", "Shreyas Iyer was 69 runs away from 2000 ODI runs.", "If Buttler scored 82 runs, he would become the joint second-fastest Englishman to 5000 ODI runs.", "Shami had dismissed Buttler five times in 60 balls, more than any other bowler in ODIs.", "Jonny Bairstow averaged 13.25 against Ravindra Jadeja in ODIs, with four dismissals in six innings."], "ranking": [10, 8, 9, 7, 6, 2, 5, 3, 1, 4]}
{"candidates": ["Astrological analysis suggests Rohit Sharma's balanced approach may lead India to victory.", "Jos Buttler's impulsiveness, influenced by astrological factors, might impact his decisions on the field.", "KL Rahul mentioned that every player has a different role and they are playing their role and responsibility well.", "England assistant coach Marcus Trescothick played down the idea that England had lost interest in ODIs."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Quinton de Kock scored his third ODI hundred against Australia.", "Quinton de Kock scored his 19th ODI century and third against Australia.", "Quinton de Kock hit his second consecutive century in the World Cup.", "Rassie van der Dussen became the fastest century scorer at the Arun Jaitley International Stadium.", "Australia's biggest loss by runs in the tournament's history, losing by 134 runs.", "Australia bowled out for 177 to lose by 134 runs - heaviest World Cup defeat by runs", "De Kock hits second century in as many matches"], "ranking": [4, 3, 2, 6, 1, 5, 7]}
{"candidates": ["South Africa won by 134 runs", "Pat Cummins c Miller b Shamsi 22 (21b 4x4 0x6 29m) SR: 104.76", "Josh Hazlewood c Rabada b Shamsi 2 (2b 0x4 0x6 1m) SR: 100"], "ranking": [1, 2, 3]}
{"candidates": ["Australia won the toss and elected to field first.", "Australia made changes to their lineup, bringing in Josh Inglis and Marcus Stoinis for Alex Carey and Cameron Green.", "Australia made two changes in their lineup, bringing in Marcus Stoinis for Cameron Green and Josh Inglis for Alex Carey.", "Australia won the toss and decided to bat first.", "South Africa were coming off a confident 102-run win over Sri Lanka in their first game.", "Australia won the toss and chose to field first."], "ranking": [6, 4, 4, 5, 2, 6]}
{"candidates": ["Quinton de Kock was named Player of the Match for his 109 runs and 2 catches.", "Quinton de Kock's performance was a reminder of his status as a modern limited-overs great.", "Australia needs to assess their own mistakes, including missed chances in the field.", "Quinton de Kock expressed pride in the team's performance, highlighting their assessment of the conditions and application with the bat.", "Quinton de Kock mentioned the importance of taking the World Cup on a match-by-match basis.", "Pat Cummins reflected on the loss, mentioning the need to adapt to all conditions and the team's hurt after the defeat.", "Temba Bavuma praised Quinton de Kock and the team's performance, calling it a near-perfect game.", "Quinton de Kock, the Player of the Match, expressed satisfaction with the team's performance and emphasized taking it game by game.", "Pat Cummins commented on Quinton de Kock's batting and the challenges faced by Australia, noting that their bowlers bowled well but the team was well off the mark.", "Cummins mentioned the need to regroup and make amends for the next game.", "Australia captain Pat Cummins stated, 'Probably not much needs to be said tonight. I think everyone's hurting.'", "Former Australia captain Aaron Finch disagreed with the third umpire's decision on Marcus Stoinis's dismissal.", "Australia batter Marnus Labuschagne was asked in the post-match press conference about the controversial dismissal of Marcus Stoinis after a review by third umpire Richard Kettleborough.", "South Africa captain Temba Bavuma: 'I think 311 was a couple over par, probably about 290/300 was par. I'm glad we lost the toss because we were going to chase, but I think Quinton getting a score like that needs to be credited a lot.'", "Australia captain Pat Cummins: 'I thought Quinton de Kock batted really well, we couldn't get a breakthrough but from where they were, we were quite happy and, on that wicket, thought 311 was chaseable.'", "Player of the match, South Africa's Quinton de Kock: 'It was a great win for the boys. We didn't really know how the wicket was going to play but we assessed conditions really well and played accordingly.'", "South Africa captain Bavuma expressed satisfaction with the team's performance, calling it a 'close to perfect game'.", "Australia captain Pat Cummins acknowledged the team's struggles and mentioned that everyone is hurting after the loss.", "Quinton de Kock was delighted with the win and mentioned the team's good assessment of the conditions."], "ranking": [1, 2, 14, 3, 16, 5, 4, 6, 7, 8, 9, 10, 11, 12, 13, 15, 17, 18, 19]}
{"candidates": ["The match was held at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow.", "The match was part of the ICC Cricket World Cup 2023.", "South Africa scored 311/7 in their 50 overs.", "Australia was all out for 177 in 40.5 overs.", "Points awarded: South Africa 2, Australia 0.", "The match was played in Lucknow on October 12, 2023.", "Quinton de Kock announced that this tournament would be his last appearances in the ODI format.", "The match was played at the Ekana International Stadium in Lucknow.", "Australia had never played at the Ekana Stadium in Lucknow before.", "South Africa played at the Ekana Stadium last year and beat India by 9 runs.", "The match was played in Lucknow.", "Australia's net run rate dropped to minus 1.85 after the match.", "Australia has lost 7 of their last 8 ODIs.", "Australia needs to beat Sri Lanka on Monday to improve their standing in the tournament.", "The accepted wisdom is 12 points will earn you a place in the semi-finals. Australia would need to win six of their remaining seven games to achieve that total.", "South Africa win by 134 runs", "South Africa have thrashed Australia in Lucknow.", "Indeed, it's Australia's heaviest defeat in World Cup history.", "The match was held at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow.", "The pitch conditions were a significant factor, with the ball doing more under lights during the chase.", "Australia's fielding and catching were notably poor during the match."], "ranking": [20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 21]}
{"candidates": ["The ICC World Cup 2023 game between Australia and South Africa will be played on Thursday, October 12, 2023.", "The match between Australia and South Africa will be played at the Arun Jaitley Stadium in Delhi.", "The game between Australia and South Africa is scheduled to kickstart at 14:00 (IST) (+5:30 GMT).", "Star Sports Network has acquired the rights to broadcast the ICC ODI World Cup 2023. The Australia vs South Africa match of the ODI World Cup 2023 will be broadcasted live in multiple languages (English, Hindi, and Vernacular) across the Star Sports Network.", "The live streaming of the match between Australia and South Africa will be on Disney+ Hotstar. All the mobile users will be able to view the World Cup clash involving the hosts for free of cost on the Disney+ Hotstar mobile app.", "According to the Dafabet, the following are the odds for this Cricket World Cup 2023 match: Australia 1.67, South Africa 2.26.", "The pitches at the Ekana International Cricket Stadium were dug up after IPL 2023 where it was widely regarded as the worst surface in the tournament", "David Warner became the quickest player to 1000 World Cup runs, reaching the mark in his 19th innings against India", "Adam Zampa has gone wicketless in four of his 10 ODIs this year, and has only five wickets in five ODI World Cup matches in his career at an economy rate of 7", "South Africa's middle order has the highest average (44.6) and run-rate (6.4) over the last four years in ODIs", "Australia's middle order average 29.9 at a run-rate of 5.40 over the same period", "South Africa's powerplay bowling is the worst in the world this year, averaging 43 with an economy rate of 6.6 in ODIs in the first 10 overs of their bowling innings", "Australia's powerplay bowlers average 40.7 but have an economy rate of 5.4", "Australia's 2023 ODI World Cup fixtures include matches against South Africa on October 12, Sri Lanka on October 16, Pakistan on October 20, Netherlands on October 25, New Zealand on October 28, England on November 4, Afghanistan on November 7, and Bangladesh on November 11.", "The match is scheduled for October 12, 2023, at 2:00 PM IST.", "The venue for the match is Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow.", "Live Ball-By-Ball Commentary will be available on the SportsTiger App.", "The Australian batting lineup struggled massively against the Indian spinners in Chennai.", "Mitchell Starc and Josh Hazlewood bowled impressive first spells under lights against India.", "The South Africa batting lineup set the stage alight in Delhi against Sri Lanka, with Quinton de Kock, Rassie van der Dussen, and Aiden Markram scoring centuries.", "Gerald Coetzee picked up three wickets to ensure a comfortable win for South Africa against Sri Lanka."], "ranking": [14, 12, 11, 10, 9, 8, 7, 1, 16, 5, 6, 4, 13, 15, 3, 2, 18, 19, 20, 21, 17]}
{"candidates": ["Pat Cummins on the Australia-South Africa rivalry: 'I also always find with South Africa; we always match up quite similarly. They've always got some fast bowlers and some batters that take the game on, maybe a leg spinner. So, it always feels like it's a clash of two very similar teams. So yeah, no doubt it will be another great game tomorrow.'", "Quinton de Kock: 'Australian and us - we've always had a great history and a good competitive background. Both teams are gonna come out fighting tomorrow. Whoever makes the right choices under the pressure will come out as the strongest team.'"], "ranking": [2, 1]}
{"candidates": ["Glenn Maxwell broke the record for the fastest ever World Cup hundred by nine balls.", "Glenn Maxwell scored the fastest century in World Cups in 40 balls", "Bas de Leede delivered the most expensive over in men's ODI history", "Australia achieved the largest victory in World Cup history by 309 runs", "Zampa now has the most wickets at the 2023 World Cup with 13", "Glenn Maxwell struck the fastest century in World Cup history, reaching his hundred in just 40 balls.", "Australia registered the biggest World Cup victory by winning with a margin of 309 runs.", "David Warner hit his second successive century in the tournament.", "Adam Zampa picked four wickets for eight runs in three overs.", "Glenn Maxwell scored the fastest-ever century in a Cricket World Cup, reaching 100 runs in just 40 balls.", "Bas de Leede conceded 115 runs from his ten overs, the most expensive figures in ODI history.", "The winning margin of 309 runs is the largest ever at a Men’s Cricket World Cup and the second largest ever in ODIs.", "Glenn Maxwell hit the fastest century in Cricket World Cup history with a 40-ball ton.", "Bas de Leede's figures of 2-115 are the most expensive in ODI history.", "Maxwell broke his own Australian record for fastest ODI century, previously set at the 2015 World Cup against Sri Lanka.", "Glenn Maxwell smashed a 40-ball hundred — the fastest ever at the Cricket World Cup.", "David Warner scored his sixth World Cup century, the most for an Australian batsman.", "The margin of victory was the largest (by runs) in World Cup history.", "Bas de Leede returned the most expensive figures in ODI history with 2-115 in 10 overs.", "Glenn Maxwell's 40-ball century is the fastest ever at a 50-over World Cup, beating Aiden Markram's record set just 18 days prior.", "Bas de Leede conceded 115 runs in his 10 overs, the most by a bowler in a men's ODI.", "Glenn Maxwell scored the fastest century in World Cups, needing just 40 balls.", "Bas de Leede delivered the most expensive over in men's ODI history, conceding 28 runs in one over.", "Australia's 309-run victory is the largest margin of victory in men's ODI World Cup history.", "Glenn Maxwell hit the fastest World Cup century in 40 balls.", "Australia won by a record 309 runs.", "Bas de Leede conceded the most runs in a men's ODI with figures of 2/115.", "Adam Zampa now has the most wickets in World Cup 2023 with thirteen scalps.", "Glenn Maxwell set a new record for the fastest century at an ICC Men's Cricket World Cup, scoring 100 runs off just 40 balls."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]}
{"candidates": ["Australia won by 309 runs, which is a significant margin in ODI cricket.", "Glenn Maxwell wins Man of the Match for the Fastest World Cup hundred.", "Australia registered the second-biggest ODI Win.", "Australia won by 309 runs, biggest World Cup win."], "ranking": [3, 2, 4, 1]}
{"candidates": ["Aryan Dutt was lbw by Zampa for 1 run.", "Paul van Meekeren was stumped by Inglis off Zampa for 0 runs.", "Australia scored 399/8 in their innings.", "Netherlands were all out for 90 runs in 21 overs.", "Glenn Maxwell wins Man of the Match for the Fastest World Cup hundred.", "Netherlands all out for 90 runs.", "2 Wickets in 2 balls: Adam Zampa on Hat-trick."], "ranking": [5, 4, 3, 2, 1, 6, 7]}
{"candidates": ["Australia's campaign has been inconsistent, with initial losses to South Africa and India, but they bounced back to defeat Pakistan and Sri Lanka.", "The Netherlands have proven to be formidable opponents, having defeated South Africa in the tournament's opening round.", "The Arun Jaitley Cricket Stadium has undergone a transformation, making it a batter-friendly ground.", "Both teams will be calculating their strategies meticulously, taking the pitch conditions into account.", "Australia opted to bat first after captain Pat Cummins won the toss.", "Australia were missing all-rounder Marcus Stoinis due to a calf problem, with Cameron Green taking his place in the side.", "Netherlands opted to stick with the same XI that succumbed to Sri Lanka on Saturday.", "Mitchell Marsh retained his place as Warner's opening partner due to Travis Head's recovery from a fractured hand.", "Australia won the toss and chose to bat first."], "ranking": [8, 6, 4, 3, 5, 7, 2, 1, 9]}
{"candidates": ["Netherlands were looking to claim another big scalp after defeating South Africa.", "Australia was set to welcome back Travis Head from injury.", "Australia and Netherlands have a shared history with several Australian players impacting Netherlands cricket.", "Australia's coach Andrew McDonald confirmed they would not be resting any players.", "Netherlands' biggest challenge was getting top-order runs against Australia's new-ball bowlers.", "Australia are a strong team and should win the game.", "David Warner has 618 runs at an average of 47.53 and a strike rate of 115.29 in 13 ODI innings this year. He also has four fifties and two centuries.", "Mitchell Marsh has 597 runs at an average of 45.92 and a strike rate of 114.14 in 14 ODI innings this year. He also has five fifties and a century.", "Marnus Labuschagne has 585 runs at an average of 45 and a strike rate of 85.40 in 14 ODI innings this year. He also has two fifties and a century.", "Mitchell Starc has 15 wickets at an average of 27.60 and a strike rate of 27.93 in eight ODI innings this year.", "Josh Hazlewood has 13 wickets at an average of 36.07 and a strike rate of 37.84 in nine ODI innings this year.", "Adam Zampa has 24 wickets at an average of 29.50 and a strike rate of 28.25 in 13 ODI innings this year.", "Bas de Leede has 378 runs at an average of 37.80 and a strike rate of 93.79 in 11 ODI innings this year. He also has 22 wickets at an average of 23.77 and a strike rate of 24.18 in 11 ODI innings this year.", "Scott Edwards has 562 runs at an average of 43.23 and a strike rate of 108.70 in 16 ODI innings this year. He also has five fifties.", "Logan van Beek has 16 wickets at an average of 31.81 and a strike rate of 36.43 in 11 ODI innings this year.", "Paul van Meekeren has 12 wickets at 36.75 runs apiece in nine ODI innings this year.", "The track in Delhi has been ideal for the batters in this World Cup, and a batting-friendly surface will be offered again. The spinners will also have a say at some point in middle overs. A total of around 300 can be a fighting one.", "The temperature will hover around 30°C, with no possibility of rain.", "Australia will face the Netherlands in the 24th match of the ICC Cricket World Cup, 2023 on October 25 at the Arun Jaitley Stadium in New Delhi, India.", "South Africa has scored 428 runs on the same venue, which shows how good this surface is for the batters. The ball comes nicely onto the bat, and batters can play the shots on the up. Bowling will be challenging in the dew under the light, and it will be hard to grip the ball.", "Australia and Netherlands will play their fifth fixture of the 2023 World Cup when they clash at the Arun Jaitley Stadium in New Delhi on Wednesday.", "The Aussies have had an up-and-down tournament so far. After losing their first two matches of the World Cup against India and South Africa, the five-time world champions came back strongly to beat Sri Lanka in back-to-back outings.", "Netherlands, on the other hand, have won one out of their first four games with their only win coming against South Africa."], "ranking": [10, 14, 16, 18, 12, 20, 1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 15, 17, 19, 21, 22, 23]}
{"candidates": ["The match was held at Arun Jaitley Stadium, Delhi", "Australia won the toss and elected to bat first", "The match was part of the ICC Cricket World Cup 2023", "Glenn Maxwell was named Player of the Match", "The Arun Jaitley Cricket Stadium has hosted 29 ODIs, with 14 won by the team batting first and 14 by the team chasing.", "A moment of silence was observed for former Indian cricketer Bishan Singh Bedi, who passed away on October 23.", "David Warner, who plays for the Delhi Capitals in the IPL, was expected to receive enthusiastic support from the Delhi crowd.", "The Dutch started with spin right from the start after being asked to bowl first, with Aryan Dutt, the off-spinner, opening the bowling.", "Warner's innings wasn't chanceless, with the opener let off in the 17th over when Max O'Dowd missed a golden chance to run the batter out.", "Roelof van der Merwe pulled off a brilliant reverse cupped take to send back Steve Smith.", "Maxwell had been suffering from illness and had a sleepless night before the match.", "Maxwell's century was the fourth-quickest in ODI history, nine balls shy of AB de Villiers' record.", "Australia faces New Zealand in Dharamsala on Saturday, when the Netherlands will play Bangladesh in Kolkata.", "Australia plundered 131 runs in the final 10 overs.", "The Netherlands began with spin from both ends.", "David Warner hit four consecutive fours off Aryan Dutt early in the innings.", "Maxwell celebrated his century with a baby-rocking gesture, dedicating it to his wife and first child.", "Netherlands' Vikramjit scored 25 runs, the highest for his team.", "Australia posted a total of 399 for 8.", "The match was played in New Delhi.", "The pitch conditions in Delhi were favorable for batting.", "Maxwell's innings came after a poor run of form in ODI cricket.", "Maxwell's reverse sweep was a key part of his innings.", "The Dutch team struggled to contain Maxwell's batting."], "ranking": [20, 18, 16, 14, 12, 10, 8, 7, 6, 5, 4, 3, 2, 1, 15, 13, 11, 9, 19, 17, 21, 22, 23, 24]}
{"candidates": ["David Willey completed 100 wickets in ODIs.", "David Willey reached 100 ODI wickets.", "David Willey takes 3-56, including his 100th ODI wicket", "David Willey reached 100 wickets in his last international match.", "David Willey became the 14th England men’s player to reach 100 wickets in the ODI format."], "ranking": [3, 2, 5, 1, 4]}
{"candidates": ["David Willey finishes his career with 100 wickets at 29.75 across 73 ODIs"], "ranking": [1]}
{"candidates": ["Skipper Babar Azam sounded optimistic in the pre-match press conference.", "The ENG vs PAK ICC World Cup clash was to finalize the top 4 teams for the knockout stages.", "Pakistan needed to defeat England by 287 runs while batting first or 284 balls to spare while chasing to think about the semi-finals.", "Jos Buttler-led England showed potential in their previous match against the Netherlands.", "Pakistan began proceedings knowing that they had the slimmest of chances of still reaching the semi-finals, requiring a win by an enormous margin to force a gargantuan swing on net run rate.", "England captain Jos Buttler decided to bat after winning the toss.", "Babar Azam added that they'd try to make the best of the circumstances."], "ranking": [5, 2, 6, 4, 1, 3, 7]}
{"candidates": ["New Zealand beating Sri Lanka comprehensively has made it almost clear that the Kiwis will be the fourth team to play in the semis of the ICC Cricket World Cup 2023, while Pakistan and Afghanistan are almost out of the race.", "Pakistan will face England in their last game on Saturday at the Eden Gardens in Kolkata, and if they are looking to qualify for the semis, they need to win this game by a record margin of at least 275 runs.", "England have struggled in this tournament but are coming off a big win in the last game, and that is the same with Pakistan. So it will be a tight contest. But Pakistan will be under pressure to win it by big margin, and England will play freely. So we back England to win.", "Skipper Babar Azam addressed a press conference before the match where he sounded optimistic and also took a dig at fans and experts back home.", "Babar Azam emphasized that he doesn't feel the pressure of captaincy despite not performing up to his potential in the World Cup.", "Babar Azam highlighted that his goal was to make the team win rather than focusing on individual performance.", "The match is theoretically a 'do or die' for Pakistan, but practically it is likely to be their last match as they need an implausible victory margin to think about the semi-finals.", "Pakistan face near-impossible task against England to make World Cup semi-finals", "England's brand of cricket has been high-risk-high-reward for about eight years now", "Several of this England squad may not wear an ODI shirt again", "Pakistan will be annoyed that several of their players lost their form at the exact same time leading to their worst mid-World Cup run in history", "Jos Buttler decided to bat first after winning the toss", "England were unchanged from their victory over the Netherlands, while Pakistan made one change with Shadab Khan replacing Hasan Ali", "In their final league game, Pakistan will take on England at the Eden Gardens in Kolkata on Saturday, 11 November 2023.", "With a mathematical probability to still qualify for the semifinals, Virender Sehwag took a sly dig at the Babar Azam & Co. over their virtual exit from the tournament.", "The Men in Green still have a game left in the flagship tournament which will see them lock horns with the reigning champions, England, who are however out of the semifinal race but are fighting for the Champions Trophy spot."], "ranking": [14, 2, 10, 12, 11, 9, 1, 3, 8, 6, 15, 13, 5, 4, 7, 16]}
{"candidates": ["Babar Azam acknowledged Pakistan's mistakes in batting, bowling, and fielding throughout the competition and committed to facilitating the rebuild", "Jos Buttler reflected on the emotional significance of the win despite a disappointing tournament", "David Willey expressed pride in his career and reflected on his retirement decision"], "ranking": [2, 1, 3]}
{"candidates": ["The weather on Saturday will be mostly sunny, with a maximum temperature of 32°C. The humidity level will be 57 percent with a moderate wind speed of 13 km/h.", "The pitch in Kolkata is on the slower side, but the ball moves around under light. Batting will not be easy, as seen in the IND-SA game. Spinners will come into play, and it will be a low-scoring thriller.", "Both teams have played a total of 91 matches so far. England are ahead with 56 wins, while Pakistan have won only 32 matches, and three games have ended without a result.", "Pitch and conditions: Bowlers beware", "Buttler needs 66 more to become just the fifth England cricketer to 5000 ODI runs", "Pakistan have lost a World Cup match to England just once since 1983, winning five of their last six", "England won by 93 runs", "Pakistan needed to chase their target of 338 in 6.4 overs to finish in the top four", "Pakistan finished fifth in the tournament, while England finished seventh"], "ranking": [9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Adam Zampa became just the third Australian spinner to take four wickets in a World Cup clash, following Shane Warne (four times) and Brad Hogg (twice)."], "ranking": [1]}
{"candidates": ["Australia won by 5 wickets with 88 balls remaining.", "Kusal Mendis scored 122 off 77 balls against Pakistan in a previous match.", "Australia's batting average is the lowest in the tournament at 18.80.", "Australia failed to reach 200 in their first two outings.", "David Warner has had a below-par start to what could be his final ODI World Cup appearance, scoring 41 and 13 in his first two games.", "Adam Zampa has leaked runs in his two games with no wickets to his name.", "Mitchell Starc recorded the feat of being the quickest to achieve 50 wickets in World Cup history.", "Sadeera Samarawickrama scored a well-made 108 against Pakistan."], "ranking": [1, 5, 4, 3, 2, 6, 8, 7]}
{"candidates": ["Sri Lanka's new skipper Mendis called it right at the toss and elected to bat first.", "Mendis opined that a total in the range of 280-300 would be safe for his side.", "Chamika Karunaratne and Lahiru Kumara came into Sri Lanka's XI in place of Dasun Shanaka and Matheesha Pathirana.", "Australia went with the same side that played against South Africa.", "Sri Lanka received a blow leading into the game in the form of a quad injury to their skipper Dasun Shanaka, ruling him out of the tournament.", "Mendis took the captaincy reins for Sri Lanka.", "Pat Cummins emphasized the need for Australia to start winning quickly and treat every game like a final.", "Kusal Mendis highlighted the need for Sri Lankan bowlers to adapt quickly to Indian conditions."], "ranking": [5, 3, 2, 1, 8, 4, 6, 7]}
{"candidates": ["Pat Cummins' team has struggled in all facets, while Sri Lanka has leaked runs at an alarming rate and lost Dasun Shanaka to injury.", "The match is almost a must-win for both teams to retain realistic semi-final hopes.", "Australia has been significantly off the pace in all three disciplines.", "Sri Lanka has managed to put runs on the board but conceded runs at an even higher rate.", "Kusal Mendis will take on the captaincy after Dasun Shanaka's injury.", "Australia made two changes after just one match, including the omission of Cameron Green and Alex Carey.", "Australia currently has the lowest batting average of any team in the tournament at 18.80.", "In ODIs, Sri Lanka had prevailed 3-2 in a five-match series in mid-2022.", "Australia will need a change of strategy against Sri Lanka in match 14 of the 2023 ODI World Cup.", "Australia's Travis Head has returned to nets having recovered from a fracture on his left hand and could feature against the Netherlands on October 25 in Delhi, provided he passes the fitness test.", "Sri Lanka's regular skipper Dasun Shanaka has been ruled out of the tournament due to a thigh injury and has been replaced by Chamika Karunaratne. Vice-captain Kusal Mendis will lead the side in Shanaka's absence.", "David Warner will look to start afresh against Sri Lanka, facing Dunith Wellalage who could get some assistance from the Ekana pitch.", "Adam Zampa could face the wrath of an in-form Kusal Mendis, who has struck one fifty and one century in his two games.", "Mitchell Starc has not yet provided the fireworks in this World Cup but against an injury-hit Sri Lanka, anything can happen.", "With Sri Lanka winning three out of the last four ODIs against Australia, the expectation for a competitive match between both these teams isn’t going to be out of the question.", "In the first match of the ODI World Cup 2023, the pitch at the Ekana Cricket Stadium was quite good for batting, which allowed South Africa to post a total in excess of 300 on the board. The average first-innings score at this venue, which boasts long boundaries, is 250, which can be breached when Australia takes on Sri Lanka on October 16.", "The struggles for the Australian batting lineup in the ODI World Cup 2023 have begun from the top, where the veterans David Warner and Steve Smith are yet to score big runs.", "Mitchell Starc and Josh Hazlewood have managed to pick some big wickets in the flagship tournament, but they haven’t been able to sustain their performances long enough to make a telling impact on the team.", "Kusal Mendis and Sadeera Samarawickrama have been amongst the runs for Sri Lanka in the first two matches of the ODI World Cup 2023, helping their team post totals in excess of 300 runs on the board, except that their efforts went in vain.", "The Sri Lankan bowling attack has been trounced all over the park in the initial stage of the flagship tournament, with no standout performer for the team management to take solace in."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]}
{"candidates": ["Pat Cummins expressed that the mood in the camp has been fantastic despite the losses and emphasized the need to turn things around quickly.", "Adam Zampa played through back spasms in a five-wicket defeat of Sri Lanka.", "Zampa mentioned he still had room for improvement once he returned to peak physical condition.", "Sri Lanka has now lost its first three matches, facing an uphill battle to make it past the pool stage.", "Adam Zampa mentioned he was dealing with a back spasm but still managed to perform well.", "Kusal Mendis reflected on the middle order's struggle and the need to perform better in upcoming matches.", "Pat Cummins expressed satisfaction with the team's performance and the energy in the field.", "Mitch Marsh highlighted the importance of the win after a slow start in the tournament.", "Captain Pat Cummins was delighted with the performance and said his side were never going to let the pressure get to them.", "Cummins highlighted the team's high standards and great energy in the field.", "Kusal Mendis, the new captain of Sri Lanka, acknowledged the team's risky shots and lack of strike rotation.", "Mendis expressed confidence in the batting unit to perform better in the remaining matches.", "Adam Zampa mentioned dealing with a back spasm but was pleased to be on the right end of the result.", "Adam Zampa reflected on his performance, stating that he felt he could have bowled better and that his role is to take wickets to make it easier for the death bowlers.", "Zampa mentioned that the call to take him off for Maxwell was made by Pat Cummins, but he might have made it himself due to his sore back."], "ranking": [10, 2, 12, 8, 5, 9, 7, 4, 1, 6, 11, 13, 3, 14, 15]}
{"candidates": ["Mitchell Marsh is hopeful that Australia will hit back before it gets too late."], "ranking": [1]}
{"candidates": ["The surface at the Ekana Stadium had got trickier as the match wore on when Australia faced South Africa.", "Sri Lanka has not beaten Australia in seven attempts at an ODI World Cup since they claimed the title in 1996.", "Dhananjaya de Silva has dismissed David Warner four times in ODIs.", "Australia has caught barely half their chances in the first two matches, giving them the lowest catch percentage of all the teams so far at this World Cup."], "ranking": [4, 2, 3, 1]}
{"candidates": ["India won by 302 runs, which is one of the largest victory margins in ODI history."], "ranking": [1]}
{"candidates": ["India (357/8) defeated Sri Lanka (55) by a 302-run margin.", "Sri Lanka was bowled out for 55 runs.", "India's dominant performance included a significant victory margin.", "India scored 357/8 in their innings.", "Sri Lanka was bowled out for 55 in 19.4 overs.", "Dilshan Madushanka was caught by Shreyas Iyer off Ravindra Jadeja's bowling for 5 runs."], "ranking": [1, 5, 2, 4, 3, 6]}
{"candidates": ["Sri Lanka won the toss and chose to bowl first.", "Sri Lanka's stand-in captain Kusal Mendis opted to bowl first, believing the pitch would be better for batting in the second innings.", "India wanted to bat first anyway, according to Rohit Sharma.", "Sri Lanka players wore black armbands to pay tribute to Percy Abeysekera, the legendary cheerleader who died earlier this week.", "Rohit Sharma mentioned that there would be some assistance for bowlers at the start and then at night, it would be nice for their seamers to bowl.", "Sri Lanka won the toss and elected to field first."], "ranking": [6, 4, 5, 2, 3, 1]}
{"candidates": ["Kusal Mendis expressed disappointment with the performance and acknowledged the good bowling by Madushanka.", "Rohit Sharma expressed happiness with the team's qualification for the semi-finals and praised the efforts of the entire squad.", "Mohammed Shami was named player of the match and praised the support of his fellow bowlers and the crowd.", "Shami was named Player of the Match for his figures of 5 for 18.", "India became the first team to qualify for the semi-finals of the tournament.", "Sri Lanka's campaign is now hanging by a thread.", "Rohit Sharma expressed happiness about officially qualifying for the knockout stages and praised the team's clinical performance.", "Kusal Mendis reflected on the decision to bowl first, noting the challenging seam and swing conditions at night.", "Mohammed Shami expressed satisfaction with his performance and the team's dominant win."], "ranking": [8, 2, 3, 6, 1, 5, 4, 7, 9]}
{"candidates": ["The match was part of the Cricket World Cup 2023.", "India secured their place in the World Cup semi-finals with this victory.", "The match was held on November 2, 2023.", "The match was played at Wankhede Stadium, Mumbai.", "The pitch was the same one where South Africa scored 399 for 7 against England earlier in the tournament.", "A statue of Sachin Tendulkar was unveiled at Wankhede Stadium on the eve of the match.", "India became the first team to reach the semifinals of the 2023 World Cup.", "India are the only undefeated team in the tournament so far.", "Sri Lanka's total of 55 runs is the 4th lowest innings total in World Cups.", "The match was held at Wankhede Stadium, Mumbai.", "The game was part of the ICC Cricket World Cup 2023.", "India booked a semi-final spot in the Cricket World Cup with this win.", "Sri Lanka is all but eliminated from the tournament after a fifth defeat from seven matches."], "ranking": [12, 2, 11, 10, 8, 6, 1, 3, 4, 10, 12, 5, 7]}
{"candidates": ["Ireland set a new best for their highest opening partnership against South Africa in ODI cricket with a 101-run stand between Paul Stirling and Andrew Balbirnie.", "Paul Stirling recorded his highest score of the season with 88 runs from 92 balls.", "This was just Ireland's second win over South Africa in ODIs.", "The 101-run stand between Stirling and Balbirnie was Ireland's second-highest in ODIs against South Africa."], "ranking": [1, 3, 2, 4]}
{"candidates": ["South Africa need 70 runs to win from 3.5 overs.", "Graham Hume dismissed Lungi Ngidi with a catch by Tucker.", "Matthew Humphreys appealed for LBW against Ottniel Baartman but it was not given.", "Lungi Ngidi hit a four off Matthew Humphreys."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Paul Stirling won the toss for the first time in five attempts and elected to bat.", "Win or lose the final one-day international against South Africa at the Sheikh Zayed stadium today, Ireland will look back on 2024 as a year of promise, missed opportunities and, to be fair, some poor luck.", "The men’s senior team will sign off their season knowing that a return of six victories from 18 white-ball matches, before today, is disappointing.", "The team’s two best batsmen Paul Stirling and Harry Tector must shoulder a lot of the blame: the former has managed just one half-century, while the latter had gone 11 innings without reaching 20 before Friday’s defeat.", "Unfortunately for today’s game, Adair was not selected in the ODI squad and is already in Australia where he will spend the next few months playing club cricket in Adelaide.", "Reeza Hendricks was flown in from South Africa due to the injury to Temba Bavuma."], "ranking": [3, 6, 5, 2, 4, 1]}
{"candidates": ["South Africa has already secured the series and is aiming for a clean sweep in the third ODI against Ireland.", "Ireland will be looking to secure a win in the final match of the series.", "In the first match of the series, South Africa defeated Ireland by 139 runs.", "In the second match of the series, South Africa won by 174 runs, securing the series victory."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The question was asked if Ireland batting first would have made a difference, and the answer was an emphatic 'Yes'.", "The series was lop-sided with the result in all three games effectively decided by the toss.", "South Africa had already clinched the series with comprehensive victories in the first two matches, but the loss in the third ODI will leave a sour taste after a disappointing tour."], "ranking": [2, 3, 1]}
{"candidates": ["Ireland won the match by 69 runs with 23 balls to spare.", "The match was held at Zayed Cricket Stadium, Abu Dhabi, United Arab Emirates.", "Ireland are likely to play another 'home series' in Abu Dhabi for commercial reasons.", "The new ball swung more under lights in this match compared to the previous two games.", "Ireland's quicks made early inroads after their batters got them to a competitive total.", "Jason Smith scored his first international fifty.", "Ireland built their score on the back of Stirling and Andy Balbirnie's first 100-plus partnership in ODIs."], "ranking": [1, 6, 7, 5, 3, 4, 2]}
{"candidates": ["The third ODI between South Africa and Ireland will be played on Monday, October 7, 2024, at the Zayed Cricket Stadium in Abu Dhabi.", "The match will start at 5 PM IST, with the toss scheduled for 4:30 PM IST.", "The live streaming of the match will be available on the FanCode app and website.", "The match will not be broadcasted on TV in India."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Dawid Malan became the oldest Englishman to score a World Cup hundred.", "Joe Root surpassed Graham Gooch as England's leading run-scorer in World Cups.", "Dawid Malan's 140 is his highest ODI score and the same as his highest Test score.", "Joe Root surpassed Graham Gooch to become England’s all-time highest scorer at World Cups.", "Dawid Malan scored his career-best 140", "England's biggest World Cup victory overseas by runs with a 137-run win over Bangladesh"], "ranking": [2, 4, 5, 3, 6, 1]}
{"candidates": ["Dawid Malan became England's oldest centurion at a men's World Cup, aged 36 years, 37 days", "Joe Root surpassed Graham Gooch's tally of 897 to become England's highest run-scorer in ODI World Cups", "Mark Wood registered the fastest delivery at the World Cup at 154 kph"], "ranking": [2, 1, 3]}
{"candidates": ["England won by 137 runs", "Taskin Ahmed b Curran 15 (25b 0x4 1x6 35m) SR: 60", "England won by 137 runs", "Dawid Malan scored 140, Jonny Bairstow scored 52, and Joe Root scored 82", "Reece Topley took 4 wickets for 43 runs", "Shoriful Islam took 3 wickets in the final 5 overs", "Litton Das scored 76 for Bangladesh", "Mushfiqur Rahim scored 51 for Bangladesh"], "ranking": [1, 5, 1, 2, 3, 4, 6, 7]}
{"candidates": ["Bangladesh won the toss and asked England to bat first.", "England made one change in their lineup with Reece Topley replacing Moeen Ali.", "Bangladesh won the toss and elected to field first.", "Bangladesh won the toss and chose to field"], "ranking": [4, 2, 3, 1]}
{"candidates": ["Dawid Malan reflected on his innings, mentioning the pitch conditions and the importance of the partnership with Jonny Bairstow.", "England will feel better after today's match as they are heading towards a big victory over Bangladesh and improve their net run rate.", "Dawid Malan expressed his determination to keep silencing critics by scoring runs and contributing to wins.", "Malan reflected on the competition for places in the England squad and his disappointment of missing out on the 2022 T20 World Cup final due to injury.", "Malan hopes to stay fit and help England play good cricket to reach the business end of the tournament.", "England produced an emphatic response to their opening World Cup match defeat.", "Shakib Al Hasan accepted the sanction for Bangladesh's over-rate fine.", "Dawid Malan was named Player of the Match.", "Jos Buttler expressed satisfaction with the team's performance and highlighted areas for improvement", "Shakib Al Hasan acknowledged the team's poor start and the difficulty of chasing 365 runs", "Dawid Malan reflected on his journey and the importance of his performance"], "ranking": [8, 5, 6, 9, 10, 2, 11, 1, 4, 3, 7]}
{"candidates": ["England's victory polished their Net Run Rate to 0.55 after the defeat against New Zealand", "England moved to fifth from bottom in the standings", "Bangladesh will face New Zealand next in Chennai", "Jos Buttler expressed concerns about the integrity of the game given the state of the outfield.", "Buttler mentioned that the poor outfield raises questions about the integrity of the game as players are advised to be careful while fielding.", "Buttler acknowledged that England did not play well in their last game and are eager to improve.", "Buttler stated that England's October 15 contest against Afghanistan in New Delhi looks like a more realistic target for Stokes to return to action."], "ranking": [5, 2, 7, 4, 3, 1, 6]}
{"candidates": ["The weather is cooler than it had been in Ahmedabad", "A fresh pitch has been prepared for this second fixture", "Seam bowlers have previously thrived here", "The outfield has been the focus of the pre-match build-up", "The heavy nature of the surface could reduce the reward for ground strokes", "The match was played in Dharamsala under the watchful gaze of the Himalayas", "The sandy base of the Dharamsala outfield came under scrutiny", "Jonny Bairstow received his 100th ODI cap presented by Eoin Morgan", "Eoin Morgan, in his role as an ICC World Cup ambassador, emphasized Ben Stokes' importance to the England team, highlighting his influence and contributions both on and off the field.", "The Himachal Pradesh Cricket Association Stadium in Dharamsala is one of the world's most picturesque.", "The ground was set to host the third Test between Australia and India earlier this year but was stripped of hosting rights due to the condition of the outfield.", "Australia is set to play just one match in Dharamsala, against unbeaten New Zealand on October 28."], "ranking": [12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["England and Bangladesh have met at each of the past four World Cups, and honours so far are even", "Overall, the rivalry is more one-sided, with 19 England wins to Bangladesh's five", "Dharamsala has hosted five completed ODIs in the past ten years", "Jonny Bairstow will be playing in his 100th ODI", "Najmul Hossain Shanto needs 33 runs to reach 1000 in ODIs", "The match will be played on Tuesday, October 10, 2023.", "The match will start at 10:30am IST, with the toss scheduled at 10am IST.", "The match will be played at the Himachal Pradesh Cricket Association (HPCA) Stadium in Dharamsala.", "The match will be broadcast live on the Star Sports Network.", "The match will be live streamed on the Disney+Hotstar app and website."], "ranking": [5, 4, 10, 2, 3, 9, 8, 7, 6, 1]}
{"candidates": ["Travis Head becomes the third Australian after Ricky Ponting and Adam Gilchrist to score a century in a World Cup final.", "Virat Kohli is now the stand-alone record holder for the most one-day international (ODI) centuries with 50.", "Australia won their record-extending sixth World Cup title.", "Australia won their 6th ODI World Cup title.", "Travis Head became the 7th batter to score a hundred in a World Cup final.", "Virat Kohli finished the World Cup with a record-shattering 765 runs.", "Mohammed Shami finished as the leading wicket-taker in the 2023 World Cup."], "ranking": [2, 1, 3, 6, 5, 4, 7]}
{"candidates": ["India won their ICC Men's Cricket World Cup 2023 encounter against Sri Lanka by 302 runs, a World Cup record win for them.", "Mohammed Shami finished with 7/57 in Mumbai, the best-ever figures for an India bowler in ODIs.", "The first century by a batter in the India vs Australia title clash would be the 40th century in the 2023 edition, making it the first edition in history to witness 40 centuries.", "Virat Kohli needs 39 more runs to become the first batter to aggregate 750 or more runs in a single edition of the World Cup.", "If Mohammad Shami and Adam Zampa reach 25 wickets each, the 2023 World Cup will become the first edition in the history of the tournament to witness two bowlers capturing 25 or more wickets.", "Ravindra Jadeja needs three more wickets to become the fourth left-arm spinner to take 30 or more wickets in the World Cup.", "Ravindra Jadeja needs three more wickets to become the ninth spinner to capture 30 plus wickets in the World Cup.", "Adam Zampa needs three more wickets to become the seventh Australian bowler to capture 30 or more wickets in the World Cup.", "David Warner needs 30 more runs to become the second opener to aggregate 1500 or more runs in the World Cup.", "Virat Kohli needs three more runs to displace Ricky Ponting as the second-highest scorer in the World Cup.", "Indian fielders need four more catches to become the third team in the World Cup to have taken 300 or more catches by fielders.", "Virat Kohli needs one more catch to become the third fielder other than the wicketkeepers to pouch 20 or more catches in the World Cup.", "David Warner needs three more catches to become the fourth fielder other than the wicketkeepers to pouch 20 or more catches in the World Cup.", "Virat Kohli has already made 711 runs, breaking Sachin Tendulkar's record for the most at a World Cup with a game to spare.", "Virat Kohli now has 50 ODI centuries to his name.", "Mohammed Shami is the top wicket taker at the tournament as it stands, despite only playing six matches.", "Travis Head joins Adam Gilchrist, Ricky Ponting, Viv Richards, Mahela Jayawardene, and Clive Lloyd as the only six men to score a hundred in a World Cup final.", "Pat Cummins becomes the first specialist fast bowler to lift the World Cup.", "India becomes the first home team to lose an ODI World Cup since 2007.", "India are the first team to field the same XI in seven consecutive matches in a men's ODI World Cup."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]}
{"candidates": ["Virat Kohli compiled a superb half-century to rescue India after an early Australia attack at the ICC Men's Cricket World Cup 2023.", "Rohit’s attacking ton led India's chase against Afghanistan, as the target was chased down in merely 35 overs.", "Jasprit Bumrah rose to the occasion against Pakistan with a shrewd spell of 2/19 to set up India's victory at the ICC Men's Cricket World Cup 2023.", "Kohli’s exceptional century helped India chase down Bangladesh’s first innings total with ease.", "Mohammed Shami's five-wicket haul and Virat Kohli's stupendous 95 helped India remain unbeaten in the ICC Men's Cricket World Cup 2023.", "Bumrah and Shami ripped through England's batting order under the lights to clean them up for 129.", "India’s top and middle order dominated the proceedings in the batting innings against Sri Lanka.", "Mohammed Siraj and Shami sliced through the Sri Lanka batting order like a hot knife through butter.", "Kohli equalled the record of his idol Sachin Tendulkar, hitting his 49th ODI hundred as India reached 326 against South Africa.", "Shreyas Iyer and Rahul helped India post 410/4 against Netherlands at the back of their attacking tons.", "Kohli’s record-breaking 50th ODI ton set the tone for India’s innings in the semi-final against New Zealand.", "Mitchell once again played an incredible knock, but New Zealand were undone by the brilliance of Shami, who finished with 7/57.", "Travis Head scored 137 off 120 balls, leading Australia to victory.", "Pat Cummins' strategic bowling in the first Powerplay put a break on India's run rate.", "Mitchell Starc found reverse swing in the knockouts, taking six wickets at an average of 14.", "Adam Zampa's tight bowling, giving away just one four in his 10 overs, was crucial.", "Mohammed Siraj and KL Rahul showed emotional reactions post-match, with Siraj in tears and Rahul crumbling to the floor.", "Australia's fielding, including a spectacular catch by Travis Head, saved crucial runs and dismissed key Indian players.", "Jasprit Bumrah's impactful bowling, including the dismissal of Steven Smith with an off-cutter.", "Travis Head scored 137 runs off 120 balls, including 15 fours and 4 sixes.", "Australia won by 6 wickets with 42 balls remaining."], "ranking": [10, 5, 8, 12, 6, 9, 14, 15, 2, 4, 1, 16, 18, 11, 13, 7, 3, 17, 19, 20, 21]}
{"candidates": ["Pat Cummins risked letting Rohit and Co. set the agenda due to the anticipated onset of dew.", "India were red-hot favourites to win the tournament after 10 successive victories.", "Indian fans were eyeing revenge for the 2003 ODI World Cup final defeat against Australia."], "ranking": [2, 1, 3]}
{"candidates": ["Experts predicted India as the favorites given their home advantage.", "India are pursuing a third World Cup title while Australia can claim a record-extending sixth crown.", "The match will be held at Narendra Modi Stadium, Ahmedabad on Sunday, November 19, 2023, with a kick-off scheduled for 2:00 pm local time after an elaborate closing ceremony.", "India are up against an Australian side who have won eight matches in a row and will be playing in their eighth World Cup final.", "Rohit Sharma’s undefeated India will look to end a 10-year global title drought in front of 130,000 fans in the World Cup final against five-time champions Australia on Sunday.", "India have racked up 10 straight wins at the tournament as they seek a third World Cup triumph to add to their 1983 and 2011 victories, the last of which came on home soil.", "Australia captain Pat Cummins confirmed that Sunday’s World Cup final will be played on a ‘used surface’.", "The black soil pitch that was used for India’s game against Pakistan last month will be persisted with.", "Cummins referred to the pitch as a ‘pretty good wicket’.", "Experts predict India as the favorites given their home advantage and dominant performance throughout the tournament.", "The key battle will come at the top of the order - the likes of Mitchell Starc and Josh Hazlewood must stop Rohit Sharma, Shubman Gill and Virat Kohli from getting off to a flyer.", "Australia's task is to silence the crowd and get some nerves jangling, as the Black Caps were able to do to a degree in their semi-final clash before falling short.", "Pat Cummins mentioned the expectation of dew later in the evening, influencing their decision to bowl first.", "Rohit Sharma expressed a preference for setting a total, calling it a 'dream come true' to lead India in the final.", "Predictions highlighted the significance of the Rohit Sharma vs. Travis Head battle.", "Experts highlighted the match as a contest between the team of the tournament (India) and the team that tends to win tournaments (Australia).", "Pat Cummins mentioned the satisfaction of silencing a big crowd, indicating Australia's readiness to face India's home advantage.", "Rohit Sharma emphasized maintaining calmness under pressure, acknowledging the immense expectations on the Indian team."], "ranking": [14, 2, 18, 5, 1, 3, 16, 17, 15, 6, 8, 11, 9, 13, 4, 7, 10, 12]}
{"candidates": ["Hardik Pandya expressed pride in the team's resilience after a close win.", "Rohit Sharma remarked that winning the series was a significant morale booster ahead of the World Cup.", "Pat Cummins' calmness and strategic decisions were praised as key factors in Australia's victory.", "Reflections on India's journey noted their incredible standards and the emotional impact of coming in second.", "Rohit Sharma's efforts to reform India's batting approach were acknowledged despite the loss."], "ranking": [3, 1, 2, 5, 4]}
{"candidates": ["Australia’s Pat Cummins and teammates celebrate winning the 2023 ICC ODI World Cup trophy.", "Australia beat India in the World Test Championship final in England before retaining the Ashes.", "Virat Kohli named Player of the Tournament with 765 runs, three hundreds, and a record 50 ODI centuries.", "The match was held in Ahmedabad.", "The final was attended by a 92,453-strong crowd.", "David Warner's final ODI innings might be his last.", "The match was affected by dew, which helped Australia's chase.", "Pat Cummins's decision to bowl first after winning the toss raised a few eyebrows.", "India's body language on the field was poor.", "The pitch was slow but it was by no means a bad cricket surface."], "ranking": [1, 8, 2, 10, 5, 6, 9, 4, 7, 3]}
{"candidates": ["Australia's resilience throughout the tournament, coming from the bottom of the table to win the World Cup.", "The emotional and physical toll on players, with mentions of injuries and the intense atmosphere at the stadium."], "ranking": [1, 2]}
{"candidates": ["Mohammed Shami became the first Indian bowler to pick more than five-wicket haul in ODI World Cups.", "Shubman Gill became the fastest to reach 2000 ODI runs.", "Virat Kohli nearly equaled Sachin Tendulkar's record of most hundreds in 50-over format.", "This was India's first win against New Zealand in the World Cup since 2003.", "Mohammed Shami took his second five-wicket haul in the ODI World Cup, a record for an Indian bowler.", "Rohit Sharma became the first Indian to hit 50-plus ODI sixes in a calendar year.", "Shubman Gill became the quickest to reach 2000 ODI runs, achieving the milestone in just 38 innings, beating Hashim Amla's record of 40 innings."], "ranking": [2, 1, 5, 6, 3, 4, 7]}
{"candidates": ["Rohit Sharma is one six away from being the first Indian to notch 50 ODI sixes in a calendar year."], "ranking": [1]}
{"candidates": ["India won by 4 wickets (with 12 balls remaining)", "Virat Kohli scored 95 runs off 104 balls with 8 fours and 2 sixes"], "ranking": [1, 2]}
{"candidates": ["India's star all-rounder Hardik Pandya was unavailable due to a left ankle injury.", "Suryakumar Yadav replaced Hardik Pandya in the lineup.", "India brought in pacer Shami for bowling all-rounder Shardul Thakur.", "New Zealand were unchanged from their previous win over Afghanistan.", "Kane Williamson was unavailable due to a thumb injury, and Tom Latham led the side.", "India opted to bowl first due to expected early dew, which could aid batting under lights.", "With Hardik Pandya injured, India brought in Suryakumar Yadav and Mohammed Shami, sacrificing an all-rounder for an additional bowler.", "According to Indian captain Rohit Sharma, the dew factor is likely to play a role in the evening, making it difficult for the bowlers to grip the ball.", "By batting second, India will have the advantage of chasing down a target in more favorable conditions.", "Sunil Gavaskar's pitch assessment stated that the pitch seemed to be designed specifically for batters, as there is a small amount of grass.", "Pacer bowlers may receive some purchase from the new ball with the dew in the evening playing under lights.", "India and New Zealand have seen both teams clashing in a total of 116 One Day Internationals (ODIs), with India leading the stakes with 58 victories against the Kiwis' 50 wins.", "Despite this, the Kiwis have had the upper hand when it comes to World Cup confrontations, with a total of five victories in the tournament, compared to India's three victories.", "India's last triumph against its Kiwi counterpart on the World Cup playground dates back to 2003.", "The top two teams in the points chart are the only ones who have yet to lose a match in the tournament.", "India and New Zealand have both proven to be formidable contenders, each team winning four matches and adding eight points to their scorecard.", "The Kiwis have edged ahead with a superior net run rate of +1.923, besting India's +1.659."], "ranking": [15, 12, 11, 10, 14, 9, 8, 7, 6, 5, 4, 3, 2, 1, 13, 16, 17]}
{"candidates": ["Experts predicted India as the favorites given their home advantage.", "Captain Babar Azam emphasized Pakistan’s focus on improving their powerplay performance.", "The Kohli vs. Shaheen Afridi battle was highlighted as a key contest.", "New Zealand have a stellar record against India in ICC events having lost just one game since 1992", "Both New Zealand and India have been clinical in their approach and come into the game having won four out of four games", "The match was expected to be influenced by the fast bowlers due to the conditions in Dharamsala", "Mohammed Siraj and Matt Henry were highlighted as key players to watch", "Both India and New Zealand have won each of their four opening games in CWC23.", "India has a 70 percent win percentage while chasing in ODIs since 2022.", "Rohit Sharma has scored 265 runs in four games in the World Cup this year.", "The match will feature key player matchups such as Virat Kohli vs Trent Boult.", "India is aiming to win their first ODI World Cup game against New Zealand in 20 years.", "India will be facing New Zealand in the 21st game of the ICC Cricket World Cup, 2023 at the Himachal Pradesh Cricket Association Stadium, Dharamsala on 22nd October 2023 at 02:00 PM IST.", "India have played 4 matches in the series and are currently ranked second on the points table, while New Zealand have also played 4 matches and are looking to strengthen their hold of the top spot.", "Both teams last played against each other in the 3rd ODI of the New Zealand in India, 3 ODI Series, 2023 where Shubman Gill scored the highest fantasy points for India with 153 match fantasy points while Devon Conway topped the fantasy points leaderboard for New Zealand with 210 match fantasy points.", "In the last match played by India against Bangladesh, India beat Bangladesh by 7 wickets. The top fantasy player for India was Virat Kohli who scored 131 fantasy points.", "In their last match in this series against Afghanistan, New Zealand beat Afghanistan by 149 runs. The top fantasy player for New Zealand was Mitchell Santner who scored 111 fantasy points.", "The pitch at the Himachal Pradesh Cricket Association Stadium, Dharamsala is a balanced pitch. The average 1st innings score at this venue in the last 20 matches is 217 runs. The team winning the toss should look to bowl first as the majority of the games played on this ground have been won by the chasing side.", "Temperature is expected to be around 21.43 °C with 37% humidity. Winds at a speed of 2.74 m/s are expected. Cloudy weather is expected during the match, this may help pacers with movement.", "Pacers have been very successful at this venue. They have taken 71% of the total wickets at this venue. We would suggest that you pick as many pace bowlers as possible in your team. Based on the stats available, we predict that the pitch will continue to assist the pacers.", "In the 116 matches played between these 2 teams, India Batters have earned the most fantasy points for their team, while All Rounders have earned the most fantasy points for New Zealand.", "The evenly matched teams come in on the back of all-win record after four games.", "It will be interesting to see what changes the host brings in following the unavailability of the injured Hardik.", "Williamson’s absence would be felt by the Kiwis.", "Experts predicted India as the favorites given their home advantage.", "Shubman Gill can be an excellent captain in the fantasy teams. Gill has always done quite well against New Zealand, and his technique will be crucial in countering the early movement.", "Virat Kohli is among the popular captaincy choices for this game. He has a terrific record against New Zealand, and his recent form has also been good.", "Devon Conway is another popular captaincy option for this game. Conway has done exceptionally well this World Cup, and his expertise against the spinners will be vital to counter the in-form spin duo of the Indian team."], "ranking": [25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 26, 27, 28]}
{"candidates": ["Virat Kohli expressed disappointment at missing his century but was pleased with the team's performance.", "Rohit Sharma praised the team's resilience and highlighted the importance of maintaining momentum.", "Daryl Mitchell reflected on his innings and the challenges posed by the Indian bowlers.", "Rohit Sharma expressed satisfaction with the team's performance, highlighting the importance of staying balanced and enjoying the moment.", "Rohit Sharma praised Mohammed Shami for his class and effective use of conditions.", "Tom Latham reflected on New Zealand's performance, acknowledging their inability to capitalize with the bat in the last 10 overs and the lack of a double breakthrough with the ball.", "Mohammed Shami, the player of the match, expressed confidence and satisfaction with his performance."], "ranking": [5, 3, 6, 2, 4, 1, 7]}
{"candidates": ["India's fifth straight win to open the tournament puts them at the top of the table.", "New Zealand are second after their first loss.", "Mitchell forged a 159-run partnership with Rachin Ravindra (75).", "India won the toss and elected to field first.", "The match was held at Himachal Pradesh Cricket Association Stadium, Dharamsala.", "Mohammed Shami was named Player of the Match.", "Play was halted briefly because of fog in Dharamshala.", "India have chased all five times in this edition of the World Cup.", "India next take on defending champions England in Lucknow on October 29.", "The match was played in Dharamsala on a chilly night.", "Play was halted due to fog, a rare occurrence.", "India's win propelled them to the top of the standings with 10 points.", "The outfield in Dharamsala was a concern for players, with some hesitancy in diving to prevent injuries.", "India's fielding was notable, with key catches and run-outs contributing to their victory.", "The pitch was two-paced, making batting challenging, especially in the middle overs.", "Fireworks were seen at the end of the match after India’s win.", "Virat Kohli's innings was noted for his risk management and calm demeanor.", "India's victory was marked by significant contributions from both bowlers and batsmen.", "New Zealand's fielding and bowling efforts were commendable despite the loss.", "'Fog stops play' is an unusual situation for cricket in India, but the high altitude of the picturesque ground in Dharamsala means that conditions at the venue are notably different from many other at the ICC Men’s Cricket World Cup 2023.", "The venue sits within view of the Himalayas, and lies at an altitude of 1457 metres."], "ranking": [1, 5, 4, 18, 19, 3, 16, 7, 14, 15, 17, 2, 9, 10, 6, 8, 11, 12, 13, 20, 21]}
{"candidates": ["India's head-to-head record against New Zealand in ODIs: 58 wins, 50 losses, 7 no results, 1 tie.", "Highest run-scorers in India vs New Zealand ODIs: Sachin Tendulkar (India) with 1750 runs, Ross Taylor (New Zealand) with 1385 runs.", "Highest wicket-takers in India vs New Zealand ODIs: Javagal Srinath (India) with 51 wickets, Tim Southee (New Zealand) with 35 wickets.", "India's squad includes Rohit Sharma (captain), Hardik Pandya (vice-captain), Shubman Gill, Virat Kohli, Shreyas Iyer, KL Rahul (wicket-keeper), Ravindra Jadeja, Shardul Thakur, Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav, Mohammed Shami, Ravichandran Ashwin, Ishan Kishan (wicket-keeper), Suryakumar Yadav.", "New Zealand's squad includes Kane Williamson (captain), Tom Latham (wicket-keeper), Devon Conway, Daryl Mitchell, Glenn Phillips, Will Young, Mark Chapman, Trent Boult, Tim Southee, Lockie Ferguson, Matt Henry, Mitchell Santner, Ish Sodhi, Jimmy Neesham, Rachin Ravindra."], "ranking": [3, 2, 2, 5, 5]}
{"candidates": ["Shreyas Iyer and KL Rahul forged a 208-run partnership, the highest fourth-wicket stand in World Cups.", "India posted their third total above 400 in the event.", "KL Rahul's hundred came off merely 62 balls, the fastest World Cup century by an India batter.", "Bas de Leede became the most successful Dutch bowler in the Cricket World Cup with 15 scalps, overtaking his father, Tim de Leede.", "India won their ninth successive World Cup match, a first for them.", "India used nine bowlers in a men's ODI World Cup innings, only the third time this has happened.", "Rahul scores fastest World Cup century for India off 62 balls", "Rohit Sharma hit his 59th six of 2023 in ODI cricket, breaking AB de Villiers's 8-year-old record for most sixes in a calendar year in ODIs."], "ranking": [1, 6, 2, 5, 3, 8, 4, 7]}
{"candidates": ["This is the first time the top 4 of any team have all got fifty in ODI World Cups"], "ranking": [1]}
{"candidates": ["India won by 160 runs", "KL Rahul scored a 62-ball century, eventually falling for 102 off 64 balls", "Shreyas Iyer remained unbeaten on 128 off 95 balls", "Teja Nidamanuru hit six sixes to score a quickfire 54 off 39 balls", "Virat Kohli took his first ODI wicket since 2014", "Rohit Sharma bowled for the first time since 2006", "Kuldeep Yadav and Ravindra Jadeja took key wickets to restrict Netherlands", "Mohammed Siraj struck early in the second innings", "India reached 410/4, their second-highest World Cup score"], "ranking": [5, 2, 1, 4, 8, 9, 6, 7, 3]}
{"candidates": ["This match is extremely critical for Netherlands as it looks to keep its standing in the World Cup 2023 points table.", "At present, the Rohit Sharma-led Team India is at the topmost position in the points table.", "India comes into the match after defeating the Temba Bavuma-led Team South Africa by a massive margin of 243 runs at the iconic Eden Gardens in Kolkata.", "Netherlands is entering the match after England defeated it by 160 runs at the MCA Stadium in Pune.", "India has won its matches against South Africa, Sri Lanka, England, New Zealand, Australia, Pakistan, Bangladesh and Afghanistan.", "Netherlands has won only two out of the eight matches played so far, against Bangladesh and South Africa.", "The toss will take place at 01:30 pm whereas the match will take place from 02:00 pm.", "Cricket lovers can watch the match live on Star Sports Network channels and livestream on Disney+Hotstar app and website.", "The match will take place at Bengaluru’s iconic M Chinnaswamy Stadium.", "M Chinnaswamy Stadium has the most batter-friendly pitch in India, with a speedy outfield and shorter boundaries making it easier for batsmen to score runs.", "Spinners get more assistance as the match progresses.", "The stadium has hosted a total of 41 ODI matches so far.", "New Zealand has scored the highest total of 401-6 against Pakistan at this stadium.", "Indian Women’s Cricket Team recorded the lowest score at 114-10 against the South African Women’s Cricket Team at this pitch.", "On Sunday, there is a very low probability of rain and absolutely no likelihood of thunderstorms.", "The weather is expected to be pleasant with sun and some areas with high cloud cover.", "Temperature in Bengaluru is expected to be around 27 degrees Celsius in daytime and around 16 degrees Celsius in the night.", "Rohit Sharma-led Team India has a 97 per cent probability of winning this match given its performance in the tournament so far.", "Netherlands has a slim probability of 3 per cent to win the match against India, according to Google’s win predictor.", "Shubman Gill, Virat Kohli, Rohit Sharma and Shreyas Iyer are among the batsmen to watch out for on the Indian side.", "Shubman Gill surpassed Pakistan captain and skipper Babar in ICC rankings.", "Shubman Gill made a total of 219 runs in only six innings.", "Virat Kohli, Rohit Sharma and Shreyas Iyer are the other Indian batsmen to make it to the ICC ODI rankings.", "Team India has Mohammed Siraj, Kuldeep Yadav, Mohammed Shami, Jasprit Bumrah and Ravindra Jadeja to depend on for bowling.", "Mohammed Siraj has topped the ICC bowling table with a rating of 709.", "Kuldeep Yadav, Jasprit Bumrah, Mohammed Shami and Ravindra Jadeja have also made the cut in the ICC bowling table.", "Netherlands has captain Scott Edwards and Sybrand Engelbrecht as key batsmen, both scoring over 200 runs.", "In the bowling department, Bas de Leede, Logan van Beek and Paul van Meekeren are Team Netherlands’ biggest bets.", "Bas de Leede has picked up 11 wickets, while Logan van Beek and Paul van Meekeren have picked up 10 wickets each.", "Rohit Sharma won the toss and elected to bat first.", "Both sides were unchanged ahead of the final group clash in the Cricket World Cup.", "India won the toss and opted to bat.", "India went in with an unchanged XI, maintaining their intensity after winning 8 matches on the trot.", "India is assured of a semi-finals berth and will face New Zealand in a repeat of the 2019 semi-final in Mumbai on Wednesday.", "India won the toss and chose to bat."], "ranking": [14, 12, 6, 11, 5, 10, 28, 29, 25, 24, 26, 27, 20, 21, 22, 23, 15, 16, 17, 18, 19, 1, 2, 3, 4, 7, 8, 9, 13, 30, 31, 32, 33, 34, 35]}
{"candidates": ["India finished its World Cup league engagements with nine wins on the trot.", "India will take on New Zealand in the semifinal at Mumbai on Wednesday.", "Rohit Sharma expressed satisfaction with the team's performance, highlighting the contributions of different individuals.", "Shreyas Iyer mentioned that his recent innings have boosted his confidence and discussed the challenging pitch conditions.", "Scott Edwards, the Dutch captain, acknowledged India's batting prowess and emphasized the growth of his young team.", "India captain Rohit Sharma expressed satisfaction with the team's performance, highlighting their adaptability and teamwork.", "Netherlands captain Scott Edwards acknowledged the strength of the Indian team and emphasized the learning experience for his young side.", "Shreyas Iyer, the Player of the Match, reflected on his performance and the importance of staying not out.", "India captain Rohit Sharma pleased with team's performance", "Netherlands skipper Scott Edwards reflects on team's performance and growth", "Player of the Match Shreyas Iyer reflects on his innings", "Rohit Sharma expressed satisfaction with India's performance, emphasizing their focus on one game at a time and the importance of enjoying the game.", "Scott Edwards acknowledged the challenge of facing India and expressed pride in his team's performance, highlighting their wins over Bangladesh and South Africa."], "ranking": [5, 12, 8, 9, 4, 3, 6, 2, 11, 10, 7, 1, 13]}
{"candidates": ["India finished the league stage with a perfect 9-0 record", "The Netherlands showed batting grit against a strong Indian attack", "Rohit Sharma expressed satisfaction with the team's performance and readiness for the semi-final against New Zealand"], "ranking": [1, 3, 2]}
{"candidates": ["The match took place at the M. Chinnaswamy Stadium in Bengaluru on November 12, 2023.", "The Diwali weekend spirit was in vogue at the stadium.", "The match took place on the Hindu festival of Diwali.", "India will face New Zealand in the semi-finals.", "India's top five batters all scored in excess of fifty.", "India openers were off to a characteristic aggressive start on a decent batting track in Bengaluru.", "India reached 100 by the 12th over.", "This was the first time that top four batters had reached the scores of fifty-plus in an innings of a Cricket World Cup encounter.", "Netherlands players look back on their two victories and many long-lasting memories made at the ICC Men's Cricket World Cup 2023.", "The Netherlands team did a lap of the Bengaluru stadium to acknowledge the crowd.", "India will face New Zealand in the semi-final in Mumbai.", "Vande Mataram was played at the M Chinnaswamy Stadium as the players shook hands.", "India complete perfect group stage", "Netherlands finish bottom of the table", "Bangladesh snatch final Champions Trophy spot by finishing eighth", "The match took place on Diwali day, adding to the festive atmosphere at the M Chinnaswamy Stadium.", "Rohit Sharma's change in approach has been notable, scoring nearly 500 runs at a strike rate of over 120 in the World Cup.", "India's players, including Virat Kohli, Suryakumar Yadav, Shubman Gill, and Rohit Sharma, all bowled during the match.", "India maintained a perfect record in the group stage with nine wins from nine matches.", "India scored 410/4 in 50 overs.", "Netherlands scored 250 in 47.5 overs.", "Shreyas Iyer was named Player of the Match.", "India elected to bat first after winning the toss."], "ranking": [20, 18, 19, 15, 12, 11, 10, 8, 16, 17, 14, 13, 6, 7, 5, 4, 3, 2, 9, 1, 21, 22, 23]}
