{"candidates": ["Rafael Devers' intentional walk by Gerrit Cole with no one on base sparked a three-run fourth inning.", "Gleyber Torres singled to right, scoring Anthony Volpe in the third inning.", "Masataka Yoshida hit a ground rule double, scoring Rafael Devers and advancing Tyler O'Neill to third in the fourth inning.", "Wilyer Abreu singled to right, scoring Tyler O'Neill and Masataka Yoshida in the fourth inning.", "Rafael Devers singled to right, scoring Danny Jansen and Trevor Story, with Jarren Duran advancing to third in the fifth inning.", "Masataka Yoshida singled to center, scoring Rafael Devers and Jarren Duran, with Tyler O'Neill advancing to third in the fifth inning.", "Gerrit Cole intentionally walked Rafael Devers in the fourth inning, leading to a seven-run inning for the Red Sox.", "The Red Sox scored seven runs against Gerrit Cole after the intentional walk.", "Masataka Yoshida hit an RBI ground-rule double.", "Wilyer Abreu added a two-run single.", "Bryan Bello pitched 5.1 innings allowing only 1 earned run and striking out 2 batters.", "Gerrit Cole allowed 7 earned runs in 4.1 innings.", "Masataka Yoshida hit a ground rule double and a single, driving in 5 runs.", "Rafael Devers drove in 2 runs with a single.", "Wilyer Abreu drove in 2 runs with a single.", "Rafael Devers' intentional walk by Gerrit Cole with no one on base sparked a three-run fourth inning.", "Devers added a two-run single in Boston's four-run fifth inning.", "Gerrit Cole gave up seven runs, his most since June 9, 2022.", "Brayan Bello gave up one run and four hits in 5 1/3 innings for the Red Sox.", "Zach Penrod made his big league debut for Boston in the eighth inning.", "Gerrit Cole hit three batters in his 4 ¹/₃ innings of work.", "Aaron Judge hit a 445-foot home run to center field for his 53rd home run of the season.", "The Yankees won the game 5-2.", "Boston starter Brayan Bello's first pitch in the sixth inning darted behind Judge's legs.", "The Yankees took three out of four games in the series."], "ranking": [1, 5, 3, 4, 6, 2, 7, 8, 10, 11, 9, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["Gerrit Cole and manager Aaron Boone discussed being more aggressive with walking Rafael Devers in certain situations before the game.", "Boston manager Alex Cora admitted prior to Sunday’s game that the Red Sox had tried to hit Aaron Judge with a pitch in the sixth inning of the previous game."], "ranking": [2, 1]}
{"candidates": ["The game was held at Yankee Stadium with an attendance of 46,378.", "The game lasted 2 hours and 51 minutes.", "A sellout crowd of 46,378 pushed the Yankees over 3 million in home attendance for the third straight season and 24th in a row other than 2020-21.", "Boston selected Zach Penrod's contract from Worcester and recalled left-hander Bailey Horn from the Triple-A farm team.", "Red Sox RHP Tanner Houck is tentatively slated to start Wednesday at Tampa Bay.", "This 27-hour slice of life will become a peculiar footnote in the history of The Rivalry.", "The Yankees organization has a championship drought since 2009."], "ranking": [5, 7, 2, 6, 4, 1, 3]}
{"candidates": ["The New York Yankees will look to Jazz Chisholm for continued offensive production when they take the field against Salvador Perez and the Kansas City Royals on Monday.", "The Yankees have been listed as -187 moneyline favorites in this matchup against the Royals (+156).", "New York is the run-line favorite (-1.5).", "The total is 8.5 runs for the contest (with -118 odds to go over and -103 odds to go under).", "Score Prediction: Yankees 5, Royals 4", "Total Prediction: Under 8.5 runs", "Win Probabilities: Yankees 54%, Royals 46%", "The Royals are trying to clinch a playoff spot.", "Bobby Witt Jr. is vying for the American League MVP against Aaron Judge."], "ranking": [8, 5, 4, 3, 6, 7, 2, 9, 1]}
{"candidates": ["Vinnie Pasquantino and the Kansas City Royals will take on the New York Yankees at Yankee Stadium on YES on Monday, September 9, 2024.", "Pasquantino's player prop bets open at 0.5 hits and 0.5 TB's.", "The Kansas City Royals and the New York Yankees meet Monday in MLB action from Yankee Stadium.", "This will be the first installment in a three-game series.", "Carlos Rodon (14-9) with a 4.08 ERA will start for the Yankees, while Brady Singer (9-10) with a 3.35 ERA will start for the Royals.", "The Yankees' recent form includes winning two out of three games against the Chicago Cubs.", "The Royals' recent form includes sweeping the Minnesota Twins in a three-game series.", "Betting odds favor the New York Yankees at -179, with the Kansas City Royals at +151.", "The over/under for the game is set at 8 runs."], "ranking": [8, 6, 5, 4, 3, 2, 1, 7, 9]}
{"candidates": ["Austin Wells expressed excitement after his homer, saying 'I was jacked. I blacked out.'", "Yankees manager Aaron Boone praised Wells' performance, stating 'Whether you get a result or not it’s just the level of the at-bat that he gives you from the left side is impressive and that was a no doubter tonight.'", "Kansas City manager Matt Quatraro reflected on McArthur's performance, saying 'It was one of those nights where he wasn’t able to put them away.'", "Kansas City’s magic number for the third Wild Card slot is 13.", "With 17 games left, the Royals can get nearly all of those by themselves."], "ranking": [2, 1, 3, 5, 4]}
{"candidates": ["The Yankees surpassed last season’s win total and moved 1 1/2 games ahead of the Orioles.", "The Royals lost their sixth straight road game and dropped 3 1/2 games behind Cleveland in the AL Central.", "The game had an attendance of 35,308 at Yankee Stadium III.", "The game duration was 2 hours and 51 minutes.", "Weather conditions were 74°F, Wind 9mph from Right to Left, Sunny, No Precipitation."], "ranking": [1, 2, 3, 4, 5]}
{"candidates": ["Yankees INF DJ LeMahieu was placed on the 10-day injured list and may miss the rest of the season.", "Yankees INF Jon Berti was activated after missing 90 games with a strained left calf."], "ranking": [2, 1]}
{"candidates": ["Kyle Schwarber's record 15th leadoff home run of the season", "Luisangel Acuna launched his third homer in just his eighth big league game."], "ranking": [1, 2]}
{"candidates": ["Sean Manaea won his fourth straight decision", "Brandon Nimmo hit a tiebreaking single in a three-run seventh inning", "Francisco Alvarez and Luisangel Acuña hit second-inning home runs", "Edwin Díaz got a four-out save", "Nick Castellanos hit a home run in the fifth inning", "Francisco Alvarez hit a two-run double in the seventh inning", "Cal Stevenson’s RBI grounder off Reed Garrett in the eighth inning", "Edwin Díaz threw a called third strike past Kyle Schwarber on a full-count fastball", "Brandon Nimmo stole second base and Francisco Alvarez doubled in the seventh inning", "Francisco Alvarez hit a 113.8 mph drive for his 11th home run this season", "Pete Alonso added an RBI single in the eighth inning", "Sean Manaea pitched 7.0 innings with 6 strikeouts and allowed 3 earned runs.", "Edwin Diaz secured the save with 1.1 innings pitched, 2 strikeouts, and no hits allowed.", "Francisco Alvarez hit a home run in the 2nd inning.", "Luis Acuña hit a home run in the 2nd inning.", "Kyle Schwarber hit a home run in the 1st inning.", "Nick Castellanos hit a home run in the 5th inning.", "Brandon Nimmo singled to left in the 7th inning, scoring Starling Marte and advancing Pete Alonso to third.", "Francisco Alvarez doubled to center in the 7th inning, scoring Pete Alonso and Brandon Nimmo.", "Pete Alonso singled to center in the 8th inning, scoring Jose Iglesias and advancing Starling Marte to third.", "Sean Manaea was dominant in seven-plus innings, charged with three runs on three hits without a walk and with six strikeouts.", "Francisco Alvarez hit a clutch two-run double in the seventh inning.", "Luisangel Acuna hit a solo home run in the second inning.", "Brandon Nimmo delivered a go-ahead hit in the seventh inning.", "Edwin Diaz struck out the potential tying run in the eighth inning and shut down the Phillies in the ninth.", "Alec Bohm's three-run homer in the fourth inning ripped open the game.", "Alec Bohm had four hits and four RBIs in the game."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["David Peterson's worst start of the season ended the Mets' winning streak at four games with a 12-2 loss to the Phillies.", "Adam Ottavino served up a back-breaking homer in the Mets’ loss.", "Infielder Eddy Alvarez pitched the ninth inning and worked a scoreless inning.", "Jose Iglesias hit a leadoff homer in the first inning, extending his hitting streak to 14 games.", "Pete Alonso's error led to the Phillies scoring an unearned run in the second inning.", "Alec Bohm hit a three-run homer in the fourth inning, giving the Phillies an 8-2 lead.", "J.T. Realmuto hit a two-run homer in the eighth inning.", "Alec Bohm went 4-for-5 with one home run and four RBIs, including a three-run homer in the fourth inning that turned a three-run lead into an 8-2 advantage."], "ranking": [8, 6, 3, 5, 4, 7, 2, 1]}
{"candidates": ["Manager Carlos Mendoza emphasized the importance of continuing to play well despite losing Francisco Lindor to a sore back", "Brandon Nimmo urged fans to turn out for the game", "It’s another lefty-lefty matchup as Sean Manaea goes up against Ranger Suárez."], "ranking": [2, 3, 1]}
{"candidates": ["Brandon Nimmo expressed that the game felt unbelievable with high energy from the crowd", "Kyle Schwarber expressed the team's desire to secure the division title", "Manager Carlos Mendoza described the atmosphere as 'unbelievable'.", "Brandon Nimmo praised Luisangel Acuna's steadiness and excellence.", "Francisco Alvarez expressed confidence in his improved performance.", "Carlos Mendoza expressed optimism about playing more games in October.", "Manager Rob Thomson thanked his players and credited the staff members.", "Alec Bohm emphasized the importance of putting the bat on the ball and swinging at good pitches.", "Manager Rob Thomson reflected on the team's journey and the goal to win the World Series."], "ranking": [6, 8, 5, 3, 9, 4, 2, 7, 1]}
{"candidates": ["David Peterson was surprised he was removed so early by manager Carlos Mendoza.", "Carlos Mendoza explained his decision to remove Peterson early, citing that the Phillies were putting together good at-bats.", "Francisco Lindor, sidelined with lower back soreness, participated in baseball activities pregame and noted improvement but is not ready to return.", "Bryce Harper commented on Alec Bohm's performance, emphasizing the need for Bohm to give himself grace as he returns from injury.", "Alec Bohm reflected on his approach to getting back to his first-half successes, focusing on putting the bat on the ball and cutting down on chases."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["A crowd of 44,152 filled Citi Field, marking just the fourth sellout this season", "The Mets remained two games ahead of Atlanta for the final NL wild card and improved to 5-1 on their seven-game homestand", "The game was held at Citi Field in Queens, New York.", "Attendance for the game was 44,152.", "The game lasted 2 hours and 23 minutes.", "The game had the fifth-biggest crowd in regular-season Citi Field history.", "The Mets remained two games clear of the Braves in the chase for the final NL wild card.", "The Phillies had a toast filmed for social media after their 12-2 win over the New York Mets.", "The Phillies have made the postseason for three straight years, a rare achievement in franchise history.", "Bryson Stott compared the current team's situation to previous years, highlighting the progress made."], "ranking": [8, 2, 10, 9, 6, 5, 3, 1, 4, 7]}
{"candidates": ["The Phillies clinched a postseason berth for a third straight year with Friday’s win.", "A victory on Saturday or Sunday would allow the Phillies to celebrate winning the NL East title before leaving Queens.", "The Mets maintained their two-game lead over the Braves for the NL’s third wild card due to Miami beating Atlanta."], "ranking": [1, 2, 3]}
{"candidates": ["Phillies starter Ranger Suárez allowed five hits and three walks in five innings", "New York benched J.D. Martinez, who is in a career-worst 0-for-31 slide", "Mark Vientos struck out a career-worst five times", "The Mets finished 5-5 this season in their new gray City Connect jerseys", "Phillies OF Austin Hayes, sidelined since Sept. 1, played in a rehab assignment for Triple-A Lehigh Valley", "Mets RHP Kodai Senga pitched a hitless inning in his first rehab outing since straining his left calf", "Mets RHP Paul Blackburn won’t pitch during the rest of the regular season"], "ranking": [5, 2, 3, 7, 6, 1, 4]}
{"candidates": ["Jose Quintana extended his scoreless streak to a career-high 22 2/3 innings.", "Quintana blanked Washington for 21 innings over three starts, the most innings a Mets pitcher has thrown in one season against an opponent without allowing a run."], "ranking": [2, 1]}
{"candidates": ["Jose Quintana allowed two hits, walked two, and struck out four in seven innings.", "Brandon Nimmo’s three-run homer capped a nine-run fourth inning.", "Luisangel Acuña homered again for the Mets.", "Mark Vientos and Starling Marte each drove in two runs.", "Tyrone Taylor opened the scoring with an RBI double.", "Nimmo hit his second homer since Aug. 20, a 419-foot drive into the Nationals’ bullpen.", "Acuña homered in the eighth inning.", "The New York Mets defeated the Washington Nationals 10-1 last night.", "The Washington Nationals had the New York Mets starter Tylor Megill on the ropes in the third inning, putting runners on first and third with no outs, but they could score only one run.", "James Wood hit into a fielder’s choice, allowing Jacob Young to score the only game run for Washington.", "The Nationals offense struggled as the team was 0-for-5 with runners in scoring position."], "ranking": [8, 2, 6, 5, 9, 3, 7, 1, 4, 10, 11]}
{"candidates": ["Luisangel Acuna hit his first MLB home run in the bottom of the eighth inning.", "Luisangel Acuna hit a game-tying double in the bottom of the third inning.", "The New York Mets won 10-1 against the Washington Nationals."], "ranking": [2, 3, 1]}
{"candidates": ["The New York Mets will take on the Washington Nationals in MLB action at Citi Field on Wednesday, starting at 9:10am AEST.", "Tylor Megill (3-5, 4.48 ERA) will get the ball for the Mets, pitting him against Mitchell Parker (7-9, 4.24 ERA) for the Nationals.", "Stats Insider's predictive analytics model gives the Mets a 64% chance of winning against the Nationals at Citi Field.", "The current betting odds in Australia for Wednesday's MLB game at Citi Field are Mets $1.60, Nationals $2.35.", "The Mets are 1.5-run favourites against the Nationals, with odds of $2.29 available at TAB.", "For the underdog Nationals (+1.5) to cover the line, TAB offers odds of $1.62.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Nationals (+1.5) are predicted to cover the line 55% of the time, while the 7.5-run over/under is expected to go over 56% of the time."], "ranking": [8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Brandon Nimmo said, 'We’re in playoff baseball and every win is extremely important. It decides whether we keep playing or not.'", "Jose Quintana said, 'We’re close to the finish of the season and we’re in good position. We feel really strong.'", "Mets manager Carlos Mendoza said, 'He’s been in the league for a long time and there’s a reason why. He knows that you’re going to go through stretches where it’s hard. And he’ll continue to find a way. It’s just basically trusting his pitches, his repertoire, in the strike zone.'", "Nats' manager Dave Martinez said after yesterday's game, 'We just couldn’t catch up to a fastball. The guy was throwing fastballs, and we were late. Bad combination.'"], "ranking": [2, 4, 1, 3]}
{"candidates": ["Carlos Mendoza praised Luisangel Acuna's calmness and poise on the field.", "Luisangel Acuna expressed that he earned his place in the big leagues.", "Pete Alonso was impressed with how Luisangel Acuna goes about his business.", "Luisangel Acuna mentioned that his confidence comes from his brother, Ronald Acuna."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The Mets finished 11-2 against the Nationals this season, their best record against one opponent since going 10-1 versus the Los Angeles Dodgers in 1988.", "The game is being played at CitiField, New York, New York with the first pitch at 7:10 pm EDT.", "The game will be broadcast on TV: MASN, Radio: 106.7 The Fan radio and via the MLB app; In Spanish on DC 87.7 FM and La Pantera 100.7 FM/1220 AM. On Sirius/XM, tune to Channel 184 for the home broadcast and the road team is online only."], "ranking": [1, 3, 2]}
{"candidates": ["Nationals: 2B Luis García Jr. (right wrist) didn’t play. He exited Tuesday’s game in the fourth inning after aggravating a chronic injury.", "Nationals: RHP Trevor Williams (flexor strain) is expected to come off the 60-day injured list and start Friday against the Chicago Cubs.", "Mets: SS Francisco Lindor (sore back) missed his third straight game but played catch and ran Wednesday afternoon.", "Mets: Rookie RHP Christian Scott (right elbow) will undergo Tommy John surgery with an internal brace added next week and will likely be out until 2026.", "Mets: RHP Kodai Senga (strained left calf), eligible to come off the 60-day injured list next Wednesday, plans to pitch for Triple-A Syracuse this weekend and could still pitch as an opener for the Mets over the final five days of the regular season.", "Mets: RHP Paul Blackburn (spinal leak in back) threw for the first time since making a rehab start Sept. 3 and hopes to pitch for the Mets next week.", "Mets: INF Brett Baty (broken left index finger) went 0 for 4 with Syracuse in his first game action since Aug. 22. Mendoza said Baty could be a candidate for a recall by the Mets."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Steven Kwan extended his Cleveland-record postseason hitting streak to 12 games."], "ranking": [1]}
{"candidates": ["Carlos Rodon totaled 25 swings and misses, the most by a Yankee pitcher in a postseason game in the pitch-tracking era (since 2008)."], "ranking": [1]}
{"candidates": ["Carlos Rodon fired six sensational innings, allowing just one run and three hits while striking out nine and walking none.", "Giancarlo Stanton and Juan Soto homered for the Yankees.", "Brayan Rocchio led off the sixth inning with a solo homer for the Guardians."], "ranking": [1, 2, 3]}
{"candidates": ["Gerrit Cole, a six-time All-Star and reigning AL Cy Young Award winner, started for the Yankees.", "Tanner Bibee started on the mound for the Guardians."], "ranking": [1, 2]}
{"candidates": ["The Cleveland Guardians had a tough Division series versus the Detroit Tigers, winning the last two outings 5-4 and 7-3.", "In Monday’s ALCS opener versus the Yankees, Cleveland gave up three runs in the third on the way to a 5-2 loss.", "For Game 2, the Guardians will start Tanner Bibee, who went 12-8 with a 3.47 ERA in 31 starts this year.", "The Yankees split their two home games versus the Kansas City Royals in the Division Series but won both road games to move on.", "In Monday’s matchup, New York got a solo homer and two runs from Giancarlo Stanton.", "Starting pitcher Carlos Rodon was great in 6.0 innings with one earned run on three hits alongside nine strikeouts.", "The Yankees will start ace Gerrit Cole in Game 2, who was 8-5 with a 3.41 ERA in 17 starts this year.", "Cole has an 11-6 record with a 2.94 ERA in 19 playoff starts over his career."], "ranking": [5, 4, 3, 2, 8, 6, 7, 1]}
{"candidates": ["Guardians manager Stephen Vogt's decision to pull Tanner Bibee early could allow him to be available if the Guardians need relief in an elimination game or if the series advances past four games.", "The Guardians' persistence in loading the bases in the fourth and fifth innings hinted at their ability to cause problems for elite pitchers like Gerrit Cole.", "The Guardians' approach demonstrated that they can manufacture runs through smart at-bats and disciplined baserunning.", "José Ramírez's homer in the final frame before the series shifts back to Cleveland is critical to any potential comeback for the Guardians.", "Aaron Judge expressed the importance of moving on to the next game despite the win.", "Stephen Vogt explained the aggressive moves made during the game and their outcomes.", "Aaron Boone emphasized the importance of being aggressive in certain situations.", "Anthony Rizzo commented on Rodon’s performance, saying 'He set the tone.'", "Guardians manager Stephen Vogt explained his decision to pull Tanner Bibee early, stating that although Bibee was throwing well, the Yankees were getting to him.", "Vogt expressed hope that the Guardians could get some offense going.", "Tanner Bibee expressed frustration about being pulled early but acknowledged there was nothing he could do about it.", "Manager Stephen Vogt emphasized the need for starters to handle more innings to keep the bullpen sharp.", "Bibee mentioned that despite being down two games, the team believes they belong in the series.", "Aaron Judge expressed relief and excitement about his home run, noting the challenging windy and chilly conditions.", "Manager Aaron Boone praised Judge's performance and the cushion his home run provided.", "Gleyber Torres emphasized the importance of maintaining the same mentality as the series shifts to Cleveland.", "Gerrit Cole reflected on his performance, acknowledging he lost some command but managed to avoid breaking under pressure.", "Aaron Judge highlighted the bullpen's lights-out performance and the collective effort needed to reach their goals."], "ranking": [14, 4, 13, 1, 16, 10, 7, 5, 9, 11, 12, 8, 15, 3, 2, 6, 18, 17]}
{"candidates": ["Carlos Rodon expressed happiness with his performance and praised his teammates, including catcher Austin Wells and the bullpen.", "Aaron Boone praised Rodon's command and emotional control during the game.", "Pitching coach Matt Blake highlighted the importance of Rodon's solid six innings for both the team and Rodon himself."], "ranking": [2, 3, 1]}
{"candidates": ["The Guardians used eight pitchers during the game.", "The series now shifts to Cleveland with the Guardians in desperate need of a Game 3 victory.", "The Guardians dropped starting pitcher Alex Cobb from their postseason roster due to a back strain.", "The Yankees lead the ALCS 2-0 for the first time since 2009 against the Los Angeles Angels.", "Guardians: RHP Alex Cobb was removed from the roster with a lower back strain sustained in the opener and replaced by RHP Ben Lively.", "The game was held at Yankee Stadium with an attendance of 47,054.", "The game lasted 3 hours and 26 minutes.", "Umpires for the game were Gabe Morales, Chris Segal, Alan Porter, Jansen Visconti, Vic Carapazza, and Mike Estabrook.", "The Guardians are trailing the Yankees 2-0 in the best-of-seven AL Championship Series.", "Teams taking a 2-0 lead in best-of-seven postseason series have gone on to win the series 84% of the time.", "Matthew Boyd is likely to start Game 3, with Gavin Williams potentially making his playoff debut in Game 4.", "The Guardians are aiming to end their 76-year World Series title drought.", "The Yankees' victory gives them a commanding 2-0 lead in the series as it shifts to Cleveland's Progressive Field.", "In all best-of-seven postseason series, teams taking a 2-0 lead have gone on to win the series 76 of 91 times (84%). Under the current 2-3-2 format, teams winning the first two games at home have gone on to take the series 44 of 55 times (80%)."], "ranking": [12, 5, 8, 9, 7, 14, 13, 11, 3, 2, 10, 1, 4, 6]}
{"candidates": ["The game was played on a chilly, 50-degree night.", "Rodon used a mix of fastball, slider, changeup, curveball, and cutter, with his slider being particularly effective."], "ranking": [2, 1]}
{"candidates": ["This NLCS is on pace to produce the most one-sided results ever in a best-of-seven series with a combined margin of 35 runs after the first 5 games.", "The Mets had a game with zero strikeouts in 44 plate appearances, a rare feat in postseason history.", "This was the 11th game in postseason history where a team had zero strikeouts, and only the third in the last six decades.", "The Dodgers have played five games in this postseason decided by eight runs or more, tying the record for most such games in a postseason.", "The Mets became the first team since the 2002 Angels to avoid striking out in a postseason game."], "ranking": [3, 5, 4, 2, 1]}
{"candidates": ["The Mets' bats exploded for a dozen runs to stave off elimination.", "Jack Flaherty was dominant in Game 1, holding the Mets scoreless for seven innings.", "Pete Alonso hit a three-run home run, his fourth of the postseason.", "Starling Marte doubled home Alonso and Jesse Winker.", "Francisco Alvarez, Francisco Lindor, and Brandon Nimmo contributed with key hits.", "Andy Pages hit a solo shot and a three-run homer for the Dodgers.", "Ryne Stanek served up a leadoff home run to Mookie Betts.", "Edwin Díaz pitched a shutdown eighth and ninth to seal the victory for the Mets.", "Shohei Ohtani homered to lead off Game 4.", "Jack Flaherty gave up eight runs in Game 5 after pitching seven shutout innings in Game 1.", "Pete Alonso hit a three-run homer in Game 5, his second in postseason elimination games for the Mets.", "Pete Alonso hit a three-run homer in the first inning.", "Starling Marte had four hits, three of which were doubles.", "Jesse Winker had two hits, including an RBI triple.", "Francisco Alvarez had three hits, including a double.", "David Peterson started the game for the Mets.", "Ryne Stanek and Edwin Díaz combined for the final thirteen outs of the ballgame.", "The Mets won the game 12-6.", "Pete Alonso hit a three-run home run in the first inning.", "Andy Pages homered twice for the Dodgers, including a three-run blast.", "Mookie Betts hit a solo homer in the sixth inning.", "Starling Marte belted three doubles, driving in three runs on four hits for New York.", "Francisco Lindor and Jesse Winker both plated runs with triples for the Mets.", "Enrique Hernandez scored on a wild pitch from Mets pitcher David Peterson.", "Reed Garrett struck out Freddy Freeman to end a bases-loaded inning.", "Freddie Freeman went hitless in five at-bats in Game 5, stranding runners at second and third base in the first inning and leaving the bases loaded in the fourth.", "Rookie Andy Pages hit two home runs in Game 5."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Friday features all four teams remaining in the 2024 MLB playoffs. Action starts at 5:10pm ET with an NLCS Game 5 between the Los Angeles Dodgers and New York Mets. The Dodgers lead the series 3-1, having outscored the Mets 18-2 over the last two games.", "As of Friday morning, the Dodgers are -134 moneyline favorites and the total is set at 7.5 runs.", "Pete Alonso delivered a strong message to the Dodgers ahead of Game 6, emphasizing the importance of capitalizing on opportunities and surviving Game 6 to reach Game 7.", "Alonso mentioned that his travel bag is still packed, indicating the team's readiness to head back to Los Angeles for Game 6."], "ranking": [3, 4, 1, 2]}
{"candidates": ["The Mets live to fight another day after their explosive offensive performance.", "Carlos Mendoza had to use his higher leverage bullpen arms due to the shrinking lead.", "Brandon Nimmo and Ryne Stanek expressed confusion over the unpredictable nature of the series.", "Francisco Lindor was surprised to learn about the Mets' zero strikeouts in Game 5.", "Ryne Stanek commented on the wild and unexpected nature of postseason baseball.", "The Mets' performance allowed fans to dream of another improbable comeback.", "Alonso's homer might have been his last home game as a Met, but he ensured it wouldn't be his last game with the franchise.", "Carlos Mendoza re-inserted Jeff McNeil into the lineup, and he responded with two sacrifice flies.", "Pete Alonso expressed confidence, saying 'We'll be ready. We love opportunities.'", "Mets manager Carlos Mendoza highlighted the importance of Pete Alonso's home run in setting the tone for the game.", "'We have potentially two games here, and I feel that to prevent runs, we’re in a very good spot,' Roberts said, reflecting on his nine years of managing in the postseason.", "'I don’t think we’ve exposed our high-leverage guys at all. And that’s part of kind of the learning curve for me over history.'", "Freddie Freeman expressed uncertainty about his ability to generate power needed to be productive at bat due to his sprained ankle.", "Dave Roberts acknowledged that Freeman's swing is not right and attributed it to his ankle injury."], "ranking": [1, 8, 12, 10, 11, 3, 2, 9, 5, 6, 4, 7, 13, 14]}
{"candidates": ["The game was played at Citi Field and will move back to Chavez Ravine for the next match.", "Both teams get a day off before the next game.", "The series has been dubbed 'The Blowout Series' due to the large margins of victory.", "The Mets' zero-strikeout game was their first in 14 years and only the second in their history with as many plate appearances.", "The Dodgers' pitchers had only one no-strikeout game in the last 30 regular seasons before this postseason.", "After three chilly games in New York, where temperatures were in the 50s and players donned knit hats and long sleeves, the series returns to the warmth of California. Sunday’s forecast calls for temperatures in the high 70s by first pitch before dropping to the 60s as the game goes on.", "Shohei Ohtani’s wife, Mamiko, and their dog, Decoy, have been low-profile regulars at Dodger Stadium during the playoffs.", "Dodgers first baseman Freddie Freeman’s status for Game 6 had yet to be decided due to a sprained right ankle.", "Dodgers catcher Will Smith was replaced by a pinch hitter in Game 5 after taking either a foul tip or a bat to his catching hand.", "Dodgers second baseman Gavin Lux won’t start Sunday because of an injured hip that limited him to a pinch-hit appearance in Game 5.", "Mets outfielder Brandon Nimmo has been playing with plantar fasciitis in his left foot.", "This is the fourth postseason meeting between the Mets and Dodgers, dating to a 1988 NLCS win for Los Angeles.", "The Mets led Major League Baseball with a 67-40 record from May 30 through the end of the season.", "The Dodgers ranked in MLB’s top five over that stretch with a 62-42 record.", "In Game 5, the Mets became the first team since the 2022 Angels to avoid striking out in a postseason game."], "ranking": [15, 14, 13, 1, 2, 12, 11, 9, 8, 10, 7, 6, 5, 4, 3]}
{"candidates": ["The game forced a Game 6 at Chavez Ravine", "Shohei Ohtani had a 'brain cramp' and did not run home on a grounder", "The Dodgers' next eleven batters were sat down after Betts' home run", "Tommy Edman broke the streak with an infield single in the ninth inning", "Hernandez popped up for the final out of the game"], "ranking": [3, 5, 2, 1, 4]}
{"candidates": ["Jack Flaherty's eight earned runs matched a postseason record accomplished by 15 other pitchers in history.", "Andy Pages (23) is the youngest Dodgers player ever to hit two home runs in a postseason game."], "ranking": [2, 1]}
{"candidates": ["Shohei Ohtani's home run left his bat at 117.8 mph, giving him three homers in this postseason.", "Mark Vientos' 12 RBIs tied the franchise record for a postseason with Curtis Granderson (2015) and John Olerud (1999)."], "ranking": [1, 2]}
{"candidates": ["Pete Alonso hit a three-run homer in the first inning.", "Andy Pages hit two home runs for the Dodgers.", "Ryne Stanek tossed a career-high 2 1/3 innings.", "Edwin Díaz got the last six outs to secure the victory for the Mets.", "Starling Marte went 4-for-4 with three doubles.", "Francisco Lindor tripled home a run.", "Brandon Nimmo brought Flaherty’s tally to eight runs.", "Ryne Stanek and Edwin Díaz combined on the final 13 outs of the Mets’ 12-6 win.", "Pete Alonso hit a three-run homer in the first inning.", "The Mets had a five-run rally against Jack Flaherty in the third inning.", "Ryne Stanek achieved a career-high seven outs.", "Edwin Díaz recorded the final six outs for the first time in his postseason career.", "Pete Alonso hit a three-run homer in the first inning.", "Starling Marte had four hits in the game.", "Andy Pages hit two home runs, making him the first Dodger rookie with a multi-homer postseason game.", "Mookie Betts hit a solo home run in the sixth inning.", "Edwin Diaz struck out Shohei Ohtani with a 99 MPH pitch.", "Ryne Stanek and Edwin Diaz secured the final 12 outs for the Mets.", "Pete Alonso hit a home run in the 1st inning, scoring Francisco Lindor and Brandon Nimmo.", "Mookie Betts hit a home run in the 6th inning.", "Andy Pages hit two home runs, one in the 4th inning and another in the 5th inning.", "Francisco Lindor hit a triple in the 3rd inning.", "Brandon Nimmo hit a single in the 3rd inning, scoring Francisco Lindor.", "Jeff McNeil hit two sacrifice flies, one in the 4th inning and another in the 6th inning.", "Starling Marte hit a double in the 3rd inning, scoring Jesse Winker and Pete Alonso.", "Francisco Alvarez hit a single in the 3rd inning, scoring Starling Marte.", "Jesse Winker hit a triple in the 4th inning, scoring Pete Alonso."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["The Mets lost 10-2 in Game 4 of the NLCS, putting them one game from elimination.", "Jose Quintana struggled against the Dodgers, allowing multiple runs in critical counts.", "Mookie Betts hit a two-run double to extend the Dodgers' lead to 5-2.", "Mookie Betts hit a two-run homer in the sixth inning.", "Jesse Winker flew out with the bases loaded to end the sixth inning.", "Shohei Ohtani hit a leadoff home run on the second pitch of the game.", "Mark Vientos hit a solo home run to tie the game in the first inning.", "Tommy Edman hit an RBI double in the third inning.", "Mookie Betts hit a double in the fourth inning.", "Mookie Betts homered against Phil Maton in the sixth inning.", "Edman hit a two-run double in the eighth inning.", "Will Smith hit an RBI single in the eighth inning."], "ranking": [7, 9, 4, 2, 11, 1, 6, 8, 10, 3, 5, 12]}
{"candidates": ["Mets manager Carlos Mendoza observed strong preparation and positive attitudes in the hitters' meeting.", "The Mets' offense was expected to be explosive due to the depth of their lineup.", "Before Game 5, manager Carlos Mendoza told both Stanek and Díaz to be ready for multi-inning assignments.", "Mendoza emphasized the importance of surviving Game 5 to extend the series.", "The Mets will likely have Sean Manaea, who shut down the Dodgers in Game 2, going against a bullpen game for the Dodgers in Game 6.", "The New York Mets host the Los Angeles Dodgers on Friday in Game 5 of the NLCS. The Dodgers lead the series 3-1 and can move on to the World Series with a victory.", "PITCHING PROBABLES: Dodgers: Jack Flaherty (13-7, 3.17 ERA, 1.07 WHIP, 194 strikeouts); Mets: David Peterson (10-3, 2.90 ERA, 1.29 WHIP, 101 strikeouts)", "BETMGM SPORTSBOOK LINE: Dodgers -132, Mets +112; over/under is 7 runs"], "ranking": [6, 5, 4, 3, 2, 8, 1, 7]}
{"candidates": ["Carlos Mendoza highlighted the team's preparation and determination to keep their season alive.", "Jesse Winker praised the bullpen, calling them'savages' for their performance.", "Edwin Díaz expressed the urgency of the game, saying 'Today was the day, like, we’ve got to go forward.'", "The Mets win the first of three must-win games in impressive fashion.", "The Dodgers could have rested Flaherty for Game 6 but opted to use him in Game 5, leading to a likely bullpen game in Game 6.", "The Mets have a path to a stunning comeback after their latest victory.", "Edwin Diaz & Francisco Alvarez spoke on the New York Mets' Game 5 win over the Los Angeles Dodgers and the possibility of the Mets forcing a Game 7."], "ranking": [5, 2, 4, 1, 6, 3, 7]}
{"candidates": ["Pete Alonso stressed the need for the Mets to be better and apply lessons from the first four games.", "Carlos Mendoza reflected on the need for urgency in the postseason.", "Carlos Mendoza acknowledged the challenges faced by the starting pitchers and credited the Dodgers' deep lineup.", "Brandon Nimmo reflected on the reality of the situation, stating that losing one more game would end their season."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The Mets' bullpen was heavily utilized due to the starting pitcher's high pitch count and other relievers being unavailable.", "Dodgers manager Dave Roberts discussed the strategy of using pitchers to win four games in a seven-game series.", "The Dodgers' 35 walks are the most walks drawn in a 5-game postseason span.", "The game was held at Citi Field in Queens, New York.", "Attendance for the game was 43,841.", "The game lasted 3 hours and 8 minutes.", "The New York Mets won the game 12-6 against the Los Angeles Dodgers.", "The teams meet Friday for the 11th time this season. The Dodgers lead the season series 7-3.", "Francisco Lindor leads the Mets with a.273 batting average, and has 39 doubles, a triple, 33 home runs, 56 walks and 91 RBI.", "Shohei Ohtani leads Los Angeles with 54 home runs while slugging.646."], "ranking": [8, 6, 3, 10, 9, 7, 1, 5, 2, 4]}
{"candidates": ["The Dodgers have scored 30 runs in the series, with 14 coming against a starter the third time through or a long man out of the bullpen.", "The Mets have issued 31 walks in four games.", "The Mets finished 0-for-10 with runners in scoring position and are 4-for-29 (.138) in that category for the series.", "The Dodgers have outscored the Mets, 30-9, in the series.", "Brandon Nimmo is dealing with plantar fasciitis in his left foot."], "ranking": [4, 3, 2, 1, 5]}
{"candidates": ["Juan Soto became the 10th player in franchise history to record three hits in their first postseason game with the Yankees, last achieved by DJ LeMahieu in the 2019 ALDS.", "It was the first postseason game with five lead changes, according to the Elias Sports Bureau."], "ranking": [1, 2]}
{"candidates": ["Yankees manager Aaron Boone and Anthony Rizzo shared a moment during Game 1, highlighting the intensity of the match.", "Royals manager Mike Quatraro noted that the pitching staff's performance was not impacted by the stadium atmosphere.", "Gleyber Torres emphasized the importance of the home crowd's support for Game 2.", "Game 2 of the ALDS will be played on Monday at 7:38 p.m. ET and can be seen on TBS, truTV, and Max.", "Royals' starting pitcher Cole Ragans had an impressive postseason debut against the Orioles and will start Game 2 against the Yankees.", "Yankees' starting pitcher Carlos Rodón enters the postseason with a career-high 32 starts this year and has performed well against the Royals this season.", "Royals' lineup for Game 2 leans heavily right-handed due to facing lefty Carlos Rodón.", "Yankees' lineup for Game 2 includes Alex Verdugo moving up a spot and Jon Berti making his first career start at first base.", "General manager Brian Cashman acquired Mark Leiter Jr. and Enyel De Los Santos to give Aaron Boone more choices for late-game action.", "Cashman did not view Clay Holmes as a problem despite his struggles."], "ranking": [6, 8, 5, 10, 3, 2, 9, 7, 4, 1]}
{"candidates": ["Nestor Cortes Jr. will throw for the first time since going on the injured list on Sept. 25 with a left elbow flexor strain.", "Cortes will make between 20 and 30 throws during the off day following the Yankees’ win over the Kansas City Royals in Game 1 of the American League Division Series on Saturday and before Monday’s Game 2.", "The New York Yankees will square off with the Kansas City Royals in Game 1 of the American League Championship Series at Yankee Stadium on Sunday, starting at 9:38am AEDT.", "The Yankees will have Gerrit Cole (0-0, 0.00 ERA) start, up against Michael Wacha (0-0, 0.00 ERA) for the Royals.", "Stats Insider's independent predictive analytics model gives the Yankees a 65% chance of defeating the Royals at Yankee Stadium.", "The Yankees are 1.5-run favourites against the Royals, with odds of $2.08 available at TAB.", "For the underdog Royals (+1.5) to cover the line, TAB offers odds of $1.77.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under."], "ranking": [5, 4, 3, 2, 8, 6, 7, 1]}
{"candidates": ["Royals manager Matt Quatraro expressed disagreement with the call on Chisholm's steal after reviewing the play postgame.", "Jazz Chisholm Jr. expressed confidence in his ability to steal bases and impact the game.", "Juan Soto expressed his excitement about the 'electric' atmosphere at Yankee Stadium and his focus on trying to get another championship for New York.", "Carlos Rodón reflected on his strong turnaround in his second season with the Yankees and emphasized the importance of the postseason.", "Juan Soto said, 'The fans showed up today. It was electric.'", "Soto reflected on his throw to home plate, saying, 'I know Perez is not that fast, so I just tried to make sure I made a great throw. Don’t try to overthrow it or anything – make an accurate throw.'", "Manager Aaron Boone commented, 'They’re set up big time right there if they score that run. That was a big play.'", "Catcher Austin Wells praised Soto, saying, 'He’s going to get on base – and if he doesn’t, he’s going to be a tough out. He really wears out pitching staffs. I’m glad he’s on our team.'", "Soto said, 'We showed today that we aren’t trying to be selfish. We are trying to pass the baton, take our walks. We aren’t trying to hit five-run homers.'", "Yankees manager Aaron Boone said, 'What a game!'", "Royals manager Matt Quatraro commented on the video review, 'I think we did have a really good argument that that should have been overturned.'", "Alex Verdugo reflected on his performance, 'I feel like I’m pretty real with myself. As in fans booing me, fans getting on me. I understand it. I was booing myself, too.'", "Verdugo added, 'For me, it was just really leaning on my guys in the clubhouse. They all got my back. They all know what kind of player I am and how I played throughout my whole career and just kept telling me, `Man, don’t let this season or this little glimpse make your whole year. You can make up for a lot of things in the playoffs.'", "Verdugo on his catch, 'Thank goodness it popped over to the left hand, so it all worked out.'", "Angel Zerpa said through a translator, 'They looked at a lot of pitches. We were close, but not good enough pitches to make them count.'", "Clay Holmes expressed that what Luke Weaver is doing has been a huge boost for the team.", "Aaron Boone praised Weaver's performance, especially for his first time in the playoffs.", "Royals manager Matt Quatraro expressed frustration over the replay decision, stating there was nothing clear and convincing to overturn the call.", "Michael Massey reviewed the replays after the final out and found the video convincing that the tag was made.", "Jazz Chisholm Jr. recalled the back-and-forth with Massey, maintaining confidence that he was safe."], "ranking": [10, 14, 1, 16, 2, 5, 7, 3, 6, 4, 11, 15, 13, 9, 8, 12, 18, 17, 19, 20]}
{"candidates": ["Cortes said that although he has been throwing plyo balls and that he’s feeling mostly better, he’s not sure how he’ll feel throwing baseballs.", "Cortes didn’t rule himself out for a potential return in the AL Championship Series, which would begin Oct. 14, though it seems unlikely.", "Cortes emphasized the importance of not putting himself at risk and mentioned discussions with trainers about his future and career plans."], "ranking": [2, 1, 3]}
{"candidates": ["The Yankees have announced that Clarke Schmidt will start Game 3, with Luis Gil available in relief.", "The Yankees won five of seven games against the Royals this season.", "The Yankees were 24-7 against the AL Central this season, which includes the three remaining AL playoff teams.", "The Yankees had not gotten a pair of bases-loaded walks in a postseason game since Bullet Joe Bush and Joe Dugan against the New York Giants’ Rosy Ryan in Game 6 of the 1923 World Series.", "The game was the first postseason game with five lead changes.", "MLB's replay regulations state the umpire in the control room has three options: confirm, change, or let stand the call on the field due to the lack of clear and convincing evidence to change it."], "ranking": [6, 5, 4, 1, 2, 3]}
{"candidates": ["Oswaldo Cabrera started at first base for the Yankees in Game 1, marking his 18th career game at the position and his first in the playoffs.", "Anthony Rizzo has been mentoring the club’s fill-in first basemen, including Oswaldo Cabrera, Ben Rice, and Jon Berti.", "New York’s Carlos Rodón (16-9, 3.96 ERA) starts Game 2 in the best-of-five series against the Royals’ Cole Ragans (11-9, 3.14) in a matchup of left-handers."], "ranking": [2, 3, 1]}
{"candidates": ["Francisco Lindor beat the throw to Red Sox catcher Connor Wong to score the go-ahead run for the Mets in the third inning.", "Ceddanne Rafaela hit a triple off New York starter Luis Severino.", "Jarren Duran hit an RBI single to tie the game in the third inning.", "Brandon Nimmo's aggressive play led to a triple by Rafaela.", "Luis Torrens hit a ball that led to a scoring error by Tyler O'Neill.", "Francisco Lindor delivered an RBI single in the fourth inning.", "Luis Severino's dominant seven-inning start sealed a 4-1 Mets victory.", "Luis Severino pitched seven crisp innings, allowing only one earned run and striking out five.", "Francisco Lindor sparked New York’s lineup again with a key performance.", "Marte grounded into a double play, allowing Iglesias to score.", "Duran singled to right, scoring Rafaela.", "Nimmo doubled to center, scoring Lindor.", "Torrens doubled to left, and Stewart scored on a fielding error by left fielder O'Neill.", "Lindor singled to right, scoring Torrens.", "Luis Severino gave up just one run over seven innings in a 4-1 win over the Red Sox.", "Francisco Lindor reached base three times, scored a run, and drove in another.", "Brandon Nimmo made a nice catch on a ball hit by Rafael Devers with runners on base, ending the sixth inning.", "Danny Young got Rafael Devers to ground out to end the eighth inning with runners on second and third.", "Phil Maton closed the game in the ninth for his first save of the year."], "ranking": [1, 5, 4, 6, 8, 3, 2, 7, 9, 11, 10, 12, 13, 14, 15, 16, 17, 18, 19]}
{"candidates": ["The Mets look to take another series from a Sox themed ballclub, as they host the Red Sox for three in Queens.", "The New York Mets host the Boston Red Sox to start a three-game series.", "Monday's game is the first time these teams square off this season.", "Brandon Nimmo has 23 doubles, three triples and 18 home runs for the Mets.", "Francisco Lindor is 13-for-43 with four doubles and four home runs over the last 10 games.", "Ceddanne Rafaela has 20 doubles, four triples, 14 home runs and 63 RBI for the Red Sox.", "Jarren Duran is 12-for-38 with four doubles and four home runs over the last 10 games.", "Mets: 7-3,.249 batting average, 3.10 ERA, outscored opponents by 14 runs in the last 10 games.", "Red Sox: 3-7,.199 batting average, 3.24 ERA, outscored by 10 runs in the last 10 games.", "Luis Severino stated that every series had become 'a must-win series' for the rest of the year."], "ranking": [5, 10, 8, 4, 3, 6, 7, 2, 9, 1]}
{"candidates": ["Manager Alex Cora commented on Jarren Duran's defensive mistake, calling him the best defensive center fielder in the big leagues.", "Tyler O'Neill reflected on his error, noting the ball bounced differently off the dirt.", "Alex Cora acknowledged the team's struggles and emphasized the need to win the next game.", "Brayan Bello reflected on his performance, stating he was out there competing.", "Alex Cora mentioned Rafael Devers' struggles after returning from injury.", "Alex Cora expressed urgency about the team's playoff chances, noting they are running out of time.", "Red Sox manager Alex Cora commented, 'We’re running out of time.'", "The surging Mets crept closer to playoff position by beating the Boston Red Sox 4-1.", "Carlos Mendoza commented on the team's resilience and the significance of playing meaningful games in September.", "Luis Severino expressed his familiarity with playing big games against Boston in New York and his focus on getting the team closer to the playoffs."], "ranking": [8, 5, 6, 9, 7, 3, 4, 1, 2, 10]}
{"candidates": ["The Red Sox committed their 101st error of the season, the first team to surpass 100 errors.", "Luis Severino pitched seven innings, allowing just one run on six hits, lowering his ERA to 3.84.", "The Red Sox had runners in scoring position in the sixth and eighth innings but failed to capitalize.", "The game was held at Citi Field with an attendance of 35,064.", "The game lasted 2 hours and 22 minutes.", "The game was attended by 35,149 fans, the highest attendance without a fan giveaway since June 26.", "Brandon Nimmo's double in the third inning put the Mets ahead again after a tied game.", "DJ Stewart, filling in for J.D. Martinez, singled and scored in the fourth inning."], "ranking": [1, 2, 5, 8, 7, 3, 4, 6]}
{"candidates": ["Player prop odds for Pete Alonso include: Batter Hits: Over 0.5 (-175), Batter Home Runs: Over 0.5 (+450), Batter RBIs: Over 0.5 (+155), Batter Runs Scored: Over 0.5 (-105), Batter Singles: Over 0.5 (+110), Batter Total Bases: Over 1.5 (+145), Batter Doubles: Over 0.5 (+420).", "Among the various prop bets available, the most appealing might be the 'Batter Home Runs' at +450, given Alonso's power and current form.", "Betting on 'Batter RBIs' at +155 could yield excellent returns, especially if Alonso gets opportunities with runners on base.", "The 'Batter Hits' prop at -175 is also a strong consideration, as Alonso has been consistently getting on base.", "The 'Batter Total Bases' at +145 also presents value, particularly if Alonso can get multiple hits."], "ranking": [5, 2, 3, 1, 4]}
{"candidates": ["New York Mets finished off the rival Phillies in Game 4 of their best-of-five Division Series, winning 3-1 to wrap up a postseason series at home for the first time in 24 years.", "The Mets’ first champagne-soaked clinching celebration in Citi Field’s 16-season history."], "ranking": [1, 2]}
{"candidates": ["Sean Manaea allowed only one run over seven innings, leading the Mets to a 7-2 victory in Game 3 of the NLDS.", "Pete Alonso homered leading off the second inning, his sixth home run in 51 career at-bats against Aaron Nola.", "Jesse Winker hit a home run in the fourth inning, giving the Mets a 2-0 lead.", "Starling Marte hit a two-run single in the sixth inning, widening the gap to 4-0.", "Jose Iglesias hit a two-run single in the eighth inning, extending the lead to 6-0.", "Pete Alonso launched another homer off Aaron Nola.", "Sean Manaea took a two-hit shutout into the eighth inning.", "Jesse Winker also went deep.", "Starling Marte had a pivotal two-run single.", "Tyrone Taylor’s terrific throw from deep center field cut down a runner at second base in the fourth.", "Manaea struck out Bryce Harper on three off-speed pitches.", "Nick Castellanos lined into an inning-ending double play.", "Alonso sent Nola’s first pitch of the second deep to right field.", "Marte’s two-run single made it 4-0.", "Jose Iglesias added a two-run single off José Ruiz.", "Harper and Castellanos each hit an RBI single in the eighth.", "Francisco Lindor delivered a run-scoring double in the bottom half to make it 7-2.", "Jesse Winker connected for a solo shot in the fourth."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]}
{"candidates": ["The Phillies trail the Mets two games to one in the National League Division Series and must win to stay in the competition.", "The Phillies' reliever Matt Strahm emphasized the high stakes, stating it was 'World Series or bust' from the beginning of the season.", "Kyle Schwarber drew parallels to the 2016 Cubs' comeback in the World Series, expressing confidence in the Phillies' ability to win.", "Nick Castellanos highlighted the pressure, stating that the team should feel most alive in this critical situation."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Francisco Lindor expressed his desire to win it all and be remembered as a team that comes every 10 years and eats for free everywhere they go.", "Team owner Steve Cohen commented that the $341 million contract given to Lindor was money well spent.", "Manager Carlos Mendoza praised the organization and dedicated the win to the fan base, Mets Nation.", "Nick Castellanos reflected on the pressure, stating that the team should embrace the situation and leave everything on the field.", "Aaron Nola commented on the unpredictability of baseball, acknowledging the Mets' strong performance in the series.", "Brandon Nimmo compared the Mets' postseason run to a movie, emphasizing its dramatic nature.", "Carlos Mendoza gave a speech before the team's champagne celebration.", "Francisco Lindor expressed joy that his wife and daughters were in attendance to watch his grand slam.", "For the NL East champion Phillies, it was a bitter exit early in the playoffs and a disappointing step backward after they advanced to the 2022 World Series and then lost Games 6 and 7 of the 2023 NLCS at home to Arizona.", "Bryce Harper and the Phillies are still looking for the franchise’s third championship."], "ranking": [1, 5, 3, 6, 8, 2, 9, 4, 7, 10]}
{"candidates": ["Sean Manaea expressed that his performance meant a lot due to the ups and downs in his career.", "Manager Carlos Mendoza praised Manaea's presence and demeanor on the mound.", "“It would be fantastic to get it done, but we’ve got to stay within ourselves,” Alonso said.", "“Basically it’s just very simple: You come in here tomorrow, and I told them it’s the most resilient club I’ve ever been around. That’s what they’re all about. They’re all about toughness and fighting and playing together. That’s what we need to do, and just focus on one game,” manager Rob Thomson said.", "“Felt like he wanted this moment,” teammate Francisco Lindor said. “He gave everything he had.”", "“Just went right after him,” Manaea said.", "“Wherever it goes out, if it does, I’m just happy it does,” Alonso said.", "“He knows me. I know him. He’s a great, talented pitcher,” Alonso said. “He’s a tough AB. I’m just happy I was able to come through for the team.”", "“What happens in September stays in September. It’s time to turn the page. I just forget about it,” Suárez said through a translator. “We’re October vibes.”"], "ranking": [8, 5, 6, 1, 2, 9, 7, 3, 4]}
{"candidates": ["The Phillies were the NL East champions but only managed one playoff victory.", "The Mets entered the postseason as a wild card with the No. 6 seed and needed a victory on the final day of the regular season to reach the playoffs.", "Reed Garrett, David Peterson, and Edwin Diaz combined on four scoreless innings in relief behind a superb start from Jose Quintana.", "The Phillies managed only an unearned run against Quintana over five innings.", "The Phillies' bullpen, which was expected to be an advantage, has struggled, allowing 17 hits and 13 runs in nine innings.", "The Mets have a strong record against the Phillies' top pitchers, Wheeler and Nola, winning 14 of the last 17 games started by them over the past three seasons.", "The game was held at Citi Field in Queens, New York, with an attendance of 44,103.", "The New York Mets won the series 3-1 and advanced to the NLCS.", "Pete Alonso danced on a table during the Mets' postgame celebrations.", "Howie Rose delivered a memorable call to end the game, saying 'California, here we come.'"], "ranking": [8, 5, 3, 6, 2, 1, 10, 4, 9, 7]}
{"candidates": ["Sean Manaea blew a kiss to the sky in memory of his Aunt Mabel, who passed away earlier in the day.", "The Mets have never clinched a postseason berth or series at home in the 16 seasons of Citi Field’s existence.", "The Phillies won their first NL East title since 2011.", "After reaching the 2022 World Series and Game 7 of last year’s NLCS, the NL East champion Phillies are on the brink of an early playoff exit at the hands of the rival Mets.", "Manaea earned his first playoff win after entering 0-3 with a 10.66 ERA in his postseason career.", "Alonso and Nola have been squaring off since their college days in the Southeastern Conference.", "It was Alonso’s sixth career homer off Nola, after entering with a.320 batting average and 1.050 OPS in 54 career plate appearances against him."], "ranking": [6, 5, 4, 2, 3, 7, 1]}
{"candidates": ["Juan Soto reached 100 RBIs for the third time in his career.", "Cole Ragans had thrown 543 curveballs in his major league career without giving up a home run on the pitch until Juan Soto's home run.", "Juan Soto now has 199 career HR, 8th-most before turning 26, behind only Jimmie Foxx, Eddie Mathews, Alex Rodriguez, Mel Ott, Mickey Mantle, Albert Pujols, and Frank Robinson."], "ranking": [2, 3, 1]}
{"candidates": ["Jazz Chisholm Jr. hit a game-ending infield single with one out in the 11th inning.", "Juan Soto launched a go-ahead homer in the sixth for the Yankees.", "Luke Weaver struck out three in 1 2/3 hitless innings for the win.", "Jazz Chisholm Jr.'s infield single in the 11th inning secured a thrilling 4-3 victory for the New York Yankees over the Kansas City Royals.", "Juan Soto’s go-ahead home run in the sixth extended the Yankees’ lead in the AL East to 1 1/2 games over Baltimore.", "Michael Massey’s home run provided a brief lead for the Royals.", "Salvador Perez’s impressive double play.", "The Royals’ successful challenge of a safe call at first base.", "Jazz Chisholm Jr. hit a game-ending infield single with one out in the 11th inning, leading the New York Yankees to a 4-3 victory over the Kansas City Royals.", "Juan Soto launched a go-ahead homer in the sixth inning for the Yankees.", "Royals pinch-runner Darion Blanco stole third base and scored on Jake Cousins' wild pitch in the 10th inning.", "Pinch-hitter Austin Wells tied the game with a sacrifice fly in the bottom of the 10th inning.", "Salvador Perez hit a tying sacrifice fly off Clay Holmes in the seventh inning and started an impressive double play to end the bottom half.", "Jazz Chisholm grounded a ball to shortstop to drive in Anthony Volpe for the winning run in a 4-3 walk-off victory.", "Luis Gil delivered a strong performance, allowing just one earned run over five innings and striking out five batters.", "Juan Soto hit a two-run homer in the sixth inning, breaking his cold streak.", "Austin Wells hit a sacrifice fly to left field in the bottom of the 10th inning, driving in Volpe to tie the game at 3-3.", "The New York Yankees' recent 4-3, 11-inning victory over the Kansas City Royals.", "Juan Soto hit a go-ahead two-run home run in the sixth inning despite an injury scare.", "Jazz Chisholm Jr. delivered his first career walk-off hit in the 11th inning.", "Juan Soto hit a 402-foot home run in the sixth inning, giving the Yankees a 2-1 lead.", "Salvador Perez tied the game with a sacrifice fly in the seventh inning.", "The Yankees won 4-3 on an infield single by Jazz Chisholm in the bottom of the 11th inning.", "The New York Yankees used extra-innings to beat the Kansas City Royals 4-3 on Wednesday night at Yankee Stadium.", "Juan Soto went 1-for-5 with a home run, two RBI and a run scored."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]}
{"candidates": ["Aaron Judge commented on his 15-game homerless drought, attributing it to the nature of the game and expressing confidence that the results will come."], "ranking": [1]}
{"candidates": ["Yankees manager Aaron Boone commented, 'This is a big series win for us against a really good club over there that threw a lot of good pitching at us.'", "Royals manager Matt Quatraro said, 'It was a tense game. It was tight. It was well pitched on both sides.'", "Juan Soto reflected on his performance, saying, 'You really get mad when you hit yourself. It’s just the way it goes. I’m not mad at the pitcher or anything. Just mad at myself, but when you come through like that, it just feels a little relief.'", "Jazz Chisholm expressed excitement about the playoff atmosphere, saying, 'We got a strikeout to end the 8th inning and the whole crowd erupted and I was just wide-eyed and was like ‘this is sick’. It ain’t even October yet, I can’t wait.'", "Aaron Judge and Yankees manager Aaron Boone both emphasized that Judge's slump is not health-related and expressed optimism about his performance.", "Boone remains confident that Judge will regain his form, highlighting the historic season Judge is putting together despite recent struggles.", "Aaron Boone praised Juan Soto's resilience and theatrical performance.", "Juan Soto expressed relief and frustration after hitting the home run despite injuring himself earlier in the at-bat.", "Jazz Chisholm commented on the intense environment, saying it felt like a playoff game.", "Chisholm expressed excitement for the upcoming series against the Boston Red Sox."], "ranking": [6, 8, 5, 1, 9, 3, 4, 2, 7, 10]}
{"candidates": ["Yankees manager Aaron Boone commented on the significance of the series win against a strong opponent.", "Royals manager Matt Quatraro reflected on the tense and well-pitched nature of the game.", "Juan Soto expressed relief after hitting a two-run homer despite fouling a ball off his ankle earlier in the at-bat."], "ranking": [2, 3, 1]}
{"candidates": ["Aaron Judge is currently a leading candidate for the AL MVP award, with his closest competitor being Kansas City Royals shortstop Bobby Witt Jr.", "Judge leads the majors in RBIs, OPS, and on-base percentage, and has a 9.5 WAR compared to Witt's 9.1.", "Juan Soto suffered a midgame injury scare but continued to play and hit a home run.", "The Yankees extended their lead to 1 1/2 games in the American League East.", "The win moves the Yankees to 84-62 this season while the loss drops Kansas City to 80-67.", "New York now leads the American League East by 1.5 games over the Baltimore Orioles.", "The Royals are now 1.5 games up on the Minnesota Twins for the second wild card spot in the AL.", "The Royals are seeking their first playoff berth since 2015."], "ranking": [2, 1, 5, 6, 7, 3, 4, 8]}
{"candidates": ["Yankees rookie Luis Gil permitted one run and five hits over five innings in his second start following a stint on the injured list due to a back injury.", "Michael Massey homered in the fourth inning against Luis Gil.", "Royals' RHP Michael Lorenzen (strained left hamstring) will make his next minor league rehab start this weekend and could return to the rotation next week."], "ranking": [2, 1, 3]}
{"candidates": ["Yankees rookie Luis Gil permitted one run and five hits over five innings in his second start following a stint on the injured list due to a back injury.", "Royals' Michael Massey homered in the fourth inning against Luis Gil.", "Royals' RHP Michael Lorenzen (strained left hamstring) will make his next minor league rehab start this weekend and could return to the rotation next week."], "ranking": [2, 1, 3]}
{"candidates": ["Francisco Lindor joined Shane Victorino and Hall of Fame slugger Jim Thome as the only major leaguers with two postseason grand slams.", "Edgardo Alfonzo hit the only other postseason slam in Mets history, during a 1999 Division Series at Arizona.", "Francisco Lindor hit the first lead-flipping postseason grand slam in the history of the Mets franchise.", "Lindor's grand slam was responsible for every run his team scored in the game, a unique achievement in postseason history.", "New York Mets wrapped up a postseason series at home for the first time in 24 years", "The Mets’ first champagne-soaked clinching celebration in Citi Field’s 16-season history"], "ranking": [3, 6, 1, 2, 5, 4]}
{"candidates": ["Jose Quintana has not allowed an earned run in three consecutive postseason starts, which is tied for the second-longest such streak in postseason history."], "ranking": [1]}
{"candidates": ["Francisco Lindor cleared the bases with a grand slam in the bottom of the sixth inning, giving the Mets a 4-1 lead.", "Nick Castellanos had seven hits in 17 at-bats during the NLDS, which included the game-tying home run and walk-off hit in Game 2.", "His batting average was an impressive.412 during the four-game series.", "Francisco Lindor hit a grand slam in the sixth inning.", "Edwin Díaz struck out Kyle Schwarber with two runners aboard to end the game.", "Brandon Nimmo embraced Lindor as the Mets poured onto the field in excitement following the final out.", "The Mets enjoyed the team's first champagne-soaked clinching celebration in Citi Field's 16-season history.", "Mets starter Jose Quintana didn't allow an earned run in five-plus innings of two-hit ball.", "David Peterson pitched 2 1/3 scoreless innings for the win.", "Díaz walked his first two batters in the ninth but retired the next three - two on strikeouts - for the first postseason save of his career.", "Francisco Lindor's sixth-inning grand slam provided all four runs in the Mets' 4-1 win over the Phillies.", "Lindor's grand slam clinched the series for the Mets, sending them to the NLCS.", "Ryne Stanek and Pete Alonso expressed their amazement and joy at Lindor's grand slam.", "Francisco Lindor hit a go-ahead grand slam in the bottom of the sixth inning, sending the Mets to their first NLCS in nine years.", "Francisco Lindor hit a grand slam with the bases loaded in the bottom of the sixth inning, giving the Mets a 4-1 lead.", "Jose Quintana gave up just one run, representing the Mets' starting pitching for the whole season.", "Reed Garrett struck out two batters in the top of the sixth inning.", "David Peterson pitched two and a third innings of scoreless ball.", "Edwin Díaz struck out Kody Clemens and Schwarber, and got Brandon Marsh to fly out, securing the win.", "Francisco Lindor hit a grand slam in the sixth inning", "Edwin Díaz struck out Kyle Schwarber with two runners aboard to end the game."], "ranking": [1, 5, 10, 3, 2, 14, 16, 8, 11, 4, 6, 15, 7, 9, 12, 13, 18, 17, 19, 20, 21]}
{"candidates": ["The Mets scored five runs in the eighth inning of Game 1, resulting in a 6-1 victory.", "Mark Vientos hit two home runs and Pete Alonso hit another in Game 2.", "Nick Castellanos hit a walk-off single, giving the Phillies a 7-6 win in Game 2.", "Jose Quintana held the Phillies to one unearned run in five innings of the Game 4, 4-1 win at Citi Field.", "Francisco Lindor hit a sixth-inning grand slam.", "Jose Quintana pitched around Harper, who walked on five pitches, before Castellanos’ double put two in scoring position.", "Alec Bohm hit a slow chopper to Vientos, who bobbled the ball and couldn’t get anyone out on the play as the Phillies took the lead.", "J.T. Realmuto flied out to shallow right field before a lazy fly from Bryson Stott ended the trouble.", "Quintana was lifted with a runner on in the sixth that Reed Garrett and David Peterson stranded.", "Francisco Lindor’s sixth-inning grand slam sent Citi Field into pandemonium as the Mets, by virtue of a 4-1 victory over the Phillies, clinched their first postseason series at the ballpark since it opened in 2009."], "ranking": [10, 5, 8, 4, 6, 3, 7, 2, 1, 9]}
{"candidates": ["Nick Castellanos issued a warning that the Mets would not want to go back to Philly for a Game 5 if the Phillies managed to win Game 4."], "ranking": [1]}
{"candidates": ["Phillies catcher J.T. Realmuto expressed respect for the Mets, acknowledging their resilience and ability to perform well in later innings.", "Mets manager Carlos Mendoza noted the Phillies' talent and perseverance as reasons for the series being tied.", "Phillies first baseman Bryce Harper anticipated a hostile and fun atmosphere in New York."], "ranking": [2, 3, 1]}
{"candidates": ["Phillies fans expressed heartbreak and disappointment after the loss, with some considering drastic measures to cope with the defeat.", "Fans evacuated from Hurricane Milton only to witness the Phillies' loss in Philadelphia.", "A pair of fans expressed their frustration and disappointment, stating they were 'fed up' with the loss.", "Nick Castellanos expressed frustration but gave credit to the Mets for their performance.", "Castellanos mentioned that the Mets are playing really good baseball and acknowledged their improvement over the season.", "The Mets will advance to the NLCS for the first time since 2015.", "Francisco Lindor expressed his desire to win it all and be remembered forever.", "Brandon Nimmo said, 'This is the kind of stuff that I was dreaming about. This has been a long time coming. We wanted it so bad for our fan base.'", "Pete Alonso told reveling fans, 'So proud of this group. We've overcome so much.'", "Steve Cohen said, 'I want to slay the negative Met fan perceptions, and we're on our way to doing that.'", "Rob Thomson reflected on the Phillies' loss, stating, 'We have a really great group. We got beat in a short series.'", "David Stearns, Mets’ president of baseball operations, described Lindor's grand slam as 'absurd' and 'crazy'.", "Jesse Winker praised Lindor, calling him an MVP and expressing pride in his performance.", "Ryne Stanek and Pete Alonso shared their emotional reactions to Lindor's grand slam, highlighting its significance.", "Nick Castellanos reflected on the Phillies' performance, acknowledging that the Mets played better in the series despite his belief that the Phillies were the better team.", "Castellanos praised the Mets' remarkable turnaround and credited Jose Iglesias for unifying the team and getting the city to buy into something bigger.", "Francisco Lindor made every Mets fan believe with his grand slam.", "Brandon Nimmo was seen crying on the field, overwhelmed by joy.", "The author expressed that this was the best night of his life as a Mets fan.", "For the NL East champion Phillies, it was a bitter exit early in the playoffs and a disappointing step backward after they advanced to the 2022 World Series and then lost Games 6 and 7 of the 2023 NLCS at home to Arizona", "Bryce Harper and the Phillies are still looking for the franchise’s third championship"], "ranking": [14, 18, 20, 19, 17, 16, 15, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 21]}
{"candidates": ["Phillies catcher J.T. Realmuto described Game 2 as an emotional roller coaster with many ups and downs.", "Mets manager Carlos Mendoza reflected on the Phillies' ability to fight back and tie the game despite being down 3-0.", "Jose Quintana expressed his confidence and pride in being part of the team.", "Quintana jumped up in excitement when he watched Lindor swing the Mets into the NLCS."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The last time the Mets won a playoff series in their own ballpark was the 2000 NLCS at Shea Stadium.", "New York is chasing its third World Series title and first since 1986.", "The Phillies scored their only run on an error by third baseman Mark Vientos in the fourth.", "Hoffman took his second loss, the latest flop by a Philadelphia bullpen that failed to deliver throughout the series.", "The Mets have hit two lead-flipping home runs in the last week, a rare achievement in postseason history.", "The article compares Lindor's grand slam to other historic postseason home runs, emphasizing its unique impact.", "The Mets faced a rocky top of the ninth inning with Edwin Díaz walking the first two batters.", "The game was a microcosm of the Mets' 2024 season."], "ranking": [5, 3, 7, 2, 1, 4, 6, 8]}
{"candidates": ["The Mets are moving on to the NLCS for the first time since 2015."], "ranking": [1]}
{"candidates": ["It marked the first game in Yankees history in which the lineup combined for zero walks, zero extra-base hits and 14-plus strikeouts."], "ranking": [1]}
{"candidates": ["Seth Lugo tied Atlanta ace Chris Sale and Detroit lefty Tarik Skubal for most wins in the majors."], "ranking": [1]}
{"candidates": ["Jazz Chisholm Jr. hit a game-ending infield single with one out in the 11th inning.", "Juan Soto launched a go-ahead homer in the sixth for the Yankees.", "Luke Weaver struck out three in 1 2/3 hitless innings for the win.", "Jazz Chisholm Jr. hit a game-ending infield single with one out in the 11th inning.", "Massey homered to right (375 feet).", "Soto homered to right (402 feet), Torres scored.", "Perez hit sacrifice fly to left, Isbel scored.", "Blanco scored on Cousins wild pitch.", "Wells hit sacrifice fly to left, Volpe scored.", "Juan Soto hit a home run in the 6th inning, scoring Gleyber Torres.", "Jazz Chisholm Jr. hit a single in the 11th inning, allowing Jon Berti to score the winning run.", "Michael Massey hit a home run in the 4th inning.", "Austin Wells hit a sacrifice fly in the 10th inning, allowing Anthony Volpe to score and tie the game.", "Jazz Chisholm Jr. gave the Yankees a walk-off win over the Royals in the 11th inning.", "Luke Weaver of the Yankees pitched 1.2 innings with 0 hits, 0 earned runs, and 3 strikeouts.", "Michael Massey of the Royals hit a home run, his 13th of the season.", "Juan Soto of the Yankees hit a home run, his 39th of the season, and had 2 RBIs.", "The Kansas City Royals' pitching staff mowed down the New York Yankees with ease, resulting in a 5-0 victory.", "Seth Lugo didn't let another New York batter reach base until there were two outs in the bottom of the sixth.", "Kris Bubic relieved Lugo in the eighth, retiring the side with two strikeouts, then John Schreiber did the same to close things out in the ninth.", "Every member of New York's starting lineup struck out at least once, with five of the nine striking out multiple times.", "Jazz Chisholm Jr. hit a game-ending infield single with one out in the 11th inning.", "Juan Soto launched a go-ahead homer in the sixth inning.", "Royals pinch-runner Darion Blanco stole third base and scored on Jake Cousins’ wild pitch.", "Pinch-hitter Austin Wells tied the game with a sacrifice fly in the bottom half of the 10th inning.", "Salvador Perez hit a tying sacrifice fly in the seventh inning and started an impressive double play to end the bottom half.", "Jazz Chisholm Jr.'s infield single in the 11th inning scored Jon Berti to deliver a 4-3 walk-off win for the Yankees.", "Juan Soto hit a two-run homer in the sixth inning.", "Luke Weaver struck out Maikel Garcia to end the top of the 11th inning.", "Tommy Kahnle struck out Paul DeJong to keep the game tied after seven and a half innings.", "The Yankees executed a double play in the seventh inning."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]}
{"candidates": ["Seth Lugo struck out 10 in seven masterful innings.", "Salvador Perez hit two run-scoring singles to reach 100 RBIs for the second time.", "Tommy Pham homered.", "Bobby Witt Jr. had an RBI single.", "Kris Bubic and John Schreiber each fanned two in a perfect inning to complete the three-hitter.", "New York failed to advance a runner to second base.", "Kyle Isbel scored twice after leadoff singles."], "ranking": [2, 1, 5, 6, 3, 7, 4]}
{"candidates": ["The New York Yankees face the Kansas City Royals for Game 3 of their three-game MLB series on Wednesday, September 11, 2024.", "The game will not be on TV but can be watched with a free trial to Amazon Prime Video.", "The Yankees have an 83-62 record overall and a 38-32 record at home.", "The Royals have an 80-66 record overall and a 35-36 record on the road.", "The Yankees lead the season series 4-2.", "Aaron Judge has 51 home runs, 117 walks, and 126 RBI while hitting.320 for the Yankees.", "Bobby Witt Jr. has a.334 batting average to lead the Royals, with 41 doubles, 11 triples, and 30 home runs."], "ranking": [7, 6, 5, 4, 3, 1, 2]}
{"candidates": ["Fans can expect a clash of titans as the Kansas City Royals visit the New York Yankees at Yankee Stadium.", "The Royals will be looking to narrow the lead of the Yankees.", "The match is bound to be exciting and recommended for all baseball lovers.", "Cole Ragans has proven himself an important asset for the Royals with more than 200 strikeouts and a low WHIP.", "Luis Gil’s season for the Yankees is outstanding with impressive wins and losses and an ERA not worse than Ragans.", "The current betting odds lean slightly towards the Yankees due to their robust home game performance and historical dominance over the Royals.", "The Kansas City Royals and the New York Yankees meet Wednesday in MLB action from Yankee Stadium.", "This will be the final installment in a three-game series.", "The New York Yankees' recent form and player performance will be examined.", "The Kansas City Royals' recent form and player performance will be examined.", "Recent betting trends and streaks involving the New York Yankees will be analyzed.", "Recent betting trends and streaks involving the Kansas City Royals will be analyzed.", "Recent betting trends in games played between the Royals and Yankees will be analyzed.", "Predictions and expectations about the match outcome are discussed.", "Strategies and preparations by teams or players are considered.", "Anticipated key player matchups or rivalries are highlighted.", "Wednesday’s MLB games include a matchup on Prime Video between the Kansas City Royals and New York Yankees in New York at 7:05 p.m. ET.", "We have odds and projections for that primetime matchup and every other game today."], "ranking": [1, 5, 15, 3, 2, 4, 14, 13, 10, 11, 12, 9, 8, 7, 6, 16, 17, 18]}
{"candidates": ["Even with the loss, the Yankees held onto the top spot in the AL East by 0.5 games.", "The Yankees are just 4-6 in their last 10 games, slowing down instead of hitting their stride with the playoffs fast approaching.", "Yankees manager Aaron Boone commented on the significance of the series win against a strong opponent.", "Royals manager Matt Quatraro reflected on the tense and well-pitched nature of the game.", "Juan Soto expressed relief after hitting a two-run homer despite injuring himself earlier in the at-bat.", "Manager Aaron Boone expressed pride in the team's performance, highlighting the importance of the series win against a strong Royals team.", "Jazz Chisholm Jr. described the game-winning hit as a 'cool moment' and expressed excitement for the upcoming games.", "Juan Soto reflected on the pain he felt after fouling a pitch off his foot before hitting a home run."], "ranking": [5, 2, 6, 8, 3, 1, 4, 7]}
{"candidates": ["Kansas City manager Matt Quatraro praised Seth Lugo's performance, calling it a pitching clinic.", "New York manager Aaron Boone acknowledged the dominance of Seth Lugo's performance.", "Yankees slugger Juan Soto commented on Lugo's effective pitch mixing.", "Seth Lugo reflected on the importance of the game and the atmosphere in New York."], "ranking": [2, 1, 3, 4]}
{"candidates": ["The game went into 11 innings.", "Attendance was 40,080.", "The game lasted 3 hours and 17 minutes.", "The game lasted 3 hours and 17 minutes.", "Attendance was 40,080 at Yankee Stadium III.", "The game was played on grass under sunny conditions with a temperature of 73°F and wind at 8 mph from centerfield.", "Kansas City fell 4 1/2 games behind first-place Cleveland in the AL Central but holds the league’s second wild card by 1 1/2 games over Minnesota.", "New York Yankees increased their advantage in the AL East to 1 1/2 games over Baltimore.", "The Yankees' bullpen allowed two runs (one earned) in six innings.", "The game was attended by 40,908 fans in The Bronx.", "The Yankees moved 1 ½ games clear of the Orioles in the AL East."], "ranking": [10, 8, 6, 6, 9, 5, 2, 1, 4, 3, 7]}
{"candidates": ["Royals remained 3 1/2 games behind first-place Cleveland in the AL Central.", "Royals hold a 2 1/2-game edge over Minnesota for the league's second wild card.", "New York's advantage in the AL East was shaved to a half-game over second-place Baltimore."], "ranking": [2, 3, 1]}
{"candidates": ["Royals: RHP Michael Lorenzen (left hamstring strain) was tagged for three runs and five hits over 1 2/3 innings during a rehab start with Double-A Northwest Arkansas.", "Royals: LHP Will Smith (back spasms) planned to throw another bullpen at less than full intensity.", "Yankees: Boone didn't rule out a return this season for infielder DJ LeMahieu (right hip impingement).", "All-Star LHP Cole Ragans (11-9, 3.33 ERA) starts for Kansas City against rookie RHP Luis Gil (13-6, 3.24) in the rubber match of the three-game series Wednesday night."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Aaron Judge ended the longest home run drought of his career with a go-ahead grand slam in the seventh inning."], "ranking": [1]}
{"candidates": ["Aaron Judge hit a go-ahead grand slam in the seventh inning.", "Masataka Yoshida hit a two-run homer in the sixth inning.", "Trevor Story hit a two-run shot in the seventh inning.", "Gleyber Torres hit an RBI single in the seventh inning.", "Aaron Judge ended the longest home run drought of his career with a go-ahead grand slam in the seventh inning that rallied the New York Yankees to a 5-4 victory over the Boston Red Sox.", "Masataka Yoshida homered to right center (408 feet), Duran scored.", "Trevor Story homered to right center (373 feet), Casas scored.", "Gleyber Torres singled to left, Volpe scored, Verdugo to second.", "Aaron Judge hit a go-ahead grand slam in the seventh inning off left-hander Cam Booser, marking his Major League-leading 52nd homer.", "The Yankees secured a 5-4 victory over the Red Sox.", "Luke Weaver struck out the side in the eighth inning and secured a six-out save."], "ranking": [1, 6, 7, 10, 2, 5, 8, 9, 3, 11, 4]}
{"candidates": ["Juan Soto doubled in the automatic runner in the bottom of the 10th inning to win the game for the Yankees.", "Danny Jansen hit a solo homer in the fifth inning to tie the game.", "Gleyber Torres hit a solo homer to lead off the bottom of the first inning."], "ranking": [1, 2, 3]}
{"candidates": ["The Boston Red Sox will try to stop a six-game road slide when they play the New York Yankees.", "The matchup Friday is the 11th time these teams square off this season. The season series is tied 5-5.", "Aaron Judge has 33 doubles, a triple, 51 home runs and 126 RBI for the Yankees.", "Juan Soto is 9-for-35 with a double, two home runs and five RBI over the last 10 games.", "Tyler O'Neill leads the Red Sox with 30 home runs while slugging.547.", "Connor Wong is 10-for-35 with five doubles, a home run and two RBI over the past 10 games.", "Yankees: 6-4,.227 batting average, 3.00 ERA, outscored opponents by four runs in the last 10 games.", "Red Sox: 4-6,.239 batting average, 4.19 ERA, outscored by six runs in the last 10 games."], "ranking": [3, 2, 8, 5, 7, 6, 1, 4]}
{"candidates": ["Aaron Judge expressed that the atmosphere felt like a playoff game and emphasized the importance of the win.", "Clarke Schmidt described the win as the most memorable of his career due to the magnitude of Judge's homer.", "Cam Booser took responsibility for the loss, stating he didn't do his job.", "Yankees manager Aaron Boone reflected on the special moment, noting the eruption of the dugout and Yankee Stadium.", "Aaron Judge commented on his approach to the game, focusing on daily performance rather than past games.", "Red Sox manager Alex Cora acknowledged Judge's consistent performance throughout the season."], "ranking": [2, 1, 6, 3, 5, 4]}
{"candidates": ["Manager Alex Cora commented on the team's ongoing struggles with hitting.", "Hitting coach Pete Fatse discussed the team's recent inconsistency and the need to execute better.", "Rafael Devers emphasized the importance of staying positive and continuing to fight for wins."], "ranking": [2, 3, 1]}
{"candidates": ["Emergency starter Richard Fitts pitched five shutout innings for Boston.", "Trevor Story returned from a dislocated left shoulder and hit his first home run of the season.", "The game had an attendance of 45,292 and lasted 2 hours and 52 minutes.", "The game was held at Yankee Stadium on September 13, 2024, with an attendance of 45,292.", "The game lasted 2 hours and 52 minutes.", "Umpires for the game were John Tumpane (Home Plate), Marvin Hudson (First Base), Hunter Wendelstedt (Second Base), and Charlie Ramos (Third Base).", "The Yankees are now three games up on the Orioles in the American League East, their largest division lead since June 14.", "The crowd at Yankee Stadium was highly engaged, chanting 'M-V-P!' for Aaron Judge.", "Judge's grand slam ended his career-long homer drought of 16 games."], "ranking": [8, 6, 3, 2, 1, 4, 9, 7, 5]}
{"candidates": ["The Red Sox went 0-for-11 with runners in scoring position and left seven men on base.", "Cooper Criswell had a strong start, limiting the Yankees to one run on four hits and three walks while striking out four over 5 1/3 innings.", "The Red Sox bullpen had a strong night, holding the Yankees at bay until the 10th inning.", "The Red Sox missed an opportunity to make up ground in the wild-card race."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Red Sox OF Rob Refsnyder remained out of the starting lineup due to right wrist discomfort.", "Red Sox RHP Liam Hendriks hopes to pitch again this season despite a setback in his rehabilitation from Tommy John surgery.", "Yankees manager Aaron Boone mentioned that Aaron Judge will probably be the designated hitter on Saturday."], "ranking": [2, 3, 1]}
{"candidates": ["Tanner Houck will start on Friday after being skipped in his last start due to a dead arm."], "ranking": [1]}
{"candidates": ["The Dodgers achieved their largest shutout victory margin in postseason history with a 9-0 win in the NLCS opener.", "Max Muncy ties Reggie Jackson for the longest postseason on-base streak with 12 consecutive plate appearances reaching safely.", "The Dodgers tied the record for most walks in the first four games of a championship series with 30.", "The Dodgers set a record for the most walks in a four-game stretch in one postseason or multiple postseasons with 31 walks in NLCS Games 1-4.", "The Mets tied a record for the most walks issued by one team over any four postseason games with 31 walks in NLCS Games 1-4.", "The Dodgers achieved their fourth consecutive postseason game with at least seven walks, a record since 1901.", "Max Muncy extended his streak of reaching base safely to 12 plate appearances, a postseason record.", "Max Muncy reached base in his first four plate appearances to set a record for consecutive trips reaching safely in a single postseason."], "ranking": [1, 2, 5, 3, 4, 6, 7, 8]}
{"candidates": ["Kiké Hernández tied Babe Ruth for postseason home runs with his 15th career postseason home run.", "Max Muncy tied Corey Seager and Justin Turner for the most postseason home runs as a Dodger in franchise history with his 13th home run.", "Max Muncy tied the franchise record for most career postseason home runs with his 13th homer, matching Corey Seager and Justin Turner."], "ranking": [1, 3, 2]}
{"candidates": ["The Mets committed four errors in three NLCS games.", "Francisco Alvarez's throw to second base allowed Max Muncy to reach safely.", "Luis Severino bobbled a potential double-play ball and deflected a comebacker, allowing a run to score.", "Tyrone Taylor made a sliding catch in the right-center-field gap, preventing a two-run extra-base hit.", "Kiké Hernández hit a two-run home run in the sixth inning to extend the Dodgers' lead.", "Shohei Ohtani hit a home run in the eighth inning.", "Max Muncy hit a home run in the ninth inning.", "The Los Angeles Dodgers won 8-0 over the New York Mets in Game 3 of the NLCS.", "The Mets lost 8-0 to the Dodgers in NLCS Game 3, putting them in a 2-1 series deficit.", "Luis Severino, Reed Garrett, and Tylor Megill each gave up multiple runs.", "Francisco Lindor struck out with bases loaded in the second inning, a critical moment in the game.", "Jose Iglesias grounded into an inning-ending double play in the sixth inning with two men on base.", "Shohei Ohtani hit a three-run home run in the eighth inning.", "Enrique Hernandez hit a two-run home run in the sixth inning.", "Luis Severino allowed two unearned runs over 4 2/3 innings.", "Walker Buehler allowed three hits and two walks over four shutout innings with six strikeouts.", "Max Muncy homered in the ninth inning.", "Shohei Ohtani launched a three-run homer in the eighth inning.", "Enrique Hernández hit a two-run shot in the sixth inning.", "Max Muncy hit a home run in the ninth inning.", "Walker Buehler struck out Francisco Lindor to leave the bases loaded in the second inning.", "Dodgers pitchers combined for a four-hitter with 13 strikeouts."], "ranking": [14, 18, 20, 16, 12, 15, 19, 1, 2, 11, 7, 9, 5, 6, 8, 3, 4, 10, 13, 17, 21, 22]}
{"candidates": ["Tonight’s game will be the 10th time these teams meet this season. The Dodgers lead the series 6-3.", "Manager Carlos Mendoza announced that David Peterson will start Game 5 for the Mets.", "Jack Flaherty will start Game 5 for the Dodgers after throwing seven scoreless innings in Game 1.", "The Dodgers' pregame hitters' meeting focused on not giving in to nibbling around the strike zone, especially against Mets starter Jose Quintana.", "David Peterson will make his first playoff start for New York after pitching well out of the bullpen this postseason.", "Jack Flaherty is scheduled to pitch for Los Angeles looking to put his hometown team in the World Series."], "ranking": [5, 4, 2, 3, 6, 1]}
{"candidates": ["The New York Mets take on the Los Angeles Dodgers on Wednesday in Game 3 of the NLCS with the series tied 1-1.", "The matchup on Wednesday is the ninth time these teams meet this season, with the Dodgers holding a 5-3 advantage in the season series.", "Pitching probables for the game are Dodgers' Walker Buehler (1-6, 5.38 ERA, 1.55 WHIP, 64 strikeouts) and Mets' Luis Severino (11-7, 3.91 ERA, 1.24 WHIP, 161 strikeouts).", "The Mets have a 46-35 record at home and an 89-73 record overall, with a collective.319 on-base percentage, the eighth-best in the majors.", "The Dodgers have a 46-35 record on the road and a 98-64 record overall, with a collective batting average of.258, ranking third in the NL.", "Carlos Mendoza plans to continue using the same lineup despite recent struggles.", "Mendoza is optimistic about the Mets' chances in Game 4, hoping for a similar turnaround as in Game 2.", "Jeff McNeil, despite being on the NLCS roster, is not expected to start in Game 4 due to matchup considerations.", "Jesse Winker is likely to remain sidelined in Game 4 because of Yoshinobu Yamamoto's reverse platoon splits.", "Francisco Alvarez will be back in the lineup for Game 4 despite his postseason struggles.", "Dodgers ace Yoshinobu Yamamoto is scheduled to face Jose Quintana in Game 4.", "Yamamoto pitched five shutout innings against the Padres in the NLDS clincher.", "Manager Carlos Mendoza plans to keep right-handed hitting options such as Jose Iglesias and J.D. Martinez in the lineup.", "Mendoza also plans to stick with slumping Francisco Alvarez.", "The New York Mets will face the Los Angeles Dodgers in Game of the League Series at Citi Field on Thursday, beginning at 11:08am AEDT.", "Luis Severino (1-0, 4.50 ERA) will start on the mound for the Mets, while the Dodgers will counter with Walker Buehler (0-1, 10.80 ERA).", "Stats Insider's prediction and tips for the Mets vs Dodgers game include the latest betting odds in Australia.", "Utilising advanced machine learning and data, Stats Insider has simulated the outcome of Thursday's NY Mets vs LA Dodgers MLB game 10,000 times.", "Stats Insider's independent predictive analytics model currently gives the Mets a 51% chance of winning against the Dodgers at Citi Field.", "The current betting odds in Australia for Thursday's MLB game at Citi Field are: Head to Head: Mets $1.91, Dodgers $1.85; Line: Mets +1.5 ($1.53), Dodgers -1.5 ($2.45); Total (Over/Under 7.5 Runs): Over $1.91, Under $1.91.", "According to Stats Insider's model, the Mets (+1.5) are predicted to cover the line 64% of the time, while the 7.5-run over/under is expected to go over 51% of the time.", "Stats Insider provides full coverage of the NY Mets vs LA Dodgers game on Thursday, including data-driven predictions and live win probabilities."], "ranking": [10, 8, 12, 14, 15, 6, 7, 5, 9, 11, 13, 4, 3, 2, 1, 16, 17, 18, 19, 20, 21, 22]}
{"candidates": ["Mets manager Carlos Mendoza said his team had to respond in Game 2.", "The result proves why the Dodgers were the first in the NL West during the regular season.", "Manager Carlos Mendoza expressed concern over the Mets' starting pitching options for Game 5.", "The Dodgers are heavily favored to close out the series in Game 5.", "Freddie Freeman emphasized the importance of not giving in to nibbling and praised the team's patience at the plate.", "Mets manager Carlos Mendoza highlighted the depth and discipline of the Dodgers' lineup.", "Chris Taylor spoke about the increased focus required in the postseason and the importance of bringing the right energy.", "Max Muncy reflected on the team's bonding and willingness to do whatever it takes for each other.", "Manager Dave Roberts expressed pride in the team's relentless performance, stating, 'I love the way that our guys haven’t let off the gas.'", "Mookie Betts commented on the emotional ride, saying, 'You just ride those emotions.'", "Shohei Ohtani mentioned Freddie Freeman's encouragement before the game, which motivated him to perform well.", "Brandon Nimmo expressed optimism despite the loss, stating, 'We’ve had our backs against the wall, for sure. Now, we do again. So we’re going to do our best to add to this story and make some more magic.'", "Pete Alonso highlighted the team's resiliency, saying, 'The character of this team, the one word I can think of for the 2024 Mets -- other than ‘Grimace’ -- is resiliency. That’s just who we are.'", "Francisco Lindor reflected on his past experience, saying, 'I’ve been up 3-1 and I lost the World Series. So it can definitely be done.'", "David Peterson emphasized the team's journey, stating, 'We’ve gone through a lot this year. It’s made us who we are at this point.'", "Dodgers manager Dave Roberts spoke about maintaining a 'hungry' attitude and the team's 'us-against-the-world' mentality."], "ranking": [12, 8, 10, 6, 9, 11, 7, 5, 1, 4, 3, 2, 15, 14, 13, 16]}
{"candidates": ["Mets manager Carlos Mendoza emphasized the importance of limiting mistakes to win ballgames.", "Francisco Lindor reflected on the tough inning and the need to be better in future games.", "Luis Severino acknowledged his mistakes in the second inning but felt he pitched well otherwise.", "Tyrone Taylor expressed his commitment to making crucial defensive plays and helping the team.", "Mookie Betts expressed amazement at Hernández's performance.", "Max Muncy praised Hernández's ability to perform in critical moments.", "Austin Barnes highlighted Hernández's focus and ability to thrive in high-pressure situations.", "Max Muncy reflected on the significance of tying the Dodgers' postseason home run record.", "Max Muncy, Walker Buehler, and Kiké Hernández spoke on the Los Angeles Dodgers' victory.", "Carlos Mendoza expressed confidence in his players, stating they have brought the team this far and will continue to step up.", "Jeff McNeil expressed readiness to play whenever called upon, despite not being in the starting lineup.", "Francisco Lindor expressed disappointment, saying, 'We didn’t do anything to give them moments. They didn’t get what they came here to see.'", "Manager Carlos Mendoza stated, 'The guys that are in there got us to this point, and I’m pretty confident they will come through.'", "Reed Garrett commented, 'We got beat 9-0 the first game and came back and won. I don’t see any reason why we can’t do that [Thursday].'", "Walker Buehler expressed satisfaction with his pitching performance in the cold weather.", "Buehler praised catcher Will Smith for his role in the shutout."], "ranking": [12, 10, 9, 8, 14, 13, 11, 15, 7, 6, 5, 4, 3, 2, 1, 16]}
{"candidates": ["The Dodgers silenced the 43,883 Citi Field crowd after pitching their fourth shutout in the past five playoff games in Game 3.", "Shohei Ohtani fouled a ball off his left knee and was in noticeable pain but stayed in the game.", "The Dodgers' bullpen has not allowed a run in a win this postseason.", "The Dodgers sat Freddie Freeman to rest his ankle, yet scored seven runs in six innings.", "Freddie Freeman missed his second game of the playoffs due to a badly sprained and swollen right ankle.", "Francisco Alvarez was pulled for a pinch hitter after getting drilled by a pitch and hobbling to first base."], "ranking": [1, 5, 3, 2, 6, 4]}
{"candidates": ["Wind conditions affected fly balls to left field, as noted by Pete Alonso and Francisco Lindor.", "Reed Garrett had not given up a home run on a splitter all year until Hernández's home run."], "ranking": [2, 1]}
{"candidates": ["The Mets need more action from Pete Alonso, who leads the team with 34 home runs and a.459 batting average.", "Game 4 of the series is tonight in Citi Field at 8:08 p.m. (Fox) where the Mets are looking for their revenge."], "ranking": [1, 2]}
{"candidates": ["Game 4 is scheduled for Thursday night in Queens, with rookie Yoshinobu Yamamoto starting for Los Angeles against veteran left-hander Jose Quintana."], "ranking": [1]}
