{"candidates": ["It was the majors' fastest nine-inning game since Armando Galarraga nearly threw a perfect game for Detroit against Cleveland on June 2, 2010. That game was completed in 1 hour, 44 minutes.", "It was the fastest nine-inning game for the Cubs since they finished a 3-0 victory over the Reds in 1 hour, 48 minutes on May 24, 2001, at Wrigley, according to the Elias Sports Bureau.", "Nick Martinez's 6.44 strikeout-to-walk ratio is the best for a Reds pitcher (minimum 100 innings) since 1900.", "The game was the fastest nine-inning Major League game played since Cleveland vs. Detroit finished in 1:44 on June 2, 2010.", "Nick Martinez set a Cincinnati Reds franchise record with a strikeout-to-walk ratio of 6.44 for pitchers who threw 140 or more innings in a season.", "At 1 hour, 48 minutes, it was the majors’ fastest nine-inning game since Armando Galarraga nearly threw a perfect game for Detroit against Cleveland on June 2, 2010. That game was completed in 1 hour, 44 minutes.", "It was the fastest nine-inning game for the Cubs since they finished a 3-0 victory over the Reds in 1 hour, 48 minutes on May 24, 2001, at Wrigley, according to the Elias Sports Bureau.", "Reds-Cubs lasted 1 hour and 48 minutes, the fastest 9-inning game since Armando Galarraga’s near-perfect game on 6/2/10 (1 hour, 44 minutes)"], "ranking": [1, 2, 5, 3, 4, 2, 2, 6]}
{"candidates": ["Jameson Taillon pitched seven crisp innings, allowing four hits, striking out two, and walking two.", "Tyson Miller got three outs before Porter Hodge finished the four-hitter for his eighth save.", "Nico Hoerner hit a leadoff double, advanced to third on Pete Crow-Armstrong's sacrifice bunt, and scored on Miguel Amaya's sacrifice fly.", "Nick Martinez pitched a five-hitter for his first career complete game.", "Nick Martinez pitched his first complete game in the big leagues, allowing one earned run and five hits over eight innings with no walks and three strikeouts.", "Nico Hoerner led off the fifth inning with a double to left field and later scored the only run of the game on a sacrifice fly by Miguel Amaya.", "Jameson Taillon pitched seven crisp innings in his second straight win.", "Miguel Amaya hit a sacrifice fly to right, scoring Nico Hoerner in the 5th inning.", "Nick Martinez pitched eight innings with only one earned run and three strikeouts.", "Nick Martinez threw eight innings in a complete game, 1-0 loss against the Cubs without walking anyone and picking up three strikeouts.", "Jameson Taillon threw seven crisp innings in his second straight win, allowing four hits, striking out two, and walking two.", "Tyson Miller got three outs before Porter Hodge finished the four-hitter for his eighth save.", "Nico Hoerner hit a leadoff double, advanced to third on Pete Crow-Armstrong’s sacrifice bunt, and scored on Miguel Amaya’s sacrifice fly.", "Nick Martinez pitched a five-hitter for his first career complete game, despite the Reds' loss.", "Jameson Taillon strikes out Jonathan India", "Pete Crow-Armstrong nabs Elly De La Cruz at 3rd", "Nick Martinez strikes out Isaac Paredes", "Miguel Amaya's sac fly", "Porter Hodge induces the final out"], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17, 18, 19]}
{"candidates": ["Ian Happ and the Chicago Cubs will hit the field at Wrigley Field against the Cincinnati Reds and Elly De La Cruz on Friday.", "The Cubs are 19th in MLB action with 170 home runs, averaging 1.1 per game.", "The Reds have an 8.7 K/9 this season as a pitching staff, ranking 12th in the majors.", "Game Day: Friday, September 27, 2024", "Game Time: 2:20 p.m. ET", "Location: Chicago, Illinois", "Stadium: Wrigley Field", "TV Channel: Bally Sports", "Live Stream: Fubo", "Favorite: Cubs (-142, bet $142 to win $100)", "Underdog: Reds (+120, bet $100 to win $120)", "Over/under: 6.5", "Analysts predict a close game between the Chicago Cubs and Cincinnati Reds on September 27, 2024, at Wrigley Field.", "The Cubs have won each of their last five-day games following a road loss.", "The Reds have lost five of their last six games against teams that held a winning record.", "The Cubs have covered the run line in six of their last seven-day games against National League opponents following a road loss.", "The Reds have failed to cover the run line in five of their last six games against teams that held a winning record.", "Seven of the Reds' last eight-day games against NL Central opponents have gone UNDER the total runs line.", "Each of the Cubs' last four-day games against National League opponents has gone UNDER the total runs line.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Reds' last three games.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the last three-day games between the Reds and Cubs at Wrigley Field.", "Nico Hoerner has scored at least one run in six of the Cubs' last seven home games against the Reds.", "Dansby Swanson has hit a home run in four of the Cubs' last six games against NL Central opponents.", "Dansby Swanson has recorded at least one RBI in six of the Cubs' last seven games against NL Central opponents.", "Dansby Swanson has recorded at least one Double in four of the Cubs' last five games against the Reds.", "Seiya Suzuki has recorded at least one Single in 10 of his last 11 appearances against opponents that held a losing record.", "Dansby Swanson has recorded at least one total base in each of his last nine appearances against NL opponents.", "Dansby Swanson has recorded at least one hit in each of his last nine appearances against NL opponents.", "TJ Friedl has recorded at least one hit in each of the Reds' last seven road games against opponents that held a winning record.", "TJ Friedl has recorded at least one total base in each of the Reds' last seven road games against opponents that held a winning record.", "Spencer Steer has scored at least one run in nine of his last 11 road appearances against the Cubs.", "Spencer Steer has hit a home run in each of the Reds' last two games at Wrigley Field against NL Central opponents that held a winning record.", "Jonathan India has recorded an RBI in each of the Reds' last three-day games against NL Central opponents that held a winning record.", "Jonathan India has recorded a Double in three of his last four road appearances against the Cubs.", "TJ Friedl has recorded at least one Single in each of the Reds' last six road games."], "ranking": [1, 2, 3, 35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4]}
{"candidates": ["Jameson Taillon reflected on his performance, stating, 'I had a little bit of a rough patch there in like early, mid-August. To be able to bounce back from that and finish strong is a good feeling.'", "Cincinnati interim manager Freddie Benavides commented on the challenging wind conditions, 'With the wind blowing in as hard as it was, it was a challenge.'", "Craig Counsell applauded third base coach Willie Harris' decision to send Nico Hoerner on the tricky flyball.", "Nick Martinez expressed that winning is most important to him and he is open to any capacity that helps the team.", "Interim manager Freddie Benavides praised Martinez's performance and expressed hope that Martinez would not opt out of his contract.", "Nick Martinez is likely to decline his player option for the 2025 season and enter free agency, where he is expected to earn more than the $12,000,000 the Reds would pay him.", "There is speculation about whether the Reds will make Martinez a qualifying offer, which has been in the $18-21,000,000 range in recent years.", "Jameson Taillon reflected on his performance, stating, 'I had a little bit of a rough patch there in like early, mid-August. To be able to bounce back from that and finish strong is a good feeling.'", "Reds interim manager Freddie Benavides commented on the challenging wind conditions, saying, 'With the wind blowing in as hard as it was, it was a challenge.'", "Cubs manager Craig Counsell praised third-base coach Willie Harris' decision to send Nico Hoerner on the tricky flyball."], "ranking": [5, 4, 8, 6, 3, 2, 1, 5, 4, 8]}
{"candidates": ["The game was played on a blustery, overcast afternoon at Wrigley Field.", "The Cubs clinched a winning season and improved to 4-7 against Cincinnati this year.", "Cincinnati failed to advance a runner to third base during the game.", "With a stiff wind blowing in at Wrigley Field, offense was hard to come by for both clubs.", "Elly De La Cruz was thrown out at third base after attempting to stretch a double into a triple, highlighting the need for smarter baserunning by the Reds.", "The game was held at Wrigley Field with an attendance of 32,083.", "The game lasted 1 hour and 48 minutes.", "The game lasted 1 hour and 48 minutes, reminiscent of Tom Browning's fast games.", "Cubs right fielder Seiya Suzuki missed his second straight game due to an ankle injury, but manager Craig Counsell was optimistic he could play the next day."], "ranking": [8, 2, 6, 5, 1, 7, 9, 3, 4]}
{"candidates": ["Reds catcher Tyler Stephenson was checked on by a trainer after being clipped by a foul ball but stayed in the game.", "Cubs outfielder Seiya Suzuki missed his second straight game due to an ankle injury but is optimistic about playing the next day.", "Right-handers Rhett Lowder and Kyle Hendricks are set to pitch in the next game."], "ranking": [2, 1, 3]}
{"candidates": ["Kyle Hendricks became the first Cubs pitcher in history to toss at least six innings while allowing two or fewer hits and one or fewer runs in a start at Coors Field, which opened in 1995.", "Kyle Hendricks became the first Cubs pitcher to go that deep into a game at Coors Field without allowing more than two hits and one run.", "Hendricks became the first Cubs pitcher in Coors Field history to allow no more than one run and two hits in a start of at least six innings.", "Kyle Hendricks became the first pitcher in Cubs history to throw at least six innings while allowing two or fewer hits and one or fewer runs in a start at Coors Field, which opened in 1995."], "ranking": [1, 4, 3, 2]}
{"candidates": ["The Cubs lost to the Rockies 6-5 in 10 innings.", "Cody Bellinger hit a solo home run in the fourth inning."], "ranking": [1, 2]}
{"candidates": ["Cody Bellinger and Brenton Doyle are expected to deliver at the plate.", "The Cubs have the ninth-ranked team ERA across all MLB pitching staffs (3.83).", "Rockies pitchers have a combined ERA of 5.43 this year, which ranks 30th in MLB.", "Mike Toglia and the Colorado Rockies take the field on Sunday at Coors Field against Kyle Hendricks, who is projected to start for the Chicago Cubs.", "The Cubs are the favorite in this one, at -146, while the underdog Rockies have +123 odds to upset.", "Chicago is a 1.5-run favorite (at +102 odds). The total is 10.5 runs for the contest.", "Score Prediction: Cubs 6, Rockies 5", "Total Prediction: Under 10.5 runs", "Win Probabilities: Cubs 53%, Rockies 47%"], "ranking": [5, 3, 2, 8, 6, 7, 4, 9, 1]}
{"candidates": ["Kyle Hendricks reflected on his performance, stating it was one of the best he had all year despite not having great stuff.", "Craig Counsell commented on Isaac Paredes' improved plate discipline and ability to extend at-bats.", "Jameson Taillon discussed his approach to pitching at Coors Field, emphasizing the importance of throwing strikes and not being intimidated by the ballpark.", "Kyle Hendricks expressed gratitude for the Cubs' continued belief in him despite his struggles earlier in the season.", "Hendricks acknowledged the importance of savoring his remaining innings this season while focusing on the team's playoff push.", "Manager Craig Counsell commended Hendricks for his willingness to move to the bullpen and adjust his routine, which helped him improve.", "Rookie Pete Crow-Armstrong reflected on a conversation with manager Craig Counsell in spring training about trust and making the next play.", "Crow-Armstrong noted the big-picture relevance of the series loss to the Rockies.", "Cubs manager Craig Counsell commented on the team's offense, saying, 'We left a small farming village in central Illinois of runners on base, but we played good offense.'", "Kyle Hendricks reflected on his performance, stating, 'Stuff moves differently (in Colorado), so you just really focus on execution and stay with it one pitch at a time, and with our lineup and defense, man, you just rely on all the guys around you.'", "Rockies manager Bud Black commented on Cal Quantrill's performance, saying, 'He told me during the game and after the game that his arm felt great. It's one of those games over a long season, six months, where he didn't throw strikes.'"], "ranking": [8, 5, 6, 4, 3, 2, 10, 9, 1, 7, 11]}
{"candidates": ["Hendricks' performance helped the Cubs snap a three-game losing streak.", "The Cubs are five games behind the Mets and Braves for the National League’s third Wild Card slot with 13 games left in the regular season.", "Chicago went 3 for 14 with runners in scoring position and stranded 16 runners, tying the major league high for a nine-inning game this season.", "Colorado pitchers walked 12 for the first time since a 12-11 win over Milwaukee on June 5, 1999."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Drew Romo achieved a career-high of 3 RBIs in the game."], "ranking": [1]}
{"candidates": ["Zach Eflin struck out nine in seven innings.", "James McCann homered to left center (429 feet), scoring two runs.", "Gunnar Henderson singled to center, scoring a run.", "Coby Mayo singled to right, scoring a run on a fielding error.", "Cedric Mullins singled to right, scoring a run.", "Gunnar Henderson singled to right, scoring a run."], "ranking": [3, 1, 5, 4, 6, 2]}
{"candidates": ["Drew Romo drove in a career-high three runs.", "Jordan Beck had a go-ahead RBI single in the bottom of the eighth inning.", "Charlie Blackmon added two RBIs with his fourth triple of the season.", "Jeff Criswell earned his first career win after pitching a scoreless eighth inning.", "Tyler Kinley picked up his eighth save of the season after striking out Adley Rutschman with runners on first and third.", "Anthony Santander hit his 39th home run of the season for the Orioles.", "Eloy Jiménez homered for Baltimore.", "Ryan O’Hearn drove in two runs with an RBI single in the fifth inning.", "Dean Kremer left the game in the fourth inning after being struck on his right forearm by a line drive.", "Ramón Urías left the game early due to a sprained ankle."], "ranking": [5, 2, 6, 8, 1, 3, 9, 7, 4, 10]}
{"candidates": ["Zach Eflin gets the nod for the Baltimore Orioles on Sunday at Coors Field against Brenton Doyle and the Colorado Rockies.", "Bookmakers list the Orioles as -161 moneyline favorites, while giving the underdog Rockies +137 moneyline odds to win.", "Baltimore (-1.5) is favored on the run line.", "The total is 11 runs for this contest.", "Score Prediction: Orioles 6, Rockies 5", "Total Prediction: Under 11 runs", "Win Probabilities: Orioles 53%, Rockies 47%"], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Rockies manager Bud Black emphasized the importance of the game for the integrity of the season.", "Drew Romo expressed feeling more comfortable and having better at-bats."], "ranking": [2, 1]}
{"candidates": ["The game was held at Coors Field, Denver, Colorado with an attendance of 32,961.", "The game lasted 2 hours and 22 minutes."], "ranking": [2, 1]}
{"candidates": ["Rockies starter Ryan Feltner had a no decision, marking his 22nd consecutive start without a win.", "Orioles are 1 1/2 games behind the Yankees in the AL East standings and four games up for the top spot in the AL wild-card race."], "ranking": [1, 2]}
{"candidates": ["The New York Yankees are AL champions for the 41st time in franchise history.", "Steven Kwan extended his Cleveland franchise record by reaching base in a 16th straight postseason game.", "The New York Yankees advanced to their 41st World Series, their first in 15 years.", "The Yankees are American League champions for the first time since 2009.", "Giancarlo Stanton moved ahead of Judge and Babe Ruth on the Yankees’ career postseason home run list with his 16th playoff homer in pinstripes."], "ranking": [3, 5, 2, 1, 4]}
{"candidates": ["Juan Soto hit a three-run homer with two outs in the 10th inning to secure the Yankees' victory.", "Giancarlo Stanton hit a two-run homer and was named ALCS MVP.", "Luke Weaver got the final three outs with Lane Thomas flying out for the last one, which was caught by Soto.", "Emmanuel Clase rebounded by retiring Aaron Judge on a flyout, striking out Giancarlo Stanton with a 100.6 mph fastball, and retiring Oswaldo Cabrera on a groundout after Jazz Chisholm Jr.'s two-out single.", "Hunter Gaddis served up a go-ahead three-run homer to Juan Soto in the 10th inning.", "Brayan Rocchio's error on a potential inning-ending double-play ball allowed everyone to be safe, leading to Juan Soto's decisive home run."], "ranking": [1, 3, 5, 4, 2, 6]}
{"candidates": ["Arden Zwelling and Ben Nicholson-Smith discuss how the Yankees can close out the series in Game 5 after taking a commanding 3-1 lead.", "Big questions surround Cleveland closer Emmanuel Clase while the Yankees may be without three of their top relief arms as they attempt to win the pennant.", "Guardians manager Stephen Vogt mentioned that the team has used their relievers a lot and everyone is tired.", "Tanner Bibee will be pitching on short rest for the Guardians in Game 5.", "The Yankees hit Bibee hard in Game 2 of the series, scoring three runs against him on the way to an eventual 6-3 win.", "Carlos Rodón has the chance to make a significant impact on the ALCS for the second time, having given the Yankees six innings of one-run baseball while striking out nine in Game 1.", "Guardians manager Stephen Vogt expressed his unwavering support for Emmanuel Clase before the game, stating, 'Emmanuel will be right back out there in the ninth tonight, because he's our guy.'"], "ranking": [5, 2, 6, 7, 3, 1, 4]}
{"candidates": ["Guardians All-Star left fielder Steven Kwan expressed that the loss stings more because the games were so close.", "Manager Stephen Vogt told his players to remember the feeling of the loss and use it to fuel their offseason.", "Vogt highlighted the pride in the team's overall accomplishments despite the loss.", "The Yankees' journey to the World Series started with a high-risk trade for Juan Soto.", "The Yankees will face either the Dodgers or the Mets in the World Series.", "The Yankees' bullpen performance was crucial in their victory.", "Tim Hill expressed pride in getting the job done and showing his value to the team.", "Luke Weaver reflected on the significance of his role and the moment.", "Aaron Judge expressed that the victory was special and reflected on the hard work and disappointment from the previous season.", "Judge mentioned the importance of overcoming tough times and building trust within the team.", "Yankees manager Aaron Boone praised Soto's performance and his impact on the team.", "Soto expressed confidence during his at-bat, believing he had the advantage over the pitcher.", "Yankees fans chanted 'Re-sign Soto!' during the postgame festivities.", "Third baseman Jazz Chisolm Jr. humorously suggested a $700 million contract for Soto.", "Giancarlo Stanton reflected on the team's resilience and the challenges they faced in the series.", "Cleveland Guardians' manager Stephen Vogt expressed pride in his team's efforts despite the loss.", "Juan Soto expressed confidence and determination, stating 'We’re going to win; we’re going to the World Series.'", "Aaron Judge praised the acquisition of Juan Soto, highlighting his impact on the team's success.", "Manager Aaron Boone expressed pride in the team's journey and special camaraderie.", "Jazz Chisholm Jr. and Gerrit Cole commented on Soto's impressive at-bat and bat control.", "Luke Weaver described his anticipation and relief as Soto's homer secured the win.", "Giancarlo Stanton emphasized the importance of re-signing Soto for the future.", "Juan Soto celebrated his home run by dancing down the first-base line and pausing to celebrate with his teammates.", "Cleveland's surprising season under first-year manager Stephen Vogt ended just short of a World Series.", "The Cleveland Guardians remain without a title since 1948, baseball's current longest drought.", "General partner Hal Steinbrenner expressed pride in the team's resilience, stating, 'We had our ups, we had our downs, but we never had our doubts.'", "The Yankees took advantage as Cleveland wore down, with the Guardians trying to ride their bullpen to the World Series but breaking at the end."], "ranking": [14, 18, 20, 1, 5, 7, 9, 11, 13, 15, 16, 2, 3, 4, 6, 8, 10, 12, 17, 19, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Yankees general manager Brian Cashman expressed satisfaction with the team's position.", "Yankees manager Aaron Boone commented on the team's journey and the significance of the win.", "Giancarlo Stanton reflected on the team's resilience and the challenges ahead.", "Guardians manager Stephen Vogt expressed pride in his team's accomplishments despite the loss.", "Stephen Vogt reflected on Clase's performance, stating, 'He responded the way I thought he would. This is the best closer on the planet. I’ll stand by that.'", "Vogt commented on the decision not to let Clase pitch the 10th inning due to his high pitch count over the last three days.", "Brayan Rocchio reflected on his error, stating, 'In that moment, it’s more important to get two outs rather than one. … Unfortunately, I was not able to catch the ball.'", "Vogt praised the bullpen's overall performance, stating, 'If it wasn’t for that group of guys in the bullpen, we wouldn’t have gotten this far into this season. They deserve a ton of credit.'"], "ranking": [5, 4, 3, 2, 1, 6, 7, 8]}
{"candidates": ["The Yankees advanced to their 41st World Series and first in 15 years.", "The Guardians' season ended under first-year manager Stephen Vogt, extending their title drought since 1948.", "Yankees fans chanted 'Re-sign Soto!' during the postgame festivities, indicating his potential high-value contract.", "Cleveland's bullpen ended the regular season with the fourth-best bullpen ERA (2.57) of any team since 1995.", "Cleveland's bullpen combined for 53 2/3 innings with a 3.52 ERA in the postseason, while starting pitchers combined for 33 2/3 innings and a 3.82 ERA."], "ranking": [1, 3, 2, 5, 4]}
{"candidates": ["Yankees' LHP Nestor Cortes had another successful live batting practice session and is on track to join the World Series roster."], "ranking": [1]}
{"candidates": ["Yankees' LHP Nestor Cortes had another successful live batting practice session and is on track to join the World Series roster."], "ranking": [1]}
{"candidates": ["The Cubs have now scored 5+ runs in 12 straight road games - a new franchise record."], "ranking": [1]}
{"candidates": ["The Chicago Cubs beat the Colorado Rockies 6-2 on Sunday afternoon at Coors Field.", "Michael Busch hit two home runs.", "Rookie Pete Crow-Armstrong hit his 10th home run.", "The Cubs had stolen bases from Nick Hoerner, Seiya Suzuki, and Dansby Swanson.", "The Cubs avoided the sweep with a 6-2 victory.", "Veteran pitcher Kyle Hendricks showed he still has something left with a vintage quality start.", "Rookie first baseman Michael Busch blasted two home runs."], "ranking": [5, 2, 4, 6, 3, 1, 7]}
{"candidates": ["Cubs manager Craig Counsell acknowledged the team's overall performance hasn't been good enough.", "The Cubs' playoff odds had dropped to 0 percent by Sunday morning according to FanGraphs.", "Baseball Reference model said there was a 0.4 percent chance for the Cubs to make the playoffs."], "ranking": [2, 1, 3]}
{"candidates": ["Cubs second baseman Nico Hoerner appreciated the group's ability to continue to make the most of the next day.", "Cubs pitcher Jameson Taillon mentioned the team will keep their heads down and go to work despite the tough situation.", "Rookie center fielder Pete Crow-Armstrong reflected on maintaining trust and making the next play."], "ranking": [2, 3, 1]}
{"candidates": ["The win moved the Cubs to 76-73 on the season while the loss dropped the Rockies to 57-93.", "The Cubs pounded out 11 hits and hit three home runs in the game.", "The Cubs' playoff probability increased to 0.1 percent after the win.", "The Cubs have not delivered a postseason win since 2017."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Detroit Tigers handed their worst shutout loss since Game 1 of the 1945 World Series.", "The Guardians became the first AL team to score five runs before recording an out in a playoff game.", "Cleveland's bullpen matched the largest shutout victory margin in club postseason history.", "Detroit's shutout was the worst in their playoff history since Game 1 of the 1945 World Series.", "Cleveland became the first team in AL postseason history to score five runs before recording an out.", "Cleveland's five-run blitz in the first inning tied the MLB record for runs scored to start a postseason game before recording an out.", "The Guardians are the first in AL postseason history to score five runs without an out being recorded, according to Elias Sports Bureau and Stats Perform."], "ranking": [4, 2, 5, 3, 1, 6, 7]}
{"candidates": ["Tyler Holton failed to record an out and reliever Reese Olson gave up a three-run homer to Lane Thomas in the first inning.", "Josh Naylor hit an RBI single to chase Tyler Holton.", "Reese Olson made a mistake with a pitch right down the middle to Lane Thomas, who belted it into the left-field bleachers.", "Detroit hitters struck out 13 times, and the Tigers didn’t get a runner past first over the final five innings.", "The Guardians scored five runs in the first inning before recording an out.", "Lane Thomas hit a three-run home run in the first inning.", "Tyler Holton, the Tigers' opener, faced just four hitters without recording an out before being pulled from the game.", "David Fry hit a two-run double in the sixth inning.", "Lane Thomas hit a three-run homer in his first career postseason swing.", "Cleveland's bullpen combined for 4 1/3 hitless innings.", "Detroit struck out 13 times and didn't get a runner past first in the final four innings.", "David Fry added a two-run double.", "Josh Naylor's RBI single contributed to the score.", "The Guardians delivered a punch to the Tigers during a 7-0 loss.", "Holton’s second pitch of the day hit the right-field fence for a Steven Kwan double.", "Olson’s first competitive pitch since Sept. 26 landed in the left-field bleachers for a 5-0 lead.", "Josh Naylor’s ensuing RBI single.", "Fry’s two-out, two-run double to essentially put the game out of reach.", "Steven Kwan drilled opener Tyler Holton’s second pitch off the right-field wall for a leadoff double.", "David Fry drew a walk.", "José Ramírez chopped a hard ground ball that third baseman Zack McKinstry couldn’t handle, allowing Kwan to score the game’s first run.", "Josh Naylor followed with a single through the right side to score Fry.", "Lane Thomas hit a three-run homer off Reese Olson.", "Tanner Bibee used his recently reintroduced sinker to induce weak contact and prevent Detroit from building any semblance of a rally.", "Cade Smith struck out Kerry Carpenter on three pitches and added three more punchouts in his postseason debut.", "David Fry added two more runs with a double in the bottom of the sixth.", "The Cleveland Guardians defeated the Detroit Tigers 7-0 in Game 1 of the 2024 American League Division Series.", "Lane Thomas hit a three-run home run in the first inning.", "Tanner Bibee pitched 4.2 innings before being pulled.", "The Guardians' bullpen, including Cade Smith, Tim Herrin, Hunter Gaddis, and Emmanuel Clase, combined to allow no hits and no runs with seven strikeouts in 4.1 innings.", "Steven Kwan opened the game with a double off the right field wall.", "Lane Thomas hit a three-run homer on the first pitch of his postseason career.", "Cade Smith struck out four straight batters.", "Emmanuel Clase retired the Tigers in order to complete the four-hit shutout.", "Jose Ramirez's bad-hop bouncer to third baseman Zach McKinstry was changed to an RBI double.", "The Cleveland Guardians capitalized on the play to score five runs in the first inning and beat the Tigers 7-0.", "Josh Naylor’s RBI single and Lane Thomas’s home run contributed to the Guardians' 5-0 lead."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37]}
{"candidates": ["Manager A.J. Hinch’s decision to not use a traditional starter in Game 1 of the AL Division Series backfired.", "The Tigers came in feeling confident after going 31-13 since Aug. 11 to earn a postseason berth before sweeping AL West champion Houston in the wild-card round.", "The Guardians created a realistic environment in their simulated games during the bye week to prepare for the ALDS.", "The Guardians emphasized the importance of having their leadoff hitter, Steven Kwan, healthy and mentally prepared for the playoffs.", "The 2,327th meeting between Detroit and Cleveland was the first between the franchises in the postseason.", "Tigers manager A.J. Hinch used his bullpen from the start, which backfired.", "Tigers manager A.J. Hinch discussed the prep work that goes into pitching chaos before Game 1.", "Hinch mentioned that not everything goes as planned and teams need to react to unexpected challenges.", "Lane Thomas expressed excitement to play in front of the Cleveland fans, saying 'I've heard this is a great place to play in the postseason.'", "The Guardians earned a bye to reach the ALDS by finishing with the second best record in the league on the way to winning the AL Central."], "ranking": [6, 8, 4, 5, 10, 3, 9, 7, 2, 1]}
{"candidates": ["Manager A.J. Hinch commented on the difficulty of overcoming a five-run deficit in the first inning.", "Zach McKinstry blamed himself and the grounds crew for the fielding error that led to the first run.", "Parker Meadows emphasized the need to keep playing their game and expressed confidence in Tarik Skubal for Game 2.", "Tigers manager A.J. Hinch commented on the difficulty of overcoming the Guardians' five-run first inning.", "Guardians manager Stephen Vogt highlighted the team's use of judgment in-game rather than blindly following numbers.", "Lane Thomas described his home run as 'electric'.", "Tigers manager A.J. Hinch commented on the strength of Cleveland's bullpen.", "Guardians manager Stephen Vogt praised his team's readiness despite a five-day break.", "Tanner Bibee expressed understanding of being pulled early due to the bullpen's strength.", "Tyler Holton said, 'They landed a good first punch, but we're still standing, so we're going to fight back.'", "Jake Rogers reflected, 'Hopefully keep them from scoring, and we need to score more than zero to win.'", "Lane Thomas described the Cleveland crowd as 'electric' and said it was everything he had thought and more.", "AJ Hinch explained his decision to go to Reese Olson, stating 'We told him early in the day that the Lane Thomas at-bat was going to be it.'", "Stephen Vogt praised his team's preparation during the five-day layoff, saying 'We worked them hard. To the players' credit, they put a ton of effort into our workouts.'", "Stephen Vogt received praise for his managerial decisions in his postseason debut.", "Fans highlighted Vogt's strategic use of the bullpen and lineup.", "The Guardians are now considered favorites to advance to the ALCS.", "Manager Stephen Vogt praised the team's readiness and early performance.", "Tiger manager A.J. Hinch acknowledged the difficulty of overcoming Cleveland's early lead.", "Bibee expressed relief and satisfaction after his first postseason game.", "Zach McKinstry took responsibility for the error and mentioned the irregular infield watering as a factor.", "Tigers manager A.J. Hinch and players reflected on the remarkable finish to the 2024 season despite the loss."], "ranking": [14, 18, 10, 13, 16, 5, 12, 15, 11, 7, 9, 6, 8, 4, 3, 2, 1, 20, 19, 17, 21, 22]}
{"candidates": ["Guardians' RHP Alex Cobb was added to the ALDS roster after recovering from an injury.", "Tarik Skubal, the favorite to win the AL Cy Young Award, is expected to start Game 2 for the Tigers.", "The Guardians will face Tigers ace Tarik Skubal in Game 2, who is the likely AL Cy Young Award winner."], "ranking": [2, 3, 1]}
{"candidates": ["Nick Martinez set a Cincinnati Reds franchise record with a strikeout-to-walk ratio of 6.44 for pitchers with at least 140 innings pitched in a season."], "ranking": [1]}
{"candidates": ["Nick Martinez pitched eight innings in a complete game, 1-0 loss against the Chicago Cubs, without walking any batters and striking out three."], "ranking": [1]}
{"candidates": ["Manager Craig Counsell told younger players before the game that Saturday would be a memorable day they would never forget."], "ranking": [1]}
{"candidates": ["Nick Martinez is likely to decline his player option for the 2025 season, potentially entering free agency for a more lucrative contract."], "ranking": [1]}
{"candidates": ["The game between the Cincinnati Reds and Chicago Cubs on September 28, 2024, lasted 1 hour and 48 minutes, reminiscent of Tom Browning's fast games."], "ranking": [1]}
{"candidates": ["Zach Neto is the first Angels infielder with a 20-homer, 20-steal season.", "Beau Brieske threw his fastest pitch of the year at 98.6 mph.", "Zach Neto joined the 20-20 club with his 20th home run and 23 stolen bases, becoming the first Angels infielder in franchise history to produce a 20-20 season."], "ranking": [1, 3, 2]}
{"candidates": ["Zach Neto homered during the fifth inning.", "Rookie Jack Kochanowicz pitched six scoreless innings.", "Ben Joyce got the final four outs for his third save.", "Mickey Moniak’s double in the fourth inning.", "Detroit had runners on the corners with one out in the sixth, but Kochanowicz got Jace Jung to hit into a 4-6-3 double play.", "Joey Wentz was hit by two hard comebackers in the seventh inning.", "Roansy Contreras got Dillon Dingler to ground into a force at second in the seventh inning.", "José Quijada loaded the bases in the eighth, but Ben Joyce struck out Spencer Torkelson.", "The Tigers' win streak ended with a 3-0 loss to the Angels.", "Rookie right-hander Jack Kochanowicz pitched six shutout innings for the Angels.", "Zach Neto hit his 20th homer of the season, a 400-footer to left-center.", "Ben Joyce struck out Spencer Torkelson with a 95-mph sinker to end a bases-loaded threat in the eighth inning.", "Spencer Torkelson faced a tough matchup against Angels flamethrower Ben Joyce with the Tigers' six-game winning streak on the line.", "Torkelson struck out against Joyce's mid-90s sinker, which acts like a changeup.", "Spencer Torkelson hit a home run after a 10-pitch walk by Jace Jung.", "Kenta Maeda settled in and dispatched three Angels hitters after a visit from catcher Jake Rogers.", "Jake Rogers threw out Jo Adell attempting to steal second base in the seventh inning.", "Beau Brieske struck out Logan O'Hoppe with a 98.6 mph fastball to end the eighth inning.", "Jason Foley secured his 19th save of the season.", "Spencer Torkelson obliterated a 408-foot homer.", "Four pitchers combined to allow just two unearned runs as the Tigers took a second-straight game from the Los Angeles Angels.", "Spencer Torkelson struck out swinging with the bases loaded in the eighth inning.", "Zach Neto hit a milestone two-run home run in the fifth inning.", "Mickey Moniak's RBI double in the fourth inning gave the Angels a 1-0 lead.", "Jack Kochanowicz tossed six scoreless innings, lowering his ERA to 4.96."], "ranking": [14, 20, 18, 12, 16, 10, 11, 15, 5, 19, 22, 21, 7, 9, 13, 8, 6, 4, 3, 2, 1, 24, 23, 17, 25]}
{"candidates": ["Jack Kochanowicz is set to pitch for the Los Angeles Angels against Spencer Torkelson and the Detroit Tigers.", "The game is the final match of a three-game series at Comerica Park.", "The Tigers are favored with -179 moneyline odds, while the Angels are listed at +150.", "The over/under for the game is set at 9 runs.", "The Tigers were on a six-game win streak and were 4½ games back of the final wild card spot before the game."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["The Los Angeles Angels are 54-79 this season and they have lost seven games in a row.", "Los Angeles has lost the first two games in this series and they have only scored two runs in each game.", "Prior to this series, the Angels lost all four against the Blue Jays, lost two out of three against the Royals, and lost two out of three against the Braves.", "Los Angeles is just 2-13 in their last 15 games and they are last in the AL West.", "The Los Angeles pitching staff has a 4.58 ERA, a 1.32 WHIP, and a.242 opponent batting average.", "The Angels offense has scored 519 runs with a.231 batting average and a.303 on base percentage.", "Zach Neto is batting.254 with 19 home runs and 64 RBI’s for the Angels this season.", "The Detroit Tigers are 68-66 this year and they have won six games in a row.", "Detroit has won the first two games in this series by scores of 6-2 and 3-2.", "Prior to this series, the Tigers swept the White Sox, lost two out of three against the Cubs, and won two out of three against the Yankees.", "Detroit is 9-2 in their last 11 games and they are third in the AL Central.", "The Detroit pitching staff has a 3.79 ERA, a 1.19 WHIP, and a.237 opponent batting average.", "The Tigers offense has scored 571 runs with a.234 batting average and a.297 on base percentage.", "Riley Greene is batting.262 with 19 home runs and 56 RBI’s for the Tigers this season.", "The projected starting pitcher for Los Angeles is Jack Kochanowicz, who is 1-3 with a 6.08 ERA and a 1.54 WHIP over 26.2 innings pitched this year.", "Kochanowicz has allowed two earned runs in two of his last three starts.", "The projected starting pitcher for Detroit is Keider Montero, who is 4-5 with a 5.15 ERA and a 1.33 WHIP over 64.2 innings pitched this season.", "Montero has allowed two earned runs or fewer in three of his last four starts."], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17, 18]}
{"candidates": ["The Angels snapped a seven-game losing streak with the win.", "Tigers rookie right-hander Keider Montero struggled with command, walking three and throwing 89 pitches in five innings.", "Joey Wentz was hit by two comebackers, one on his left hand and another on his right knee, and had to leave the game.", "The Detroit Tigers have won six in a row and 13 of their past 16 games.", "The Tigers are now only 4 1/2 games back from a wild-card spot with 28 games to play."], "ranking": [3, 5, 4, 1, 2]}
{"candidates": ["The White Sox became the worst team in modern baseball history with their loss to the Tigers, surpassing the 1962 Mets' record.", "Chicago White Sox set a modern major league record with their 121st loss.", "Jackson Jobe recorded his first Major League strikeout.", "The Chicago White Sox set a modern-day Major League Baseball record for most losses in a season with their 121st defeat.", "Andrew Benintendi tied his career high with his 20th homer.", "Chicago White Sox set the post-1900 record for losses with 121."], "ranking": [1, 2, 6, 3, 5, 4]}
{"candidates": ["The White Sox set a modern-day major-league record for losses in a season with their 121st defeat."], "ranking": [1]}
{"candidates": ["The Tigers clinched a playoff berth with their 4-1 victory over the White Sox.", "Andrew Vaughn made the last out as the Tigers celebrated their playoff spot."], "ranking": [1, 2]}
{"candidates": ["Detroit went into the season expecting to contend for a spot in the playoffs in a second full season under president of basketball operations Scott Harris and A.J. Hinch's fourth year as manager.", "Manager A.J. Hinch emphasized the importance of getting Jackson Jobe some work before the playoffs.", "The Tigers were preparing for their AL Wild Card Series by testing their roster."], "ranking": [2, 1, 3]}
{"candidates": ["The Chicago White Sox and the Detroit Tigers meet Saturday in MLB action from Comerica Park.", "This will be the second installment in a three-game series.", "Sean Burke will start for the White Sox on Saturday. So far Burke is 1-0 with a 1.93 ERA in three games (two starts) during his rookie campaign.", "Beau Brieske will start for Detroit on Saturday. Brieske is 4-4 with a 3.56 ERA and 68 Ks this year.", "Eight of the White Sox's last nine games have gone UNDER the total runs line.", "Six of the last seven games between the White Sox and Tigers at Comerica Park have gone UNDER the total runs line.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Tigers' last nine day games against American League opponents.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the White Sox's last six road games.", "Matt Vierling has recorded a Double in each of his last three appearances against the White Sox after playing the previous day.", "Kerry Carpenter has recorded at least one Single in each of his last six appearances against AL Central opponents that held a losing record.", "Matt Vierling has scored at least one run in five of his last six appearances against AL Central opponents that held a losing record.", "Javier Baez has hit a home run in two of his last three home appearances with the Tigers against AL opponents.", "Riley Greene has recorded two or more total bases in each of his last seven home appearances against the White Sox after playing the previous day.", "Colt Keith has recorded at least one RBI in five of the Tigers' last six games against AL Central opponents that held a losing record.", "Riley Greene has recorded at least one hit in each of his last eight appearances against AL Central opponents that held a losing record.", "Andrew Benintendi has recorded an RBI in three of his last four appearances against AL opponents.", "Andrew Vaughn has recorded at least one hit in each of his 10 previous Saturday appearances against AL Central teams that held a winning record.", "Yoan Moncada has recorded a Double in six of his last eight appearances in day games against AL Central teams that held a winning record.", "Yoan Moncada has recorded a Single in each of his last five appearances against opponents that held a winning record.", "Luis Robert has scored a run in four of his last five appearances in day games.", "Andrew Vaughn has hit a home run in four of the White Sox's last eight road games against AL opponents.", "Yoan Moncada has recorded two or more total bases in seven of his last eight appearances in day games against AL Central teams that held a winning record."], "ranking": [14, 20, 10, 12, 18, 16, 8, 7, 5, 11, 9, 15, 13, 6, 4, 3, 2, 1, 19, 17, 21, 22]}
{"candidates": ["White Sox GM Chris Getz expressed surprise at the team's record-breaking losses, comparing the situation to the 2003 Detroit Tigers who later made it to the World Series.", "White Sox owner Jerry Reinsdorf released a statement expressing the organization's unhappiness with the season's results and acknowledging the pain felt by fans.", "The Motor City's baseball team salvaged the season and revived interest, drawing big crowds after closing recent seasons in a mostly empty ballpark.", "Manager A.J. Hinch praised Jackson Jobe's performance and efficiency.", "Jackson Jobe expressed that getting his first Major League strikeout was super special.", "Interim manager Grady Sizemore praised the team's effort and resilience despite the tough season.", "Nicky Lopez reflected on the challenging season but emphasized the dream of playing for his hometown team.", "Gavin Sheets highlighted the team's unity and professionalism through the difficult season.", "Detroit manager A.J. Hinch commented on missed opportunities early in the game.", "Sean Burke reflected on his performance and the playing conditions.", "A.J. Hinch mentioned the energy from the previous night's celebration and the impact of the weather delay."], "ranking": [1, 2, 3, 6, 5, 8, 9, 10, 7, 4, 11]}
{"candidates": ["Mason Miller recorded his 23rd save in 25 chances, matching Huston Street’s mark in 2005 for second-most saves by a rookie Oakland reliever."], "ranking": [1]}
{"candidates": ["Oakland hit three home runs and scored five runs during the 7th and 8th innings to secure a 5-4 win over the Reds.", "Fernando Cruz started for the Reds due to a shortage of starting pitchers.", "Osvaldo Bido dominated against left-handed hitters, allowing only a.154 batting average and.205 slugging percentage.", "The Reds called up left-handed reliever Evan Kravetz from Triple-A.", "Rhett Lowder is set to start in Friday's doubleheader against Milwaukee.", "The Reds made a comeback in the 7th inning, scoring six runs to take a 6-5 lead.", "Wil Benson hit a three-run homer in the 7th inning.", "Emilio Pagan gave up four runs in the 8th inning, leading to an 8-6 loss for the Reds.", "Seth Brown hit a pair of home runs, including a go-ahead three-run shot in the eighth inning.", "The Oakland Athletics hit four home runs in the game.", "Seth Brown hit two home runs, including a three-run homer in the eighth inning to lead the A's to a 9-6 win.", "Will Benson hit a go-ahead three-run homer for the Reds in the seventh inning.", "Lawrence Butler homered on the game’s third pitch for a 1-0 Oakland lead.", "Brent Rooker added his team-leading 31st homer in the sixth inning.", "Will Benson hit a three-run home run in the bottom of the seventh inning.", "Emilio Pagán gave up Seth Brown's three-run home run in the top of the eighth inning.", "Lawrence Butler hit a home run and pitched three innings with six strikeouts, both career highs for Fernando Cruz.", "Max Schuemann and Lawrence Butler each hit a two-run homer in the seventh inning to propel the Oakland Athletics past the Cincinnati Reds 5-4.", "Zack Gelof added a solo shot in the eighth inning.", "All-Star closer Mason Miller hung on after giving up two runs and four hits in a shaky ninth inning, securing his 22nd save.", "Jakob Junis made his fourth start of the season for the Reds and retired all 12 batters he faced with three strikeouts."], "ranking": [1, 18, 5, 19, 20, 3, 2, 14, 6, 11, 4, 7, 9, 15, 16, 10, 12, 13, 8, 17, 21]}
{"candidates": ["The Cincinnati Reds used an opener on Tuesday night against the Oakland Athletics, with Jakob Junis pitching four solid innings before turning the game over to reliever Buck Farmer and eventually using a total of six pitchers.", "The Reds plan to use Fernando Cruz as the opener for Wednesday's game against the Athletics.", "There may be transactions before the game, such as activating Brent Suter to replace Casey Legumina or recalling Yosver Zulueta or Connor Phillips to log some innings in relief.", "The Reds are running out of starting pitchers, leading to the use of relievers as starters.", "Fernando Cruz has struggled against left-handed hitters this season.", "Osvaldo Bido has been effective against left-handed hitters since being called up by Oakland.", "Evan Kravetz was called up from Triple-A due to the Reds' pitching shortage.", "Rhett Lowder, a 2023 1st round pick, will start in Friday's doubleheader against Milwaukee.", "Brent Rooker and the Oakland Athletics take the field on Wednesday at Great American Ball Park against Fernando Cruz, who will start for the Cincinnati Reds.", "First pitch is at 6:40 p.m. ET for the second game of a three-game series.", "The Athletics are listed as +105 moneyline underdogs in this matchup with the favored Reds (-124).", "Cincinnati is a 1.5-run favorite (at +159 odds).", "The matchup's over/under has been listed at 10 runs.", "Score Prediction: Reds 5, Athletics 3", "Total Prediction: Under 10 runs", "Win Probabilities: Reds 61%, Athletics 39%"], "ranking": [12, 8, 10, 9, 6, 7, 11, 5, 4, 3, 2, 1, 15, 14, 13, 16]}
{"candidates": ["The Cincinnati Reds will square off with the Oakland Athletics in MLB action at Great American Ball Park on Wednesday, beginning at 8:40am AEST.", "Jakob Junis (4-0, 3.52 ERA) will start for the Reds, while the Athletics are going with Mitch Spence (7-9, 4.67 ERA).", "Stats Insider's predictive analytics model currently gives the Reds a 54% chance of beating the Athletics at Great American Ball Park.", "The Reds are listed as 1.5-run favourites against the Athletics, with odds of $2.35 available at TAB.", "For the underdog Athletics (+1.5) to cover the line, TAB offers odds of $1.60.", "The over/under for total runs scored is set at 9.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's model, the Athletics (+1.5) are predicted to cover the line 63% of the time, while the 9.5-run over/under is considered an equal 50-50 chance of hitting."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The Reds' strategy of using openers on back-to-back games against the Athletics is cited as a reason why MLB is considering rule changes to require starters to pitch deeper into games.", "MLB Commissioner Rob Manfred and baseball fans want to see starters going deeper into games, with a six-inning minimum for starters being suggested.", "The game was played at Great American Ball Park with a forecast of 80° and cloudy with a 50% chance of rain.", "The Reds' playoff odds are very low, at 0.1% according to Fangraphs.", "The attendance at the game was notably low, reflecting the team's struggles.", "The Oakland Athletics have homered 166 times this season, seventh-most in the major leagues.", "Oakland has scored 50.3% of its runs on homers, the highest percentage in the majors.", "The game was a pitchers' duel-turned-slugfest at Great American Ball Park.", "Oakland starter Osvaldo Bido retired the first 13 batters he faced and allowed just one hit through six innings before running out of gas in the seventh.", "Oakland had one hit and trailed 1-0 through six innings but rallied to hand Cincinnati its ninth straight loss against interleague opponents.", "Oakland has 162 home runs this season, tied with the Minnesota Twins for seventh in the majors. More than 50% of the runs for the A's this season have come on homers."], "ranking": [8, 9, 11, 5, 6, 7, 10, 4, 3, 2, 1]}
{"candidates": ["Athletics: C Tyler Soderstrom (left wrist bone bruise) has started hitting and could begin a rehab assignment this week.", "Reds: LHP Nick Lodolo (left middle finger strain) was placed on the 15-day injured list, retroactive to Aug. 24. LHP Brandon Williamson (shoulder strain) was sent to Triple-A Louisville on a rehab assignment. OF Stuart Fairchild (left thumb sprain) was placed on the 10-day IL.", "Osvaldo Bido (5-3, 3.24 ERA) pitches Wednesday for Oakland. The Reds had not announced a scheduled starter. Bido is 3-0 with a 0.53 ERA in his last three starts."], "ranking": [2, 1, 3]}
{"candidates": ["Luis Gil pitched six innings in his return from a back injury, allowing only one hit.", "Aaron Judge hit an RBI double and scored on Austin Wells’ two-run single.", "The Yankees achieved their first shutout since August 23 against the Colorado Rockies.", "Luke Weaver handled the ninth inning for his first career save in 199 major-league appearances.", "The Chicago Cubs lost to the New York Yankees 3-0 on September 6, 2024, at Wrigley Field.", "The Cubs recorded only one hit, a Cody Bellinger double in the fourth inning, in the shutout.", "Yankees starter Luis Gil allowed one hit in six innings in the Yankees' 3-0 win.", "Yankees center fielder Aaron Judge hit an RBI double in the third inning and scored in the same inning.", "Yankees right fielder Juan Soto singled in the third inning.", "Luis Gil pitched six sharp innings in his return from a back injury, allowing only one hit and striking out seven.", "Aaron Judge hit an RBI double and scored on Austin Wells' two-run single.", "Luke Weaver handled the ninth inning for his first career save in 199 major league appearances.", "Aaron Judge hit a double to left field, scoring Gleyber Torres and advancing Juan Soto to third base.", "Austin Wells hit a single to left field, scoring Juan Soto and Aaron Judge.", "Luis Gil pitched 6 innings, allowing only 1 hit and no runs while striking out 7 batters.", "Luke Weaver earned his first save of the season.", "Luis Gil pitched six sparkling innings in his return from a back injury, and the New York Yankees beat the Chicago Cubs 3-0.", "Aaron Judge doubled to left, Torres scored, Soto to third.", "Wells singled to left, Soto scored and Judge scored.", "The Yankees beat the Cubs 3-0 at Wrigley Field.", "Luis Gil pitched one-hit ball for six shutout innings against the Cubs.", "Luis Gil had a no-hitter through 3.1 innings before Cody Bellinger doubled in the fourth.", "Luis Gil allowed only one hit over six scoreless innings, striking out seven and walking two.", "Aaron Judge doubled down the third-base line to score the game’s first run.", "Austin Wells drove in two more runs with a single to give New York a 3-0 lead.", "New York's bullpen, including Jake Cousins, Tommy Kahnle, and Luke Weaver, each pitched a scoreless inning to close out the game.", "Luke Weaver recorded his first save of the season."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["Analysts predict an interesting series between the New York Yankees and Chicago Cubs, with the first game taking place on September 6, 2024, at Wrigley Field.", "The Yankees' recent form includes a series loss to the Texas Rangers, where they gave up 14 hits and surrendered three runs in both the fourth and sixth innings in their last game.", "Luis Gil will start for the Yankees with a season record of 12-6 and a 3.39 ERA in 24 starts.", "The Cubs recently played the Pittsburgh Pirates, losing the first two games but winning the finale with a 12-0 blowout.", "Jordan Wicks will start for the Cubs with a season record of 2-2 and a 3.82 ERA in eight games.", "Luis Gil heads to the mound for the New York Yankees as they visit the Chicago Cubs.", "Luis Gil (12-6) with a 3.39 ERA and a 1.20 WHIP.", "Jordan Wicks (2-2) with a 3.92 ERA and a 1.36 WHIP.", "The Yankees are second in the majors in runs scored this year while sitting ninth in batting average, second in on-base percentage, and second in slugging.", "Aaron Judge has been amazing this year. He is hitting.323 on the year with a.455 on-base percentage. Judge has 51 home runs this year, helping to his 124 RBIs. Further, he has scored 107 times this year.", "Juan Soto is also having a great year. He is hitting.295 on the year with a.423 on-base percentage. He has 38 home runs and 98 RBIs this year, scoring 112 times.", "Anthony Volpe is also having a solid season. Volpe is hitting.254 on the year with a.303 on-base percentage. He has 11 home runs and 54 RBIs. Further, he has stolen 26 bases and scored 84 times this season.", "Anthony Volpe is also hot at the plate. In the last week, he is hitting.286 with a stolen base, six RBIs, and four runs scored.", "Giancarlo Stanton is hitting.250 in the last week with two home runs, five RBIs, and three runs scored.", "Gleyber Torres is hitting.375 in the last week with a.448 on-base percentage. He has four RBIs and five runs scored in the last week.", "The Yankees are hitting.278 in the last week, with six home runs and 36 runs in six games.", "The Cubs are 12th in runs scored this year while sitting 17th in batting average, 12th in on-base percentage, and 19th in slugging.", "Ian Happ led the way this year. He is hitting.247 on the year with a.346 on-base percentage. Happ has 23 home runs and 81 RBIs. Further, he has stolen 11 bases and scored 80 times.", "Seiya Suzuki is also having a solid year. He is hitting.277 on the year with a.353 on-base percentage. Suzuki has 19 home runs and 64 RBIs while scoring 65 times on the year.", "Cody Bellinger is hitting.267 this year with a.325 on-base percentage. He has 15 home runs, 61 RBIs, and has scored 58 times.", "Dansby Swanson has been great in the last week. He is hitting.462 in the last week with a.481 on-base percentage. He has two home runs with seven RBIs and seven runs scored in the last week.", "Ian Happ is hitting.346 in the last week with seven RBIs and four runs scored.", "Pete Crow-Armstrong is hitting.318 in the last week with a home run and six RBIs. He has also scored six times in the last week.", "The Cubs are hitting.290 over the last week, with five home runs and 41 runs scored.", "Only one member of the Cubs has at-bats against Luis Gil. That is Isaac Paredes who is one for five with a single, a walk, and a strikeout."], "ranking": [25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Aaron Boone commented, 'It was a good day.'", "Craig Counsell reflected, 'I thought Gil threw the ball well, but we got to do a better job.'", "Luis Gil expressed through an interpreter, 'The more innings that I pitched, felt better.'", "Anthony Rizzo shared, 'It was just cool to be here. A lot of smiles.'", "Aaron Boone commented, 'It was a good day.'", "Craig Counsell reflected, 'I thought Gil threw the ball well, but we got to do a better job.'", "Anthony Rizzo expressed, 'It was just cool to be here. A lot of smiles.'", "Luis Gil expressed satisfaction with his performance in his first start since returning from the injured list.", "The Yankees highlighted the importance of Gil's performance for their postseason aspirations."], "ranking": [8, 5, 6, 7, 8, 5, 7, 3, 1]}
{"candidates": ["Anthony Rizzo received multiple standing ovations from the crowd at Wrigley Field.", "Yankees first baseman Anthony Rizzo was welcomed back to Wrigley Field before the game and saluted the crowd before batting in the second inning.", "A fair amount of Yankees fans were seen in the stands during the game.", "Sarah Zematis and her daughter Sophia attended the game courtesy of the Anthony Rizzo Family Foundation.", "The game had an attendance of 40,101.", "It was New York's first shutout since Aug. 23 against Colorado and No. 12 on the season overall.", "Anthony Rizzo received multiple standing ovations from the crowd at Wrigley Field.", "The game was attended by 40,101 fans at Wrigley Field.", "The game lasted 2 hours and 42 minutes.", "The weather was 68°F with a wind of 16 mph from left to right and cloudy conditions.", "The game was held at Wrigley Field with an attendance of 40,101.", "The game lasted 2 hours and 42 minutes.", "Anthony Rizzo received a warm welcome from the crowd at Wrigley Field in his first at-bat since joining the Yankees in 2021.", "The Yankees paired timely hitting with superb pitching to secure the win."], "ranking": [1, 2, 10, 12, 8, 3, 1, 8, 11, 13, 8, 9, 4, 5]}
{"candidates": ["The Yankees farmed out reliever Ron Marinaccio to Triple-A Scranton/Wilkes-Barre after the game.", "Scott Effross was optioned to open up a roster spot for Luis Gil, who came off the IL on Friday.", "The Yankees are expected to activate reliever Ian Hamilton from the IL on Saturday, likely optioning Phil Bickford to Triple-A."], "ranking": [3, 2, 1]}
{"candidates": ["Emmanuel Clase finished for his career-high 45th save, taking over the major league lead from St. Louis’ Ryan Helsley and moving within one of Jose Mesa’s franchise record.", "Emmanuel Clase picked up his league-leading 45th save, a career high, moving one save closer to the Guardians’ single-season record of 46 held by Jose Mesa (1995).", "It was Cleveland’s 12th shutout win, and marked the 55th time the Guardians bullpen tossed at least three shutout innings in a game, the most in baseball."], "ranking": [1, 2, 3]}
{"candidates": ["Lane Thomas and José Ramírez hit back-to-back homers in the eighth inning to put the Rays away, 6-1.", "Joey Cantillo tossed five scoreless innings.", "Josh Naylor knocked in two runs with a single in the sixth inning."], "ranking": [1, 3, 2]}
{"candidates": ["Christopher Morel, coming off a one-hit performance in his last game (1-for-2), will take the field for the Tampa Bay Rays versus Ben Lively and the Cleveland Guardians on Sunday.", "Morel has hit a team-best 21 home runs. He has 57 RBI.", "The Guardians will call on Lively (11-9) to make his 27th start of the season. He is 11-9 with a 4.01 ERA and 110 Ks through 137 2/3 innings pitched.", "The right-hander’s last time out came on Tuesday versus the Chicago White Sox, as he tossed two scoreless innings while allowing just one hit.", "Lively is trying to register his 10th quality start in this matchup.", "Ben Lively and the Guardians take on the Rays at Progressive Field.", "The game is scheduled to start at 1:40 p.m. ET and will be broadcast on Bally Sports Great Lakes, WTAM 1100 AM, WMMS 100.7 FM, WARF 1350 AM (Spanish) and the Guardians Radio Network.", "The starting pitchers are RHP Ben Lively (11-9, 4.01) for the Guardians and RHP Taj Bradley (6-10, 4.40) for the Rays.", "Jose Ramirez and Yandy Diaz are the hottest hitters on the Cleveland Guardians and Tampa Bay Rays, respectively.", "The Guardians are -126 moneyline favorites in this matchup with the Rays (+107).", "Cleveland is the run-line favorite (-1.5).", "The total is 8 runs for the game (with -116 odds on the over and -105 odds to go under).", "Score Prediction: Guardians 4, Rays 3.", "Total Prediction: Under 8 runs.", "Win Probabilities: Guardians 56%, Rays 44%.", "The Tampa Bay Rays bring a 2-1 lead into the next game of the series against the Cleveland Guardians.", "Cleveland has gone 44-27 at home and 85-64 overall. The Guardians are 58-19 in games when they record eight or more hits.", "Tampa Bay has a 36-38 record on the road and a 73-76 record overall. The Rays have a 21-8 record in games when they hit two or more home runs.", "Sunday's game is the seventh time these teams match up this season. The Rays are up 4-2 in the season series.", "PITCHING PROBABLES: Rays: Taj Bradley (6-10, 4.40 ERA, 1.22 WHIP, 137 strikeouts); Guardians: Ben Lively (11-9, 4.01 ERA, 1.24 WHIP, 110 strikeouts)"], "ranking": [14, 2, 3, 5, 6, 1, 15, 4, 8, 9, 10, 11, 12, 13, 16, 17, 18, 19, 20, 7]}
{"candidates": ["Joey Cantillo emphasized the importance of the bats waking up and the team fighting.", "Lane Thomas expressed his admiration for José Ramírez's versatility and performance.", "Stephen Vogt highlighted the importance of contributions from the entire lineup, not just Ramírez and Naylor."], "ranking": [2, 3, 1]}
{"candidates": ["The Guardians have the best home record in the AL at 45-27.", "All-Star left fielder Steven Kwan missed his third straight game with mid-low back tightness, but remains day to day.", "The Guardians reduced their magic number to clinch the American League Central Division to 9 over the Royals.", "Cleveland moved closer to securing a playoff spot, with a magic number of 4 over Detroit and Seattle.", "José Ramírez extended his on-base streak to 14 games and his hitting streak to 8 games.", "The loss closed out a 4-6 road trip that was highlighted by a series win over the Orioles last week and a series split against the Guardians this weekend, with a sweep at the hands of the Phillies in between.", "It marked the first time in MLB history that a team faced off against three straight division leaders on a road trip in September.", "Not only are the Rays (73-77) almost guaranteed to miss out on the postseason for the first time since 2018, but they’re also in danger of recording their first losing season since 2017."], "ranking": [3, 6, 5, 4, 2, 8, 1, 7]}
{"candidates": ["Rays: Second baseman Christopher Morel (right Achilles discomfort) was not in the lineup for the second day in a row but struck out as a pinch-hitter for the final out of the game.", "Guardians: RHP Carlos Carrasco (left hip strain), who has been on the injured list since Aug. 8, will make his second rehab start this week."], "ranking": [1, 2]}
{"candidates": ["Chris Flexen had a franchise-record 23 straight winless starts.", "Chicago White Sox averted a record-breaking loss for the third straight day.", "Chris Flexen was winless in his previous 23 starts, a franchise record.", "Los Angeles Angels set a franchise record for losses in a season with 96 losses.", "Los Angeles Angels finished with the most road losses for the team since 1996.", "The White Sox are tied with the Mets for most games lost in a season in the modern era at 120.", "The Angels set a franchise record for losses with 96 losses in the season.", "The White Sox tied the major-league record for most losses in a season with 120 losses."], "ranking": [3, 5, 2, 6, 8, 4, 7, 1]}
{"candidates": ["The White Sox defeated the Angels 7-0 on Thursday, Sept. 26, 2024, fueled by a season-high seven-run inning and 6 1/3 innings of pitching from Chris Flexen.", "The Chicago White Sox scored seven runs in the fifth inning, their best inning of the entire season, to cap off a sweep of the Los Angeles Angels.", "The White Sox scored seven runs in an inning for the first time this season.", "Chris Flexen pitched a gem to lead the White Sox to a 7-0 victory over the Angels.", "The Chicago White Sox completed just their second three-game sweep of the season with a 7-0 victory against the Los Angeles Angels.", "Chris Flexen snapped a 23-start winless streak with his performance in the game.", "The White Sox had their biggest offensive inning of the season during this match.", "Chris Flexen struck out seven in 6 1/3 innings for his first win since May 8.", "Andrew Vaughn hit a two-run single in the fifth inning.", "Lenyn Sosa doubled home two more runs in the fifth inning.", "Zach Neto departed due to right shoulder irritation after trying to steal second base.", "Chicago White Sox beat the Los Angeles Angels 7-0 at Guaranteed Rate Field.", "The White Sox swept the series 3-0 against the Angels.", "Chris Flexen pitched 6.1 innings with 5 hits, 0 earned runs, 7 strikeouts, and 1 walk.", "Andrew Vaughn singled to left, scoring Fletcher and Vargas, with Robert Jr. advancing to second.", "Lenyn Sosa doubled to right, scoring Vaughn and Robert Jr., with Sosa advancing to third.", "Bryan Ramos singled to left, scoring Sosa.", "Zach DeLoach doubled to left, scoring Ramos.", "David Fletcher singled to left, scoring DeLoach.", "The Chicago White Sox swept the Los Angeles Angels with a 7-0 win on September 26, 2024, avoiding breaking the MLB loss record.", "The White Sox's red-hot hitting lifted the crowd to a standing ovation.", "The White Sox won 7-0 against the Angels on September 26, 2024.", "Miguel Vargas scored past Angels catcher Logan O’Hoppe off Andrew Vaughn’s two-run single during the fifth inning.", "The White Sox scored seven runs in the fifth inning, their season high."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Andrew Benintendi hit a go-ahead single in the 10th inning, leading the Chicago White Sox to a 4-3 win over the Los Angeles Angels.", "Korey Lee hit a two-run homer in the second inning for the White Sox.", "Lenyn Sosa hit a tiebreaking solo home run in the fourth inning.", "The Angels tied the game in the eighth inning with a squeeze play bunt single by Michael Stefanic."], "ranking": [1, 3, 2, 4]}
{"candidates": ["The White Sox were sitting on a record-tying 120 losses, and their next loss would make them the most losing team in modern MLB history.", "Fans were hoping to watch the White Sox lose to claim baseball’s modern record for the worst season ever."], "ranking": [1, 2]}
{"candidates": ["The Los Angeles Angels and the Chicago White Sox meet Thursday in MLB action from Guaranteed Rate Field.", "This will be the final installment in a three-game series.", "The Angels played the Houston Astros in their last series, losing the first three installments before a 9-8 win Sunday.", "In the opener versus the Sox, the Angels took a 3-2 loss.", "On Wednesday, LA lost 4-3 in extras.", "Starter Jose Suarez lasted 5.0 innings with three earned runs.", "In the starter slot for Thursday, the Angels are going with Tyler Anderson, who is 10-14 with a 3.70 ERA in 30 starts.", "The Angels will play against the Rangers following this series.", "The White Sox took a sweep versus the San Diego Padres in their last set, losing 3-2, 6-2, and 4-2.", "On Wednesday, Chicago put up nine hits in the 10-inning victory.", "Davis Martin gave up two earned runs in 3.2 frames as a starter.", "Chris Flexen will start for the Sox on Thursday, with a record of 2-15 and a 5.15 ERA in 32 games (29 starts).", "Eleven of the White Sox's last 12 day games against AL West opponents have gone UNDER the total runs line.", "Each of the Angels' last four games as favorites have gone UNDER the total runs line.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the White Sox's last seven games as underdogs.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Angels' last four games as favorites against AL Central opponents.", "The Los Angeles Angels and Chicago White Sox will meet on Thursday at Guaranteed Rate Field, at 2:10 p.m. ET.", "Zachary Neto and Andrew Vaughn are expected to deliver at the plate as two hot hitters.", "The Angels average one home run per game to rank 22nd in MLB action with 163 total home runs.", "The White Sox rank last in Major League Baseball with just 129 home runs as a team.", "The game will be broadcast on Bally Sports and available for live stream on Fubo."], "ranking": [18, 20, 19, 15, 16, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 17, 21]}
{"candidates": ["White Sox interim manager Grady Sizemore commented on the team's focus and professionalism despite fan frustration.", "Angels manager Ron Washington reflected on the team's inability to capitalize on scoring opportunities."], "ranking": [1, 2]}
{"candidates": ["The White Sox completed their second three-game sweep of the season, both at home.", "The White Sox avoided setting a new record for the highest total defeats in the Modern Era, remaining tied with the 1962 Mets at 120 losses.", "Chicago White Sox finished their home schedule with a 23-58 record.", "The Angels managed just five runs and 19 hits in the series at Chicago.", "The White Sox put the game away with a season-high seven runs in the fifth inning.", "The Chicago White Sox averted a record-breaking loss for the third straight day, beating the Los Angeles Angels 7-0.", "The game took place at Rate Field in Chicago, Illinois, with an attendance of 15,678.", "The game lasted 2 hours and 30 minutes.", "The White Sox offered promotions such as $5 beers and clearance sales on unsold gear to attract fans.", "Crowds were more hostile earlier in the series, with fans wearing paper bags over their heads and chanting 'Sell The Team'.", "Shortstop Zach Neto left the game with right shoulder irritation but is expected to return soon.", "The Angels' inability to turn a key double play in the fifth inning contributed to their loss."], "ranking": [6, 2, 8, 10, 4, 1, 12, 11, 9, 5, 7, 3]}
{"candidates": ["The White Sox avoided a record-breaking 121st loss for the second straight game.", "The Angels matched a franchise record with their 95th loss."], "ranking": [1, 2]}
{"candidates": ["Angels' 1B Nolan Schanuel got the day off after fouling a ball off his right leg in the previous game.", "Upcoming matchups: Angels' Reid Detmers vs. Texas' Jacob deGrom, White Sox's Garrett Crochet vs. Detroit."], "ranking": [1, 2]}
{"candidates": ["Angels' 1B Nolan Schanuel exited the game in the first inning due to a bruised right leg."], "ranking": [1]}
{"candidates": ["Elly De La Cruz joined Eric Davis and Barry Larkin as the only Reds players with 25 homers and 65 stolen bases in a season.", "Jared Jones became just the seventh Pirate rookie to eclipse 125 strikeouts in a season.", "Elly De La Cruz joined Hall of Famer Joe Morgan and Eric Davis as the only players in Cincinnati Reds franchise history to hit 25 home runs and steal 65 bases in the same season."], "ranking": [1, 3, 2]}
{"candidates": ["Elly De La Cruz became the 3rd player in MLB history to have 100 stolen bases in their first two big league seasons.", "Elly De La Cruz joined the 100 steals/100 extra-base hits club in his first two seasons in the big leagues, achieving this faster than anyone else.", "Elly De La Cruz set a new record for most strikeouts in a season for the Cincinnati Reds with 206 strikeouts."], "ranking": [2, 1, 3]}
{"candidates": ["Elly De La Cruz stole his 65th base of the season in the 4th inning.", "Nick Martinez dominated in the Reds' 8-3 win over Pittsburgh."], "ranking": [2, 1]}
{"candidates": ["The Cincinnati Reds will square off with the Pittsburgh Pirates in MLB action at Great American Ball Park on Saturday, commencing at 8:40am AEST.", "Nick Martinez (9-6, 3.37 ERA) will start on the mound for the Reds, up against Mitch Keller (11-10, 3.87 ERA) for the Pirates.", "Based on advanced machine learning and data, Stats Insider has simulated the result of Saturday's Cincinnati vs Pittsburgh MLB match-up 10,000 times.", "Our proven predictive analytics model gives the Reds a 53% chance of winning against the Pirates at Great American Ball Park.", "The Reds are listed as 1.5-run favourites against the Pirates, with odds of $2.54 available at TAB.", "For the underdog Pirates (+1.5) to cover the line, TAB offers odds of $1.50.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Pirates (+1.5) are predicted to cover the line 64% of the time, while the 8.5-run over/under is expected to go over 56% of the time.", "While the Reds have a higher chance of winning the game, betting on the Pirates to win is our recommended option due to the 1.0% edge identified when comparing our data-driven probabilities to the odds currently available.", "The game between the Reds and Pirates at Great American Ball Park is scheduled to commence at 8:40am AEST on Saturday.", "Teams: Cincinnati Reds vs Pittsburgh Pirates", "Date: Saturday 21 September 2024", "Time: 8:40am AEST", "Venue: Great American Ball Park"], "ranking": [10, 8, 7, 9, 6, 5, 4, 3, 2, 1, 14, 13, 12, 11]}
{"candidates": ["Elly De La Cruz expressed pride in joining great players and feeling great about finishing strong.", "Rhett Lowder reflected on making pitches in crunch time and not panicking.", "Reds manager David Bell praised Lowder's maturity and preparedness.", "Jared Jones confirmed there was no injury despite a scare in the fifth inning.", "Jones reflected on his performance, stating 'Terrible. Everything was terrible today.'", "Manager Derek Shelton commented on Jones' inconsistency and the challenges of his first Major League season.", "Jared Jones described his performance as 'terrible.'", "Manager Derek Shelton commented on Jones' inconsistency and the impact of his injury.", "Shelton emphasized the importance of finishing strong for their pitchers."], "ranking": [5, 4, 3, 2, 9, 8, 7, 6, 1]}
{"candidates": ["The game was played on a muggy afternoon on the banks of the Ohio River, which may have affected Jones' performance.", "David Bednar tossed a scoreless seventh inning.", "Ryan Borucki blanked the Reds in the eighth inning.", "Jalen Beeks gave up the Reds' seventh and final run in the sixth inning.", "Rhett Lowder pitched five scoreless innings for the Reds.", "Bryan Reynolds is tied with Brendan Donovan for the most hits (14) against the Reds this year."], "ranking": [6, 4, 5, 3, 2, 1]}
{"candidates": ["Reds' LHP Sam Moll will not pitch this season due to a left shoulder impingement.", "C Austin Wynns will be shut down due to a right teres major tear.", "Pirates' RHP Paul Skenes has the lowest ERA in the major leagues since debuting on May 11.", "Reds' RHP Hunter Greene will come off the injured list to make his first start since August 13."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Keider Montero threw his first career complete game shutout."], "ranking": [1]}
{"candidates": ["Keider Montero threw a Maddux, a shutout in fewer than 100 pitches, becoming the first Tigers pitcher to face the minimum 27 batters since Justin Verlander in 2011."], "ranking": [1]}
{"candidates": ["Kerry Carpenter matched a career high with four hits.", "Trey Sweeney hit a three-run home run in the first inning.", "Spencer Torkelson hit an RBI-single in the first inning.", "Riley Greene hit a home run in the first inning.", "Ezequiel Tovar drove in two runs in the fifth inning.", "Ryan McMahon hit a home run in the second inning.", "Brenton Doyle hit an RBI single in the fifth inning.", "Riley Greene hit a home run on a 2-2 count against Colorado starter Tanner Gordon, contributing to the Tigers' 7-4 victory.", "Kerry Carpenter hit a triple down the right-field line that scored Matt Vierling.", "Keider Montero delivered a historic complete game shutout, allowing only three hits and no walks on 96 pitches.", "Riley Greene made a clutch, tumbling catch in the stands during the fifth inning.", "Riley Greene hit a solo home run in the first inning, setting off a six-run, six-hit opening inning.", "Riley Greene's fourth-inning sacrifice fly scored Jake Rogers, providing an important insurance run.", "Detroit Tigers' Matt Vierling celebrates after scoring against the Colorado Rockies on a triple by Kerry Carpenter during the first inning of a baseball game Wednesday, Sept. 11, 2024, in Detroit.", "Kerry Carpenter matched a career high with four hits.", "Riley Greene homered to right (356 feet).", "Trey Sweeney homered to right (407 feet), Torkelson and Jung scored.", "Ryan McMahon homered to right (354 feet)."], "ranking": [15, 12, 10, 11, 8, 9, 7, 1, 13, 2, 14, 3, 5, 6, 15, 4, 12, 9]}
{"candidates": ["Keider Montero struck out Jordan Beck of the Colorado Rockies on his 96th pitch, culminating in an 11-0 victory for the Detroit Tigers.", "Montero induced three double plays and gave up only three hits with no walks.", "Despite catcher Dillon Dingler being scratched with illness, Montero and Jake Rogers implemented the game plan effectively."], "ranking": [1, 2, 3]}
{"candidates": ["The Colorado Rockies and the Detroit Tigers meet Wednesday in MLB action from Comerica Park.", "This will be the second installment in a three-game series.", "Casey Mize will be the starter for the Tigers, with a season record of 2-6 and a 4.30 ERA in 18 starts.", "Tanner Gordon will start for the Rockies, with a season record of 0-5 and a 7.55 ERA in his first seven starts.", "Seven of the Rockies' last eight games have gone UNDER the total runs line.", "Three of the last four games between the Rockies and Tigers have gone OVER the total runs line.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Tigers' last five home games against National League opponents.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Rockies' last three games.", "Montero was coming off an outing where he gave up five earned runs over 4 1/3 innings against the San Diego Padres.", "Montero has been working relentlessly, studying mechanics, jogging up and down stadium steps, and adding a sinker to his arsenal."], "ranking": [8, 10, 6, 5, 9, 7, 3, 4, 2, 1]}
{"candidates": ["Kerry Carpenter expressed awareness of needing a homer for the cycle but ended up with an infield single.", "Tigers manager A.J. Hinch praised Tyler Holton's performance.", "Rockies manager Bud Black commented on Tanner Gordon's learning experience as a rookie.", "Tyler Holton reflected on the excitement of the current season compared to the previous year.", "Keider Montero expressed pride and happiness for his performance, stating 'I was over the clouds.'", "Manager A.J. Hinch praised Montero's performance, highlighting his potential as an effective major league starter.", "Manager A.J. Hinch praised Riley Greene's performance and his role in the team.", "Riley Greene expressed appreciation for the fans' support and intensity during the games.", "The Detroit Tigers won their fourth game in a row on Wednesday night, but they didn’t gain any ground in their chase for the final American League wild-card spot."], "ranking": [5, 3, 2, 8, 1, 4, 6, 7, 9]}
{"candidates": ["Montero expressed pride and happiness for the work performed, describing the moment as 'over the clouds'.", "Tigers manager A.J. Hinch praised Montero's versatility, competitiveness, and the development of his pitching arsenal.", "Hinch and players deflected questions about the wild-card race, focusing instead on the contributions of players like Montero."], "ranking": [2, 1, 3]}
{"candidates": ["The Tigers are three games behind Minnesota for the last American League wild card.", "The Tigers improved to 20-8 since August 11.", "The Tigers finished second in the AL Central in 2023 but missed the wild-card race.", "Tanner Gordon allowed seven runs and 10 hits in 3 1/3 innings.", "Tyler Holton, Will Vest, and Jason Foley combined for 4 1/3 shutout innings.", "Tigers' Reese Olson is expected to throw a bullpen session to determine the next steps in his recovery.", "Shortstop Javier Báez, who underwent season-ending hip surgery, used a cane to walk to the outfield for a team picture.", "The win moved the Tigers closer to the final spot in the American League Wild Card, now just three games behind the Minnesota Twins.", "Detroit's bullpen had two full days off in a row, thanks to Montero's complete game shutout and a day off on Monday."], "ranking": [8, 5, 2, 9, 4, 6, 3, 1, 7]}
{"candidates": ["Montero's performance was described as the best by Parker Meadows, who noted he didn't have to run around much, indicating a strong pitching performance.", "Gabe Ribas, the Tigers' director of pitching, was in attendance and has been instrumental in Montero's development."], "ranking": [1, 2]}
{"candidates": ["Corey Seager hit his 200th career homer.", "Corey Seager became the first exclusively left-handed-hitting shortstop in MLB history to reach 200 home runs.", "Corey Seager became the first purely left-handed-hitting shortstop in Major League history to hit 200 home runs.", "Corey Seager hit his 30th home run of the season, which also was his 200th career homer.", "Nathan Eovaldi tied a season-high with 10 strikeouts, which he also recorded against the White Sox on July 24.", "Corey Seager has reached 200 home runs in his career."], "ranking": [3, 1, 2, 4, 6, 5]}
{"candidates": ["Travis Jankowski robbed Andrew Vaughn of a game-winning homer with a leaping catch in the ninth inning.", "Corey Seager had four hits, including a tiebreaking single in the ninth.", "Wyatt Langford hit a three-run homer in the second game for Texas.", "Grant Anderson got one out for his first career save.", "Marcus Semien hit a tiebreaking RBI double for Texas in the seventh inning of the first game.", "Corey Seager put the Rangers ahead in the 9th inning.", "Wyatt Langford hit a home run and had 3 RBIs.", "Andrew Benintendi had 2 hits, 2 RBIs, and 2 walks."], "ranking": [1, 2, 5, 8, 3, 4, 6, 7]}
{"candidates": ["The Texas Rangers play the Chicago White Sox after Corey Seager had four hits on Wednesday in a 4-3 win over the White Sox.", "Thursday's game is the seventh meeting between these teams this season. The Rangers have a 6-0 advantage in the season series."], "ranking": [1, 2]}
{"candidates": ["The Chicago White Sox will take on the Texas Rangers in MLB action at Guaranteed Rate Field on Thursday, commencing at 7:10am AEST.", "The White Sox will send Garrett Crochet (6-9, 3.64 ERA) to the mound, while the Rangers are going with Andrew Heaney (4-13, 4.04 ERA).", "Stats Insider's predictive analytics model gives both the White Sox and the Rangers an equal 50% chance of winning the game.", "The latest betting odds in Australia for Thursday's MLB game at Guaranteed Rate Field are: White Sox $2.10, Rangers $1.73.", "The White Sox are 1.5-run underdogs against the Rangers, with odds of $1.65 available at TAB.", "For the favourite Rangers (-1.5) to cover the line, TAB offers odds of $2.10.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's model, the White Sox (+1.5) are predicted to cover the line 62% of the time, while the 8.5-run over/under is expected to stay under 53% of the time.", "The Chicago White Sox (31-101) will take on the Texas Rangers (60-71) at Guaranteed Rate Field on Thursday. The starting pitchers will be Nathan Eovaldi and Nick Nastrini.", "As a team, the Texas Rangers are scoring 4.2 runs/g, which ranks them 22nd in baseball.", "The Rangers have an earned run average of 4.32 so far this year (24th in baseball).", "The Chicago White Sox hold an on-base percentage of.278 and a batting average of.221 so far this season.", "The White Sox have a team WHIP of 1.446 in addition to having a FIP of 4.69 as a staff on the year."], "ranking": [13, 10, 8, 7, 6, 5, 4, 3, 2, 11, 12, 9, 1]}
{"candidates": ["Nathan Eovaldi expressed satisfaction with his fastball location and overall performance.", "Corey Seager and Marcus Semien reflected on their home run potential and contributions to the team's success.", "Manager Bruce Bochy praised Seager's hitting abilities and work ethic.", "Nick Nastrini reflected on his improved performance, attributing it to refining his mechanics and execution.", "White Sox catcher Korey Lee praised Nastrini's elite pitches and improved mechanics.", "Nastrini mentioned the support and guidance he received from teammates and coaches, including Dominic Leone and Charlotte pitching coach R.C. Lichtenstein."], "ranking": [4, 2, 3, 5, 1, 6]}
{"candidates": ["Following another heartbreaking loss, Vaughn credited Jankowski for his play, calling it 'probably one of the best catches you’ll see in a long time.'", "Interim manager Grady Sizemore said, 'That’s a tough game to lose. We played well, did everything right. They got some key hits when they needed it and stole one from us at a good time.'"], "ranking": [1, 2]}
{"candidates": ["Rangers manager Bruce Bochy mentioned having to tone down his comments due to the lack of fans in the stands during the resumed game.", "Rangers left-hander Andrew Heaney allowed five hits in five innings and mentioned it was not his best stuff but he competed to give his team a chance to win."], "ranking": [2, 1]}
{"candidates": ["Rangers: Jacob deGrom's second minor league rehab start went well, and he went to the bullpen for more work after being removed.", "White Sox: RHP Steven Wilson (lower back strain) pitched a scoreless inning in a rehab appearance with Triple-A Charlotte.", "Nathan Eovaldi (9-7, 3.79 ERA) starts for Texas in the series finale Thursday against White Sox right-hander Nick Nastrini (0-5, 8.39 ERA)."], "ranking": [2, 3, 1]}
{"candidates": ["Tarik Skubal achieved his 16th win of the season, the most in baseball.", "Skubal lowered his MLB-best ERA to 2.51 through 168.1 innings.", "Skubal now has 203 strikeouts, which tops baseball."], "ranking": [1, 2, 3]}
{"candidates": ["Tarik Skubal reached 200 strikeouts in a season, becoming the fourth Tigers lefty to achieve this milestone, joining Mickey Lolich, Hal Newhouser, and Matthew Boyd."], "ranking": [1]}
{"candidates": ["Cooper Criswell retired the first 12 Tigers he faced, pitching four perfect innings.", "Spencer Torkelson hit a go-ahead two-run homer off Rich Hill.", "Riley Greene hit a two-run homer in the sixth inning.", "Brant Hurter of the Detroit Tigers pitched 5.0 innings, allowing 6 hits and 1 earned run while striking out 5 batters.", "Riley Greene of the Detroit Tigers hit a home run, his 20th of the season, and contributed 2 RBIs.", "Romy González of the Boston Red Sox went 2-3 and scored a run.", "Rich Hill of the Boston Red Sox pitched 0.2 innings, allowing 1 hit and 2 earned runs while striking out 2 batters.", "Tarik Skubal allowed only four hits and struck out eight batters in eight innings.", "Tyler O'Neill hit a home run in the top of the first inning.", "Trey Sweeney hit a two-run double, scoring Zach McKinstry and Spencer Torkelson.", "Tyler Holton closed out the game for the Tigers.", "Spencer Torkelson hit a two-run home run in the fifth inning.", "Riley Greene hit a two-run home run in consecutive innings.", "Spencer Torkelson and Riley Greene each hit a two-run homer, contributing to the Detroit Tigers' 4-1 victory over the Boston Red Sox.", "Brant Hurter pitched five innings of one-run ball for the win and got Wilyer Abreu to bounce into a double play.", "Jason Foley got his 20th save with a perfect ninth inning.", "Jarren Duran's two-out RBI single lifted Boston to a 1-0 lead in the fifth inning.", "Spencer Torkelson hit a drive to left for his eighth homer, giving the Tigers a 2-1 lead.", "Riley Greene hit a two-run homer in the sixth inning, his 20th of the season.", "Spencer Torkelson and Riley Greene each hit a two-run homer, and the Detroit Tigers beat the Boston Red Sox 4-1.", "Beau Hurter pitched 5.0 innings with 6 hits, 1 earned run, 5 strikeouts, and 0 walks.", "Jason Foley earned his 20th save with 1.0 inning pitched, 0 hits, 0 earned runs, 1 strikeout, and 0 walks."], "ranking": [14, 20, 15, 18, 19, 6, 7, 8, 9, 10, 11, 12, 13, 1, 2, 3, 4, 5, 16, 17, 21, 22]}
{"candidates": ["Tarik Skubal pitched a career-high eight innings, allowing just one run and striking out eight batters.", "Riley Greene threw out Romy Gonzalez at second base after he tried to stretch a single into a double.", "Zach McKinstry and Trey Sweeney turned an improbable double play on a high-chopper by Triston Casas.", "Ryan Kreidler made a difficult play at third base to retire Triston Casas in the eighth inning.", "The Tigers scored two runs in the second inning with hits from Spencer Torkelson, Zach McKinstry, and Trey Sweeney."], "ranking": [1, 5, 3, 4, 2]}
{"candidates": ["Red Sox manager Alex Cora discussed the pitching strategy before the game, indicating a plan to use Rich Hill after Criswell.", "Detroit Tigers had slim playoff hopes and needed to win against Boston to stay in the wild card race."], "ranking": [2, 1]}
{"candidates": ["The Detroit Tigers will take on the Boston Red Sox in MLB action at Comerica Park on Sunday, commencing at 8:10am AEST.", "Tarik Skubal (15-4, 2.58 ERA) will get the ball for the Tigers, while the Red Sox will counter with Nick Pivetta (5-9, 4.61 ERA).", "Based on trusted computer power and data, Stats Insider has simulated the outcome of Sunday's Detroit vs Boston MLB game 10,000 times.", "Stats Insider's predictive analytics model gives the Tigers a 57% chance of winning against the Red Sox at Comerica Park.", "The latest betting odds in Australia for Sunday's MLB game at Comerica Park are: Head to Head: Tigers $1.71, Red Sox $2.15; Line: Tigers -1.5 ($2.45), Red Sox +1.5 ($1.53); Total (Over/Under 7.5 Runs): Over $1.91, Under $1.91.", "According to Stats Insider's model, the Red Sox (+1.5) are predicted to cover the line 62% of the time, while the 7.5-run over/under is expected to stay under 51% of the time.", "The game had a special atmosphere as fans came early to celebrate the 40-year anniversary of the 1984 World Series championship.", "The Detroit Tigers (68-67) are welcoming the Boston Red Sox (69-65) at Comerica Park on Sunday. The expected starting pitchers will be Cooper Criswell and Ty Madden.", "As a team, the Boston Red Sox are putting up 4.8 runs per game, which has them sitting at 8th in MLB.", "The Detroit Tigers have compiled an OBP of.298 in addition to a batting average of.234 so far this year."], "ranking": [7, 3, 9, 5, 8, 6, 1, 4, 2, 10]}
{"candidates": ["Rich Hill took responsibility for the loss, stating he needed to make better pitches.", "Alex Cora reflected on the team's struggles and emphasized the need to regroup and reassess.", "Cooper Criswell expressed his support for Cora's decision, despite wanting to continue pitching.", "Tarik Skubal's performance against Boston should all but sew up the Cy Young Award for him and cement his spot in the MVP race.", "Brant Hurter expressed excitement about getting a first-pitch double play.", "Riley Greene expressed pride in reaching 20 homers for the first time and contributing to the team's win.", "Red Sox manager Alex Cora reflected on the team's struggles with late-game offense."], "ranking": [5, 4, 3, 1, 6, 2, 7]}
{"candidates": ["Tarik Skubal expressed his excitement about the milestone and the support from fans.", "Spencer Torkelson praised Skubal's conviction and confidence in his pitches.", "Manager AJ Hinch highlighted the importance of aggressive base running and praised the team's defensive plays."], "ranking": [2, 3, 1]}
{"candidates": ["The Red Sox outhit the Tigers 6-3 but still lost the game.", "The Tigers won the game with a final score of 4-1 at Comerica Park, Detroit, MI.", "The pitching Triple Crown has not been accomplished in a 162-game season since Johan Santana did it in 2006.", "The Tigers earned their second series win in the last 13 against Boston and won the season series for the first time since 2017.", "The game had an attendance of 30,173 and lasted 2 hours and 22 minutes.", "The game was held at Comerica Park in Detroit, Michigan with an attendance of 30,173.", "The game lasted 2 hours and 22 minutes."], "ranking": [4, 2, 6, 1, 5, 3, 7]}
{"candidates": ["The Tigers are six losses behind the Twins for the final wild card spot and are 1½ games behind the Red Sox and a game behind the Mariners."], "ranking": [1]}
{"candidates": ["Cade Smith struck out 12 batters in the ALDS, setting a new MLB record for a reliever in a division series.", "Cade Smith became the first pitcher in Cleveland history to appear in all five games of a division series.", "Steven Kwan became the first Cleveland player and third in MLB history to collect three hits or more in three straight postseason games.", "Steven Kwan extended his playoff hitting streak to 10 games, matching Kenny Lofton in 1995 for the franchise record.", "Steven Kwan's 11 hits in the ALDS are a new club record for a single division series.", "Steven Kwan's 20 hits are the most by a Cleveland player through 12 career playoff games, passing Kenny Lofton's 18 in 1995.", "David Fry hit the franchise’s first go-ahead, pinch-hit home run to secure the win on the road.", "Cleveland earned its first playoff win when facing elimination since Game 6 of the 1997 World Series in Florida. The Guardians had dropped 11 consecutive postseason elimination games since then, the longest such losing streak in MLB history."], "ranking": [1, 5, 2, 6, 3, 4, 7, 8]}
{"candidates": ["David Fry hit the first go-ahead, pinch-hit home run in Cleveland Guardians franchise history.", "Tigers fans once again set postseason game attendance record at Comerica Park", "Cleveland ended a streak of 11 losses in postseason elimination games dating to Game 6 of 1997 World Series.", "David Fry hit the second pinch-homer in Cleveland postseason history after Hank Majeski in Game 4 of the 1954 World Series.", "Cleveland ended a streak of 11 losses in postseason elimination games dating to Game 6 of 1997 World Series.", "David Fry hit the second pinch-homer in Cleveland postseason history after Hank Majeski in Game 4 of the 1954 World Series.", "David Fry hit the fourth go-ahead pinch home run in postseason history when trailing in seventh inning or later after the Los Angeles Dodgers’ Kirk Gibson in the 1988 World Series, Toronto’s Ed Sprague in the 1992 World Series and Atlanta’s Eric Hinske in the 2010 NL Division Series.", "44,923 fans set a playoff attendance record for the second straight day at 25-year-old Comerica Park."], "ranking": [1, 7, 3, 4, 5, 6, 2, 8]}
{"candidates": ["Lane Thomas hit a grand slam in the fifth inning, made possible by Steven Kwan's one-out base hit off Skubal.", "Cade Smith entered Game 5 in the third inning, the earliest he had ever appeared in a major league game.", "The Guardians won a back-and-forth affair 5-4 on Thursday to force the fifth and decisive game of the series.", "David Fry hit a two-run home run in the seventh inning, giving the lead back to the Guardians.", "David Fry added an RBI on a squeeze play two innings later.", "Guardians closer Emmanuel Clase completed a five-out save, giving up a run in the ninth but closing the door on Matt Vierling and the Tigers.", "Matthew Boyd will start in a win-or-go-home American League Division Series Game 5 against his former team, the Detroit Tigers.", "The mentor-mentee battle between Boyd and Tarik Skubal will be a key matchup in the game.", "The Guardians forced a winner-take-all game at Progressive Field with a dramatic 5-4 win over the Tigers in Game 4 on Thursday night.", "David Fry played the hero role with a go-ahead two-run homer in the seventh and a safety squeeze in the ninth that gave Cleveland a two-run lead.", "The safety squeeze in the top of the ninth turned out to be critical, because Detroit was able to get a run off Emmanuel Clase in the bottom half of the frame that cut the deficit to one run, but the Guardians' All-Star closer struck out Matt Vierling to end the game.", "David Fry blasted a two-run homer in the seventh inning and added a run-scoring sacrifice bunt in the ninth to help the Cleveland Guardians secure a 5-4 victory.", "Relievers Hunter Gaddis, Tim Herrin, and Emmanuel Clase held the Tigers to one run over the last 3 2/3 innings.", "Jose Ramirez belted his first home run of the postseason in the fifth inning.", "Detroit’s Zach McKinstry tied the score at 2-2 with a home run in the fifth inning.", "Wenceel Perez hit a two-out single in the sixth inning to give Detroit a 3-2 lead.", "Justyn-Henry Malloy doubled and scored in the ninth inning to bring the Tigers within one run.", "Trey Sweeney tied the game with a sacrifice fly into center field.", "José Ramírez hit a go-ahead solo shot into the bullpens in left field.", "Zach McKinstry tied the game with a home run into the bullpens in left field.", "Wenceel Pérez gave the Tigers a 3-2 lead with a bloop single into left field.", "David Fry hit a season-altering two-run homer off Beau Brieske into left field.", "David Fry contributed to an additional run with a squeeze play in the top of the ninth.", "Emmanuel Clase locked down the save with a swinging strikeout of Matt Vierling."], "ranking": [1, 20, 5, 7, 18, 3, 15, 12, 2, 4, 6, 11, 9, 14, 16, 17, 8, 13, 10, 19, 21, 22, 23, 24]}
{"candidates": ["David Fry hit a momentum-shifting, series-saving home run into the Detroit Tigers' bullpen.", "David Fry executed a squeeze bunt that allowed Brayan Rocchio to score a pivotal insurance run.", "José Ramírez hit a home run, which was predicted by David Fry in a dugout conversation.", "Tigers eliminated from playoffs after 7-3 loss to Guardians in game 5", "Fry's 2-run homer, squeeze bunt lead Guardians over Tigers win and force Game 5", "Tigers blank Guardians with clutch hitting, strong pitching, taking series lead", "Carpenter's 3-run homer off Clase sends Tigers to win over Guardians in Game 2", "David Fry had a go-ahead, two-run homer in the seventh inning.", "Fry bunted home an insurance run in the ninth.", "Zach McKinstry homered in the fifth inning.", "Wenceel Pérez hit a run-scoring single in the sixth inning.", "Emmanuel Clase retired five batters, preserving a 4-3 lead in the eighth when he escaped a second-and-third jam by striking out Trey Sweeney on a 100.9 mph cutter.", "Justyn-Henry Malloy doubled leading off the ninth, advanced on Parker Meadows' groundout and scored on Jace Jung's groundout.", "Clase struck out Matt Vierling for the save.", "David Fry had a go-ahead, two-run homer in the seventh inning.", "David Fry bunted home an insurance run in the ninth.", "Emmanuel Clase retired five outs for his third multi-inning save of the year.", "Zach McKinstry homered in the fifth off Tanner Bibee.", "Wenceel Pérez hit a run-scoring single in the sixth.", "José Ramírez hit a solo home run in the fifth inning.", "Brayan Rocchio slid home headfirst to beat Will Vest's backhand flip, boosting the lead to 5-3.", "Pinch-hitter Justyn-Henry Malloy doubled leading off the ninth, advanced on Parker Meadows’ groundout and scored on Jace Jung’s groundout.", "Emmanuel Clase struck out Matt Vierling to end the game."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]}
{"candidates": ["Steven Kwan reflected on his success in the postseason, attributing it to executing his plan at the plate.", "Tigers manager A.J. Hinch praised Steven Kwan, calling him the 'engine' for Cleveland that 'creates a lot of pressure.'", "Cade Smith expressed that he is not taking a second of the playoff experience for granted, highlighting the team's resilience and ability to compete."], "ranking": [2, 1, 3]}
{"candidates": ["Manager Stephen Vogt praised David Fry's contributions, stating 'You just can’t say enough about what David has meant to us this year.'", "Catcher Austin Hedges referred to the game as David Fry's 'coming-out party.'", "Austin Hedges credited David Fry as a big reason for the team's current position.", "Tigers fans sad but optimistic leaving ALDS Game 4 loss at home", "Fans filled with emotion as Tigers win first home playoff game in over 10 years", "David Fry is one of the best baseball players in this league,” Guardians manager Stephen Vogt said.", "It’s win or go home,” Vogt said. “You want your best pitchers out there as long as possible.", "It’s always comforting to have Tarik Skubal on the mound,” Detroit manager A.J. Hinch said.", "We’re still one win away,” Detroit first baseman Spencer Torkeslon said. “That’s the mindset. We don’t want it easy. We knew it wasn’t going to be easy.", "We’ve shown that all year long, that’s who these guys are,” Fry said. “We have a bunch of tough dudes. We get down 2-1 and we’re in the locker room like it’s just another day. We show up ready to play to try and get a win. And let’s go win Game 5.", "Such a great baseball game,” Vogt said.", "I was really excited to get to the mound, especially getting the trust back from the manager to get me in that role and that responsibility,” Clase said through an interpreter."], "ranking": [10, 8, 7, 5, 12, 9, 4, 3, 2, 1, 6, 11]}
{"candidates": ["The winner of Saturday’s game will meet the New York Yankees in the American League Championship Series, set to begin Monday night in The Bronx.", "The game will be played in front of a sellout crowd at Progressive Field.", "The Guardians plan to use all available pitchers, including rookies Andrew Walters and Erik Sabrowski, if necessary.", "Per Weather.com, there is an 80 percent chance of rain with total accumulations of around half an inch in Cleveland on Saturday night.", "The winner of Saturday's game will take on the New York Yankees at Yankee Stadium in Game 1 of the ALCS on Monday at 7:37 p.m. ET.", "The winner of Game 5 will face either the New York Yankees or Kansas City Royals in the ALCS beginning Monday."], "ranking": [3, 2, 5, 6, 1, 4]}
{"candidates": ["Rajai Davis, who attended every game of the series, reflected on his own postseason heroics and how they relate to Fry's performance.", "Construction underway on premium 'Home Plate Club' Comerica Park; see renderings", "Red Wings move back home opener start time due to Tigers ALDS game", "Carpenter injured his left hamstring when he scored in the sixth and was pinch hit for in the seventh.", "Lane Thomas ended the Guardians’ 20-inning scoreless streak with a two-out RBI single in the first off Reese Olson."], "ranking": [5, 1, 2, 4, 3]}
{"candidates": ["The White Sox established a franchise record with their 107th loss, remaining on pace to supplant the 1962 Mets as the worst team in MLB history.", "Francisco Lindor extended his on-base streak to 30 games, the longest active streak in the major leagues.", "J.D. Martinez has reached 1,700 strikeouts in his career.", "The Chicago White Sox set a franchise record for losses in a single season with their 107th loss, surpassing the previous record of 106 losses set by the 1970 team.", "Garrett Crochet tied an AL record by striking out seven consecutive batters to start the game.", "The Chicago White Sox set a new franchise record for losses in a season with 107.", "The Chicago White Sox set a franchise record with their 107th loss."], "ranking": [1, 3, 6, 2, 4, 5, 7]}
{"candidates": ["The New York Mets and Chicago White Sox will send Sean Manaea and Garrett Crochet, respectively, out to start when the two clubs square off on Sunday at Guaranteed Rate Field, at 2:10 p.m. ET.", "The Mets’ 4.10 team ERA ranks 15th across all league pitching staffs.", "The White Sox have pitched to a 4.88 ERA this season, which ranks 29th in baseball.", "The game will be broadcast on NBC Sports Networks and can be live-streamed on Fubo.", "The Chicago White Sox (31-104) will attempt to defeat the New York Mets (70-64) on Sunday, September 1, 2024, at Guaranteed Rate Field in Chicago, IL.", "The starting pitchers for the game are Sean Manaea for the Chicago White Sox and Garrett Crochet for the New York Mets.", "The New York Mets have hit 248 doubles and 171 home runs as a team this season.", "The Mets have a team slugging percentage of.420 and have struck out 1,139 times while walking 425 times.", "The Mets are earning 4.8 runs per game, which is 10th in MLB, with a team batting average of.249.", "The Mets' pitching staff has a collective WHIP of 1.30 and a team ERA of 4.14, with 1,179 strikeouts and 506 walks.", "The Chicago White Sox have a team on-base percentage of.278 and a team batting average of.220 this year.", "The White Sox have hit 109 home runs and have 397 runs batted in this season.", "The White Sox pitching staff has a WHIP of 1.442 and a FIP of 4.65, with 1,109 strikeouts and 528 walks.", "The White Sox have allowed 173 home runs and surrender 5.33 runs per 9 innings, ranking 29th in MLB."], "ranking": [12, 8, 9, 14, 11, 13, 7, 6, 5, 10, 4, 3, 2, 1]}
{"candidates": ["Sean Manaea expressed optimism about the team's position for a playoff run.", "Francisco Lindor commented on Manaea's improving performance and expressed satisfaction with the team's current standing.", "Manager Carlos Mendoza praised Manaea's performance and demeanor on the mound.", "Interim manager Grady Sizemore commented on Garrett Crochet's performance and the decision to pull him early, stating, 'He was pretty frustrated when I came out there, but I think he knows the situation and what we're trying to do. He threw well. He was on, he had good stuff. It's going to be tough when he's on a short leash like that and a pitch count, that he's never going to get to go as deep as he wants.'", "White Sox postgame show host Chuck Garfien expressed frustration, saying, 'We’re on this set to talk about winning games and I’ve only done it 31 times this year.'", "Ozzie Guillen, former manager, commented on the team's poor performance, saying, 'At the end of the day, this is embarrassing.'"], "ranking": [4, 3, 2, 6, 5, 1]}
{"candidates": ["The White Sox's loss officially makes this season historic for the franchise, with potential for more records as they approach the worst record in modern MLB history.", "The worst record in a 162-game season belongs to the 2003 Detroit Tigers, who went 43-119. The White Sox would have to go 12-12 down the stretch to tie that record.", "Sunday’s loss capped off a 0-10 homestand, another first in franchise history.", "The White Sox are the first team to have three losing streaks of 10 or more games in a season since the 1965 Mets."], "ranking": [1, 4, 2, 3]}
{"candidates": ["The #TexRangers at #WhiteSox game is the first in MLB history to be suspended before an out was recorded."], "ranking": [1]}
{"candidates": ["The Rangers won 3-1 in the completion of the suspended game.", "The Rangers took the nightcap 4-3.", "Travis Jankowski made one of the catches of the year by taking a walk-off homer away from Andrew Vaughn in the ninth inning.", "The Texas Rangers-Chicago White Sox game was suspended Tuesday night after four pitches in the first inning due to persistent rain.", "Travis Jankowski robbed Andrew Vaughn of a walk-off three-run homer in the ninth inning, securing the Rangers' 4-3 win over the White Sox.", "Wyatt Langford hit a three-run home run in the fourth inning for the Rangers.", "Travis Jankowski robbed Andrew Vaughn of a game-winning homer with a leaping catch in the ninth inning.", "Langford homered to left center (409 feet), Lowe scored and Jung scored.", "Seager singled to center, Taveras scored, Semien to third."], "ranking": [8, 7, 1, 9, 2, 5, 3, 4, 6]}
{"candidates": ["The Texas Rangers-Chicago White Sox game was suspended after four pitches in the first inning due to persistent rain."], "ranking": [1]}
{"candidates": ["Chicago, which has the worst record in baseball at 31-101 and is 4-30 since the All-Star break, is looking to end a four-game winless streak.", "The Rangers entered the first game of the three-game series with a two-game losing streak."], "ranking": [1, 2]}
{"candidates": ["White Sox starter Garrett Crochet threw four pitches — two balls and two strikes — before the game was halted.", "Andrew Heaney was the scheduled starter for Texas.", "Chicago, which has the worst record in baseball at 31-101 and is 4-30 since the All-Star break, is looking to end a four-game winless streak.", "The Rangers entered the first game of the three-game series with a two-game losing streak.", "The Chicago White Sox will take on the Texas Rangers in MLB action at Guaranteed Rate Field on Wednesday, commencing at 10:10am AEST.", "The White Sox will send Garrett Crochet (6-9, 3.64 ERA) to the mound, up against Andrew Heaney (4-13, 4.04 ERA) for the Rangers.", "Based on trusted computer power and data, Stats Insider has simulated the result of Wednesday's White Sox vs Texas MLB match-up 10,000 times.", "Stats Insider's predictive analytics model gives the Rangers a 52% chance of winning against the White Sox at Guaranteed Rate Field.", "The current betting odds in Australia for Wednesday's MLB game at Guaranteed Rate Field are: White Sox $2.15, Rangers $1.71.", "The White Sox are listed as 1.5-run underdogs against the Rangers, with odds of $1.71 available at TAB.", "For the favourite Rangers (-1.5) to cover the line, TAB offers odds of $2.14.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the White Sox (+1.5) are predicted to cover the line 61% of the time, while the 8.5-run over/under is expected to stay under 55% of the time.", "Stats Insider provides full betting coverage of the White Sox vs Texas game on Wednesday, including data-driven predictions and free betting tips.", "The game between the White Sox and Rangers at Guaranteed Rate Field is scheduled to commence at 10:10am AEST on Wednesday.", "Teams: Chicago White Sox vs Texas Rangers", "Date: Wednesday 28 August 2024", "Time: 10:10am AEST", "Venue: Guaranteed Rate Field"], "ranking": [3, 2, 1, 2, 15, 4, 14, 5, 13, 12, 11, 10, 9, 8, 7, 16, 17, 18, 19]}
{"candidates": ["Manager Bruce Bochy expressed excitement about Jankowski's game-saving catch.", "Andrew Chafin, the pitcher, acknowledged Jankowski's play and jokingly mentioned owing him a few steak dinners.", "Travis Jankowski reflected on the significance of his catch, calling it a once-in-a-lifetime play.", "Andrew Vaughn praised Jankowski's catch, acknowledging the effort and skill involved."], "ranking": [2, 4, 1, 3]}
{"candidates": ["The game will be made up on Wednesday as part of a doubleheader, starting at 4:10 p.m.", "Rangers: RHP Jacob deGrom (elbow surgery) retired all six batters he faced in his second rehab start for Triple-A Round Rock on Tuesday night.", "White Sox: 3B Yoan Moncada (adductor strain) and RHP Michael Soroka (shoulder strain) were scheduled to begin rehab assignments with Triple-A Charlotte on Tuesday.", "The club added INF Jake Amaya to the active roster a day after claiming him off waivers from Houston and recalled RHP Prelander Berroa from Charlotte.", "INF Bryan Ramos was optioned to Triple-A and RHP John Brebbia was designated for assignment.", "Texas rookie Jack Leiter is scheduled to make his fourth career start against fellow RHP Chris Flexen when the series continues Wednesday."], "ranking": [6, 2, 3, 5, 4, 1]}
{"candidates": ["Paul Skenes recorded his 16th game with seven or more strikeouts, surpassing Larry McWilliams (1983) for seventh-most by a Pirates starter in a season.", "Paul Skenes became just the second player since 1913 to post a sub-2.00 ERA through 22 career appearances.", "Paul Skenes upped his strikeout total to 167 on the year, the fifth-most by a pitcher in their first 22 appearances since 2001.", "Aroldis Chapman is now tied for the most strikeouts in a single season by a left-handed Pirates reliever.", "Paul Skenes has already blown past the franchise’s rookie strikeout record, now sitting at 167.", "Skenes is the first pitcher in the Modern Era with 150 strikeouts and an ERA under 2.00 in his first 22 career games.", "Paul Skenes is the only pitcher in baseball history to have a sub-2.20 ERA and 150-plus strikeouts in his first 21 games."], "ranking": [7, 5, 4, 2, 3, 1, 6]}
{"candidates": ["The Cincinnati Reds will look to sweep a three-game series with a victory against the Pittsburgh Pirates.", "Cincinnati is 39-41 in home games and 76-80 overall. The Reds have a 53-13 record in games when they out-hit their opponents.", "Pittsburgh has a 72-83 record overall and a 34-43 record in road games. The Pirates are 39-18 in games when they did not give up a home run.", "Sunday's game is the 13th time these teams square off this season. The Pirates are up 7-5 in the season series.", "Elly De La Cruz leads Cincinnati with 25 home runs while slugging.479. TJ Friedl is 11-for-36 with two home runs and nine RBI over the last 10 games.", "Bryan Reynolds leads the Pirates with a.276 batting average, and has 29 doubles, three triples, 22 home runs, 54 walks and 85 RBI. Isiah Kiner-Falefa is 12-for-43 with an RBI over the last 10 games.", "Last 10 games: Reds: 5-5,.248 batting average, 5.28 ERA, outscored by five runs. Pirates: 3-7,.239 batting average, 4.76 ERA, outscored by 27 runs.", "Pitching Probables: Pirates: Paul Skenes (10-3, 2.07 ERA, 0.98 WHIP, 158 strikeouts); Reds: Hunter Greene (0-0).", "Paul Skenes, the No. 1 pick in the 2023 MLB Draft, will start for the Pittsburgh Pirates against the Cincinnati Reds.", "Hunter Greene will start for the Cincinnati Reds fresh off the injured list.", "The Pirates have a disappointing 72-83 record, while the Reds are at 76-80.", "First pitch is at 1:10 p.m. ET."], "ranking": [10, 8, 7, 6, 5, 4, 3, 2, 9, 1, 11, 12]}
{"candidates": ["Andrew McCutchen and the Pittsburgh Pirates take the field on Sunday at Great American Ball Park against Hunter Greene, who is starting for the Cincinnati Reds.", "The Pirates have the 21st-ranked team ERA among all MLB pitching staffs (4.20).", "The Reds have an 8.7 K/9 this season as a pitching staff, which ranks 11th in the majors.", "First pitch will be at 1:10 p.m. ET.", "Pirates are the favorites with odds of -122, while the Reds are the underdogs with odds of +102.", "The over/under for the game is set at 8.", "The Pittsburgh Pirates and the Cincinnati Reds meet Sunday in MLB action from Great American Ball Park.", "This will be the final installment in a three-game series.", "Hunter Greene will start for the Reds. This year Greene is 9-4 with a 2.83 ERA in 24 starts.", "Paul Skenes will start for the Pirates. So far Skenes is 10-3 with a 2.07 ERA in the first 21 starts of his career.", "The Pirates lost the first three games against the St. Louis Cardinals before a 3-2 win Thursday.", "The Reds played the Atlanta Braves in their last set, winning 6-5 in the first game before a pair of losses to drop the series."], "ranking": [10, 8, 9, 12, 7, 11, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Pirates manager Derek Shelton praised Paul Skenes, saying 'He's special. He continues to evolve. I mean the change-up today was elite.'", "Reds manager David Bell commented on Skenes' performance, stating 'He dominated really. He had a really good change-up. It is kind of the growth from the last time we faced him. That pitch was a difference maker for him today.'", "Paul Skenes reflected on his performance, saying 'Obviously, the third time seeing them, you gotta get them out in different ways than you have in the past. We did a good job adjusting to that today.'", "Paul Skenes expressed that winning Rookie of the Year would be a cool honor.", "Joey Bart praised Skenes' performance and his ability to put zeros on the board.", "Derek Shelton commended Skenes for his historic performance and evolving skills.", "Nick Yorke reflected on his journey to the big leagues and his excitement to contribute to the team.", "Reds manager David Bell noted that Skenes' changeup was a difference maker in the game.", "Pirates manager Derek Shelton endorsed Skenes for the National League Rookie of the Year, citing his historic performance.", "Skenes expressed that winning the Rookie of the Year award would be a cool honor, especially in his first professional season."], "ranking": [6, 5, 4, 3, 8, 2, 10, 9, 1, 7]}
{"candidates": ["Pittsburgh won by shutout for the 12th time this season.", "The Reds lost by shutout for the 14th time this season and for the second time when Skenes started.", "The game was held at Great American Ball Park in Cincinnati, Ohio with an attendance of 34,750.", "The game lasted 2 hours and 25 minutes.", "The Pirates' bullpen pitched a shutout in a challenging ballpark.", "Hunter Greene returned from the injured list but only pitched three innings."], "ranking": [2, 1, 6, 5, 3, 4]}
{"candidates": ["José Ramírez was intentionally walked for a franchise-record 88th time.", "José Ramírez was intentionally walked for a franchise-record 88th time."], "ranking": [1, 2]}
{"candidates": ["Lane Thomas emphasized the importance of having fun and aggressive at-bats.", "Taylor Walls praised Junior Caminero's potential and future career.", "The Guardians enjoyed their 6-1 win in front of over 30,000 fans at Progressive Field."], "ranking": [2, 3, 1]}
{"candidates": ["The Guardians remained three games ahead of second-place Kansas City in the division with 13 games remaining.", "Cleveland has the best home record in the AL at 44-27.", "Tampa Bay is 5 1/2 games out of the final AL wild-card berth.", "Cleveland has the best home record in the AL at 44-27.", "The Guardians remained three games ahead of second-place Kansas City in the division.", "The Rays are six back for the third AL wild card.", "The game was held at Progressive Field in Cleveland, Ohio.", "The attendance for the game was 31,362.", "The game lasted 2 hours and 16 minutes.", "The game was played on a perfect Saturday night for baseball."], "ranking": [8, 2, 5, 2, 7, 6, 10, 9, 4, 3]}
{"candidates": ["Jackson Jobe made his MLB debut as a closer against the Tampa Bay Rays, throwing a scoreless ninth inning in a 7-1 win.", "Jobe retired three of the four batters he faced, throwing seven of nine pitches for strikes and generating one whiff on seven swings.", "Jobe's fastball averaged 98 mph during his debut."], "ranking": [1, 2, 3]}
{"candidates": ["The Detroit Tigers are on a three-game home winning streak.", "Thursday's game is the sixth meeting between the Detroit Tigers and Tampa Bay Rays this season, with the Tigers leading the season series 4-1.", "Riley Greene leads the Tigers with a.264 batting average, 26 doubles, six triples, and 24 home runs.", "Parker Meadows is 10-for-41 with two home runs and three RBI over the past 10 games.", "Christopher Morel has 11 doubles, three triples, and 21 home runs for the Rays.", "Jonathan Aranda is 8-for-31 with three home runs over the last 10 games."], "ranking": [3, 2, 1, 5, 4, 6]}
{"candidates": ["The Tampa Bay Rays and the Detroit Tigers meet Thursday in MLB action from Comerica Park.", "This will be the final installment in a three-game series.", "Reese Olson will start for Detroit on Thursday. So far Olson is 4-8 with a 3.49 ERA in 21 starts.", "Tyler Alexander will start for the Rays. This year Alexander is 6-5 with a 5.35 ERA and 84 Ks.", "Each of the Rays' last five-day games against American League opponents has gone UNDER the total runs line.", "Five of the Tigers' last six-day games against AL East opponents have gone UNDER the total runs line.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Tigers' last eight-day games against American League opponents.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Rays' last five-day games.", "Javier Baez has recorded at least one hit in each of his last 10 Thursday-day appearances.", "Spencer Torkelson has hit a home run in each of the Tigers' last two games at Comerica Park against AL East opponents that held a losing record.", "Javier Baez has recorded at least one total base in each of his last 10 Thursday-day appearances.", "Wenceel Perez has scored a run in eight of his last nine appearances against AL opponents that held a losing record.", "Spencer Torkelson has recorded at least one RBI in four of his last five home appearances against opponents that held a losing record.", "Kerry Carpenter has recorded a Single in eight of his last nine appearances against AL opponents that held a losing record.", "Yandy Diaz has recorded at least one Single in seven of his last eight road appearances against opponents that held a winning record.", "Brandon Lowe has recorded at least one hit in 10 of his last 11 appearances in day games against teams that held a winning record.", "Brandon Lowe has hit a home run in two of the Rays' last three road games against the Tigers.", "Brandon Lowe has recorded at least one total base in 10 of his last 11 appearances in day games against teams that held a winning record.", "Brandon Lowe has scored at least one run in four of his last five appearances against the Tigers."], "ranking": [15, 18, 12, 11, 9, 8, 7, 6, 14, 5, 13, 10, 4, 3, 2, 1, 16, 17, 19]}
{"candidates": ["Tigers manager A.J. Hinch expressed belief in the team's momentum and accomplishments.", "Rays manager Kevin Cash commented on the Tigers' momentum and the Rays' need to sweep their season-ending series against the Red Sox.", "Rookie Colt Keith expressed love for the team and their current energy.", "Bally Sports Detroit play-by-play announcer Jason Benetti delivered an iconic call as the game went final.", "The Tigers have won 30 of their last 39 games, significantly improving their standings.", "Detroit is currently tied with the Kansas City Royals for the second AL Wild Card spot."], "ranking": [5, 4, 3, 2, 6, 1]}
{"candidates": ["Jackson Jobe expressed his happiness and surprise at being called up for his MLB debut, stating it was a special moment.", "Jobe mentioned that he felt more nervous warming up in the bullpen than pitching in the game.", "Jobe appreciated the fans' support and chanting during his debut."], "ranking": [2, 3, 1]}
{"candidates": ["The game was held at Comerica Park with an attendance of 27,867.", "The game lasted 2 hours and 23 minutes.", "Umpires for the game were Brian O'Nora (Home Plate), Brennan Miller (First Base), Chris Conroy (Second Base), and Shane Livensparger (Third Base).", "Detroit's magic number to clinch a playoff spot is now two.", "FanGraphs gives the Tigers a 96.6% chance of reaching the postseason.", "The Tigers’ magic number is now one. This means the Tigers just need to win one more game, or have the Minnesota Twins lose one more, to reach the postseason."], "ranking": [6, 5, 4, 3, 2, 1]}
{"candidates": ["Jackson Jobe was called up from the minor leagues to join the Detroit Tigers' bullpen for the rest of the 2024 season, including the postseason.", "Jobe is expected to be in the Opening Day starting rotation in 2025.", "Jobe's journey to the MLB included a hype video played on the scoreboard detailing his progress through high school and the minor leagues."], "ranking": [2, 3, 1]}
{"candidates": ["Cade Smith set a Division Series relief record with 12 strikeouts by a reliever.", "Parker Meadows tied Charlie Gehringer for the longest hitting streak to start a postseason career in Tigers history with hits in all seven postseason games.", "It was Cleveland’s first appearance in the ALCS since 2016.", "It was the 10th winner-take-all game in franchise history and their first victory in such a game since beating the Yankees in Game 5 of the 1997 ALDS.", "Lane Thomas' grand slam was the first postseason grand slam by a Cleveland player since Francisco Lindor in Game 2 of the ALDS in 2017.", "Steven Kwan tied Kenny Lofton for the longest postseason hitting streak in Cleveland history with 10 games.", "Steven Kwan is just the third player in history to have three consecutive three-hit postseason games, joining Tim Anderson and Hall of Famer Lou Brock.", "Cade Smith's 12 strikeouts in 6 1/3 innings are the most in a league division series.", "Parker Meadows tied Tigers legend Charlie Gehringer with a seven-game hit streak to start his postseason career, the longest in team history."], "ranking": [1, 3, 8, 6, 5, 4, 2, 7, 9]}
{"candidates": ["Tigers fans once again set postseason game attendance record at Comerica Park", "The win snapped a string of 11 straight losses by Cleveland in elimination games dating back to Game 6 of the 1997 World Series."], "ranking": [2, 1]}
{"candidates": ["Lane Thomas hit a grand slam off Tigers ace Tarik Skubal in the fifth inning.", "Jose Ramirez was hit by a 99.9 mph fastball to force in the game-tying run.", "Hunter Gaddis struck out Kerry Carpenter to escape a bases-loaded jam in the sixth inning.", "Colt Keith doubled home Riley Greene in the seventh inning to cut the lead to two runs.", "Eli Morgan struck out Wenceel Perez and Spencer Torkelson to strand Colt Keith at second base in the seventh inning.", "Lane Thomas hit a grand slam in the fifth inning.", "Steven Kwan had another three-hit game.", "Emmanuel Clase secured a two-inning save.", "Andres Gimenez hit a leadoff single to start the fifth inning rally.", "Jose Ramirez was hit by a pitch to bring in a run and tie the score.", "Jake Rogers and Colt Keith added RBI hits for the Tigers.", "Brayan Rocchio scored a run in the eighth inning.", "Eli Morgan stopped a Tigers rally with consecutive strikeouts.", "Matthew Boyd struck out five batters in two innings.", "Cade Smith pitched 1 2/3 scoreless innings.", "Lane Thomas hit a grand slam off Tarik Skubal in the bottom of the fifth inning.", "David Fry hit a home run in Game 4.", "Spencer Torkelson hit two doubles in the game.", "Kerry Carpenter hit an RBI double off the base of the right field wall.", "Jake Rogers hit a line drive single to right field to score Spencer Torkelson.", "Colt Keith hit an RBI double off the wall in straightaway center field.", "Bryan Rocchio hit an RBI single in the bottom of the eighth inning.", "Thomas hit a grand slam off Skubal, contributing significantly to the Guardians' victory.", "Ramírez was hit by a pitch, allowing Giménez to score and tying the game.", "Thomas reached on an infield single, allowing Kwan to score.", "Rocchio singled to center, allowing Giménez to score.", "Lane Thomas hit a grand slam off Tarik Skubal in the fifth inning.", "Hunter Gaddis struck out Kerry Carpenter with bases loaded in the sixth inning.", "Eli Morgan struck out both batters he faced in the seventh inning.", "Emmanuel Clase got the final six outs to secure the win.", "The Guardians evened the series with a tense, come-from-behind, 5-4 victory at Comerica Park.", "Game 5 was moved up to 1 p.m. ET due to the threat of inclement weather.", "Tarik Skubal has a 24-inning scoreless streak dating back to the regular season.", "David Fry hit the go-ahead two-run homer in the seventh inning of Game 4.", "Lane Thomas hit a grand slam off Detroit ace Tarik Skubal in the fifth inning.", "Emmanuel Clase struck out Kerry Carpenter to end the eighth inning.", "Hunter Gaddis struck out Kerry Carpenter with bases loaded in the sixth inning.", "Eli Morgan struck out two batters in the seventh inning.", "Emmanuel Clase got the final six outs to secure the win."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39]}
{"candidates": ["Tigers eliminated from playoffs after 7-3 loss to Guardians in game 5", "Fry's 2-run homer, squeeze bunt lead Guardians over Tigers win and force Game 5", "Tigers blank Guardians with clutch hitting, strong pitching, taking series lead", "Carpenter's 3-run homer off Clase sends Tigers to win over Guardians in Game 2", "Guardians’ pinch hitter David Fry blasted a 2-run home run in the seventh inning to put Cleveland in front for good as the Guardians won the game 5-4.", "Kerry Carpenter hit a three-run homer to win Game 2.", "Kerry Carpenter got hurt while rounding third and scoring in the sixth inning on Thursday night.", "The Guardians rallied to win 5-4 and even the back-and-forth series."], "ranking": [8, 5, 3, 6, 2, 4, 1, 7]}
{"candidates": ["Tigers manager A.J. Hinch expressed pride in his team's effort and determination.", "Hinch mentioned that the loss would serve as motivation for the next season.", "Jake Rogers praised Tarik Skubal's performance despite the loss.", "Kerry Carpenter expressed his determination to contribute to the team despite his injury.", "Hinch highlighted the bullpen's performance, particularly Cade Smith, Hunter Gaddis, and Emmanuel Clase.", "Stephen Vogt expressed pride in the team's resilience and belief.", "Vogt praised the Tigers and acknowledged the competitive nature of the series.", "Vogt highlighted Lane Thomas' grand slam as a pivotal moment.", "The Guardians will face the Yankees in Game 1 of the ALCS.", "The Tigers will head home after a very successful season and the most shocking and exciting stretch drive in team history.", "Scott Harris' job is to bolster the rotation and find more power in the lineup for 2025.", "The Tigers' clutch magic over the last 10 weeks has been incredible.", "The future looks very bright for the Detroit Tigers.", "Congrats to the Cleveland Guardians. Hopefully this is the beginning of a great rivalry between the two squads.", "The Cleveland Guardians celebrated their victory by making a semi-circle in the middle of their clubhouse and emptying champagne and beer bottles on each other as 'Rocky Top' blasted through the speakers.", "The Guardians are on their way to the ALCS for the first time since 2016.", "The Tigers had their late-season push end in disappointment after going 31-13 post-August 11 to earn a postseason berth.", "Tigers manager A.J. Hinch expressed the significance of the elimination game.", "Guardians catcher Austin Hedges commented on the excitement and exhaustion of the postseason.", "José Ramírez expressed the team's desire to win for the city.", "Stephen Vogt reflected on the team's resilience and approach throughout the season.", "Emmanuel Clase expressed confidence in his ability to perform in high-pressure moments.", "Detroit manager A.J. Hinch expressed heartbreak over the season's abrupt end."], "ranking": [14, 18, 10, 16, 12, 11, 13, 9, 20, 1, 7, 5, 4, 3, 2, 15, 6, 8, 19, 17, 21, 22, 23]}
{"candidates": ["Tigers fans sad but optimistic leaving ALDS Game 4 loss at home", "Fans filled with emotion as Tigers win first home playoff game in over 10 years", "Hinch said his focus was only on finding a way to advance.", "Tigers catcher Jake Rogers said he was sore but otherwise fine after being hit with two foul balls on the left hand in Thursday's game."], "ranking": [3, 1, 4, 2]}
{"candidates": ["The Tigers made their first playoff berth in 10 years.", "The Guardians will advance to play the New York Yankees in the American League Championship Series.", "The Tigers missed a chance to make their eighth appearance in the ALCS since the divisional format was created in 1969.", "The Guardians and Tigers played each other 18 times this year, with the Guardians winning 10 of those games.", "The Guardians hit.234 with 19 runs and four homers in the ALDS, while the Tigers hit.214 with 13 runs and two homers.", "The Tigers had a chance to eliminate the Guardians in Game 4, but the Guardians rallied for a 5-4 win to send the series back to Cleveland.", "The Guardians advanced to the ALCS to take on the New York Yankees.", "The Tigers hit three balls off the wall in the game.", "The Guardians held off some late threats to win 7-3.", "The Tigers had plenty of baserunners but couldn't get those seeing-eye ground balls.", "The game was held at Progressive Field in Cleveland, Ohio, with an attendance of 34,105.", "The game lasted 3 hours and 8 minutes.", "The Guardians won the tough AL Central under first-year manager Stephen Vogt.", "The Tigers swept the Houston Astros in the wild-card round before meeting Cleveland in the postseason for the first time after more than 2,300 games between the franchises.", "The winner will advance to face the Yankees in the ALCS beginning Monday night in the Bronx.", "Kerry Carpenter was not in the starting lineup for Game 5 due to a left hamstring injury.", "Tyler Freeman was replaced on the roster by Angel Martinez due to a strained left oblique.", "The Guardians celebrated their victory with champagne and beer in the clubhouse.", "The Guardians' bullpen, known for its strength, showed some wear and tear but managed to secure the win.", "The Guardians will face the New York Yankees in the AL Championship Series."], "ranking": [10, 2, 8, 14, 12, 4, 3, 16, 6, 15, 18, 19, 5, 9, 1, 11, 13, 7, 17, 20]}
{"candidates": ["Construction underway on premium 'Home Plate Club' Comerica Park; see renderings", "Tigers: Detroit upset the Houston Astros in the Wild Card round winning two straight in Texas. Prior to this season, the Tigers last qualified for the playoffs in 2014. They have won the World Series in 1935, 1945, 1968, and 1984.", "Guardians: Cleveland has an all-time record of 62-60. They have appeared in the World Series 6 times – 1920, 1948, 1954,1995, 1997, and 2016 – and lost 6 times.", "If the Tigers have to replace Carpenter on their roster, he would be ineligible if the team advances to play the New York Yankees in the ALCS."], "ranking": [4, 2, 1, 3]}
{"candidates": ["Logan Driscoll hit his first career homer, a two-run shot."], "ranking": [1]}
{"candidates": ["Tanner Bibee gave up a two-run homer in the third and a solo shot in the fourth inning.", "Bibee ended his day having given up three runs in six innings with no walks and nine strikeouts.", "Steven Kwan was scratched from the lineup due to back soreness.", "Zack Littell tossed six scoreless innings without issuing a walk.", "David Fry had a pinch-hit RBI double in the eighth inning.", "Zack Littell shut down Cleveland for six innings.", "Jhonkensy Noel and David Fry hit back-to-back doubles in the eighth inning.", "Edwin Uceta worked a 1-2-3 ninth for his third save.", "Jonathan Aranda homered for the Rays.", "Jose Siri narrowly missed a homer with a blast to center field that hit the yellow line marking the top of the wall."], "ranking": [8, 5, 10, 2, 6, 3, 4, 9, 1, 7]}
{"candidates": ["Gavin Williams allowed three runs in 5 1/3 innings.", "Brandon Lowe hit a home run off Gavin Williams.", "Lane Thomas hit an RBI double for the Guardians.", "Tampa Bay Rays took the lead with a walk, a double, a sacrifice fly, and an RBI single in the fourth inning."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The Cleveland Guardians will face the Tampa Bay Rays in MLB action at Progressive Field on Friday, starting at 9:15am AEST.", "Gavin Williams (3-8, 5.25 ERA) will start for the Guardians, pitting him against Ryan Pepiot (8-6, 3.66 ERA) for the Rays.", "Stats Insider's independent predictive analytics model gives the Guardians a 58% chance of defeating the Rays at Progressive Field.", "The Guardians are listed as 1.5-run favourites against the Rays, with odds of $2.50 available at TAB.", "According to Stats Insider's analytics model, the Rays (+1.5) are predicted to cover the line 62% of the time, while the 7.5-run over/under is expected to go over 55% of the time."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Guardians manager Stephen Vogt commented on the Rays' pitching, stating, 'They know how to pitch, and they've kept us off balance.'", "Vogt praised Bibee's performance, saying, 'He did his job tonight, and he battled through it.'", "David Fry acknowledged the Rays' pitching, saying, 'Give them credit, they’ve pitched well the last couple of days and their bullpen's really good for a reason.'", "Vogt reflected on the upcoming games, stating, 'We've got our work cut out for us the next two days, but we're going to do what we do every day, show up ready to play and go out and give it our best.'"], "ranking": [3, 2, 1, 4]}
{"candidates": ["Guardians manager Stephen Vogt commented on Gavin Williams' performance, noting his struggle with consistency but acknowledging his effort to get through 5 1/3 innings.", "Gavin Williams reflected on his performance, mentioning adjustments made from his previous start."], "ranking": [1, 2]}
{"candidates": ["The Guardians' AL Central lead shrinks with their second straight loss to the Rays.", "Kansas City sits just three games back of Cleveland in the American League Central with 14 games remaining in the regular season.", "Cleveland’s bats were held to just four hits in the game.", "Cleveland's loss coupled with Kansas City's win reduced the Guardians' division lead to three games.", "The Guardians played without All-Star left fielder Steven Kwan, who was scratched from the starting lineup due to 'body fatigue'.", "Rays' LF Christoper Morel was replaced after hitting a single in the third inning due to right Achilles tendon discomfort."], "ranking": [5, 3, 2, 6, 4, 1]}
{"candidates": ["Miami matched a season high with 12 runs and set a season high with 18 hits.", "Ezequiel Tovar became the first Rockies player with 40 or more doubles since Charlie Blackmon hit 42 in 2019. Tovar is just the second Colorado shortstop to hit 40 doubles, joining Trevor Story, who hit 42 in 2018."], "ranking": [1, 2]}
{"candidates": ["Brendan Rodgers' big two-homer game", "Brenton Doyle's solo home run (22) in the bottom of the 3rd inning, giving the Rockies a 1-0 lead with 2 outs.", "Jesús Sánchez knocked the go-ahead ninth-inning homer in the Marlins’ 9-8 comeback victory over the Rockies on Tuesday night.", "Derek Hill had three hits and the second two-homer game of his career.", "Kyle Stowers had three hits and four RBI.", "J. Tinoco earned the win with 2.1 innings pitched, allowing 2 hits, 0 earned runs, 3 strikeouts, and 0 walks.", "B. Blalock took the loss with 4.0 innings pitched, allowing 9 hits, 6 earned runs, 3 strikeouts, and 1 walk.", "Kyle Stowers drove in a game-high four on three RBI knocks.", "Derek Hill homered twice.", "Hill got the scoring started by rocketing an elevated four-seamer from right-hander Bradley Blalock over the center-field wall.", "Hill struck again in the sixth, jumping a first-pitch, middle-middle cutter from righty Noah Davis for a two-run homer.", "Stowers capped the game’s scoring with a two-out RBI single in the ninth.", "Brenton Doyle finished a triple short of the cycle, hitting a double in the second, a solo homer in the third, and an RBI single in the sixth.", "Brendan Rodgers hit solo homers in the third and fourth innings and added an infield single in the sixth. It was the second multi-homer game of Rodgers’ career.", "Rookie catcher Drew Romo hit a two-run double off the right-field fence in Colorado’s four-run fourth.", "Derek Hill led Miami’s parade, going 3-for-6 with two homers and three RBIs as the Marlins recorded a season-high 18 hits."], "ranking": [12, 8, 1, 6, 5, 15, 16, 4, 10, 3, 9, 2, 11, 7, 14, 13]}
{"candidates": ["Max Meyer recorded 18 swings and misses, second-most for him this season.", "Meyer notched more whiffs with his changeup than his four-seamer (five vs. three) and allowed no hits among the five base knocks.", "Meyer’s six strikeouts were his most since Aug. 1, which was five starts ago.", "Meyer walked a season-high four batters, two of which came around to score.", "The defense behind Meyer committed four errors for the first time in a game since Sept. 2, 2021.", "Aaron Schunk hit his first career homer to left field, turning on Meyer’s mislocated fastball for a solo shot.", "The Rockies opened the sixth with a single and a walk to chase Meyer at 96 pitches. Two inherited runners scored to skew his final line (five-plus innings, five runs, four earned runs)."], "ranking": [3, 2, 5, 6, 4, 1, 7]}
{"candidates": ["The Colorado Rockies will face the Miami Marlins in MLB action at Coors Field on Thursday, beginning at 10:40am AEST.", "The Rockies will have Kyle Freeland (3-6, 5.70 ERA) start, while the Marlins will counter with Max Meyer (3-3, 5.24 ERA).", "Stats Insider's predictive analytics model gives the Rockies a 55% chance of beating the Marlins at Coors Field.", "The Rockies are 1.5-run favourites against the Marlins, with odds of $2.42 available at TAB.", "For the underdog Marlins (+1.5) to cover the line, TAB offers odds of $1.58.", "The over/under for total runs scored is set at 10.833 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Marlins (+1.5) are predicted to cover the line 62% of the time, while the 10.833-run over/under is expected to stay under 53% of the time.", "The Colorado Rockies (49-84) host the Miami Marlins (48-84) at Coors Field on Thursday, August 29, 2024.", "The moneyline on this matchup has the Marlins at +109 and the Rockies are priced at -131.", "The pitchers who are expected to start are Valente Bellozo for the Marlins and Bradley Blalock for the Rockies.", "As a team, the Miami Marlins are recording 3.7 runs per outing, which has them sitting at 29th in MLB.", "The Marlins have a team OBP of.296 and have hit 122 home runs this season.", "The Marlins pitching staff has a collective WHIP of 1.39 and a team ERA of 4.72, ranking 28th in MLB.", "The Marlins bullpen has a save percentage of 52.1% and has entered the game in 110 save situations.", "The Colorado Rockies have an OBP of.306 and a batting average of.244 this season.", "The Rockies have hit 145 home runs and have a team slugging percentage of.400.", "The Rockies pitching staff has a team ERA of 5.53, ranking 30th in MLB.", "The Rockies bullpen has a save percentage of 55.6% and has entered the game in 54 save chances."], "ranking": [15, 12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 11, 13, 14, 1, 16, 17, 18]}
{"candidates": ["Kyle Stowers: 'Now that being said, the expectation from Day 1 was to perform for myself. So I don't want to act like that's an excuse, but I'm feeling settled now.'", "Derek Hill: 'I could kind of tell early in the day, when we got here and got into the cage and whatnot, that everybody was just kind of dialed in and ready to go out there and compete. And whenever we go out there and compete and stick to our game plan, we do some fun things.'", "Skip Schumaker: 'He's swinging at strikes. When he swings at strikes, he hits the ball really hard the other way, up the middle. He's got pull-side power when he wants it. He's a good overall hitter. It's just when he's in the strike zone. I could say that about 100 different guys in the Major Leagues. Still a young guy in this league, still trying to figure out the league as well. The league adjusted. He adjusted. So that means that he's a really good athlete, because he adjusted to the league.'", "Brendan Rodgers commented, 'It was good to have yesterday off and get a little rest. I put some good swings on the ball.'", "Bradley Blalock reflected, 'We had a plan coming in, but it didn’t fall our way. But props to their hitters. I just have to be better next time.'", "Manager Bud Black stated, '(Blalock) wasn’t quite sharp. He’s learning through these first few handful of starts about the difference between facing major league hitters and minor league hitters and the importance of every pitch counting. Not throwing a good pitch and then a poor one. The consistency of quality pitches is something that he has to continue to focus on, and it will be his challenge as a major league starting pitcher.'"], "ranking": [3, 5, 1, 4, 2, 6]}
{"candidates": ["Marlins manager Skip Schumaker commented on the game, stating that the walks and the defense were the reasons for the loss.", "Schumaker noted that Meyer’s slider had a lot more swing and miss, and his fastball command was better in the first four innings.", "Meyer acknowledged being frustrated with his inconsistent performance, noting that he is used to succeeding and believes he will be very dominant once he gains 100% confidence."], "ranking": [2, 3, 1]}
{"candidates": ["The game was held at Coors Field in Denver, Colorado with an attendance of 20,949.", "The game lasted 2 hours and 58 minutes.", "Miami reliever Jesus Tinoco pitched 2 1/3 innings and picked up his first career victory. Tinoco was part of the Rockies’ 2015 trade, sending star shortstop Troy Tulowitzki to Toronto."], "ranking": [2, 3, 1]}
{"candidates": ["Paul Goldschmidt passes Joe DiMaggio on the all-time HR list with his 22nd home run of the season", "Charlie Blackmon ties Carlos González for 5th on the Rockies' all-time home run list with his 227th home run", "Ezequiel Tovar's NL-leading 45th double of the season", "Charlie Blackmon's 227th career home run, tying Carlos Gonzalez for fifth in franchise history", "Ezequiel Tovar hit his NL-leading 45th double to tie the game.", "Charlie Blackmon reached 800 career RBIs and tied with Carlos Gonzalez for fifth in club history with 227 career homers.", "Ryan Helsley tied the franchise record for most single-season saves with his 48th save of the season, matching Trevor Rosenthal's 2015 performance."], "ranking": [7, 5, 3, 4, 2, 6, 1]}
{"candidates": ["Ryan Helsley tied the franchise record for saves with his 48th save of the season, equaling the mark set by Trevor Rosenthal in 2015.", "Helsley set club records for consecutive saves (31) and saves before the All-Star break (32).", "Helsley did not blow a save at Busch Stadium all season, going 27 for 27 at home."], "ranking": [2, 1, 3]}
{"candidates": ["Ryan Helsley secured the Cardinals' 5-2 victory over the Rockies with a one-pitch save.", "Helsley induced a 107.1 mph grounder from Colorado’s Sam Hilliard and started a double play to end the game.", "Brenton Doyle hit a solo homer and Michael Toglia drew a one-out walk in the ninth inning, prompting Helsley's entry into the game."], "ranking": [2, 1, 3]}
{"candidates": ["Alec Burleson and the St. Louis Cardinals will try to beat Kyle Freeland, the Colorado Rockies' starting pitcher.", "The favored Cardinals have -129 moneyline odds to win against the underdog Rockies, who are listed at +109.", "St. Louis is favored on the run line (-1.5 with +121 odds).", "The over/under is 10.5 runs for this contest (with -105 odds to go over and -115 odds to go under).", "Score Prediction: Cardinals 6, Rockies 5", "Total Prediction: Under 10.5 runs", "Win Probabilities: Cardinals 51%, Rockies 49%"], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Charlie Blackmon expressed his thoughts on the game, stating, 'I think you just never know what's going to happen at Coors Field. I told the guys that was a Coors Field grinder. We've seen that game before, over and over. You've got to make sure you never quit. You never know what could happen.'", "Charlie Blackmon mentioned his desire to enjoy his last three games, saying, 'I think I'd like to be able to enjoy this, these last three games. I don't have any goals except for the fact I want to remember as much as I can and enjoy it.'", "Charlie Blackmon expressed his desire to enjoy his final games", "Ryan McMahon discussed the team's goal to avoid a 100-loss season", "Cardinals manager Oliver Marmol reflected on the loss and praised Ryan Fernandez's performance throughout the year", "Charlie Blackmon expressed mixed emotions about his impending retirement, stating he will cherish the weekend but also feel sad.", "Ryan McMahon highlighted the team's goal to avoid a 100-loss season.", "Kyle Freeland reflected on his season, expressing satisfaction with his performance after returning from injury.", "The loss snapped a four-game winning streak for the Cardinals.", "Goldschmidt took over the team lead with his 22nd home run of the season. He had been tied with Alec Burleson, who has not hit a home run since Aug. 17, a span of 120 at-bats.", "The Cardinals were trying to sweep a series in Colorado for the first time since 2004.", "They also were trying to match their season-high five-game winning streak, set from May 20-26.", "Cardinals relievers combined had allowed only one run over six innings in the first two games of the series.", "This was the third time this season the Cardinals lost a game despite scoring eight or more runs (15-3 in those games)."], "ranking": [1, 2, 6, 5, 4, 3, 5, 8, 10, 7, 9, 11, 12, 13]}
{"candidates": ["Ryan Helsley expressed pride in being part of a storied franchise and being mentioned among the top number of saves in franchise history.", "Helsley reflected on his desire for the Cardinals to be playoff-bound instead of eliminated from postseason contention.", "Cardinals manager Oliver Marmol praised Helsley's hard work and availability throughout the season.", "Pedro Pagés highlighted Helsley's consistency and dominance throughout the 2024 season."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The Rockies need to win two out of three games against the Los Angeles Dodgers to avoid their second 100-loss season", "The loss snapped a four-game win streak for the Cardinals", "Charlie Blackmon's father threw out the ceremonial first pitch", "The game was played at Coors Field in Denver.", "The Rockies need to take two of three from the Dodgers to avoid 100 losses this season.", "Charlie Blackmon's father, Myron, threw out the first pitch on Thursday.", "Fireworks themed in Blackmon's honor were planned for Friday, a No. 19 jersey shirt giveaway for Saturday, and an honorary pregame ceremony for Sunday."], "ranking": [7, 5, 3, 1, 6, 4, 2]}
{"candidates": ["The Cardinals clinched at least a.500 season with their 81st victory."], "ranking": [1]}
{"candidates": ["Cardinals placed LHP JoJo Romero on the 15-day injured list and recalled RHP Chris Roycroft", "Rockies' RHP Ryan Feltner will start the season finale against the Dodgers", "The Cardinals will close out the season with three games this weekend against the Giants in San Francisco. Miles Mikolas is scheduled to start the opener on Friday night."], "ranking": [3, 2, 1]}
{"candidates": ["Kerry Carpenter hit a three-run homer in the ninth inning off All-Star closer Emmanuel Clase for a 3-0 victory against the AL Central champions.", "Detroit used seven pitchers to eliminate AL West champion Houston to finish a two-game wild card sweep for its first postseason series win since 2013.", "The Detroit Tigers defeated the Cleveland Guardians 3-0 in Game 2 on Monday, evening their American League Division Series 1-1.", "Kerry Carpenter hit a three-run homer off Cleveland closer Emmanuel Clase with two outs in the top of the ninth inning, giving Detroit the 3-0 win.", "Steven Kwan made a spectacular diving catch in a clutch situation to keep the scores tied in their American League Division Series clash against the Detroit Tigers.", "The scores remained tied 0-0 at the start of the eighth inning in Game 2 of the ALDS between the Detroit Tigers and Cleveland Guardians.", "Right-handed reliever Hunter Gaddis gave up a double to Matt Vierling before getting the second out of the inning and handing an intentional walk to Riley Greene before exiting the game.", "Wenceel Perez struck a line drive out to left field, but Steven Kwan made a diving catch just before the ball hit the ground to prevent a go-ahead run.", "The Tigers challenged the decision, but the Guardians retained the on-field decision after a video review.", "Kerry Carpenter hit a three-run homer off Emmanuel Clase in the ninth inning to help the Tigers beat the Guardians 3-0 and level the ALDS at one win apiece.", "Tarik Skubal was dominant as the Tigers took game two in Cleveland, 3-0.", "Kerry Carpenter hit a rare hanging slider from Emmanuel Clase into the Progressive Field seats in right field.", "Jose Ramirez went hitless with two strikeouts.", "The lefty masher lineup rolled out by manager Stephen Vogt could not solve Skubal for seven innings.", "Will Vest and Beau Briske successfully pitched in relief for the Tigers.", "Matthew Boyd and the Guardians bullpen performed well until Clase entered to close out the 8th inning.", "Steven Kwan made a crucial play with his glove to help close out the 8th inning.", "Jhonkensy Noel made a crucial defensive play in the fifth inning by cutting off a potential double and throwing to second base, inspired by Steven Kwan's defensive techniques."], "ranking": [1, 2, 3, 4, 5, 14, 15, 16, 17, 6, 7, 8, 9, 10, 11, 12, 13, 18]}
{"candidates": ["Javier Báez surprised his Detroit Tigers teammates by walking into the Progressive Field clubhouse before Game 2 of the ALDS in Cleveland.", "Detroit Tigers won a dramatic 3-0 victory over Cleveland in Game 2 of the ALDS."], "ranking": [2, 1]}
{"candidates": ["Tigers manager A.J. Hinch plans to use many pitchers for an inning or so Wednesday as he has twice in the playoffs and in a slew of games in the regular season.", "Hinch did not announce who will start for Detroit, but said he intended to inform the Guardians by the end of their workout Tuesday.", "The Guardians have a player making a long-awaited return to the postseason. Alex Cobb last appeared in the playoffs in 2013 when he started two games for Tampa Bay, a wild-card win against Cleveland and a Division Series loss to Boston.", "The article mentioned the importance of not letting Riley Greene and Kerry Carpenter beat the Guardians."], "ranking": [3, 2, 1, 4]}
{"candidates": ["Javier Báez, despite being out for the season due to injury, made an effort to join his team, which boosted team morale.", "Tigers manager A.J. Hinch discussed the uncertainty of the pitching lineup for Game 3, indicating strategic planning and flexibility."], "ranking": [1, 2]}
{"candidates": ["Tigers president of baseball operations Scott Harris expressed excitement about the return of playoff baseball to Detroit and the impact of the fans.", "Alex Cobb reflected on his long journey back to the postseason and expressed confidence in his team's defense and bullpen.", "The author expressed concern about Emmanuel Clase's performance in colder weather.", "The author noted that the Guardians will need more from their lineup to win future games.", "The author reflected on the well-played game against two very good teams and the unpredictable nature of baseball playoffs.", "Guardians manager Stephen Vogt praised Noel's play and highlighted the influence of Steven Kwan's defensive skills on the team.", "Steven Kwan expressed humility and pride in Noel's execution of the play, noting the difficulty of throwing into the sun."], "ranking": [5, 4, 3, 2, 7, 6, 1]}
{"candidates": ["Tigers manager A.J. Hinch expressed the importance of Báez's presence for the team's morale and experience.", "Cleveland's Steven Kwan commented on the challenge of facing multiple new pitchers, describing it as 'pitching chaos'."], "ranking": [2, 1]}
{"candidates": ["The Motor City has not hosted a playoff baseball game in a decade.", "Detroit tied the series Monday with a 3-0 victory against the AL Central champions.", "The Royals beat the Yankees, tying every division series at 1-1."], "ranking": [2, 1, 3]}
{"candidates": ["Riley Greene hit a home run on a 2-2 count against Colorado starter Tanner Gordon.", "Kerry Carpenter hit a triple that scored Matt Vierling."], "ranking": [1, 2]}
{"candidates": ["The Detroit Tigers (74-71) will take on the Colorado Rockies (54-91) on Thursday, September 12, 2024, at Comerica Park in Detroit, MI.", "The starting pitchers will be Ryan Feltner for the Rockies and Tarik Skubal for the Tigers.", "The odds on this game have Colorado at +152 while Detroit is coming in at -184.", "The total is set at O8.5.", "Colorado has a slugging rate of.397 and has been called out on strikes 1,434 times, while being walked on 404 occasions.", "The Rockies have accumulated 246 doubles as a squad and have hit 157 home runs.", "The Rockies have a team ERA of 5.44 this year, which is 30th in baseball.", "The Detroit Tigers have a team slugging percentage of.387 and they score 4.27 runs per contest, ranking 17th in MLB.", "Detroit's pitching staff has given up 586 runs on the season while having an ERA of 3.66, ranking 6th in the league."], "ranking": [8, 6, 5, 4, 3, 2, 9, 1, 7]}
{"candidates": ["Jacob Stallings commented on the end of an 11-day road trip and facing the likely AL Cy Young winner.", "Rockies manager Bud Black praised the win against a strong team and acknowledged Skubal's performance.", "Tigers manager A.J. Hinch noted the team's offensive struggles and praised Ryan Feltner's performance.", "Spencer Torkelson expressed disappointment in the loss and determination to come back stronger.", "Tarik Skubal mentioned that his hand was a little sore but he was not too worried about it.", "Skubal and the team decided it was smart not to come out for the seventh inning due to discomfort in catching the ball.", "Tarik Skubal expressed disappointment in his performance despite keeping the team in the game.", "Spencer Torkelson reflected on the loss, stating that all losses are tough and the team needs to come back ready to go."], "ranking": [5, 2, 3, 1, 8, 6, 4, 7]}
{"candidates": ["The game was held at Comerica Park, Detroit, Michigan with an attendance of 19,538.", "The game lasted 2 hours and 33 minutes.", "Umpires for the game were Alfonso Marquez (Home Plate), Lance Barrett (First Base), Jeremy Riggs (Second Base), and Mark Ripperger (Third Base).", "Tigers pitcher Tarik Skubal was hit in the right hand by a line drive but continued to play after being checked by the training staff.", "Rockies manager Bud Black was ejected by home-plate umpire Alfonso Marquez after Spencer Torkelson's at-bat."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["The regular season finale between the Guardians and Houston Astros was canceled after a lengthy delay due to rain.", "Cleveland third baseman José Ramírez was prevented from a shot at hitting his 40th home run and joining the exclusive 40-40 club.", "Ramírez finished with 39 homers, leaving him one short of becoming the seventh player in MLB history to hit 40 homers and steal 40 bases in the same season."], "ranking": [3, 2, 1]}
{"candidates": ["The Guardians have won eight of their last nine day games against AL West opponents.", "The Astros have lost each of their last three day games after playing the previous day.", "The Guardians have covered the run line in each of their last eight Sunday day games against the Astros.", "The Astros have failed to cover the run line in four of their last five games against American League opponents after playing the previous day.", "The Cleveland Guardians will square off with the Houston Astros in Game 2 of the American League Division Series at Progressive Field on Sunday, commencing at 8:10am AEST.", "The Guardians will have Ben Lively (13-9, 3.80 ERA) start, while the Astros are going with Justin Verlander (4-6, 5.55 ERA).", "Stats Insider's predictive analytics model currently gives the Guardians a 54% chance of winning against the Astros at Progressive Field.", "The Guardians are 1.5-run favourites against the Astros, with odds of $2.50 available at TAB.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under."], "ranking": [3, 2, 1, 4, 9, 8, 6, 5, 7]}
{"candidates": ["Guardians manager Stephen Vogt expressed concerns over player safety due to the field conditions.", "Vogt reflected on José Ramírez's remarkable season despite missing the 40-40 milestone by one home run.", "Vogt highlighted the Guardians' significant improvement in standings and attendance compared to the previous season.", "Stephen Vogt reflected on José Ramírez's season, noting several near-miss home runs and praising his consistent performance and example for young players.", "José Ramírez expressed determination to achieve the 40-40-40 milestone next year despite the cancellation of Game 162.", "Guardians manager Stephen Vogt reflected on Ramírez's impressive season and his near 40-40-40 achievement."], "ranking": [5, 2, 6, 1, 3, 4]}
{"candidates": ["The game was called following a 3-hour, 5-minute delay due to continuous rain.", "The Guardians finished the season at 92-69 and will host Game 1 of the ALDS on Oct. 5.", "The Astros, with a record of 88-73, are set to open their AL wild-card series at home on Tuesday.", "Astros' LF Yordan Alvarez is scheduled to take batting practice on Monday as he recovers from a knee sprain.", "Guardians' RHP Alex Cobb is preparing to pitch in the postseason after recovering from a middle finger blister.", "The Cleveland Guardians-Houston Astros series finale was canceled due to rain.", "Rain has been a key factor in this series since game one on Friday night.", "Both the Guardians and Astros are locked into their playoff positions.", "Cleveland will be the second seed in the American League and will have home-field advantage in the ALDS, while Houston is the third seed and will host the Detroit Tigers in the ALWS.", "Jose Ramirez will not have the chance to become the seventh player in MLB history to record a 40/40 season (40 stolen bases and 40 home runs).", "The regular season finale between the Guardians and Houston Astros was cancelled due to rain, preventing Cleveland third baseman José Ramírez from a shot at hitting his 40th home run and joining the exclusive 40-40 club.", "The regular season finale between the Guardians and Houston Astros was canceled Sunday after a lengthy delay, preventing Cleveland third baseman José Ramírez from a shot at hitting his 40th home run and joining the exclusive 40-40 club.", "Cleveland's jump in the standings after winning 76 games in 2023 led to a bump in attendance as the Guardians drew more than 2 million fans at home for the first time since 2017.", "The game between the Cleveland Guardians and Houston Astros on September 29, 2024, was canceled due to inclement weather.", "José Ramírez was denied the opportunity to become Cleveland’s first 40/40/40 hitter due to the game cancellation.", "The next game for the Cleveland Guardians will be on October 5 in Game 1 of the American League Division Series.", "The Houston Astros must advance past Detroit in the AL Wild Card series to potentially face the Guardians again.", "Managers from both clubs and MLB officials decided to cancel the game after a three-hour delay due to safety concerns.", "Ticketholders for the canceled game will receive a credit amount for their tickets that can be used towards a 2024 postseason game or a 2025 regular season game.", "The game was ultimately canceled due to persistent rainy conditions in northeast Ohio.", "The final game of the regular season between the Cleveland Guardians and Houston Astros was canceled due to inclement weather and field conditions.", "Fans will receive a credit for their tickets that can be used toward a 2024 postseason game or a regular-season contest in 2025.", "The game was not necessary for either team as both had already secured their respective seeds in the AL playoff bracket."], "ranking": [11, 8, 7, 18, 19, 10, 9, 6, 5, 4, 3, 2, 1, 15, 14, 13, 12, 16, 17, 20, 21, 22, 23]}
{"candidates": ["Eight of the Astros' last nine road games after playing the previous day have gone UNDER the total runs line.", "Each of the Guardians' last five games have gone UNDER the total runs line.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Guardians' last six home games.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Astros' last five day games against American League opponents."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Astros: LF Yordan Alvarez (knee sprain) was scheduled to do more baseball activities in Houston, and as long as he continues to make progress, it's likely he'll be on the wild card roster.", "Guardians: RHP Alex Cobb (middle finger blister) had his usual velocity during a 35-pitch simulated game. He'll throw another on Thursday and Vogt said the team is moving forward with plans to have him pitch in the postseason."], "ranking": [2, 1]}
{"candidates": ["Jameson Taillon pitched six strong innings to help the Cubs beat the Yankees 2-1.", "Isaac Paredes hit a two-RBI single during the first inning.", "Cubs pitchers held the Yankees to six runs and kept key hitters like Juan Soto, Aaron Judge, Giancarlo Stanton, and Jazz Chisholm Jr. from hitting home runs.", "Jameson Taillon allowed only one run in six innings and the Chicago Cubs beat the New York Yankees 2-1 to avoid a series sweep.", "I. Paredes singled to center, Bellinger scored and Swanson scored, Tauchman to third.", "Volpe hit sacrifice fly to left, Chisholm Jr. scored.", "Gerrit Cole and Jameson Taillon engaged in a pitching duel, each tossing six strong innings.", "The Yankees fell to the Cubs, 2-1, at Wrigley Field.", "Isaac Paredes’ two-run first-inning single off Cole held up as the difference.", "Anthony Volpe’s second-inning sacrifice fly was the only run for the Yankees.", "Ian Happ made three nice catches in left field for the Cubs.", "Jameson Taillon dominated the Yankees on Sunday afternoon at Wrigley Field, tossing six innings allowing one run on six hits while striking out six.", "Isaac Paredes hit a two-run single in the first inning, which held up as the difference in a 2-1 victory for the Cubs.", "Jameson Taillon held the Yankees to one run over six innings.", "Nate Pearson and Porter Hodge provided stellar relief to secure the win.", "Jameson Taillon outdueled Gerrit Cole in a well-pitched, 2-1 Chicago Cubs victory over the New York Yankees.", "Taillon allowed just one run in six innings while striking out six and walking one.", "Cole allowed two unearned runs, striking out seven Cubs and walking one, allowing just three hits in six innings.", "I. Paredes singled to center, Bellinger scored and Swanson scored, Tauchman to third in the 1st inning.", "Volpe hit sacrifice fly to left, Chisholm Jr. scored in the 2nd inning."], "ranking": [12, 9, 5, 11, 8, 7, 10, 15, 6, 14, 16, 1, 4, 3, 2, 13, 18, 17, 19, 20]}
{"candidates": ["The New York Yankees have designated right-handers Phil Bickford and Nick Burdi for assignment ahead of their 2-0 win against the Chicago Cubs. These moves were made as part of the team’s late-season roster adjustments.", "The Chicago Cubs will square off with the New York Yankees in MLB action at Wrigley Field on Sunday, starting at 4:20am AEST.", "Javier Assad (7-4, 3.21 ERA) will get the ball for the Cubs, while the Yankees are going with Clarke Schmidt (5-3, 2.52 ERA).", "Stats Insider's predictive analytics model gives the Yankees a 57% chance of beating the Cubs at Wrigley Field.", "The current betting odds in Australia for Sunday's MLB game at Wrigley Field are Cubs $2.20, Yankees $1.67.", "The Cubs are 1.5-run underdogs against the Yankees, with odds of $1.67 available at TAB.", "For the favourite Yankees (-1.5) to cover the line, TAB offers odds of $2.20.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Cubs (+1.5) are predicted to cover the line 57% of the time, while the 7.5-run over/under is expected to go over 54% of the time.", "Stats Insider's Cubs vs Yankees betting tips are based on market-leading modelling and gambling expertise to help you place more informed bets with your chosen online bookie.", "While the Yankees have a higher chance of winning the game, betting on the Cubs to win is our preferred option due to the edge identified when comparing our data-led probabilities to the odds currently on offer.", "The match-up between the Cubs and Yankees at Wrigley Field is scheduled to commence at 4:20am AEST on Sunday.", "The New York Yankees and the Chicago Cubs meet Sunday in MLB action from Wrigley Field.", "This will be the final installment in a three-game series.", "The Yankees played the Texas Rangers in their last series. New York lost two of those three games, but then beat Chicago in their Friday opener.", "On Saturday the Yankees kept it up with a 2-0 shutout win.", "In the Sunday finale the Yankees will send out Gerrit Cole as starter. This year Cole is 6-3 with a 3.65 ERA in 13 starts.", "Chicago Cubs played the Pittsburgh Pirates in their last set. Chicago similarly lost two of those three games.", "On Saturday the Cubs posted four team hits and two errors.", "Chicago got 5.2 innings and one earned run from starter Javier Assad.", "It’ll be Jameson Taillon in the start for the Cubs on Sunday. Over 24 starts this year Taillon is 9-8 with a 3.66 ERA."], "ranking": [16, 14, 18, 10, 12, 11, 13, 15, 9, 8, 7, 6, 5, 4, 3, 2, 1, 20, 19, 17, 21]}
{"candidates": ["Jameson Taillon expressed pride in beating his friend and former teammate Gerrit Cole.", "Isaac Paredes hoped his hit would serve as motivation for the team.", "Gerrit Cole expressed bittersweet feelings about the defeat, noting missed opportunities to bolster their lead in the American League East.", "Jameson Taillon reflected on his friendship with Cole and the significance of their matchup.", "Aaron Boone commented on Gleyber Torres' error that extended the inning.", "Gleyber Torres expressed regret over missing a play that led to the Cubs' runs.", "Cole mentioned his frustration with a pitch to Mike Tauchman that he thought should have been a strikeout.", "Cole described the game as fun competition and looked forward to the next matchup.", "Cubs manager Craig Counsell expressed optimism about Paredes' performance, stating that helping the team win can boost his confidence.", "Jameson Taillon reflected on the challenges Paredes faced adjusting to a new team and environment mid-season.", "Isaac Paredes mentioned that his struggles were due to timing issues and a lack of consistent quality contact.", "Jameson Taillon and Gerrit Cole reflected on their long-standing friendship and mutual respect.", "Taillon emphasized the importance of camaraderie and learning from teammates, inspired by Cole's example.", "Cole highlighted the symbiotic relationship and mutual growth between him and Taillon."], "ranking": [12, 9, 8, 11, 5, 6, 7, 10, 4, 3, 2, 1, 13, 14]}
{"candidates": ["Former pitcher Kerry Wood and former third baseman Aramis Ramírez were inducted into the Cubs Hall of Fame before the game.", "The game was held at Wrigley Field with an attendance of 39,364.", "The game lasted 2 hours and 18 minutes.", "The game coincided with Gerrit Cole’s 34th birthday.", "Cole and Taillon have a long-standing friendship dating back to their time as prospects with the Pirates.", "The game took place on a sunny Sunday at Wrigley Field.", "Sunday marked Gerrit Cole's 34th birthday, and earlier in the week, Taillon and Cole's wife surprised him with a boat trip on Lake Michigan and a nice dinner.", "The game was held at Wrigley Field, Chicago, Illinois.", "Attendance was 39,364.", "Game time was 2 hours and 18 minutes."], "ranking": [7, 5, 10, 8, 9, 6, 1, 4, 3, 2]}
{"candidates": ["The White Sox achieved their first comeback win of the season, breaking their 0-94 record when trailing after seven innings."], "ranking": [1]}
{"candidates": ["Andrew Benintendi’s one-out line single to left in the 10th inning off lefty Jose Quijada scored free runner Miguel Vargas.", "The White Sox walked off the Angels 4-3 in the 10th inning.", "Andrew Benintendi hit a tiebreaking, two-out single to help the White Sox win 3-2.", "Jonathan Cannon pitched three-hit ball over six scoreless innings for Chicago.", "Jack López hit his first career homer in the eighth inning.", "Hunter Strickland gave up back-to-back doubles to Zach DeLoach and Bryan Ramos in the eighth inning.", "Luis Robert Jr. was credited with an infield hit that tied the game.", "Justin Anderson worked the ninth for his first save.", "White Sox left fielder Andrew Benintendi connects for a game-winning RBI single in the 10th inning against the Angels.", "White Sox left fielder Andrew Benintendi celebrates with teammates after hitting a walk-off single in the tenth inning.", "White Sox second baseman Lenyn Sosa hits a home run in the fourth inning.", "White Sox catcher Korey Lee hits a two-run home run in the second inning.", "Andrew Benintendi hit a walk-off RBI single in the tenth inning.", "Korey Lee hit a two-run homer in the second inning.", "Lenyn Sosa hit a tiebreaking solo drive in the fourth inning.", "Michael Stefanic laid down a bunt single on a squeeze play to tie the game at three.", "The Angels matched a franchise record with their 95th loss.", "José Suarez allowed three runs over five frames in a 4-3 loss in 10 innings to the White Sox.", "Korey Lee hit a two-run homer in the second inning.", "Lenyn Sosa hit a go-ahead solo blast in the fourth inning.", "The Angels tied the game in the eighth inning with a successful squeeze play.", "Taylor Ward grounded into a double play with the go-ahead run at third base.", "The Angels hit into three critical double plays late in the game.", "Andrew Benintendi hit a game-winning RBI single in the 10th inning.", "Korey Lee and Lenyn Sosa hit home runs for the White Sox.", "The Angels tied the game with a squeeze bunt in the eighth inning.", "The White Sox executed three critical double plays, including one in the 10th inning.", "The game went to extra innings, and the White Sox won 4-3.", "Andrew Benintendi's 10th-inning single secured a 4-3 win for the Chicago White Sox over the Los Angeles Angels.", "Korey Lee hit a two-run homer in the second inning.", "Lenyn Sosa hit a tiebreaking solo home run in the fourth inning.", "The Angels had runners on the corners in the seventh inning but failed to score due to a double play.", "Michael Stefanic tied the game at 3 with a bunt single on a squeeze play in the eighth inning.", "Davis Martin struck out four and walked five over 3 2/3 innings in his final start of the season.", "Andrew Benintendi’s one-out single in the 10th inning scored Miguel Vargas, resulting in a walk-off victory.", "Luis Robert Jr. contributed with two doubles in the game."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]}
{"candidates": ["The White Sox rallied to score three runs in the bottom of the eighth and held on for a 3-2 victory.", "Jonathan Cannon struck out seven in six scoreless innings.", "Jack López hit his first career home run.", "Zach DeLoach and Bryan Ramos hit back-to-back doubles in the bottom of the eighth inning.", "Luis Robert Jr.'s towering fly ball was missed by Jack López, tying the game.", "Andrew Benintendi hit a run-scoring single to give the White Sox the lead.", "Justin Anderson locked down his first save of the season."], "ranking": [1, 3, 5, 4, 2, 6, 7]}
{"candidates": ["The Los Angeles Angels and the Chicago White Sox meet Wednesday in MLB action from Guaranteed Rate Field.", "This will be the second installment in a three-game series.", "Jose Suarez is on a good run over his last three appearances with zero earned runs and a save in 12.0 total innings.", "Davis Martin has given up eight earned runs over 8.0 innings during a pair of losses in his last two outings.", "The White Sox faced the Los Angeles Angels on Tuesday looking to avoid a 121st loss, which would’ve surpassed the New York Mets’ 120 losses in 1962."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Andrew Benintendi said, 'Guys aren’t going to pack it in.'", "Andrew Benintendi commented on the long season and the potential for setting a record.", "Jack López expressed his disappointment over his error that impacted the game.", "José Suarez expressed confidence in his performance and readiness for next year.", "Angels manager Ron Washington commented on Suarez's performance, noting that he battled and kept the team in the ballgame.", "Ron Washington reflected on Zach Neto's mistakes, attributing them to youth and inexperience.", "Ron Washington mentioned the team's missed offensive opportunities due to hitting into double plays.", "Andrew Benintendi expressed happiness about his game-winning hit.", "Interim manager Grady Sizemore praised the team's effort and bullpen performance.", "Benintendi mentioned the team's focus on finishing the season strong.", "Sizemore highlighted the positive energy in the clubhouse after the walk-off win.", "White Sox interim manager Grady Sizemore commented on the team's focus and professionalism despite fan frustration.", "Angels manager Ron Washington reflected on the team's inability to capitalize on scoring opportunities.", "Davis Martin commented on the season, stating, 'No one likes losing. Winning is a lot more fun.'", "Grady Sizemore emphasized the importance of building on the recent wins and maintaining consistency.", "Andrew Benintendi expressed the team's desire to make the most out of the remaining games.", "Luis Robert Jr. reflected on his statistical drop-off this season and its impact on the team.", "Davis Martin mentioned the team's goal to spoil games for Detroit in their upcoming series.", "Grady Sizemore highlighted the competitive nature of the upcoming series against Detroit, who are fighting for a playoff spot."], "ranking": [14, 10, 12, 16, 8, 11, 15, 1, 6, 9, 4, 7, 13, 5, 3, 2, 17, 18, 19]}
{"candidates": ["Jonathan Cannon expressed understanding of fans' frustration and appreciated their support during the game.", "Andrew Benintendi acknowledged fans' desire to see history and was glad the team secured the comeback win."], "ranking": [2, 1]}
{"candidates": ["The game marked the start of 'Fan Appreciation Week' and was also 'Dog Day', allowing fans to bring their dogs to the stadium.", "A full stadium-wide chant of 'Sell the team!' occurred in the fifth inning due to a mental error by White Sox players."], "ranking": [2, 1]}
{"candidates": ["Angels' 1B Nolan Schanuel exited in the first inning due to a bruised right leg.", "The White Sox opted to push ace Garrett Crochet's start back a day to Friday.", "RHP Chris Flexen will start for the White Sox in the home finale, while LHP Tyler Anderson will start for the Angels.", "A sparse crowd voiced their displeasure with White Sox chairman Jerry Reinsdorf during the game.", "White Sox starter Davis Martin gave up two runs and three hits in 3 2/3 innings.", "Michael Soroka allowed only one hit over 2 1/3 innings.", "Angels' 1B Nolan Schanuel exited the game in the first inning due to a bruised right leg."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Jackson Chourio moved closer to becoming the youngest player in Major League history to log a 20/20 season."], "ranking": [1]}
{"candidates": ["Rhett Lowder made his big-league debut for the Cincinnati Reds.", "Lowder allowed just one run on a pair of hits with six strikeouts and four walks in four innings.", "The Milwaukee Brewers scored 10 runs in the ninth inning, leading to a 14-0 victory over the Reds."], "ranking": [2, 3, 1]}
{"candidates": ["The game was featured on national television as one of the FOX national games of the week.", "Fernando Cruz's splits show right-handed hitters struggle against him, while left-handed hitters perform well.", "Frankie Montas, a former Red, has a 3.33 ERA with the Brewers since being acquired in a trade deadline deal.", "Montas's splits indicate right-handed hitters struggle against him, while left-handed hitters perform well."], "ranking": [4, 3, 2, 1]}
{"candidates": ["The Milwaukee Brewers (76-56) are on their way to Great American Ball Park on Saturday where they will take on the Cincinnati Reds (63-70).", "The expected starting pitchers are Frankie Montas for the Brewers and Carson Spiers for the Reds.", "Milwaukee has a slugging percentage of.404 and have struck out 1,162 times, while being walked on 493 occasions.", "The Brewers have accumulated 605 runs batted in as well as 1,127 base knocks so far this season, and their batting average comes in at.253.", "As a team, the Milwaukee Brewers are knocking in 4.8 runs per game, which puts them at 9th in MLB.", "The Brewers are sitting with a team earned run average of 3.70 for the year (3rd in baseball), and their staff has struck out 1,073 batters.", "The Cincinnati Reds are sitting with an on-base percentage of.304 and a team batting average of.232 on the campaign.", "Cincinnati has hit 154 home runs so far this year as well as 563 runs batted in.", "The Reds have a team SLG% of.399 and they are earning 4.47 runs per game (15th in the league).", "The Cincinnati pitching staff have given up 569 runs this season while having an ERA of 4.09 (532 earned runs surrendered)."], "ranking": [6, 5, 8, 9, 7, 10, 4, 3, 2, 1]}
{"candidates": ["Brewers manager Pat Murphy said, 'We’re not saying we’re more talented than other teams, we’re just finding a way with somebody different every night. We’re confident in everybody.'", "Jackson Chourio said, 'All I really had in my mind in that moment was finding a way to get on base, finding a way to help the team. I like being in those situations, where you can help the team win.'", "Reds manager David Bell said, 'The Brewers did what they had to do tonight, great plays, great swings, and good pitching. They’re good.'", "The Reds' manager David Bell faced criticism for his lineup choices and in-game decisions.", "Fans expressed frustration over the team's baserunning and lack of accountability.", "Some fans called for the firing of David Bell due to the team's poor performance and frequent one-run losses.", "Jake Bauers commented on Jackson Chourio's performance, calling him'special'.", "Blake Perkins expressed excitement about Chourio's future with the Brewers.", "Manager Pat Murphy reflected on Chourio's resilience and contribution to the game despite his injury.", "David Bell expressed frustration after the Reds lost their third straight game to the Brewers.", "David Bell commented on the Brewers' strong defensive plays and their ability to win the game.", "David Bell discussed the importance of making split-second decisions as a runner at third base.", "Brewers manager Pat Murphy said, 'We’re not saying we’re more talented than other teams, we’re just finding a way with somebody different every night. We’re confident in everybody.'", "Jackson Chourio said through a translator, 'All I really had in my mind in that moment was finding a way to get on base, finding a way to help the team. I like being in those situations, where you can help the team win.'", "Reds manager David Bell said, 'The Brewers did what they had to do tonight, great plays, great swings, and good pitching. They’re good.'"], "ranking": [12, 9, 8, 14, 13, 15, 7, 6, 5, 11, 10, 12, 9, 8, 14]}
{"candidates": ["Rhett Lowder expressed his excitement and detailed his experience of his debut day.", "Reds manager David Bell praised Lowder's composure and competitive spirit.", "Reds backup catcher Luke Maile commented on Lowder's ability to navigate a strong offense in his first start."], "ranking": [2, 1, 3]}
{"candidates": ["The game was played on a hot day in Cincinnati with temperatures reaching 97 degrees.", "Lowder's debut marked a significant milestone in his career."], "ranking": [2, 1]}
{"candidates": ["Brewers RHP Nick Mears (right forearm inflammation) is expected to resume playing catch when the Brewers return home next week.", "Reds INF/OF Santiago Espinal was out of the lineup after fouling a ball off his left shin in the second game of Friday’s doubleheader. Manager David Bell said there is no fracture and Espinal was available to hit.", "Brewers RHP Tobias Myers (6-5, 2.99 ERA) starts the series finale on Sunday. He has a 2.20 ERA in his past 14 starts. The Reds have not announced a starter."], "ranking": [2, 3, 1]}
{"candidates": ["Tarik Skubal became the fourth Detroit left-hander with 200 strikeouts in a season.", "Tarik Skubal reached 200 strikeouts in a season, becoming the fourth Tigers lefty to achieve this milestone, joining Mickey Lolich, Hal Newhouser, and Matthew Boyd.", "Tarik Skubal became the fourth Detroit left-hander with 200 strikeouts in a season."], "ranking": [2, 1, 3]}
{"candidates": ["The Boston Red Sox needed extra-innings, but they beat the Detroit Tigers 7-5 on Friday night at Comerica Park.", "Kenley Jansen earned the win in relief while Chris Martin got the save.", "Jarren Duran went 3-for-5 with two doubles and a home run.", "Tigers pitcher Tarik Skubal struck out Red Sox rookie Ceddanne Rafaela in the eighth inning.", "Tarik Skubal, a potential breakout candidate for the Cy Young Award, dominated the Red Sox in a 2-1 victory.", "Tarik Skubal pitched eight innings and struck out eight batters.", "Tyler O’Neill hit a first-inning homer for the Red Sox.", "Spencer Torkelson hit a one-out single and Zach McKinstry extended his hitting streak to a career-best 11 games with a double.", "Trey Sweeney hit a fly ball to left field that drove in two runs with a double.", "Tyler Holton pitched the ninth for his sixth save.", "Ryan Kreidler made a jump throw from foul territory to retire Triston Casas.", "Tarik Skubal pitched a career-high eight innings, allowing only one run and striking out eight batters.", "Riley Greene threw out Romy Gonzalez at second base, marking his fourth outfield assist in his career.", "Zach McKinstry and Trey Sweeney turned an improbable double play on a high-chopper by Triston Casas.", "Ryan Kreidler made a difficult throw from behind the third base bag to retire Triston Casas in the eighth inning.", "Tyler Holton secured the victory by dispatching the top of the Red Sox order in the ninth inning.", "Tarik Skubal allowed one run on four hits over eight innings and struck out eight without a walk.", "Tyler O’Neill’s 25th homer gave the Red Sox a quick lead in the first inning.", "Poor defense allowed the Tigers to take the lead against Nick Pivetta in the second inning.", "Spencer Torkelson singled with one out and took third on a double down the right-field line by Zach McKinstry.", "Trey Sweeney followed with a deep fly ball to left field, resulting in two runs for the Tigers.", "Nick Pivetta allowed two runs on six hits, walked one, and struck out six over six innings.", "Tyler Holton closed the game for the Tigers, securing the win.", "Tarik Skubal allowed one run in eight innings and struck out eight.", "Tyler O’Neill hit a first-inning homer for Boston.", "Spencer Torkelson hit a one-out single and Zach McKinstry extended his hitting streak to a career-best 11 games with a double.", "Trey Sweeney hit a fly ball to left that drove in two runs with a double.", "Tyler Holton pitched the ninth for his sixth save.", "Ryan Kreidler and Parker Meadows were picked off first in the seventh inning.", "Kreidler made a jump throw from foul territory behind third to retire Triston Casas in the eighth."], "ranking": [14, 20, 16, 24, 1, 5, 18, 10, 22, 11, 2, 7, 15, 13, 9, 21, 4, 6, 8, 17, 3, 12, 25, 19, 23, 26, 27, 28, 29, 30]}
{"candidates": ["Carpenter's blast forces extra innings but Tigers lose opener to Red Sox", "Connor Wong hit a home run off Casey Mize in the sixth inning to put the Boston Red Sox ahead 4-0.", "The Detroit Tigers lost to the Boston Red Sox 7-5 in extra innings."], "ranking": [2, 1, 3]}
{"candidates": ["Tarik Skubal was widely considered a potential breakout candidate and a popular pick to win the American League Cy Young Award coming into the season.", "The game had a special atmosphere as fans came early to celebrate the 40-year anniversary of the 1984 World Series championship team."], "ranking": [1, 2]}
{"candidates": ["Tarik Skubal expressed that it was fitting to pitch deep into the game on the night the Tigers celebrated their 1984 World Series championship.", "Tigers manager A.J. Hinch praised Skubal's performance and consistency throughout the season.", "Red Sox manager Alex Cora acknowledged Skubal's talent and emphasized the need for the Red Sox to win the next game.", "Tarik Skubal expressed his focus on winning each day's game and emphasized the importance of the team's aggressive play.", "Manager AJ Hinch praised Skubal's efficiency and dominance against a tough Red Sox lineup.", "Spencer Torkelson highlighted Skubal's conviction and confidence, noting its positive impact on the team.", "Red Sox manager Alex Cora praised Tarik Skubal, calling him probably the best pitcher in the American League.", "Rob Refsnyder acknowledged he should have made the play that allowed the Tigers to score and apologized to Nick Pivetta.", "Tyler O’Neill commented on battling against Skubal and the need for the Red Sox to play better baseball moving forward.", "Alex Cora expressed belief in the team's potential to do more and emphasized the importance of playing better baseball.", "Tarik Skubal reflected on the significance of pitching deep into the game on the night the Tigers celebrated the 1984 World Series championship.", "Tigers manager A.J. Hinch praised Skubal's performance and his potential to win the Cy Young.", "Red Sox manager Alex Cora acknowledged Skubal's talent and emphasized the need for Boston to win the series.", "Hinch credited third base coach Joey Cora for the aggressive decision to send McKinstry to the plate.", "Alex Cora commented on Joey Cora's aggressive coaching style."], "ranking": [7, 5, 9, 11, 3, 8, 1, 14, 12, 13, 6, 2, 10, 4, 15]}
{"candidates": ["Casey Mize reflected on his performance, noting the need to improve his pitch placement, especially in critical counts.", "Manager A.J. Hinch commented on Mize's mixed performance, acknowledging both good and misfired pitches.", "Catcher Jake Rogers mentioned that Mize wanted to be perfect and that his performance, while not his best, was still acceptable."], "ranking": [2, 3, 1]}
{"candidates": ["The Red Sox remain 3.5 games back of the third and final wild card spot in the American League after the victory.", "Jarren Duran is chasing some prestigious Red Sox history, having 75 extra-base hits as a leadoff hitter in 2024.", "The Tigers celebrated their 1984 World Series championship with a ceremonial first pitch by Jack Morris to Lance Parrish.", "The Tigers moved within 1 1/2 games of Boston for fourth in the American League wild-card race.", "Rich Hill, the only player on either roster born when the Tigers last won the World Series, picked off Parker Meadows at first base.", "The Tigers are six losses behind the Twins for the final wild card spot, 1½ games behind the Red Sox, and a game behind the Mariners.", "The Tigers' aggressive base running, exemplified by Zach McKinstry's play, was highlighted as part of the team's identity and strategy.", "The game finished in 2 hours and 1 minute.", "With Minnesota losing, the Red Sox remain 3½ games out in the race for a wild-card berth.", "The Tigers celebrated the franchise's 1984 World Series championship.", "Jack Morris threw the ceremonial first pitch to Lance Parrish.", "Rich Hill, the only player on either roster born when the Tigers last won the World Series, picked off Parker Meadows."], "ranking": [10, 2, 8, 6, 3, 5, 4, 12, 9, 7, 11, 1]}
{"candidates": ["Casey Mize's fastball velocity was down, averaging 93.8 mph compared to his season average of 95.6 mph.", "Mize generated nine swings-and-misses over his 85-pitch outing, including four with his fastball and two with his slider.", "Boston batters launched eight balls off Mize's pitches at 100 mph or faster, with an average exit velocity of 92 mph."], "ranking": [2, 1, 3]}
{"candidates": ["The teams will finish the three-game series on Sunday with Detroit RHP Ty Madden making his second start against Boston RHP Cooper Criswell."], "ranking": [1]}
{"candidates": ["Josh Naylor hit his 30th and 31st homers of the season, joining José Ramírez as the only two players on Cleveland’s roster with at least 30 homers. They are just the second Guardians duo in the past two decades to reach 30 homers and 100 RBIs in the same season, joining Ramírez and Edwin Encarnacion in 2018.", "Carlos Correa extended his hitting streak to 16 games, matching a career-high and the longest by a Twin this season."], "ranking": [1, 2]}
{"candidates": ["The Guardians clinched one of the American League's six playoff spots with a 3-2 win over the Minnesota Twins.", "The Guardians achieved their major league-leading 42nd comeback.", "The bullpen held Minnesota hitless for 5⅔ innings.", "Andrés Giménez drove in José Ramírez from second base in the 10th inning for the walk-off win.", "The Twins were mathematically eliminated from winning the division with a 3-2, 10-inning loss to the Cleveland Guardians on Thursday afternoon at Progressive Field.", "The Guardians walked off the Twins in extra innings for the second straight game.", "Cleveland clinched a playoff berth with this victory.", "Simeon Woods Richardson pitched 4.2 innings with 6 strikeouts.", "The Twins offense struggled, managing only two runs (one earned) on three hits and three walks against Cleveland's starter Joe Cantillo.", "The Twins had zero hits and just one walk over 6 2/3 innings against Cleveland's bullpen.", "In the top of the 10th inning, Kyle Farmer was the Manfred Man, and Willi Castro laid down a sacrifice bunt.", "Andrés Giménez drilled an RBI single into right field off Twins lefty Caleb Thielbar to score automatic runner José Ramírez for Cleveland’s second straight walk-off victory and seventh of the season.", "The Guardians notched their 42nd comeback win while improving the best home record in the AL to 48-28.", "Giménez’s base hit touched off a wild celebration between first and second base.", "It was the fourth career walk-off plate appearance for Giménez and his second this season.", "Guardians rookie Joey Cantillo pitched into the fifth inning before turning things over to the top-ranked bullpen in baseball.", "Cleveland relievers tossed 5 2/3 scoreless innings, holding the Twins hitless and striking out eight.", "Minnesota threatened to score in the top of the 10th as Eli Morgan loaded the bases by hitting Matt Wallner with a pitch and walking Manuel Margot.", "Morgan retired Carlos Correa on a pop to first base in foul territory and escaped the inning when Byron Buxton sent a fly ball to Lane Thomas in right for the final out.", "Rookie designated hitter Kyle Manzardo opened the scoring when he yanked a changeup from Twins starter Simeon Woods Richardson into the seats in right for his fourth home run and second of the series.", "Andrés Giménez singled home José Ramírez from second base in the 10th inning as the Cleveland Guardians clinched a playoff berth with a 3-2 win over the Minnesota Twins.", "Cleveland posted their major league-leading 42nd comeback win and second straight in extra innings.", "Eli Morgan got out of a bases-loaded jam in the 10th inning by retiring Carlos Correa on a foul pop and Byron Buxton on a liner to right.", "Rookie Kyle Manzardo homered for the Guardians.", "Kyle Manzardo hit a home run in the first inning.", "Manuel Margot hit a double in the fifth inning, allowing Kyle Farmer and Willi Castro to score.", "Brayan Rocchio hit a sacrifice fly in the sixth inning, allowing Josh Naylor to score.", "Andrés Giménez hit a single in the tenth inning, allowing José Ramírez to score the winning run."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28]}
{"candidates": ["Josh Naylor launched game-tying homers in the second and the seventh innings, the first of which was a Statcast-projected, 445-foot bomb into the right field seats.", "Brayan Rocchio hit a walk-off single in the 10th inning to secure a 5-4 victory for the Guardians.", "Pinch-hitter Kyle Manzardo knocked in a run on a single to center in the 10th inning.", "Pinch-hitter Will Brennan delivered a game-tying RBI single to right field in the 10th inning.", "Carlos Correa drove in all four Minnesota runs, including a clutch, go-ahead, two-run single in the 10th inning.", "Bailey Ober struck out a career-high 12 batters in seven innings.", "Ronny Henriquez and Michael Tonkin allowed three runs in a 5-4, walk-off loss to the Guardians.", "Kyle Manzardo hit an RBI single, Andrés Giménez walked, and Will Brennan hit the game-tying knock in the 10th inning.", "Brayan Rocchio hit a grounder over the head of first baseman Carlos Santana to walk off for the win."], "ranking": [2, 1, 6, 5, 3, 8, 9, 4, 7]}
{"candidates": ["The Cleveland Guardians face the Minnesota Twins, leading the series 2-1.", "Cleveland is 88-65 overall and 47-28 at home. Guardians hitters are batting a collective.238, which ranks eighth in the AL.", "Minnesota has a 38-39 record in road games and an 80-72 record overall. The Twins are 33-15 in games when they hit two or more home runs.", "Thursday's game is the 13th time these teams match up this season. The Guardians hold a 9-3 advantage in the season series.", "Jose Ramirez leads Cleveland with 35 home runs while slugging.514. Lane Thomas is 10-for-40 with three home runs and 11 RBI over the past 10 games.", "Carlos Santana has 22 home runs, 57 walks and 65 RBI while hitting.240 for the Twins. Kyle Farmer is 11-for-24 with two doubles, three home runs and five RBI over the past 10 games.", "Guardians: 7-3,.237 batting average, 1.98 ERA, outscored opponents by 10 runs in the last 10 games.", "Twins: 4-6,.234 batting average, 4.39 ERA, outscored by five runs in the last 10 games."], "ranking": [5, 2, 3, 4, 1, 6, 7, 8]}
{"candidates": ["Guardians outfielder Will Brennan expressed the team's determination and hunger to prove people wrong, highlighting the fun atmosphere in the clubhouse.", "Guardians manager Stephen Vogt praised Josh Naylor's milestone of 30 homers and 100 RBIs, calling it a special achievement.", "Guardians starter Tanner Bibee reflected on the return of the team's magic, describing it as unbelievable to watch.", "Bailey Ober emphasized the need to move on and get ready for the next game.", "Carlos Correa highlighted the importance of forgetting about the loss and focusing on winning the next game.", "Manager Rocco Baldelli commented on the bullpen's inability to hold the lead due to player unavailability."], "ranking": [3, 2, 1, 6, 5, 4]}
{"candidates": ["The Guardians have been atop the AL Central since mid-April.", "The Guardians are known for their aggressive playing style, termed 'Guards ball'.", "Emmanuel Clase, the All-Star closer, has not blown a save since May and is a Cy Young contender.", "The Guardians clinched a Major League Baseball playoff spot with a 3-2 win in 10 innings against the Twins at Progressive Field.", "The Guardians were not a popular pick to reach the playoffs when the season started, but have spent the last 23 weeks perched atop the American League Central Division.", "Cleveland became the second team in the AL to claim a spot in the playoffs after the Yankees.", "It marks the 17th playoff appearance in franchise history for the club with baseball’s longest World Series championship drought, a dry spell that dates back to 1948.", "Cleveland's bullpen combined for 5 2/3 hitless innings.", "Cleveland lowered the magic number to clinch the AL Central title to three.", "The Twins fell into a tie with Detroit for the final wild card spot.", "Cleveland took control of the division in mid-April and has had sole possession of first place for all but one day the past five months.", "Kyle Manzardo is batting.357 with four home runs and seven RBIs in 16 games since being recalled from Triple-A Columbus on Sept. 1.", "The game went into extra innings, ending in the tenth inning.", "The final score was Cleveland Guardians 3, Minnesota Twins 2.", "The game was held at Progressive Field with an attendance of 21,707.", "The game lasted 3 hours and 4 minutes.", "Weather conditions were 76°F, sunny, with a wind of 4mph from left to right."], "ranking": [7, 15, 4, 1, 3, 2, 6, 9, 5, 11, 8, 14, 13, 12, 10, 16, 17]}
{"candidates": ["The Guardians spent all but seven days of the season in first place, experiencing plenty of success and high moments.", "The Guardians could clinch a postseason berth with a win on Thursday."], "ranking": [1, 2]}
{"candidates": ["Guardians' RHP Alex Cobb will pitch a simulated game at Triple-A Toledo in his next step in returning to the rotation.", "Steven Kwan is making progress after going on the IL earlier this week and is eligible to return on Sept. 24.", "Twins will open a three-game series in Boston on Friday with David Festa starting.", "Guardians will head to St. Louis for their last three road games of the regular season with Ben Lively starting against Kyle Gibson."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Sal Frelick has reached 50 runs batted in his career.", "Dominic Smith has reached 500 strikeouts in his career."], "ranking": [2, 1]}
{"candidates": ["Julian Aguiar made his third big league start in Thursday's series finale and was picked up by his offense for a no-decision during a 10-9 walk-off win over the A's at Great American Ball Park.", "Cincinnati battled back with three runs capped by TJ Friedl's two-run single through the right side."], "ranking": [1, 2]}
{"candidates": ["The game is a makeup for a postponed game on April 11th.", "First pitch for game one is scheduled for 12:40pm ET.", "The game will be available to watch on MLB Network as well as Bally Sports Ohio.", "Nick Martinez's splits show he performs better on the road with an ERA of 2.74 compared to 4.42 at home.", "Colin Rea's splits show he allows more home runs at home (15) compared to on the road (7)."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Hunter Greene has started throwing again and the team is working on a target date for his return this season.", "The Reds made several roster moves, including calling up Rhett Lowder and Yosver Zulueta for the doubleheader.", "Brandon Leibrandt was optioned to Louisville, and Davis Wendzel was designated for assignment.", "Willy Adames commented on the team's mindset of focusing on winning the moment.", "Manager Pat Murphy praised DL Hall's performance and its potential impact on the team's future plans.", "DL Hall expressed satisfaction with his performance, stating he finally felt like himself again.", "Brewers manager Pat Murphy praised DL Hall's performance.", "Rhett Lowder described his debut as a dream come true.", "Reds manager David Bell commented on Lowder's poise during his debut."], "ranking": [6, 8, 9, 5, 2, 3, 1, 4, 7]}
{"candidates": ["Second game of the day/night doubleheader: Rhett Lowder, the seventh pick in last year's draft, will make his Major League debut. DL Hall (0-1, 6.43) will pitch for the Brewers."], "ranking": [1]}
{"candidates": ["Beau Brieske threw his fastest pitch of the year at 98.6 mph.", "Zach Neto is the first Angels infielder with a 20-homer, 20-steal season."], "ranking": [2, 1]}
{"candidates": ["Spencer Torkelson hit a two-run home run in the second inning.", "Kerry Carpenter added an RBI single in the third inning.", "Mickey Moniak hit a 409-foot homer to right-center in the sixth inning.", "Jason Foley pitched the ninth inning for his 19th save.", "Spencer Torkelson hit a home run after a 10-pitch walk by Jace Jung.", "Kenta Maeda settled in and dispatched three Angels hitters after a visit from catcher Jake Rogers.", "Jake Rogers threw out Jo Adell attempting to steal second base in the seventh inning.", "Beau Brieske struck out Logan O'Hoppe with a 98.6 mph fastball, the fastest pitch he has thrown all year.", "Jason Foley secured his 19th save of the season.", "Zach Neto hit a two-run home run during the fifth inning.", "Rookie Jack Kochanowicz pitched six scoreless innings.", "Ben Joyce got the final four outs for his third save.", "Mickey Moniak’s double in the fourth inning gave the Angels a 1-0 lead.", "Detroit had runners on the corners with one out in the sixth, but Kochanowicz got Jace Jung to hit into a 4-6-3 double play.", "Joey Wentz was hit by two hard comebackers in the seventh inning.", "Detroit loaded the bases with two out in the eighth, but Joyce struck out Spencer Torkelson.", "Spencer Torkelson hit a two-run home run in the second inning.", "Kerry Carpenter added an RBI single in the third inning.", "Mickey Moniak homered to right center in the sixth inning, scoring Logan O'Hoppe.", "Spencer Torkelson hit a two-run homer in the bottom of the 2nd inning."], "ranking": [14, 15, 6, 10, 12, 16, 13, 5, 11, 8, 3, 4, 2, 7, 9, 1, 18, 17, 19, 20]}
{"candidates": ["The Detroit Tigers are riding a five-game winning streak and are currently the hottest team in baseball.", "Mason Englert will be making his first start of the season for the Tigers after 11 relief appearances.", "Manager A.J. Hinch has been effectively managing a shortage of starting pitchers by using several openers each turn through the rotation.", "Griffin Canning will be starting for the Angels, making his 27th appearance of the season with a record of 4-11 and a 5.18 ERA.", "The Tigers are sizable favorites for the game with a -165 listing, implying a 62.1 percent chance to win."], "ranking": [1, 4, 3, 2, 5]}
{"candidates": ["The Detroit Tigers (66-66) welcome the Los Angeles Angels (54-77) at Comerica Park on Wednesday.", "The odds on this game have Los Angeles at +135 and Detroit is at -161.", "The pitchers taking the mound will be Griffin Canning and Kenta Maeda.", "The Angels have tallied 193 two-baggers as a squad and have hit 128 baseballs out of the park.", "Los Angeles has a slugging % of.371 and have been called out on strikes 1,122 times, while being walked on 388 occasions.", "As a squad, the Los Angeles Angels are knocking in 3.9 runs per game, which has them at 27th in MLB.", "The Angels have an ERA of 4.58 on the campaign (27th in MLB), and they have rung up 1,010 hitters.", "Angels pitchers have conceded 156 long balls and 638 total runs (27th in MLB).", "The Angels relievers have accumulated a save rate of 67.4% and has come into the game in 105 save situations.", "The Detroit Tigers have an on-base percentage of.298 as well as a team batting average of.234 for the season.", "Detroit has compiled 136 HRs for the year to go along with 541 runs batted in.", "The Tigers have a team slugging percentage of.389 and they score 4.26 runs per game (18th in MLB).", "The Detroit pitching staff have relinquished 549 runs so far this season while having an ERA of 3.83 (499 earned runs relinquished).", "The Tigers are sitting with a team WHIP of 1.198 in addition to having a FIP of 3.76 as a team this year.", "Detroit has called on relief pitchers to enter the game in 49 save chances and they have walked away with 29 saves.", "The Tigers have racked up 1,118 assists, 69 errors and have accounted for 3,516 putouts this season.", "Maeda (67-55 career record) holds a 4.17 earned run average and has conceded 8.0 hits per nine innings."], "ranking": [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17]}
{"candidates": ["Spencer Torkelson commented on the team's versatility in finding different ways to win.", "Tigers manager A.J. Hinch emphasized the importance of staying grounded and continuing to play well.", "Angels manager Ron Washington acknowledged the team's better performance but noted it was not enough to win.", "Kenta Maeda reflected on his pitching performance and the advantage of having a lead.", "Manager A.J. Hinch emphasized the importance of small plays in the game.", "Spencer Torkelson highlighted the need to stay focused and not look too far ahead.", "Zach Neto expressed his joy about achieving the 20-homer, 20-steal milestone.", "Angels manager Ron Washington praised Jack Kochanowicz for his improvement and performance.", "Tigers manager A.J. Hinch reflected on missed opportunities during the game."], "ranking": [7, 5, 4, 3, 6, 2, 1, 8, 9]}
{"candidates": ["The game experienced a lengthy rain delay of 1 hour 50 minutes before starting.", "The Tigers moved two games over.500 at 68-66 for the first time since May 7.", "Angels starter Griffin Canning took the loss, giving up three runs and five hits and four walks in five innings."], "ranking": [3, 1, 2]}
{"candidates": ["L. Thomas had an outstanding performance with 4 RBIs.", "A. Hedges hit a home run in the 3rd inning.", "M. Boyd pitched 4.1 innings with 9 strikeouts.", "E. Clase secured his 44th save of the season.", "Matthew Boyd led the Guardians to a 6-4 victory over the White Sox.", "Boyd recorded two strikeouts within the first eight pitches of the game.", "Boyd struck out a season-high nine hitters.", "The White Sox scored all four of their runs in the third inning, but only one was earned due to a throwing error by Andrés Giménez.", "Ben Lively's start ended abruptly after he was hit in the hip with a line drive, leading to Cleveland's bullpen pitching the remaining 7.0 innings without allowing a single run.", "Lane Thomas hit a three-run homer in the top of the sixth inning, giving Cleveland a commanding four-run lead.", "Kyle Manzardo recorded two hits in his four at-bats, including an RBI single that gave the Guardians their first run of the night.", "In their 6-4 loss Wednesday to the Guardians that completed a three-game sweep and put them six losses away from tying the 1962 Mets’ modern-era record of 120 in a season, the Sox twice saw the Guardians score two runs on infield singles by the same player.", "Lane Thomas beat out a slow roller to third baseman Miguel Vargas with two outs in the first inning, allowing Steven Kwan to score easily from third and Jose Ramirez to race in all the way from second.", "Lane Thomas played a crucial role in the Guardians' 6-4 win over the White Sox.", "The Guardians' bullpen contributed significantly to the victory.", "Lane Thomas had four RBI and the Cleveland Guardians held on behind their bullpen to beat the Chicago White Sox 6-4.", "Austin Hedges homered to left (362 feet) in the 3rd inning.", "Thomas reached on infield single to third, Kwan scored and Ramírez scored in the 1st inning.", "Thomas reached on infield single to second, Kwan scored and Giménez scored in the 3rd inning.", "Sosa singled to center, Julks scored, Ramos to second, Robert Jr. to third in the 3rd inning.", "Robert Jr. scored on a balk, Sosa to second on a balk, Ramos to third on a balk in the 3rd inning.", "Vargas grounded out to second, Ramos scored, Sosa to third in the 3rd inning.", "Fletcher reached on infield single to shortstop, Sosa scored in the 3rd inning.", "Brennan grounded out to first, Thomas scored, Freeman to second in the 8th inning.", "Lane Thomas had four RBIs and the Cleveland Guardians held on behind their bullpen to beat the Chicago White Sox 6-4.", "Austin Hedges added a solo home run for the AL Central-leading Guardians.", "Cleveland Guardians closing pitcher Emmanuel Clase celebrated after defeating the Chicago White Sox 6-4.", "Chicago White Sox starting pitcher Davis Martin reacted after giving up a solo home run to Cleveland Guardians’ Austin Hedges.", "Chicago White Sox’s Lenyn Sosa watched his RBI single during the third inning.", "Cleveland Guardians starter Matthew Boyd threw during the first inning.", "Lane Thomas hit a three-run homer, contributing significantly to the Guardians' 5-0 victory.", "Six Cleveland relievers combined for seven innings of four-hit ball after Ben Lively departed with a leg injury.", "Chicago White Sox were shut out for the 17th time this season, finishing with five hits.", "White Sox rookie Jonathan Cannon was charged with three runs and seven hits in 5 1/3 innings.", "Sean Burke made his major league debut, pitching three innings and allowing one run and three hits."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Lane Thomas hit a three-run homer during the sixth inning.", "Cleveland's bullpen combined for seven innings of four-hit ball after Ben Lively departed with a leg injury.", "Chicago White Sox were shut out for the 17th time this season.", "Chicago White Sox dropped a franchise-record 14th straight home game."], "ranking": [2, 3, 4, 1]}
{"candidates": ["Matthew Boyd and Austin Hedges prepared for the game by reviewing scouting reports and taking notes on the White Sox offense."], "ranking": [1]}
{"candidates": ["The Chicago White Sox will take on the favoured Cleveland Guardians in MLB action at Guaranteed Rate Field on Wednesday, commencing at 9:40am AEST.", "Jonathan Cannon (3-9, 4.53 ERA) will be on the bump for the White Sox, up against Ben Lively (11-9, 4.07 ERA) for the Guardians.", "Based on advanced machine learning and data, Stats Insider has simulated the result of Wednesday's White Sox vs Cleveland MLB match-up 10,000 times.", "Our independent predictive analytics model currently gives the Guardians a 66% chance of defeating the White Sox at Guaranteed Rate Field.", "The current betting odds in Australia for Wednesday's MLB game at Guaranteed Rate Field are: White Sox $2.85, Guardians $1.40.", "The White Sox are 1.5-run underdogs against the Guardians, with odds of $2.14 available at TAB.", "For the favourite Guardians (-1.5) to cover the line, TAB offers odds of $1.71.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Guardians (-1.5) are predicted to cover the line 54% of the time, while the 8.5-run over/under is considered an equal 50-50 chance of hitting.", "Our White Sox vs Guardians predictions are based on detailed simulations and wagering experience to help you place more informed bets with your chosen online bookie.", "Even though the Guardians are more likely to cover the line, our best bet of White Sox +1.5 is based on the probability of that happening, as suggested by our predictive analytics model, and the top odds available.", "Andrew Vaughn and the Chicago White Sox will face Matthew Boyd, who will start for the Cleveland Guardians.", "The Guardians pitching staff is 10th in the majors with a collective 8.8 strikeouts per nine innings.", "The White Sox have pitched to a 4.86 ERA this season, which ranks 29th in baseball.", "First pitch is set for 2:10 p.m. ET for the final game of a three-game series.", "The game will be held at Guaranteed Rate Field in Chicago, Illinois.", "The game will be broadcast on Bally Sports and available for live stream on Fubo.", "The game between the Cleveland Guardians and Chicago White Sox is scheduled for September 11, 2024, at Guaranteed Rate Field in Chicago, IL.", "The pitchers taking the mound will be Matthew Boyd for the Chicago White Sox and Davis Martin for the Cleveland Guardians.", "The Cleveland Guardians have a team slugging percentage of.396 and have hit 166 home runs this season.", "The Chicago White Sox have a team slugging percentage of.340 and have hit 115 home runs this season.", "The Cleveland Guardians are averaging 4.5 runs per game, while the Chicago White Sox are averaging 3.08 runs per game.", "The Cleveland Guardians' pitching staff has a team ERA of 3.81, while the Chicago White Sox's pitching staff has a team ERA of 4.85."], "ranking": [14, 18, 20, 19, 16, 15, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 17, 21, 22, 23]}
{"candidates": ["Matthew Boyd expressed that he felt really good during the game despite some challenges.", "Austin Hedges noted that Boyd was still striking out hitters even though he didn't have his 'A' stuff.", "The Guardians completed a nine-game trip with a 6-3 record, including a sweep over the White Sox.", "First-year Cleveland manager Stephen Vogt said, 'I feel incredible about it. This was a tough road trip, this late in the year to be gone through three cities and play some tough teams.'", "Lane Thomas said, 'I’m just going to try to keep being consistent with the work and build off what we’re doing right now. It’s been fun and I feel like we’re winning some games right now. So just keep that, you know, just carry that through the rest of September.'", "Chicago’s Davis Martin said, 'Everybody pissed. Every time we go score four runs for me, it’s like, hey, that’s well in the ballpark for us to get a victory. It’s my job to set the tone.'", "Lane Thomas reflected on his recent performance, stating, 'You just work day in and day out, and eventually you find something that kind of helps.'", "Manager Stephen Vogt praised his relievers, saying, 'Those guys stepped up in a huge way. They were all efficient. Did their job, and then some.'", "Interim manager Grady Sizemore commented on the White Sox's performance, 'We had a couple of good swings here and there. We got some guys on, but just not the big hit when guys were on and weren’t able to grind at-bats and make them work at all.'", "Ben Lively shared his thoughts on his injury, 'It hit me and like my leg just gave out. Next thing I know I was on the ground and it was just stinging.'", "Sean Burke expressed his excitement about his debut, 'It was unbelievable. This is definitely the best day of my life. It’s something I’ve worked for since I picked up a baseball for the first time. It’s hard to put into words right now.'"], "ranking": [8, 6, 5, 4, 3, 2, 10, 9, 7, 11, 1]}
{"candidates": ["Sean Burke reflected on his major league debut, stating, 'It’s been a little bit of a roller coaster. But it all paid off and I think everything happens for a reason. I’m just happy to be here now.'"], "ranking": [1]}
{"candidates": ["Boyd's performance helped the Guardians maintain a four-game lead over the Royals in the AL Central standings.", "Boyd has limited his opponents to one earned run or fewer in five of his six starts since coming off the injured list.", "Chicago dropped a franchise-record 15th straight at home, lost its 17th in 19 overall and was swept for the 24th time.", "At 33-114, the White Sox are closing in on the post-1900 record for losses — 120 by the 1962 New York Mets in their inaugural season.", "The Guardians finished 6-3 on a three-city trip that included stops in Kansas City and at Dodger Stadium in Los Angeles.", "Cleveland and New York are tied for the best record in the American League.", "At 33-113, the White Sox are closing in on the post-1900 record for losses — 120 by the 1962 New York Mets in their inaugural season.", "Cleveland's bullpen has a 37-11 record and a major league-best 2.76 ERA.", "Guardians left-hander Matthew Boyd (2-1, 2.20 ERA) and White Sox right-hander Davis Martin (0-3, 3.29 ERA) are set to pitch in the series finale."], "ranking": [8, 6, 3, 2, 5, 4, 1, 7, 9]}
{"candidates": ["Ben Lively was hit on the outside of his right leg by Dominic Fletcher’s liner, leading to his departure from the game.", "Cleveland's bullpen began the day with a 36-11 record and a major league-best 2.80 ERA."], "ranking": [2, 1]}
{"candidates": ["Guardians: RHP Alex Cobb (blister on his right middle finger) is throwing weighted balls, and LHP Joey Cantillo is in line to start on Saturday.", "LHP Sam Hentges is going to have shoulder surgery on Sept. 18 and is expected to be sidelined for about a year.", "White Sox: RHP Drew Thorpe said his season-ending elbow surgery went as expected and should have a normal offseason.", "INF Brooks Baldwin (right wrist sprain) is still experiencing pain when hitting."], "ranking": [4, 3, 2, 1]}
{"candidates": ["The Guardians made a late game comeback to win 7-5.", "Bo Naylor hit a leadoff homer in the seventh inning.", "Jhonkensy Noel hit a go-ahead RBI single.", "Emmanuel Clase recorded his American League-best 39th save, lowering his ERA to 0.58.", "Emmanuel Clase seals the win for the Cleveland Guardians against the Kansas City Royals with a critical out in the top of the 9th inning.", "Eli Morgan (CLE) secured the win with 1.1 innings pitched, allowing 1 hit, 0 earned runs, and striking out 2.", "Vinnie Pasquantino (KC) had an outstanding performance, going 4-5 with a run, a home run, and an RBI.", "Josh Naylor (CLE) contributed significantly with 3 hits, a run, and 2 RBIs.", "Lucas Erceg (KC) took the loss and a blown save, pitching 1 inning, allowing 3 hits and 1 earned run.", "Rookie Jhonkensy Noel singled home Josh Naylor with the go-ahead run in the seventh inning.", "Bo Naylor homered off starter Michael Wacha.", "Josh Naylor, Will Brennan and Noel had RBI singles against Lucas Erceg.", "Andrés Giménez tacked on a sacrifice fly in the eighth.", "Bobby Witt Jr., Vinnie Pasquantino and Michael Massey hit solo homers off Guardians ace Tanner Bibee.", "Paul DeJong hit a two-run homer.", "The Royals moved into a tie for first with Cleveland by beating the Guardians 6-1.", "The game was delayed more than two hours by rain.", "The Royals tacked on three runs in the seventh inning on RBI singles by Maikel Garcia and Michael Massey, along with a wild pitch.", "James McArthur struck out four in two innings, and the Royals' bullpen closed with five perfect innings following the rain delay.", "All-Star shortstop Bobby Witt Jr. got hit on the right hand by a pitch but stayed in the game and ripped a double in the ninth.", "Bo Naylor sparked a rally in the seventh inning with his 11th home run.", "Hunter Gaddis worked a 1-2-3 eighth inning.", "Emmanuel Clase secured his 39th save by mowing through the top of the Royals lineup.", "Josh Naylor, Will Brennan, and Jhonkensy Noel contributed key hits in the seventh inning rally.", "Michael Massey hit his first career leadoff home run.", "Vinnie Pasquantino hit his 19th home run.", "Michael Massey and Bobby Witt Jr. added solo home runs for the Royals.", "Lucas Erceg's scoreless streak ended during the Guardians' four-run seventh inning.", "Vinnie Pasquantino homered in the first inning and achieved his first career four-hit game.", "Bo Naylor hit his 11th home run of the year in the seventh inning.", "Tanner Bibee gave up five earned runs on eight hits, including three solo home runs, but also struck out six batters with 11 swings and misses.", "Bo Naylor hit a solo home run in the seventh inning, sparking a comeback for the Cleveland Guardians.", "Steven Kwan and Andres Gimenez followed up with base hits, both scoring via a Josh Naylor single and a Will Brennan single.", "Will Brennan scored the go-ahead run on a Jhonkensy Noel base hit to right field.", "Andres Gimenez made a spectacular catch in the top of the eighth inning, preventing Freddy Fermin from reaching base and potentially changing the game's outcome."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Kansas City Royals' Michael Lorenzen exited the game with a left hamstring strain during the second inning.", "Lorenzen had a 1.99 earned run average over his first four starts in a Royals uniform.", "Kansas City was leading 2-0 in the bottom of the second inning when Lorenzen exited."], "ranking": [2, 3, 1]}
{"candidates": ["The Guardians avoided being swept by the Royals in four games for the first time since June 1973.", "Andrés Giménez made a crucial defensive play to maintain the momentum.", "The Guardians avoided a four-game sweep in the series with their MLB-leading 37th comeback win.", "Kansas City had its seven-game road winning streak snapped and is 23-14 since the All-Star break.", "Wacha was denied his 100th career win, pitching six-plus innings and allowing five runs.", "The game was delayed for 2 hours, 14 minutes due to rain.", "Royals starter Michael Lorenzen left in the second inning after straining his left hamstring while covering first base.", "Cleveland avoided a four-game sweep and maintained first place in the AL Central Division.", "The Guardians moved one game ahead of Kansas City for sole possession of first place in the division with 28 games remaining.", "The two clubs will meet again on Monday for a three-game set at Kauffman Stadium.", "Kansas City drops one game behind Cleveland in the American League Central.", "The Royals clinched the season series against the Guardians, now ahead 7-3 with three more games to play next week in Kansas City."], "ranking": [3, 6, 1, 5, 8, 12, 9, 4, 2, 11, 7, 10]}
{"candidates": ["Ten of the Guardians' last 12 day games after playing the previous day have gone UNDER the total runs line.", "Five of the Royals' last six day games against AL Central opponents have gone UNDER the total runs line.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Royals' last three day games against American League opponents."], "ranking": [2, 3, 1]}
{"candidates": ["The New York Yankees clinched their 32nd straight winning season.", "The Yankees clinched their 32nd consecutive winning season, the second-longest streak in Major League history behind the 1926-64 Yankees, who were winners in 39 straight seasons. Thirty-two straight winning seasons matches the second-longest streak in the four major pro sports, alongside the NHL’s Montreal Canadiens (1952-83).", "The New York Yankees clinched their 32nd straight winning season, the second-longest such period in major league history."], "ranking": [3, 1, 2]}
{"candidates": ["Clarke Schmidt and Nestor Cortes combined on a four-hit shutout against the Cubs.", "The Cubs were held scoreless for the 15th time this season.", "Cubs outfielder Cody Bellinger struck out in the sixth inning.", "Cubs left fielder Ian Happ committed an error while fielding a ball hit by the Yankees' Anthony Rizzo in the second inning.", "Chicago Cubs lost to the New York Yankees 2-0 on 2024-09-07.", "The Cubs have been shut out in three of their past four games.", "Clarke Schmidt and Nestor Cortes combined on a four-hitter.", "The Yankees blanked the Cubs 2-0.", "Wells grounded out to second, Torres scored, Soto to third in the 1st inning.", "Judge scored on a throwing error by catcher Bethancourt, Chisholm Jr. stole third in the 6th inning.", "Javier Assad yielded two runs (one earned) and three hits, struck out five and walked three in 5⅔ innings.", "Pete Crow-Armstrong made a notable defensive play by catching a fly ball and throwing to first baseman Michael Busch to catch Alex Verdugo off the base, although the call was overturned.", "Javier Assad struck out Juan Soto with a 93.3 mph sinker to end the fifth inning.", "Clarke Schmidt returned from the injured list and pitched into the fifth inning, combining with Nestor Cortes on a four-hitter in the Yankees’ 2-0 victory over the Cubs.", "Nestor Cortes held Chicago hitless over 4 1/3 innings in his first relief appearance since 2021.", "Austin Wells knocked in Gleyber Torres with the game’s first run on a first-inning groundout.", "New York added another run with an aggressive sixth-inning double steal, where Aaron Judge scored due to a throwing error.", "The Cubs were shut out by the Yankees for the second consecutive game.", "Giancarlo Stanton and Aaron Judge had potential home runs knocked down by strong winds.", "The Yankees scored their runs via a first-inning groundout and a throwing error by Cubs catcher Christian Bethancourt.", "Clarke Schmidt and Nestor Cortes combined on a four-hitter to blank the Chicago Cubs 2-0.", "Austin Wells drove in Gleyber Torres with a groundout in the first inning.", "Aaron Judge swiped third base and scored on a throwing error by catcher Christian Bethancourt."], "ranking": [1, 2, 14, 18, 5, 6, 3, 4, 10, 11, 15, 16, 7, 8, 9, 12, 13, 17, 19, 20, 21, 22, 23]}
{"candidates": ["Gleyber Torres and the New York Yankees meet Dansby Swanson and the Chicago Cubs on Saturday at 2:20 p.m. ET, in the second of a three-game series at Wrigley Field.", "The favored Yankees have -144 moneyline odds against the underdog Cubs, who are listed at +122.", "New York is a 1.5-run favorite (at +120 odds).", "The total is 7.5 runs for the matchup.", "Score Prediction: Cubs 5, Yankees 4", "Total Prediction: Over 7.5 runs", "Win Probabilities: Yankees 52%, Cubs 48%", "Cubs manager Craig Counsell discussed the offense-suppressing elements before the game, emphasizing that it was not an excuse."], "ranking": [8, 6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Ian Happ expressed that the team feels they have a good enough ballclub to be in the playoffs but need to play better.", "Cubs President Jed Hoyer mentioned the confusion caused by the fickle winds of Wrigley Field affecting the offense.", "Manager Craig Counsell discussed the challenges of predicting weather conditions and emphasized the need to be prepared for both pitcher-friendly and hitter-friendly situations.", "Manager Craig Counsell commented on the need to create offense on a daily basis to win games.", "Team president Jed Hoyer reflected on the Cubs' offensive struggles and the need for improvement.", "Manager Craig Counsell commented on Javier Assad's performance, stating 'He pitched very well. He did his job.'", "Clarke Schmidt expressed confidence in the Yankees' rotation, stating, 'We have a lot of talented guys on this staff and we have a lot of depth, which is really good.'", "Austin Wells commented on Schmidt's performance, saying, 'It looked the same [as earlier in the season], if not better. Really, it comes down to execution and locations, and I think that’s going to tighten up as we get further along into the end of this month.'", "Nestor Cortes shared his initial frustration about moving to the bullpen but emphasized his commitment to the team, stating, 'I’m never going to back down from a challenge. I’m never going to leave my teammates out to dry. You’re always going to get my best effort, no matter if I’m happy or not.'", "Manager Aaron Boone praised Cortes' professionalism and performance, saying, 'He went out and excelled at it.'", "Cubs president of baseball operations Jed Hoyer commented on the team's offensive struggles and the need to analyze the season's ups and downs.", "Hoyer mentioned the impact of 'park effects' and the challenging offensive environment at Wrigley Field this season.", "Nestor Cortes expressed his willingness to accept any role for the team despite initial disappointment.", "Ian Happ emphasized the need for the Cubs to play better to stay in the playoff picture."], "ranking": [12, 9, 8, 7, 6, 5, 4, 3, 2, 11, 10, 1, 13, 14]}
{"candidates": ["The game was attended by a crowd of 40,080 on a sun-chilled September afternoon.", "The Cubs' playoff odds stood at 1.1% before the game.", "The Cubs have a 72-70 record with 20 games left in the season.", "The Cubs ranked 27th with a.667 OPS in home games compared to a 10th-ranked.738 OPS in road games.", "The wind blew in on Saturday for the 33rd time at Wrigley in 70 home games, and the Cubs are 12-21 when it does.", "The Cubs pitchers ranked second in home ERA (3.22) and 21st on the road (4.36).", "The series concludes with a matchup of Gerrit Cole and Jameson Taillon, and the Cubs will induct Kerry Wood and Aramis Ramirez into their Hall of Fame.", "Yankees first baseman Anthony Rizzo received a standing ovation during the second inning.", "The game was held at Wrigley Field with an attendance of 40,080.", "The game lasted 2 hours and 34 minutes.", "Austin Wells threw out two runners trying to steal second base -- Nico Hoerner in the fourth inning and Pete Crow-Armstrong in the fifth.", "The Yankees secured their first series victory since taking two of three from the Rockies on Aug. 23-25.", "Strong winds at Wrigley Field affected the offensive performance of both teams.", "Wrigley Field had a 93 ballpark factor going into the game, ranking 29th among MLB venues in terms of offensive environment.", "Yankees first baseman Anthony Rizzo received cheers in his second game back at Wrigley Field since being traded in July 2021."], "ranking": [12, 5, 8, 9, 11, 10, 2, 3, 14, 15, 6, 1, 4, 7, 13]}
{"candidates": ["The game will be held at Wrigley Field and can be watched on MARQUEE and YES networks.", "Betting odds favor the New York Yankees at -141, with the Chicago Cubs at +120."], "ranking": [2, 1]}
{"candidates": ["Yankees reinstated Clarke Schmidt and Ian Hamilton from the 60-day injured list before the game.", "Cubs' Justin Steele was scheduled to play catch as part of his recovery from left elbow tendinitis."], "ranking": [2, 1]}
{"candidates": ["Giancarlo Stanton tied Carlos Beltrán and Nelson Cruz for the most homers in the first 35 career playoff games.", "Stanton moved into a tie with Judge and Babe Ruth for fourth in club history for postseason homers."], "ranking": [1, 2]}
{"candidates": ["The Yankees got off to a good start in Game 1 of this set, posting a 5-2 win.", "In the Tuesday matchup, New York was up 3-0 after just two innings and ended up with another victory 6-3.", "In Game 3 Thursday, the Yankees came back from a 3-1 deficit but ultimately ended up losing 7-5 in 10 innings.", "On Thursday the Guardians got an epic walk-off home run from David Fry to close out one of the team’s biggest wins ever.", "The Cleveland Guardians produced an astonishing late comeback to beat the New York Yankees.", "Outfielder Jhonkensy Noel forced an extra-inning after a sensational game-tying home run.", "Utility player David Fry hit a walk-off homer to secure the victory for Cleveland.", "The game went into extra innings, with the Guardians winning 7-5.", "Cleveland took a 3-1 lead before back-to-back home runs by Aaron Judge and Giancarlo Stanton gave the Yankees a 4-3 lead.", "Jhonkensy Noel tied the game with a two-run home run in the ninth inning.", "David Fry hit a 399-foot home run in the bottom of the tenth inning to win the game."], "ranking": [8, 6, 5, 2, 3, 4, 9, 7, 10, 1, 11]}
{"candidates": ["Riding the euphoria of a 7-5 comeback win in extra innings on Thursday, the Guardians look to extend the American League Championship series and guarantee a return to New York when they face the Yankees in Game 4.", "The game will be held at Progressive Field at 8:08 p.m. ET.", "The starting pitchers for the game are RHP Gavin Williams for the Guardians and RHP Luis Gil for the Yankees.", "Yankees LHP Carlos Rodón makes his second start of the series after a strong Game 1 outing.", "Guardians right-hander Tanner Bibee will pitch on three days' rest after being pulled early in Game 2.", "Tanner Bibee will start Game 5 with the Guardians' season at stake.", "Carlos Rodon gets the starting nod for the Yankees on Saturday, with first pitch scheduled for 8:08 p.m. ET.", "Guardians catcher Austin Hedges claimed Emmanuel Clase is the best pitcher in MLB history.", "Yankees closer Luke Weaver had been performing exceptionally well, mimicking Mariano Rivera."], "ranking": [1, 8, 3, 4, 5, 2, 6, 9, 7]}
{"candidates": ["The Cleveland Guardians will square off with the New York Yankees in Game 1 of the World Series at Progressive Field on Friday, starting at 8:08am AEDT.", "Matthew Boyd (0-0, 0.00 ERA) will be on the bump for the Guardians, up against Clarke Schmidt (0-0, 3.86 ERA) for the Yankees.", "Stats Insider's predictive analytics model currently gives the Guardians a 52% chance of beating the Yankees at Progressive Field.", "The Guardians are listed as 1.5-run underdogs against the Yankees, with odds of $1.53 available at TAB.", "For the favourite Yankees (-1.5) to cover the line, TAB offers odds of $2.45.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "The Cleveland Guardians recent form and player performance will be examined.", "The New York Yankees recent form and player performance will be examined.", "Recent betting trends and streaks involving the Cleveland Guardians will be examined.", "Recent betting trends and streaks involving the New York Yankees will be examined.", "Recent betting trends in games played between Yankees and Guardians will be examined.", "A summary that ties it all together and produces a favorable betting outcome for the Yankees vs Guardians game will be provided.", "In the starter slot for Game 4 will be New York’s Luis Gil, who went 15-7 with a 3.50 ERA in 29 starts this year.", "For the starting pitcher job Friday, Cleveland is sending out Gavin Williams, who went 3-10 with a 4.86 ERA over 16 starts in 2024.", "System Match: PLAY OVER in NYY-CLE (o/u at 7.5)", "System Match (FADE): CLEVELAND (+102 vs. NYY)", "System Match: PLAY NY YANKEES (-122 at CLE)", "System Match: PLAY OVER the total (o/u at 7.5)"], "ranking": [18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Travis Kelce expressed his delight on social media, praising the Cleveland Guardians for their remarkable victory.", "Kelce, who was born near Cleveland, was ecstatic about the team's performance."], "ranking": [1, 2]}
{"candidates": ["Yankees' Ian Hamilton injured a calf and won't be eligible for the World Series if New York advances.", "The game had an attendance of 35,263 and lasted 3 hours and 27 minutes.", "Mark Leiter Jr. was added to the Yankees’ ALCS roster before the game as an injury replacement for Ian Hamilton.", "The Guardians have a history of fighting back, having overcome a 6-2 deficit to tie Game 4.", "The Guardians previously faced elimination in the AL Division Series against the Tigers and prevailed in five games.", "The Guardians used eight pitchers for mostly stellar work.", "Second baseman Andrés Giménez and first baseman Josh Naylor made a pivotal double-gasp highlight in the 10th inning.", "The Guardians stole three bases, and all four bench players (Fry, Noel, Will Brennan, and Bo Naylor) got hits.", "Aaron Judge's home run was the second-fastest home-to-home speed of his career.", "Clay Holmes' scoreless streak in the postseason ended at 15 1/3 innings."], "ranking": [7, 10, 8, 5, 6, 4, 3, 2, 1, 9]}
