{"candidates": ["Pete Alonso's homer was No. 220 of his career, tying him with Mike Piazza for third place on the Mets’ all-time list."], "ranking": [1]}
{"candidates": ["Sean Manaea pitched into the seventh inning of the Mets' 8-3 victory against the Diamondbacks.", "Pete Alonso homered to open the scoring.", "Manaea retired Arizona in order four times and piled up 11 strikeouts on the night."], "ranking": [2, 3, 1]}
{"candidates": ["The Arizona Diamondbacks take on the New York Mets after Eugenio Suarez's four-hit game on Sunday.", "Arizona is 37-26 at home and 75-56 overall. The Diamondbacks have a 37-12 record in games when they hit two or more home runs.", "New York has a 68-63 record overall and a 33-30 record on the road. Mets hitters have a collective.419 slugging percentage to rank fourth in the NL.", "Tuesday's game is the fifth meeting between these teams this season. The season series is tied 2-2.", "PITCHING PROBABLES: Mets: Sean Manaea (9-5, 3.48 ERA, 1.17 WHIP, 138 strikeouts); Diamondbacks: Eduardo Rodriguez (2-0, 3.94 ERA, 1.25 WHIP, 11 strikeouts).", "BETMGM SPORTSBOOK: LINE Diamondbacks -116, Mets -104; over/under is 9 runs."], "ranking": [5, 2, 3, 6, 1, 4]}
{"candidates": ["Corbin Carroll expressed that he is not trying to be the team's hero but aims to help the team win every day.", "D-backs manager Torey Lovullo acknowledged the frustration in the dugout during the middle innings.", "Mets center fielder Brandon Nimmo praised Carroll's performance and acknowledged his significant contribution to the D-backs' comeback.", "Manager Carlos Mendoza emphasized the importance of winning baseball games.", "Pete Alonso expressed that tying Mike Piazza's home run record was special as Piazza was his childhood hero.", "Edwin Diaz commented, 'It was a tough loss today. We had it. We have got to keep playing baseball and at the end of the season we’ll see where we are.'", "Carlos Mendoza said he isn’t concerned about Edwin Diaz, stating, 'The past two outings he’s gotten hurt with [the slider]. Maybe he’s a little short … but the past two outings to give up a huge hit in that spot. He will make some adjustments and be ready to go.'", "Luis Severino reflected on his performance, saying, 'There was a little pain out there, but the more I pushed on it, it was a little bit tougher to push it.'", "Manager Torey Lovullo commented that the team gave extra outs which equaled unearned runs.", "Brandon Pfaadt reflected on his performance, mentioning he didn't feel great command-wise and had to use more off-speed pitches.", "Lovullo praised Jordan Montgomery for his effective pitching after a rough start.", "Edwin Díaz expressed disappointment saying, 'It's a tough loss. We had it.'", "Brandon Nimmo acknowledged the uphill battle for the Mets in the wild-card race.", "Carlos Mendoza mentioned feeling good about their chances when Díaz is their closer.", "Luis Severino commented on his injury, stating, 'A lot of pain, I'm not gonna lie. I'll have a painful next three days, but it's going to be good.'", "Brandon Nimmo reflected on the loss, saying, 'It hurts. Nothing we can do about it now, so we just move forward.'"], "ranking": [5, 12, 2, 15, 1, 8, 10, 14, 11, 6, 3, 9, 13, 4, 7, 16]}
{"candidates": ["Sean Manaea expressed confidence in his pitches and aggressive approach against hitters.", "Manager Carlos Mendoza praised Manaea's hard work and continuous improvement."], "ranking": [2, 1]}
{"candidates": ["The D-backs have been performing exceptionally well, with 21 wins and a +64 run differential since July 29, leading all of baseball.", "The D-backs' 35-14 record since July 1 is the best in the Majors in that span.", "Corbin Carroll's two home runs accounted for five of Arizona's eight runs.", "The Mets bullpen performed well in relief of Luis Severino before the eighth inning.", "Luis Severino was hit by a line drive in the third inning and continued to pitch despite limping.", "The Mets' bullpen pieced together three hitless innings before handing the ball to Díaz.", "Dedniel Núñez was unavailable due to lingering tightness in his right forearm."], "ranking": [1, 2, 3, 5, 4, 6, 7]}
{"candidates": ["The game was played in Phoenix with a temperature of 107 degrees.", "The Mets are 18-8 when Manaea starts this season, the highest number of wins behind a starter on the mound."], "ranking": [2, 1]}
{"candidates": ["Trey Sweeney had four hits, including a home run, in the game.", "Ty Madden recorded his first career win."], "ranking": [1, 2]}
{"candidates": ["The Detroit Tigers erupted for six runs in the eighth inning to beat the Athletics 9-1 at Oakland Coliseum.", "Trey Sweeney of the Detroit Tigers hit a home run during the third inning.", "Trey Sweeney had four hits, including a home run.", "Ty Madden struck out seven batters.", "Sweeney homered to right (404 feet) in the 3rd inning.", "Carpenter singled to center, Jung scored, Greene to second in the 3rd inning.", "Sweeney singled to left, Torkelson scored, McKinstry to second in the 4th inning.", "Gelof singled to right, Langeliers scored, Brown to third in the 6th inning.", "Meadows doubled to center, Sweeney scored and Torkelson scored in the 8th inning.", "Vierling doubled to center, Meadows scored in the 8th inning.", "Greene singled to right, Vierling scored, Greene to second in the 8th inning.", "Carpenter doubled to left, Greene scored in the 8th inning.", "Keith singled to left, Carpenter scored on error, Keith safe at second on fielding error by left fielder Brown in the 8th inning.", "The A's took the first game of the three-game series 7-6 in 13 innings on Friday.", "The Tigers rebounded for a 2-1 win on Saturday.", "Riley Greene, Colt Keith, Zach McKinstry, Parker Meadows, and Jace Jung have combined for 12 hits in the series for the Tigers.", "The A's have compiled 21 hits in the series, led by Lawrence Butler and Brent Rooker with four apiece.", "Detroit Tigers ace Tarik Skubal took a no-decision on Friday.", "Trey Sweeney hit a leadoff homer in the third inning.", "Ty Madden struck out seven batters in five innings.", "Lawrence Butler extended his career-best hit streak to 18 games.", "Detroit Tigers scored six runs in the eighth inning."], "ranking": [1, 5, 3, 10, 4, 12, 13, 15, 2, 6, 7, 8, 9, 16, 17, 18, 19, 11, 14, 20, 21, 22]}
{"candidates": ["The Tigers will look for a series win on Sunday afternoon against the Oakland Athletics.", "The A's will move their home games to Sacramento next season in anticipation of calling Las Vegas home in 2028.", "The Tigers haven't announced a starting pitcher for Sunday’s game, but left-hander Tyler Holton is a leading candidate to pitch first.", "The A's have announced that right-hander J.T. Ginn will start the final game of the club’s second-to-last homestand.", "The A's are taking a long look at top prospect Jacob Wilson, who has three hits in his past two starts at shortstop.", "The Detroit Tigers and Riley Greene hit the field at Oakland-Alameda County Coliseum against Brent Rooker and the Oakland Athletics on Sunday.", "The Tigers are -105 moneyline underdogs in this matchup with the favored Athletics (-115).", "Oakland is favored on the run line (-1.5).", "The over/under is 8.5 runs for the matchup.", "Score Prediction: Athletics 6, Tigers 5", "Total Prediction: Over 8.5 runs", "Win Probabilities: Athletics 50%, Tigers 50%"], "ranking": [10, 12, 8, 9, 7, 6, 5, 4, 3, 2, 1, 11]}
{"candidates": ["The Oakland Athletics will face the Detroit Tigers in MLB action at Oakland Coliseum on Sunday, commencing at 6:07am AEST.", "Brady Basso (0-0, 5.40 ERA) will start on the mound for the Athletics, while the Tigers are going with Brenan Hanifee (0-1, 1.47 ERA).", "Stats Insider's prediction and tips for the Athletics vs Tigers game are based on 10,000 simulations.", "The Athletics have a 53% chance of defeating the Tigers at Oakland Coliseum according to the predictive analytics model.", "The current betting odds in Australia for Sunday's MLB game at Oakland Coliseum are Athletics $1.91, Tigers $1.85.", "The Athletics are 1.5-run underdogs against the Tigers, with odds of $1.57 available at TAB.", "For the favourite Tigers (-1.5) to cover the line, TAB offers odds of $2.40.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "The Athletics (+1.5) are predicted to cover the line 65% of the time, while the 7.5-run over/under is considered an equal 50-50 chance of hitting."], "ranking": [8, 6, 5, 4, 3, 2, 1, 9, 7]}
{"candidates": ["Detroit Tigers ace Tarik Skubal, born in the Oakland suburb of Hayward, expressed his fondness for the Coliseum despite not securing a personal win on Friday.", "Tigers manager A.J. Hinch praised Ty Madden for his calmness and competitive spirit.", "Trey Sweeney expressed confidence in his hitting despite previous struggles.", "A's manager Mark Kotsay reflected on the emotional impact of the team's upcoming move."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The game was held at Oakland Coliseum with an attendance of 11,250.", "The game lasted 3 hours and 1 minute.", "Umpires for the game were Quinn Wolcott (Home Plate), Ryan Additon (First Base), Gabe Morales (Second Base), and Chris Guccione (Third Base).", "The A's intend to depart the Coliseum at season’s end.", "The A's will move their home games to Sacramento next season in anticipation of calling Las Vegas home in 2028.", "The Athletics will play their home games in Sacramento next season before moving to Las Vegas in 2028.", "The game drew 11,250 fans."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The Braves now have 12 extra-inning wins, which leads the big leagues.", "Matt Olson is playing his 600th consecutive game, dating to 5/2/21. Only other streaks of 600+ to begin in divisional era (1969): 1982-98 Cal Ripken Jr: 2,632, 1975-83 Steve Garvey: 1,207, 2000-07 Miguel Tejada: 1,152, 1978-83 Pete Rose: 745, 1981-86 Dale Murphy: 740, 1973-78 Rose: 678, 1969-73 Sandy Alomar Sr: 661"], "ranking": [2, 1]}
{"candidates": ["Sean Murphy’s infield ground ball with the bases loaded scored a sliding Eli White in the 11th inning, and the Atlanta Braves rallied for a gritty 4-3 win over the Toronto Blue Jays.", "Atlanta got another brilliant outing from left-hander Chris Sale, who pitched six shutout innings.", "The Braves’ decisive rally started when White led off the 11th inning with a bunt single that advanced automatic runner Michael Harris II to third base.", "Adam Duvall then reached on an error by Blue Jays third baseman Addison Barger, whose throw sailed wide to first and scored Harris to tie the game.", "Murphy followed with the bouncing ball up the middle off Zach Pop (1-4) and White was able to score, sliding in ahead of the throw from shortstop Ernie Clement.", "George Springer put the Blue Jays up 3-2 in the 11th with a bouncing single up the middle that scored Barger, who had advanced to third on a sacrifice bunt from Brian Serven.", "Sale threw a season-high 113 pitches, finishing his outing by retiring Leo Jiménez on a flyout to right after an 11-pitch battle.", "Trailing 2-1 in the ninth, White reached first on a bouncing ball up the middle for a single. Marcell Ozuna followed with a single into the left-center gap that moved White to third.", "Matt Olson then lofted a long fly ball to left, easily scoring White for the sacrifice fly that tied it.", "Braves reliever Raisel Iglesias coaxed two straight weak ground balls with the bases loaded from Nathan Lukes and Barger to end a bases-loaded threat in the 10th.", "Pinch hitter Spencer Horwitz put the Blue Jays ahead 2-1 in the eighth with a two-run homer.", "Chris Sale pitched six scoreless innings, strengthening his bid for the National League’s Triple Crown and Cy Young Award.", "Eli White played a crucial role by hitting a big ninth-inning hit and scoring the winning run in the 11th inning.", "Raisel Iglesias continued his impressive performance with a 0.00 ERA over his past 29 appearances, including a scoreless 10th inning in this game.", "Spencer Horwitz hit a home run in the 8th inning with 2 outs, scoring Ernie Clement and himself.", "Jarred Kelenic hit a home run in the 2nd inning with 2 outs.", "George Springer hit a single in the 11th inning, scoring Addison Barger.", "Adam Duvall reached on an error in the 11th inning, allowing Michael Harris II to score.", "Sean Murphy hit a fielder's choice in the 11th inning, allowing Eli White to score the winning run.", "The Atlanta Braves suffered a tough loss on Saturday against the Toronto Blue Jays, falling 9-5."], "ranking": [1, 5, 3, 4, 2, 6, 10, 8, 9, 7, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]}
{"candidates": ["Matt Olson and the Atlanta Braves will play Vladimir Guerrero Jr. and the Toronto Blue Jays on Sunday at Truist Park, at 1:35 p.m. ET.", "The Braves are favored in this one, at -281, while the underdog Blue Jays have +229 odds to play spoiler.", "Atlanta is favored on the run line (-1.5). The over/under is 7.5 runs for this game.", "Score Prediction: Braves 4, Blue Jays 3", "Total Prediction: Under 7.5 runs", "Win Probabilities: Braves 57%, Blue Jays 43%", "Chris Sale is set to make his 27th start of the season as he continues his dominant campaign.", "The Atlanta Braves ace, who’s currently the frontrunner in the NL Cy Young odds, has been virtually untouchable for most of the year.", "Sale has not allowed more than two earned runs in 15 straight starts and is coming off a seven-inning shutout against the Rockies.", "The situation on the mound for the Toronto Blue Jays is not as promising as Yariel Rodriguez will make the start.", "Rodriguez held the Twins off the board in his last outing on September 1 but lasted just three innings.", "Prior to that, Rodriguez had given up a combined 15 earned runs across his three previous starts.", "Toronto has scored three runs or fewer in seven of its last 10 contests while hitting the F5 team total Over in only three of its last 13 away games.", "Vladimir Guerrero Jr. has collected an RBI in five straight outings while batting.389 through the first four games of September.", "Guerrero Jr. has recorded only 27 of his 94 RBI this season against southpaws, though his RBI to AB ratio vs lefties (28%) is much better compared to righties (15%)"], "ranking": [12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 11, 1, 13, 14, 15]}
{"candidates": ["Braves manager Brian Snitker said, 'That was probably one of the top two or three most draining games I’ve ever been a part of. It’s great to see how they just hung in there and kept forcing the issue.'", "Murphy said, 'Just making sure I put the ball in play, and hopefully something good happens. Hit it to a good enough spot.'", "Snitker said about Sale, 'His whole year has been phenomenal.'", "Manager Brian Snitker described the game as one of the most draining he has ever been a part of and praised the team's resilience.", "Chris Sale emphasized the importance of winning games at this time of year and expressed his desire to win the World Series.", "Sean Murphy credited the pitching staff for carrying the team through the game."], "ranking": [1, 5, 3, 2, 4, 6]}
{"candidates": ["Jarred Kelenic put the Braves up 1-0 in the second on a two-out homer to right-center, which was his 15th long ball of the season.", "Sale now has an 8-1 record in games following an Atlanta loss.", "The Braves moved back into a tie with the Mets for the NL’s final Wild Card spot after this win.", "Chris Sale is tied for the league lead in wins (16) and leads in ERA (2.38) and strikeouts (213).", "Raisel Iglesias has held opponents to a.092 batting average over his past 29 appearances.", "The game was played at Truist Park with an attendance of 36,394.", "The game lasted 3 hours and 4 minutes.", "The weather was 76°F, cloudy, with a wind of 12 mph from left to right."], "ranking": [4, 3, 2, 1, 5, 8, 7, 6]}
{"candidates": ["Braves: 2B Whit Merrifield (fractured foot) could return for next weekend’s series against the Dodgers if he can tolerate the pain.", "The Braves are already missing 2B Ozzie Albies (left wrist fracture), who has been out seven weeks.", "Blue Jays: Host the Mets on Monday for the start of a three-game series. New York will start RHP Paul Blackburn (5-4, 4.66 ERA).", "Braves: Host Cincinnati on Monday for a makeup game. RHP Charlie Morton (8-7, 4.24 ERA) will start for the Braves."], "ranking": [2, 3, 1, 4]}
{"candidates": ["Ceddanne Rafaela has reached 75 runs batted in his career."], "ranking": [1]}
{"candidates": ["Kutter Crawford became the first Boston Red Sox starter with 30 starts since Nick Pivetta in 2022."], "ranking": [1]}
{"candidates": ["Tyler O’Neill ended the game with a three-run homer off Keegan Akin in the 10th inning.", "Anthony Santander hit a two-out solo homer in the eighth inning, his team-high 41st of the season.", "Emmanuel Rivera hit a go-ahead RBI single in the top of the 10th inning and also hit a third-inning home run.", "Tyler O’Neill hit a game-winning three-run home run in the bottom of the 10th inning.", "Tyler O’Neill hit a three-run homer in the 10th inning to give the Boston Red Sox a 5-3 victory over the Baltimore Orioles.", "Anthony Santander hit his 41st homer of the season to tie the game at 2 in the eighth inning.", "Emmanuel Rivera hit a leadoff homer in the third inning for the Orioles.", "Greg Weissert got the victory after giving up Emmanuel Rivera’s RBI single in the bottom of the 10th.", "Nick Pivetta strikes out Cedric Mullins", "Dean Kremer strikes out Wilyer Abreu", "Emmanuel Rivera's solo home run", "Red Sox score on a throwing error", "Ceddanne Rafaela's RBI single", "Nick Pivetta strikes out nine Orioles", "Dean Kremer fans seven Red Sox", "Anthony Santander's game-tying solo home run", "Jarren Duran's fantastic leaping catch", "Emmanuel Rivera's go-ahead single", "Tyler O'Neill's walk-off three-run home run", "Tyler O’Neill hit a three-run homer in the bottom of the 10th inning, leading the Red Sox to a walk-off win over the Orioles, 5-3.", "Nick Pivetta threw six innings allowing one run while striking out nine.", "Justin Slaten gave up a solo homer that tied the game in the eighth inning.", "Kenley Jansen pitched a scoreless ninth inning.", "Greg Weissert allowed the go-ahead run in the 10th inning before being saved by O’Neill’s homer.", "O'Neill's walk-off three-run HR lifts Red Sox over Orioles in 10.", "Nick Pivetta pitched 6.0 innings with 4 hits, 1 earned run, and 9 strikeouts.", "Emmanuel Rivera went 2-4 with a run, a home run, and 2 RBIs.", "Greg Weissert secured the win with 1.0 inning pitched, 1 hit, and 0 earned runs.", "Keegan Akin took the loss with 0.1 innings pitched, 1 hit, 1 earned run, and 1 strikeout.", "Tyler O’Neill hit a walk-off three-run home run in the bottom of the 10th inning.", "Nick Pivetta struck out nine over six strong innings, allowing one run on four hits and one walk.", "Dean Kremer pitched well, allowing two runs (one earned) over seven innings with five hits, two walks and seven strikeouts.", "Anthony Santander hit a solo home run in the eighth inning to tie the game at 2-2.", "Emmanuel Rivera hit a leadoff solo home run in the top of the third inning."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]}
{"candidates": ["Kutter Crawford allowed three runs over 6 1/3 innings but took the loss as the Red Sox offense faltered.", "Cedric Mullins hit a solo homer in the first inning and a two-run homer in the third inning off Crawford.", "Triston Casas hit an RBI double in the fourth inning.", "Masataka Yoshida hit a run-scoring double in the eighth inning.", "A balk scored Tyler O'Neill from third base in the eighth inning."], "ranking": [3, 1, 4, 2, 5]}
{"candidates": ["The Orioles on Tuesday scored five runs and that was enough for the two-run victory.", "Cedric Mullins had a strong game finishing with two hits and driving in three RBIs.", "Anthony Santander has hit 39 home runs and driven in 91 RBIs.", "Dean Kremer, starting for the Orioles, has a 7-9 record and an ERA of 4.27. In his last start against the Tampa Bay Rays, he went six innings giving up two hits and zero runs.", "The Red Sox have lost seven of their last eight games at Fenway Park against teams that held a winning record.", "The underdogs have won three of the Orioles' last four games.", "The Orioles have covered the run line in each of their last 12 games as road underdogs against American League opponents following a road win.", "The Red Sox have failed to cover the run line in seven of their last eight games at Fenway Park against teams that held a winning record.", "The Red Sox are battling for the playoff spot and they can’t be losing these games.", "Rafael Devers has hit 28 home runs and driven in 81 RBIs.", "Nick Pivetta, starting for the Red Sox, has a 5-10 record and an ERA of 4.38. In his last start against the Chicago White Sox, he went six innings giving up five hits and one run."], "ranking": [9, 6, 8, 5, 4, 10, 3, 2, 1, 7, 11]}
{"candidates": ["Keegan Akin expressed frustration over the team's inconsistent play.", "Dean Kremer reflected on the team's struggles to synchronize all aspects of their game.", "Orioles manager Brandon Hyde discussed the decision-making process during the crucial moments of the game.", "Emmanuel Rivera emphasized the need for the team to stay strong and get the job done.", "Manager Alex Cora expressed that their postseason hopes are still realistic but getting harder.", "Tyler O’Neill emphasized the importance of focusing on winning games day-by-day."], "ranking": [5, 4, 3, 2, 6, 1]}
{"candidates": ["Manager Alex Cora expressed frustration with the prolonged offensive struggles of the team.", "Cora emphasized the importance of showing up, playing, and winning the series to keep moving forward."], "ranking": [2, 1]}
{"candidates": ["The Orioles sit 1 1/2 games behind the first-place Yankees in the American League East standings.", "Baltimore is currently atop the AL Wild Card standings with a three-game advantage over Kansas City.", "The Orioles have been struggling with a 25-26 record since the All-Star break and have lost five of their past seven games.", "Tyler O’Neill is 3rd in MLB in ABs per HR (12.4; min. 20 HRs), behind Shohei Ohtani (12.1) and Aaron Judge (10.1)", "The Red Sox are four games back with 16 games to go in the American League wild-card race.", "Rafael Devers, Triston Casas, and Jarren Duran have been struggling with their performances.", "The Red Sox rotation has posted a 3.43 ERA since Aug. 15, while the bullpen has a 5.77 ERA.", "Red Sox relievers have 19 blown saves since the All-Star break, the most in baseball.", "Brennan Bernardino landed on the IL with left elbow inflammation.", "Cam Booser was reinstated after being out since Aug. 14 with left elbow inflammation.", "Liam Hendriks is in a holding pattern with elbow soreness and may not return in time.", "Tanner Houck is set to start on Friday after being skipped last time through the rotation.", "James Paxton announced his plans to retire after the 2024 season.", "Boston remains four games out of the last wild-card spot in the American League.", "The Red Sox have 16 games to play to secure a playoff spot."], "ranking": [12, 11, 10, 8, 9, 7, 6, 5, 4, 3, 2, 1, 14, 13, 15]}
{"candidates": ["The Red Sox had 13 strikeouts on the night, contributing to their offensive struggles.", "The Red Sox are now four games behind Minnesota for third place in the American League wild-card standings."], "ranking": [1, 2]}
{"candidates": ["The Kansas City Royals joined an extremely rare group in baseball history by making the playoffs the season after losing 100+ games."], "ranking": [1]}
{"candidates": ["Kansas City Royals became the first team in baseball history to make the playoffs after posting a 106-loss season the previous year.", "Bobby Witt Jr. became the first shortstop in major league history with multiple seasons of at least 30 homers and 30 steals.", "Bobby Witt Jr. is the first player in major league history with multiple 30-30 seasons in his first three years in the majors."], "ranking": [2, 1, 3]}
{"candidates": ["The Kansas City Royals shut out the Atlanta Braves 3-0 in Atlanta on Friday night.", "Kansas City Royals second baseman Michael Massey hit a double against the Atlanta Braves in the seventh inning at Truist Park on Sept 27.", "Travis d'Arnaud hit a walk-off home run to secure a 2-1 win for the Braves.", "Reynaldo López recorded nine strikeouts in his return start, each with his slider.", "Travis d’Arnaud hit a walk-off home run in the ninth inning.", "Reynaldo López came off the injured list to throw six strong innings.", "Raisel Iglesias earned the win with a perfect top half of the ninth.", "Reynaldo López struck out nine batters and lowered his season ERA to 2.00.", "The Royals stuck with Seth Lugo as their starter in Saturday’s 2-1 walk-off loss to the Braves at Truist Park.", "Reynaldo López struck out nine in six innings for the Braves.", "Travis d’Arnaud hit the walk-off home run on a 2-0 fastball in the ninth inning."], "ranking": [8, 5, 1, 4, 2, 6, 9, 3, 10, 7, 11]}
{"candidates": ["Atlanta Braves pitcher Max Fried delivered a masterful performance, leading to a 3-0 victory over the Kansas City Royals.", "Max Fried pitched three-hit ball over 8 2/3 innings to lead the Atlanta Braves to a 3-0 victory over Kansas City.", "Sean Murphy hit a two-run homer for the Braves.", "Marcell Ozuna scored on a throwing error after his first stolen base since 2022.", "Raisel Iglesias retired Salvador Perez on a flyout for his 33rd save.", "Brady Singer allowed two runs on four hits with three walks and five strikeouts."], "ranking": [1, 2, 5, 4, 3, 6]}
{"candidates": ["The Atlanta Braves lead 1-0 in a three-game series with the Kansas City Royals.", "PITCHING PROBABLES: Royals: Seth Lugo (16-9, 3.03 ERA, 1.09 WHIP, 178 strikeouts); Braves: Reynaldo Lopez (0-0)", "BETMGM SPORTSBOOK: LINE Braves -152, Royals +129; over/under is 7 1/2 runs", "Atlanta is 87-71 overall and 44-33 in home games. The Braves have gone 60-25 in games when they record at least eight hits.", "Kansas City is 40-39 on the road and 85-75 overall. The Royals have hit 168 total home runs to rank 10th in the AL.", "The teams square off Saturday for the second time this season."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["The Atlanta Braves will take on the Kansas City Royals in Game 1 of the National League Division Series at Truist Park on Saturday, starting at 9:20am AEST.", "Max Fried (10-10, 3.42 ERA) will start for the Braves, up against Brady Singer (9-12, 3.73 ERA) for the Royals.", "Stats Insider's predictive analytics model gives the Braves a 67% chance of defeating the Royals at Truist Park.", "The Braves are 1.5-run favourites against the Royals, with odds of $2.10 available at TAB.", "The over/under for total runs scored is set at 7.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "The Royals came in with their magic number at one to clinch their first playoff appearance since winning the 2015 World Series.", "The Kansas City Royals and the Atlanta Braves meet Saturday in MLB action from Truist Park.", "This will be the second installment in a three-game series.", "Seth Lugo will start for the Royals on Saturday. This year Lugo is 16-9 with a 3.03 ERA in 32 starts.", "Reynaldo Lopez will start for the Braves on Saturday. So far Lopez is 8-5 with a 2.03 ERA in 24 starts.", "Thirteen of the Braves' last 14 home games against AL Central opponents have gone UNDER the total runs line.", "Each of the Royals' last four night games against National League opponents have gone UNDER the total runs line.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Braves' last four home games.", "The 'Inning 1 UNDER 0.5 runs' market has hit in each of the Royals' last three night games."], "ranking": [12, 8, 5, 10, 11, 2, 14, 6, 7, 3, 4, 1, 9, 13]}
{"candidates": ["Reynaldo López expressed the team's mentality to do whatever is necessary to win and wreak havoc in the postseason.", "Travis d'Arnaud highlighted the confidence gained from López's performance and the team's strong rotation.", "Manager Brian Snitker praised the rotation as the best since he became the manager.", "Manager Brian Snitker expressed the emotional significance of the game, stating 'This is big here. This is playoff baseball, literally.'", "Reynaldo López reflected on his surprising season and the opportunity he was given.", "Travis d’Arnaud praised the pitching staff for keeping the team in the game.", "Manager Matt Quatraro emphasized the need to find a way to scratch out a couple of runs against great pitching for the playoffs.", "Bobby Witt Jr. expressed his bittersweet feelings about not playing all 162 games but emphasized his desire to be fully ready for postseason baseball."], "ranking": [4, 6, 3, 1, 8, 5, 2, 7]}
{"candidates": ["Kansas City Royals celebrated their playoff berth in the visitors’ clubhouse at Truist Park after the Minnesota Twins were eliminated.", "Royals' manager Matt Quatraro led the team to the playoffs in his second year.", "Bobby Witt Jr. signed an 11-year deal worth $288.7 million to serve as the cornerstone of the franchise.", "Cole Ragans praised Bobby Witt Jr., calling him the best player in baseball and highlighting his hard work and talent.", "Max Fried expressed his emotions about potentially pitching his last game for the Braves as he is set to become a free agent after the World Series.", "Royals manager Matt Quatraro praised Fried's pitching performance."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["The Royals clinched a playoff spot in the American League for the first time since the 2015 season.", "The Royals are currently tied with the Detroit Tigers for the second/third wild card spot.", "Finishing as the second wild card team would mean a playoff date with the Baltimore Orioles while the third wild card spot would mean a date with the Houston Astros.", "The Braves' win, combined with losses by the Mets and D-backs, put them a game ahead in the NL Wild Card race.", "Charlie Morton is set to start the finale against the Royals, with Chris Sale and Spencer Schwellenbach potentially saved for the Wild Card Series.", "The Braves' magic number is one, and they can clinch their seventh straight playoff appearance on Sunday.", "The Royals went with a makeshift lineup after clinching their first postseason appearance since 2015.", "Bobby Witt Jr. likely locked up the AL batting title with a.332 average.", "Sixteen-game winner Seth Lugo pitched two scoreless innings for Kansas City as a tuneup for the Wild Card Series."], "ranking": [1, 5, 8, 3, 9, 2, 6, 4, 7]}
{"candidates": ["The Royals made the playoffs despite losing first baseman Vinnie Pasquantino to a thumb injury.", "General manager J.J. Picollo built a winning team without significant financial investments.", "Veteran catcher Salvador Perez had a significant offensive season with 27 homers and 104 RBIs.", "The Royals' rotation included key players like Seth Lugo, Michael Wacha, Cole Ragans, Brady Singer, and Michael Lorenzen.", "Lucas Erceg earned 11 saves since joining the Royals in a trade with Milwaukee.", "Bobby Witt Jr. had a notable performance in the Home Run Derby, reaching the finals before losing to Teoscar Hernández.", "Kansas City Royals celebrated their first postseason berth since 2015 after Minnesota lost to Baltimore.", "Royals: 1B Vinnie Pasquantino was on the field during batting practice and will take simulated at-bats against reliever Will Smith on Saturday.", "Braves: RHP Reynaldo López threw his second side session Thursday, felt good and will be activated to start Saturday."], "ranking": [7, 5, 3, 2, 8, 6, 1, 4, 9]}
{"candidates": ["Royals' 1B Vinnie Pasquantino is hopeful to return during the playoffs after facing live pitching for the first time since his injury.", "Braves' RHP John Brebbia was optioned to Triple-A Gwinnett with López coming off the injured list."], "ranking": [1, 2]}
{"candidates": ["Shohei Ohtani became the first MLB player with 43 home runs and 43 stolen bases in the same season.", "Ohtani was already the first Dodger to join the 40-40 club, achieving the feat in 126 games — the quickest in major-league history.", "First time in Dodgers' history the team hit three consecutive home runs to lead off a game.", "Shohei Ohtani, Mookie Betts, and Freddie Freeman started the game with consecutive home runs, the first time that has happened in the Dodgers' history.", "The Dodgers achieved their first back-to-back-to-back homers to lead off a game in franchise history.", "Corbin Carroll's 14.32-second race around the bases was the seventh-fastest home-to-home time since Statcast tracking began in 2015."], "ranking": [2, 1, 5, 3, 4, 6]}
{"candidates": ["Shohei Ohtani hit an eighth-inning homer, a 380-footer off Paul Sewald, giving the Dodgers a 10-5 lead.", "Ohtani achieved his 43rd stolen base in the second inning, taking second base after Diamondbacks starter Zac Gallen threw a pitch in the dirt.", "Shohei Ohtani, Mookie Betts, and Freddie Freeman hit consecutive home runs to lead off the game.", "Corbin Carroll hit an inside-the-park home run for the Diamondbacks.", "Lourdes Gurriel Jr. hit a two-run double and a home run.", "Max Muncy hit an RBI single.", "Tommy Edman hit a two-run single in the ninth inning.", "Evan Phillips retired the side in order in the ninth inning to secure the win.", "Shohei Ohtani, Mookie Betts, and Freddie Freeman hit consecutive home runs to start the game.", "Lourdes Gurriel Jr. doubled to center, scoring two runs.", "Tommy Edman singled to right, scoring two runs in the 9th inning to secure the win for the Dodgers.", "Shohei Ohtani hit his National League-leading 44th homer and drove in two runs in the Los Angeles Dodgers' 8-6 win over the Arizona Diamondbacks.", "Tommy Edman broke a 6-6 tie with a two-run single in the top of the ninth inning.", "Ohtani, Mookie Betts, and Freddie Freeman hit consecutive homers for the Dodgers to lead off the game against Merrill Kelly.", "It is the fifth time this season that Shohei Ohtani has homered leading off the first inning.", "Ohtani hit a game-tying sacrifice fly in the second inning after Arizona turned a 3-0 deficit into a 4-3 lead in the bottom of the first.", "Shohei Ohtani hit a home run in the 1st inning.", "Mookie Betts hit a home run in the 1st inning.", "Freddie Freeman hit a home run in the 1st inning.", "Corbin Carroll hit an inside-the-park home run in the 1st inning.", "Lourdes Gurriel Jr. hit a home run in the 3rd inning.", "Tommy Edman hit a single in the 9th inning, driving in two runs to give the Dodgers the lead.", "Diamondbacks outfielder Corbin Carroll hit an inside-the-park home run in the first inning.", "Los Angeles' Shohei Ohtani, Mookie Betts, and Freddie Freeman hit back-to-back-to-back home runs in the first inning.", "The Dodgers took an 8-6 lead in the ninth inning and held on for the win.", "Shohei Ohtani hit a towering leadoff homer off D-backs right-hander Merrill Kelly.", "Mookie Betts hit a 400-foot homer two pitches later.", "Freddie Freeman hit a first-pitch homer off Kelly.", "Corbin Carroll hit an inside-the-park home run.", "Tommy Edman hit a tiebreaking two-run single in the ninth inning."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]}
{"candidates": ["The Dodgers and D-backs knew this weekend’s four-game tilt at Chase Field would set the tone for the NL West race down the stretch."], "ranking": [1]}
{"candidates": ["Manager Dave Roberts commented on Ohtani's focus and understanding of the value of the stolen base, especially during a pennant race.", "Miguel Rojas emphasized the importance of winning tight games as preparation for the playoffs.", "Evan Phillips reflected on handling emotions and the importance of fighting adversity.", "Dave Roberts highlighted the team's competitive spirit and the need to maintain intensity.", "Arizona manager Torey Lovullo said, 'There was a lot of excitement in this building. I felt the energy. The fans were engaged. There were a lot of fireworks for the first two innings. … It felt like we did enough to stay in this game.'", "Josh Bell said it felt like a postseason atmosphere.", "Dodgers manager Dave Roberts said, 'A lot of grit, fight, from both teams. And those guys gave us all we could handle.'", "D-backs manager Torey Lovullo said, 'That's one of the great qualities of this team -- their intensity, their focus, it never stops.'"], "ranking": [5, 3, 2, 4, 8, 6, 7, 1]}
{"candidates": ["Alex Bregman homered to left center (393 feet), Jose Altuve scored.", "Michael Brantley grounded into fielder's choice to first, Yordan Alvarez scored on error, Jose Abreu safe at second on throwing error by first baseman Rivera, Jose Abreu safe at third on error.", "Jeremy Peña singled to right, Jose Abreu scored, Michael Brantley to second.", "Kyle Tucker hit sacrifice fly to right, Alex Bregman scored.", "Kyle Tucker tripled to right. Kyle Tucker scored.", "Jose Abreu homered to left center (403 feet), Kyle Tucker scored.", "Lourdes Gurriel Jr. doubled to left, Jake McCarthy scored.", "Houston Astros defeated Arizona Diamondbacks 8-1.", "Cristian Javier secured the win for the Astros with a record of 10-5.", "Kyle Nelson took the loss for the Diamondbacks with a record of 7-4."], "ranking": [8, 5, 6, 4, 3, 2, 7, 1, 9, 10]}
{"candidates": ["The Houston Astros celebrated clinching a playoff spot with T-shirts and a subdued toast."], "ranking": [1]}
{"candidates": ["The Houston Astros beat the Arizona Diamondbacks 8-1 to earn their third straight AL West title.", "The game took place at Chase Field in Phoenix, Arizona with an attendance of 30,703.", "The game lasted 2 hours and 40 minutes."], "ranking": [1, 2, 3]}
{"candidates": ["Ronald Acuña Jr. became the first player in MLB history to steal 70 bases and hit 40 home runs in a season.", "Ronald Acuña Jr. became the first player in MLB history to have at least 40 homers and 70 stolen bases in a single season."], "ranking": [1, 2]}
{"candidates": ["The Braves became the third team in AL/NL history to belt 300 home runs in a season."], "ranking": [1]}
{"candidates": ["Seiya Suzuki missed a crucial fly ball in the eighth inning, allowing two late runs to score.", "Kevin Pillar hit a leadoff homer in the sixth inning, sparking a three-run outburst for the Braves.", "Ronald Acuña Jr. launched a two-run homer in the seventh inning.", "The Braves completed a seven-run comeback against the Cubs."], "ranking": [3, 2, 4, 1]}
{"candidates": ["The Chicago Cubs are projected to miss the MLB Playoffs after their loss against the Atlanta Braves on Tuesday.", "Manager David Ross expressed confidence in his team's resilience despite the tough loss.", "Reliever Drew Smyly emphasized the importance of the final stretch of the season for the Cubs."], "ranking": [1, 3, 2]}
{"candidates": ["Ronald Acuña Jr. expressed his excitement about achieving the 40-70 milestone and the importance of the win.", "Ozzie Albies reflected on the significance of Acuña's achievement and the team's performance.", "Braves manager Brian Snitker commented on Max Fried's recovery and expected return for the NL Division Series.", "Cubs manager David Ross emphasized that the loss was not due to a single mistake and highlighted other missed opportunities.", "Drew Smyly and other Cubs players expressed support for Suzuki, acknowledging his contributions throughout the season.", "Suzuki acknowledged the stadium lights were a factor in his error but did not want to use it as an excuse.", "Ronald Acuña Jr. expressed disbelief at reaching the 40-70 milestone, stating it seemed impossible.", "Ozzie Albies and Marcell Ozuna both said that Acuña's performance should assure he wins the National League MVP award."], "ranking": [1, 3, 6, 5, 8, 4, 2, 7]}
{"candidates": ["Cubs manager David Ross emphasized that he would not highlight one mistake despite the loss.", "Cubs pitcher Justin Steele and other teammates expressed their support for Seiya Suzuki.", "Ross mentioned the team's resilience and their ability to bounce back from challenges throughout the season."], "ranking": [2, 3, 1]}
{"candidates": ["The homers by Ozzie Albies and Marcell Ozuna pushed the Braves to 303 for the season, nearing the MLB record of 307 set by the Minnesota Twins in 2019.", "The crowd of 37,246 pushed the Braves over 3 million in attendance for the second season in a row and eighth time in team history.", "The Cubs are now eliminated from the division race and must secure a wild card to consider the season a success.", "The Cubs have been operating with a sense of urgency for months, needing to win consistently to stay in playoff contention.", "The Cubs were fighting for a wild-card postseason berth.", "A crowd of more than 37,000 at Truist Park witnessed the historic moment."], "ranking": [1, 2, 5, 4, 3, 6]}
{"candidates": ["Suzuki admitted that he momentarily lost the ball in the stadium’s lights.", "The Cubs were eliminated from contention for the National League Central title, which was clinched by the Brewers.", "The Phillies clinched the top Wild Card seed, holding a five-game lead over Arizona."], "ranking": [2, 1, 3]}
{"candidates": ["Cubs' 1B Jeimer Candelario returned to the lineup after being activated from the injured list.", "RH Marcus Stroman is set to pitch for the Cubs in the series finale, while the Braves will call up rookie AJ Smith-Shawver to make his fifth start of the season."], "ranking": [2, 1]}
{"candidates": ["Eugenio Suárez hit a game-ending single off the right-field wall, capping a three-run 10th inning that led Arizona Diamondbacks over the Milwaukee Brewers 11-10.", "Jackson Chourio had a career-high five RBI, including a two-out, opposite-field, two-run triple.", "Blake Walston struck out Willy Adames to strand Chourio at third to get his first big league win in his fourth appearance."], "ranking": [1, 2, 3]}
{"candidates": ["Willy Adames hit a grand slam as part of a two-homer night.", "Garrett Mitchell added a two-run homer.", "Willy Adames homered to left center (379 feet), scoring Chourio, Contreras, and Mitchell.", "Willy Adames homered to right center (386 feet).", "William Contreras homered to right center (414 feet), scoring Ortiz.", "Randal Grichuk homered to left (378 feet), scoring Smith."], "ranking": [1, 5, 2, 4, 3, 6]}
{"candidates": ["D.L. Hall gets the nod on the mound for the Milwaukee Brewers in the final of a three-game series against the Arizona Diamondbacks and Randal Grichuk on Sunday at 4:10 p.m. ET.", "The Diamondbacks’.263 batting average is second-best in MLB.", "The Brewers have a team batting average of.250 this season, which ranks eighth among MLB teams.", "Favorite: Diamondbacks (-158, bet $158 to win $100)", "Underdog: Brewers (+134, bet $100 to win $134)", "Over/under: 8.5", "Randal Grichuk and the Arizona Diamondbacks will aim to outdo William Contreras and the Milwaukee Brewers at Chase Field on Sunday at 4:10 p.m. ET.", "Predictions for the match include a score prediction of Diamondbacks 5, Brewers 4, with a total prediction of under 8.5 runs.", "Win probabilities are estimated at 52% for the Diamondbacks and 48% for the Brewers.", "Corbin Carroll and the Arizona Diamondbacks will meet Willy Adames and the Milwaukee Brewers on Sunday at Chase Field, at 4:10 p.m. ET.", "The Brewers are +134 moneyline underdogs for this matchup against the favorite Diamondbacks (-158).", "Arizona (-1.5) is favored on the run line.", "The matchup's over/under is listed at 8.5 runs.", "Score Prediction: Diamondbacks 5, Brewers 4", "Total Prediction: Under 8.5 runs", "Win Probabilities: Diamondbacks 52%, Brewers 48%"], "ranking": [14, 2, 3, 10, 11, 13, 1, 9, 7, 12, 8, 15, 16, 4, 5, 6]}
{"candidates": ["Eugenio Suárez commented 'Crazy game. They gave me that opportunity.'", "Acting manager Jeff Banister reflected on his decision to intentionally walk Brice Turang, saying 'I walked him right into their hottest hitter. That’s on me.'"], "ranking": [2, 1]}
{"candidates": ["Arizona Diamondbacks improved to 37-1 this year when taking a five-run lead.", "Milwaukee Brewers have not overcome a five-run deficit to win on the road since May 11, 2018.", "Diamondbacks manager Torey Lovullo missed the game to attend a memorial service in California for former major leaguer Billy Bean.", "Gold Glove catcher Gabriel Moreno was activated from the injured list by Arizona and pinch hit in the seventh.", "Right-hander Paul Sewald was put on the 15-day injured list with left neck discomfort.", "Blake Walston was recalled from Triple-A Reno and reliever Dylan Floro was designated for assignment."], "ranking": [1, 2, 5, 4, 6, 3]}
{"candidates": ["The game was held at Chase Field in Phoenix, Arizona with an attendance of 44,886.", "The game lasted 3 hours and 3 minutes."], "ranking": [2, 1]}
{"candidates": ["Spencer Horwitz recorded his first career four-hit game.", "Spencer Horwitz had his second multi-homer game of his career.", "Jose Berrios set a career-high for wins with his 15th win of the season.", "The Braves’ starting pitchers had allowed three runs or fewer in 25 straight games, setting a franchise record that was also the sixth-longest streak in MLB history."], "ranking": [4, 2, 3, 1]}
{"candidates": ["Spencer Horwitz homered twice among his four hits.", "José Berríos pitched six effective innings.", "Horwitz homered to center (420 feet) in the 2nd inning.", "Horwitz homered to right center (421 feet) in the 4th inning.", "Clement doubled to left, Barger scored in the 4th inning.", "Loperfido doubled to center, Clement scored in the 4th inning.", "Horwitz doubled to right, Guerrero Jr. scored on error, Horwitz safe at third on throwing error by second baseman Williams in the 5th inning.", "Wagner grounded out to first, Horwitz scored in the 5th inning.", "Harris II singled to right, Urshela scored, Harris II out stretching at second in the 5th inning.", "Lukes singled to center, Clement scored, Loperfido to second in the 9th inning.", "Guerrero Jr. grounded into fielder's choice to second, Loperfido scored, Lukes out at second in the 9th inning.", "Wagner singled to center, Guerrero Jr. scored, Horwitz to second in the 9th inning.", "Kelenic singled to right, Olson scored on fielding error by right fielder Lukes, Laureano to second in the 9th inning.", "Williams doubled to left, Laureano scored and Kelenic scored, Arcia to third in the 9th inning.", "Harris II grounded out to second, Arcia scored, Williams to third in the 9th inning.", "Spencer Horwitz hit two solo home runs and an RBI double against Braves starting pitcher Spencer Schwellenbach.", "Horwitz added a ninth-inning single to finish the night 4-for-5.", "José Berríos earned his 15th win of the season, allowing one run on five hits over six innings.", "Spencer Horwitz homered twice among his four hits and had three RBIs.", "Jose Berrios pitched six effective innings, allowing one earned run and five hits.", "Ernie Clement and Joey Loperfido had back-to-back RBI doubles.", "Nathan Lukes, Vladimir Guerrero Jr., and Will Wagner contributed to the Blue Jays' three runs in the ninth inning.", "Jarred Kelenic, Orlando Arcia, and Luke Williams contributed to the Braves' four runs in the bottom of the ninth inning.", "Blue Jays rookie Spencer Horwitz homered twice and doubled off the right-field wall against Braves rookie Spencer Schwellenbach, powering the Jays to a 9-5 win at Truist Park in Atlanta that snapped a four-game losing skid.", "Spencer Schwellenbach surrendered a career-worst 10 hits, including two home runs, and six runs -- though just three earned -- over five innings.", "Schwellenbach surrendered leadoff homers to Horwitz in both the second and fourth innings.", "Luke Williams, who was playing second base in place of Merrifield, committed a two-out throwing error, leading to consecutive doubles by Ernie Clement and Joey Loperfido.", "Max Fried pitched seven innings of one-run ball, allowing five hits and a walk while striking out eight.", "The Atlanta Braves won 3-1 against the Toronto Blue Jays to open their series."], "ranking": [24, 16, 20, 18, 21, 22, 23, 25, 26, 27, 28, 29, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 17, 19]}
{"candidates": ["Jose Berrios will take the mound for the Toronto Blue Jays against the Atlanta Braves and Matt Olson on Saturday at 7:20 p.m. ET.", "The Braves are favored in this one, at -162, while the underdog Blue Jays have +137 odds to upset.", "Atlanta is favored on the run line (-1.5 with +130 odds).", "The total for the matchup has been set at 7.5 runs.", "Score Prediction: Braves 5, Blue Jays 4", "Total Prediction: Over 7.5 runs", "Win Probabilities: Braves 56%, Blue Jays 44%", "Jose Berrios will take the mound for the Toronto Blue Jays against Matt Olson and the Atlanta Braves on Saturday at 7:20 p.m. ET.", "The Braves have the 16th-ranked batting average in the majors (.241).", "The Blue Jays have the 25th-ranked ERA (4.37) in the majors this season."], "ranking": [8, 5, 6, 9, 3, 4, 2, 8, 7, 1]}
{"candidates": ["Horwitz credited assistant hitting coach Matt Hague for his performance.", "Horwitz expressed gratitude for learning from Vladimir Guerrero Jr.", "José Berríos reflected on his goal of achieving 20 wins in a season.", "Braves manager Brian Snitker emphasized the importance of focusing on the next game.", "Jose Berrios expressed his satisfaction with reaching 15 wins and highlighted the team's enjoyment of winning.", "Spencer Schwellenbach reflected on the challenges of pitching many innings and his efforts to recover and compete.", "Braves manager Brian Snitker expressed pride in his team's resilience despite the injuries and losses, stating, 'I’m proud of how these guys have continued to play and fight, regardless of the guys we’ve lost. We’re still staying relevant and playing for something.'", "Spencer Schwellenbach reflected on his performance, saying, 'I can live with being in the zone and getting beat while attacking guys. That was just one of those days.'", "Schwellenbach also commented on his physical condition, stating, 'It is a grind. I haven’t thrown this many innings in my life. But I’m doing whatever I can to recover and get in the training room and the weight room and anything I can to come out and pitch each time. Physically, I feel fine. There’s nothing wrong mentally. I just have to keep going.'", "Max Fried expressed that he has been commanding the ball better and credited his defense for making great plays.", "Fried mentioned his goal to give it all he has to get back to the postseason.", "Braves catcher Travis d’Arnaud praised Fried for staying calm and executing well."], "ranking": [9, 8, 7, 6, 5, 4, 1, 3, 2, 10, 11, 12]}
{"candidates": ["Schwellenbach allowed a career-worst 10 hits over five innings.", "The Braves committed two errors, both of which led to runs.", "Braves' INF Whit Merrifield was out of the lineup due to a foot fracture.", "The Braves fell to 7-37 this season in games they've allowed five runs or more.", "Whit Merrifield entered the clubhouse with a protective boot and revealed he fractured his left foot on Friday night.", "The Braves are now one game behind the Mets in the battle for the NL’s final Wild Card spot.", "Spencer Schwellenbach has posted a 3.78 ERA through his first 17 career starts and has thrown 142 2/3 innings between the Minor and Major League levels this year.", "The Braves are tied for the third and final Wild Card spot with the Mets.", "The Braves have closed the gap on the Padres and Diamondbacks for the first and second Wild Card spots."], "ranking": [6, 8, 4, 3, 5, 2, 9, 1, 7]}
{"candidates": ["Atlanta Braves Player Prop Facts: Austin Riley has hit a home run in each of his last three appearances against AL East opponents that held a losing record.", "Jorge Soler has recorded a Double in three of his last four home appearances against AL East opponents.", "Ozzie Albies has recorded at least one Single in each of his last seven appearances at Truist Park against opponents that held a losing record.", "Jarred Kelenic has recorded at least one total base in each of the Braves last 14 games against AL opponents at Truist Park.", "Marcell Ozuna has recorded at least one hit in each of the Braves' last 11 night games against opponents that held a losing record.", "Ronald Acuna Jr. has scored at least one run in seven of his last eight appearances at Truist Park against AL opponents that held a losing record.", "Jarred Kelenic has recorded at least one RBI in five of the Braves' last six games against AL East opponents.", "Toronto Blue Jays Player Prop Facts: Jose Berrios has recorded a win in six of his last seven appearances.", "Vladimir Guerrero Jr. has recorded at least one RBI in each of the Blue Jays' last four games against NL East opponents that held a winning record.", "Alejandro Kirk has recorded at least one hit in each of his last eight appearances against NL East opponents.", "Bo Bichette has scored at least one run in each of his last five road appearances against the Braves.", "Daulton Varsho has hit a home run in two of the Blue Jays' last three night games against opponents that held a winning record.", "Jose Berrios has recorded five or more strikeouts in each of his last six appearances in night games.", "George Springer has recorded at least one Single in eight of the Blue Jays' last nine road games against NL East opponents.", "Alejandro Kirk has recorded at least one total base in each of his last eight appearances against NL East opponents."], "ranking": [5, 12, 9, 11, 8, 4, 10, 2, 6, 7, 3, 1, 14, 13, 15]}
{"candidates": ["The Minnesota Twins meet the Boston Red Sox leading the series 1-0.", "Saturday's game is the fifth time these teams match up this season. The Twins are ahead 3-1 in the season series.", "PITCHING PROBABLES: Twins: Pablo Lopez (15-8, 3.84 ERA, 1.15 WHIP, 187 strikeouts); Red Sox: Kutter Crawford (8-15, 4.19 ERA, 1.10 WHIP, 162 strikeouts)", "BETMGM SPORTSBOOK: LINE Twins -139, Red Sox +117; over/under is 8 runs"], "ranking": [2, 3, 1, 4]}
{"candidates": ["The Boston Red Sox will take on the Minnesota Twins in MLB action at Fenway Park on Saturday, beginning at 9:10am AEST.", "Richard Fitts (0-0, 0.00 ERA) will start for the Red Sox, while the Twins will counter with David Festa (2-6, 5.07 ERA).", "Stats Insider's predictive analytics model gives the Red Sox a 51% chance of beating the Twins at Fenway Park.", "The Red Sox are listed as 1.5-run underdogs against the Twins, with odds of $1.60 available at TAB.", "For the favourite Twins (-1.5) to cover the line, TAB offers odds of $2.35.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Red Sox (+1.5) are predicted to cover the line 63% of the time, while the 8.5-run over/under is expected to go over 54% of the time."], "ranking": [7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["The game between the Minnesota Twins and Boston Red Sox scheduled for Saturday was postponed because of rain.", "A split doubleheader is planned for Sunday at Fenway Park.", "The regularly scheduled game was moved from 1:35 p.m. to 12:35 p.m.", "The rained-out game will be the second game, with the first pitch scheduled for 5:35 p.m.", "Due to unceasing rain and a coastal flood alert for Suffolk County, Saturday’s Red Sox-Twins game has been postponed.", "The American League teams will now wrap up their season series with a split doubleheader on Sunday."], "ranking": [5, 4, 3, 2, 6, 1]}
{"candidates": ["Chris Bassitt has reached 1,000 pitcher strikeouts in his career.", "Daulton Varsho has reached 500 strikeouts in his career.", "Jarren Duran is the first player since at least 1901 to record 40 doubles, 10 triples, 20 home runs, and 30 stolen bases in a season.", "Vladimir Guerrero Jr. tied Rafael Devers for most extra-base hits in the AL by age 25 with 333."], "ranking": [2, 4, 1, 3]}
{"candidates": ["George Springer hit a three-run home run in the top of the fifth inning.", "Jarren Duran hit a two-run blast to center field in the bottom of the eighth inning.", "On the day Rich Hill joined the Red Sox, they pulled out a much-needed 6-3 victory over the Toronto Blue Jays."], "ranking": [2, 1, 3]}
{"candidates": ["Manager Alex Cora switched up the routine on Tuesday, cutting back on the pregame work for his players.", "Rafael Devers was out of the lineup for Tuesday night’s win with shoulder soreness and is out again tonight.", "Brayan Bello, who has posted one win in his last seven starts, will take the mound for the Sox.", "Chris Bassitt is 2-0 with a 2.38 ERA in five career starts against the Red Sox, going at least six innings in all of them. He has struggled in his last three starts, going 0-2 while allowing 14 runs in 15 innings.", "The Blue Jays will take on the Red Sox once again on Wednesday night with Chris Bassitt pitching against Bryan Bello.", "Chris Bassitt is 9-12 with a 4.41 ERA while Bryan Bello is 11-6 with a 4.95 ERA."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["The game between the Toronto Blue Jays and the Boston Red Sox is scheduled for Wednesday, August 28, 2024, at 7:10 PM ET at Fenway Park.", "The Toronto Blue Jays have a team batting average of.240 and have scored a total of 564 runs this season.", "The Boston Red Sox have a team batting average of.259 and have scored 640 runs this season.", "Chris Bassitt of the Blue Jays has a record of 9 wins and 2 losses with an ERA of 4.41.", "Brayan Bello of the Red Sox has a record of 11 wins and 6 losses with an ERA of 4.95.", "The odds indicate a close contest, with the Red Sox slightly favored at home and the total set at 9.5 with favorable odds towards the over.", "The Toronto Blue Jays are set to face the Boston Red Sox at Fenway Park on August 28, 2024.", "The expected starting pitchers for the game are Chris Bassitt for the Blue Jays and Brayan Bello for the Red Sox.", "The moneyline odds for the game have the Blue Jays at +118 and the Red Sox at -141.", "The over/under for the game is set at 9.5 runs.", "The Boston Red Sox will take on the Toronto Blue Jays in MLB action at Fenway Park on Wednesday, commencing at 9:10am AEST.", "Cooper Criswell (5-4, 4.41 ERA) will start on the mound for the Red Sox, while the Blue Jays are going with Yariel Rodríguez (1-5, 4.33 ERA).", "Based on advanced machine learning and data, Stats Insider has simulated the outcome of Wednesday's Boston vs Toronto MLB match-up 10,000 times.", "Our leading predictive analytics model currently gives the Red Sox a 55% chance of beating the Blue Jays at Fenway Park.", "The latest betting odds in Australia for Wednesday's MLB game at Fenway Park are shown here: Head to Head: Red Sox $1.71, Blue Jays $2.15; Line: Red Sox -1.5 ($2.40), Blue Jays +1.5 ($1.57); Total (Over/Under 9.5 Runs): Over $1.91, Under $1.91.", "According to Stats Insider's analytics model, the Blue Jays (+1.5) are predicted to cover the line 62% of the time, while the 9.5-run over/under is expected to stay under 52% of the time.", "The match-up between the Red Sox and Blue Jays at Fenway Park is scheduled to commence at 9:10am AEST on Wednesday.", "Teams: Boston Red Sox vs Toronto Blue Jays; Date: Wednesday 28 August 2024; Time: 9:10am AEST; Venue: Fenway Park."], "ranking": [18, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17]}
{"candidates": ["Chris Bassitt credited his success to switching his spot on the mound from the first base side to the third base side.", "John Schneider praised Bassitt's mix of pitches and his ability to locate fastballs.", "Alex Cora admired Bassitt's pitching strategy and execution.", "John Schneider acknowledged Brayan Bello's effective pitching and strategy.", "Chris Bassitt praised Brayan Bello's performance, noting his accuracy and effectiveness.", "Brayan Bello expressed his enjoyment of the game and the importance of staying focused.", "Red Sox manager Alex Cora praised Bello's performance as his best outing in the big leagues.", "Bello emphasized the importance of winning the game to keep moving forward in their playoff push.", "Despite the loss, Vladimir Guerrero Jr. had another productive day at the plate.", "The loss halted the Jays winning streak and dropped them to 65-69 on the season.", "The Red Sox moved up to 68-64 and are now 4.0 games back of the Minnesota Twins in the battle for the third and final wild card spot in the American League."], "ranking": [8, 6, 5, 7, 4, 10, 3, 2, 9, 1, 11]}
{"candidates": ["Manager Alex Cora reflected on how optimistic he felt with the additions at the deadline compared to where the club is now in a stretch of 27 games in 27 days."], "ranking": [1]}
{"candidates": ["David Hamilton injured a finger when he tried to bunt and left the game in the top of the ninth.", "The game was attended by 32,809 people at Fenway Park.", "The Red Sox have scored five or more runs 67 times, third most in MLB behind the Diamondbacks (70) and Yankees (68).", "Bello is 2-4 with a 6.96 ERA in seven career starts against Toronto. He picked up a win and a loss against the Blue Jays in June.", "Abreu has 29 RBI in his last 38 games since July 9, batting.295 with a.974 OPS in that span.", "In 34 games since the All-Star break, Masataka Yoshida has hit.336 with a.936 OPS."], "ranking": [5, 6, 3, 4, 2, 1]}
{"candidates": ["Sea Dogs broadcasters Emma Tiedemann and Rylee Pay called the game as part of the Women’s Celebration Game at Fenway Park.", "The game was the completion of a game suspended in June.", "Dave O’Brien and Kevin Youkilis shared the booth with Tiedemann and Pay."], "ranking": [2, 3, 1]}
{"candidates": ["The victory snapped a streak of 20 straight games in which the White Sox lost Chris Flexen's starts — the longest such stretch in MLB history.", "The White Sox snapped a historic streak by winning a game started by Chris Flexen after losing 20 consecutive games started by him, an MLB record.", "Chris Flexen's winless streak extended to 21 straight starts, the longest in team history.", "The White Sox had lost Chris Flexen's previous 20 starts, which is a major league record."], "ranking": [1, 2, 4, 3]}
{"candidates": ["Interim manager Grady Sizemore emphasized the importance of playing clean, competitive baseball."], "ranking": [1]}
{"candidates": ["Manager Alex Cora expressed frustration, stating 'We had a chance. It was a tie game in the ninth, we just didn’t finish that inning.'", "Richard Fitts reflected on his debut, saying 'Today was really special because I got to share it with my family and I’m really honored to be a Red Sox, today and hopefully for a long time.'", "Cora praised Fitts for his performance and mental readiness.", "Zack Kelly attributed his poor performance to bad luck, noting that everything the White Sox got off him was weakly hit but found the hole.", "Cora offered a pointed assessment of Kelly’s outing, citing 'lack of execution' and the need for consistency.", "Red Sox manager Alex Cora commented, 'We had a chance, right? And it was a tie game in the ninth, so we just didn't finish that inning.'", "Cora also mentioned, 'We didn't do much today offensively. They put the ball in play, found some holes, and obviously, the ninth inning, that happened. But offensively, we didn't do much. It’s a tough one.'", "Richard Fitts reflected on his debut, saying, 'Today was really special, just because I got to share it with my family. I’m really honored to be a Red Sox today, and hopefully for a long time.'", "Triston Casas reflected on a fielding error, 'Hard hit. It hit the grass and then popped up, and I anticipated the next hop being just as high, and it just stayed down.'", "Casas also commented on the team's situation, 'We knew September was going to be a dogfight, but we’re right where we want to be. We have our backs against the wall and we have to play well for sure, but that just puts that much more focus on these types of games.'", "A former baseball executive commented on the White Sox's historically bad season, noting they are 'inventing ways to lose games'.", "Interim manager Grady Sizemore commented, 'That’s just the kind of game we want to play.'", "Chris Flexen reflected on his performance, saying, 'He was hitting the spots, he was making good pitches, keeping them kind of off-balance.'", "Flexen also credited the defense for their performance.", "Fletcher commented on the importance of adding runs in the ninth inning, 'Any time you can add runs, it’s big.'", "Sizemore reflected on the team's performance, 'We played very clean, took care of the ball, made some great plays, good throws.'", "Grady Sizemore praised the team's clean play and clutch at-bats.", "Chris Flexen reflected on his routine and the importance of not giving up.", "Chris Flexen commented on his winless streak, emphasizing sticking with his routine and competing.", "Dominic Fletcher highlighted the team's competitive spirit despite recent struggles.", "Red Sox manager Alex Cora reflected on the team's lack of offensive production."], "ranking": [11, 14, 16, 18, 10, 12, 14, 7, 5, 1, 3, 9, 15, 6, 8, 13, 4, 2, 17, 19, 20]}
{"candidates": ["The Red Sox are now one game over.500 at 72-71 with 19 games to play.", "Next up for the Red Sox is a series against the Orioles, who are seeking to solidify their position in the AL East championship race.", "The game was held at Fenway Park with an attendance of 29,110.", "The game lasted 2 hours and 35 minutes.", "Weather conditions were 69°F, with wind at 11mph out to right field, and sunny with no precipitation.", "The White Sox need to go 10-8 in their final 18 games to avoid tying the 1962 New York Mets (40-120) for the most losses in Major League Baseball’s modern era.", "Korey Lee returned to the lineup after being a late scratch on Friday and sitting out Saturday due to a back tweak.", "The win ensured a happy flight home for the White Sox.", "The MLB-worst White Sox are nine losses away from tying the 1962 New York Mets for the most losses since 1900.", "The 1899 Cleveland Spiders hold the MLB loss record at 20-134."], "ranking": [8, 5, 9, 10, 10, 2, 6, 4, 1, 3]}
{"candidates": ["Boston starter Richard Fitts was recalled from Triple-A Worcester before the game.", "Red Sox manager Alex Cora mentioned that RHP Tanner Houck would be pushed back for extra rest and start on Friday.", "Trevor Story came off the injured list and played Saturday after expected season-ending shoulder surgery in April."], "ranking": [2, 3, 1]}
{"candidates": ["Aaron Boone achieved his 500th win as a manager.", "The New York Yankees swept a doubleheader at Fenway Park for the first time since 2006.", "Ceddanne Rafaela hit his first career home run in MLB.", "Aaron Boone achieved his 500th win as a manager."], "ranking": [2, 1, 3, 4]}
{"candidates": ["Nick Pivetta struck out 10 batters over 5 1/3 innings of work.", "Gleyber Torres had a go-ahead, two-run single in the sixth inning of the first game and started a game-ending double play with the bases loaded.", "Carlos Rodón struck out nine over five innings in the night game, allowing one run and four hits.", "Ceddanne Rafaela hit his first big league home run.", "Rafael Devers hit his 30th home run of the season and the 25th of his career against the Yankees.", "Nick Ramirez finished with a perfect ninth for his first major league save.", "Ceddanne Rafaela hit a 400-foot leadoff home run against Carlos Rodón.", "New York Yankees won game one of Tuesday's double-header to snap a seven-game losing streak against Boston.", "The Yankees and Red Sox played a regular-season game on Tuesday afternoon in front of maybe 10,000 people at Fenway Park.", "The Sox took a 2-0 lead before Nick Pivetta blew up a one-hit shutout with 10 strikeouts by allowing three runs in the sixth inning.", "The Sox drew three consecutive one-out walks off Yankees closer Clay Holmes in the ninth inning, bringing Alex Verdugo to the plate with the winning run on second base.", "Alex Verdugo grounded into a game-ending double play in the first contest on Monday despite feeling confident against Yankees reliever Clay Holmes.", "The Yankees won that game, 4-1. The Sox were hitless in 19 at-bats with runners in scoring position and left 20 runners on base over the two games.", "Matt Bowman strikes out his first batter since 2019 during the Yankees vs Red Sox game on September 12, 2023.", "Ceddanne Rafaela homered to left in the 1st inning.", "Estevan Florial singled to center in the 5th inning, scoring Everson Pereira.", "Jake Bauers grounded into a fielder's choice in the 6th inning, scoring Gleyber Torres.", "Gleyber Torres singled to left in the 9th inning, scoring Oswaldo Cabrera.", "Austin Wells reached first base on catcher's interference in the 9th inning, allowing Everson Pereira to score."], "ranking": [5, 1, 4, 10, 2, 11, 8, 15, 14, 6, 12, 3, 9, 13, 7, 16, 17, 18, 19]}
{"candidates": ["The Boston Red Sox face the New York Yankees in MLB action at Fenway Park on Tuesday, beginning at 9:10am AEST.", "The Red Sox will send Kutter Crawford (6-7, 4.36 ERA) to the mound, pitting him against Clarke Schmidt (9-8, 4.54 ERA) for the Yankees.", "Stats Insider's best betting tips for Red Sox vs Yankees, as well as the latest betting odds in Australia, are featured in this article.", "Based on high-tech machine learning and data, Stats Insider has simulated Tuesday's Boston-NY Yankees MLB match-up 10,000 times.", "Our proven predictive analytics model gives the Red Sox a 53% chance of beating the Yankees at Fenway Park.", "The latest betting odds in Australia for Tuesday's MLB game at Fenway Park are listed here: Head to Head: Red Sox $1.77, Yankees $2.10; Line: Red Sox -1.5 ($2.50), Yankees +1.5 ($1.56); Total (Over/Under 9.5 Runs): Over $1.90, Under $1.90.", "Looking at the latest head-to-head odds, PointsBet currently has the Red Sox at $1.77 and the Yankees at $2.10.", "The Red Sox are 1.5-run favourites against the Yankees, with odds of $2.50 currently available at PointsBet.", "For the underdog Yankees (+1.5) to cover the line, PointsBet currently has odds of $1.56.", "The Over/Under for total runs scored is set at 9.5 with PointsBet, which currently has odds for the Over at $1.90 and odds for the Under at $1.90.", "According to Stats Insider's model, the Yankees (+1.5) have a 64% chance of covering the line, while the Over/Under total of 9.5 runs has a 53% chance of going Over.", "While the Red Sox have a higher chance of winning the game, betting on the Yankees to win is our preferred option due to the edge identified when comparing our data-led probabilities to the odds currently on offer.", "The game between the Red Sox and Yankees at Fenway Park is scheduled to begin at 9:10am AEST on Tuesday.", "Teams: Boston Red Sox vs New York Yankees; Date: Tuesday 12 September 2023; Time: 9:10am AEST; Venue: Fenway Park.", "The Yankees enter this series on the back of a tough stretch, having lost the first series they played in two weeks.", "The Yankees have a paltry 1-8 record against the Red Sox in the 2023 season.", "The Yankees' strength in 2023 lies in their pitching, ranking third in the league with a.233 batting average against (BAA) and a respectable 3.99 ERA.", "The Red Sox have thrived offensively, boasting a.264 batting average (3rd),.329 on-base percentage (7th),.437 slugging percentage (6th), and a.766 OPS (7th).", "The Yankees have faced road woes, holding a 32-36 record away from home with a 4.08 ERA (ranking 11th) and an anemic.228 batting average (ranking 29th).", "A successful outing would bolster New York’s postseason aspirations, especially with a showdown against another AL East Wild Card contender, the Toronto Blue Jays, and a series against the Pittsburgh Pirates following this road trip.", "The Yankees can ill-afford another losing skid, considering the limited games left in the season and the looming threat of their first losing season since 1992.", "Both teams have had to grapple with injuries that have significantly impacted their roster depth.", "The Yankees have had to cope with the season-ending losses of key players like RHP Luis Severino and the promising switch-hitting prospect Jasson Dominguez due to injuries.", "The Red Sox have also seen important players sidelined, including outfielder Jarren Duran and left-handed pitcher James Paxton."], "ranking": [20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 21, 22, 23, 24]}
{"candidates": ["Aaron Boone expressed a wish that his 500th win had come earlier.", "Alex Cora acknowledged the Red Sox's difficult position in the wild card race.", "Verdugo said there are 'plenty of times' he walks to the plate knowing he will take a strike. But in his mind, this was a time to be aggressive.", "Sox manager Alex Cora didn’t fault Verdugo, citing his success against Holmes."], "ranking": [2, 4, 3, 1]}
{"candidates": ["The Yankees wore caps to honor first responders of the 9/11 terrorist attacks.", "The opening game had the lowest attendance at Fenway Park for a Red Sox-Yankees game since May 27, 1999, not including pandemic-restricted crowds in 2020 and 2021.", "Ceddanne Rafaela did the 'Ice in my veins' celebration after his home run.", "The home run was Rafaela's first career at-bat against the Yankees.", "The Yankees are trying to avoid their first losing season since 1992 and owner Hal Steinbrenner has vowed to make changes in how the team operates.", "The Sox continue to plod through what could well be the final weeks of Chaim Bloom’s tenure as chief baseball officer.", "The rivals combined to start eight rookies in Game 1, a 3-2 victory for the Yankees.", "The Yankees swept a doubleheader at Fenway Park for the first time since 2006.", "The game had an attendance of 30,392 and lasted 3 hours and 39 minutes."], "ranking": [8, 5, 6, 4, 2, 3, 7, 1, 9]}
{"candidates": ["Yankees RHP Jonathan Loáisiga was placed on the 15-day injured list with right elbow swelling.", "Red Sox RHP Kenley Jansen exited the second game with fatigue and illness symptoms."], "ranking": [2, 1]}
{"candidates": ["The Yankees' starting pitchers for the series are Clarke Schmidt, Carlos Rodón, TBD, and Michael King.", "The Red Sox's starting pitchers for the series are Kutter Crawford, Nick Pivetta, Tanner Houck, and TBD.", "Aaron Judge has a.206 batting average in 40 career road games against the Red Sox.", "Giancarlo Stanton boasts a.325 batting average in 32 career road games against the Red Sox.", "Gleyber Torres has had success on the road against the Red Sox, with a.265 batting average in his career.", "DJ LeMahieu has a.268 batting average in 32 road games against the Red Sox in his career.", "Alex Verdugo has performed well against the Yankees this season, boasting a.325 batting average with 13 hits.", "Rafael Devers has been a standout player, hitting.429 with 15 hits, 7 RBI, and 11 runs scored against the Yankees this season.", "Justin Turner has been on fire against the Yankees this season, batting.395 with 15 hits, 14 RBI, 7 runs, and 4 home runs."], "ranking": [9, 8, 7, 6, 5, 4, 3, 2, 1]}
{"candidates": ["Kyle Schwarber’s fourth-inning homer was the 19th of his postseason career, the most ever by a left-handed hitter. He passed Hall of Famer Reggie Jackson.", "The pickoff-caught stealing in the first inning was the first time Trea Turner was caught stealing all season. Including the postseason, he had stolen 40 consecutive bases without being caught. This is the third-longest span in major league history, tied with former Phillie Jimmy Rollins (2007-08).", "Kyle Schwarber's 19th postseason home run, a record for left-handed hitters"], "ranking": [1, 2, 3]}
{"candidates": ["Alek Thomas became the ninth player in MLB history with a game-tying, pinch-hit home run in the eighth inning or later of a postseason game. He is the youngest player ever to do it.", "Thomas' homer was the fourth pinch-hit home run in the playoffs in Diamondbacks history."], "ranking": [1, 2]}
{"candidates": ["A dramatic eighth-inning pinch-hit homer by Alek Thomas and RBI single by Gabriel Moreno gave the Arizona Diamondbacks three runs in the bottom of the eighth, propelling them to a come-from-behind 6–5 victory over the Philadelphia Phillies.", "The Phillies cut the deficit to 2–1 when Schwarber led off the fourth with a homer to right off Kyle Nelson, a 115-mph drive that traveled 409 feet.", "The Phillies extended their lead to 5–2 in the top of the seventh on a one-out triple to right by center fielder Johan Rojas and sacrifice fly by Turner.", "Kevin Ginkel pitched around a leadoff single to left by Bohm, holding the Phillies scoreless in the top of the eighth.", "Craig Kimbrel gave up the winning run in Game Three, to pitch the bottom of the eighth.", "Alek Thomas hit a game-tying home run, the sixth time in the history of the LCS (est. 1969) a pinch-hitter hit a game-tying home run.", "Gabriel Moreno drove a 100-mph fastball to the outfield for a go-ahead single.", "Paul Sewald struck out Turner to end the game and even the series.", "Alek Thomas hit a dramatic, score-tying, pinch-hit two-run homer off Craig Kimbrel in the eighth inning", "Gabriel Moreno hit the go-ahead RBI single four batters later", "Philadelphia's bullpen imploded in the eighth inning", "Paul Sewald struck out three in the ninth to secure the save in Game 4", "Arizona Diamondbacks came back from a three-run deficit to beat the Philadelphia Phillies 6-5.", "Alek Thomas hit a two-run home run in the eighth inning off Craig Kimbrel.", "Gabriel Moreno hit a game-winning double off Jose Alvarado.", "Zack Wheeler delivered seven shutdown innings, giving up one run and five hits with a walk while striking out eight.", "Bryce Harper, Kyle Schwarber, and J.T. Realmuto homered.", "Bryson Stott hit an RBI single and Harper slid home in a collision with catcher Gabriel Moreno as part of a double steal.", "Schwarber’s homer was his fifth in the NLCS and 20th of his postseason career.", "Schwarber’s sixth-inning drive traveled 461 feet over the swimming pool beyond the right-center fence.", "Harper hit a 444-foot homer into the right-field seats.", "Realmuto added a two-run homer in the eighth against Luis Frías.", "Craig Kimbrel gave up three runs in the eighth inning, including a tying homer by Alek Thomas.", "Kyle Schwarber hit a solo homer.", "Brandon Marsh added a run-scoring double.", "Trea Turner contributed with a sacrifice fly.", "Gabriel Moreno drove in the go-ahead run with a single off José Alvarado.", "Paul Sewald closed out the game for the Diamondbacks.", "The Diamondbacks scored three runs in the eighth inning off Craig Kimbrel to stun the Phillies in Game 4, tying the series 2-2.", "Game 4 was a bullpen game, with both teams using eight pitchers."], "ranking": [1, 14, 12, 20, 25, 2, 10, 5, 3, 11, 16, 7, 18, 9, 15, 22, 24, 26, 27, 28, 29, 4, 6, 8, 13, 17, 19, 21, 23, 30]}
{"candidates": ["Alek Thomas hit a game-tying, pinch-hit home run in the bottom of the eighth inning.", "Gabriel Moreno singled home a run in the third inning and did the same in the eighth, giving the Diamondbacks a 6-5 lead."], "ranking": [1, 2]}
{"candidates": ["The Arizona Diamondbacks square off with the Philadelphia Phillies in Game 4 of the National League Championship Series at Chase Field on Saturday, beginning at 11:07am AEDT.", "The Diamondbacks will send Joe Mantiply (2-0, 9.00 ERA) to the mound, while the Phillies are going with Cristopher Sánchez (0-0, 0.00 ERA).", "Stats Insider's best betting tips for Diamondbacks vs Phillies, as well as the latest betting odds in Australia, are featured in this article.", "Using state-of-the-art machine learning and data, Stats Insider has simulated Saturday's Arizona-Philadelphia MLB game 10,000 times.", "Our leading predictive analytics model gives the Phillies a 53% chance of winning against the Diamondbacks at Chase Field.", "The latest betting odds in Australia for Saturday's MLB game at Chase Field are listed here: Head to Head: Diamondbacks $2.10, Phillies $1.75; Line: Diamondbacks +1.5 ($1.71), Phillies -1.5 ($2.20); Total (Over/Under 9.5 Runs): Over $1.90, Under $1.90.", "According to Stats Insider's analytics model, the Diamondbacks (+1.5) have a 59% chance of covering the line, while the 9.5-run Over/Under has a 51% chance of staying Under.", "The game between the Diamondbacks and Phillies at Chase Field is scheduled to commence at 11:07am AEDT on Saturday.", "Teams: Arizona Diamondbacks vs Philadelphia Phillies; Date: Saturday 21 October 2023; Time: 11:07am AEDT; Venue: Chase Field."], "ranking": [8, 6, 5, 4, 3, 2, 1, 9, 7]}
{"candidates": ["Alek Thomas expressed his gratitude and amazement at the moment, calling it 'unreal' and 'awesome.'", "Evan Longoria highlighted the significance of Thomas' home run, suggesting it could be a pivotal moment if the team wins the trophy."], "ranking": [2, 1]}
{"candidates": ["This was the fourth come-from-behind victory for the Diamondbacks in the 2023 postseason. No other team has more than two.", "Kyle Schwarber’s fourth-inning homer was his 11th in an LCS, tied for second-most with Jose Altuve, who homered earlier Friday. Manny Ramirez leads the list with 13.", "The game featured a bullpen game for the Diamondbacks due to a shortage of starting pitching", "The crowd at Chase Field erupted in support of the Diamondbacks, imitating the Citizens Bank Park crowd that has supported the Phillies", "The Diamondbacks were picked to finish fourth in the NL West but are now two games from the World Series.", "The Phillies have the fourth-highest payroll and a collection of stars, making them the overwhelming favorite in the series.", "Trea Turner was picked off by Joe Mantiply in the first inning, which was a positive sign for the Diamondbacks.", "Philadelphia moved one win from its second straight World Series appearance.", "The series resumes Monday in Philadelphia, where the Phillies are 6-0 this postseason with 17 homers."], "ranking": [1, 2, 8, 5, 3, 6, 9, 4, 7]}
{"candidates": ["The Diamondbacks' bullpen celebrated wildly after Thomas' home run, causing some chaos as closer Paul Sewald was warming up.", "Thomas had struggled earlier in the season and was sent to Triple-A Reno to make mechanical adjustments before returning to the majors."], "ranking": [1, 2]}
{"candidates": ["Brandon Lockridge hit the first home run of his career.", "Luis Arraez is trying to hold off Shohei Ohtani and Marcell Ozuna for the NL batting title, which would be his third batting crown in three years for three different teams, a feat never done in MLB history.", "Yu Darvish's win was his 203rd as a professional pitcher, tying Hiroki Kuroda for the most pro wins for a Japanese-born pitcher between the United States and Japan."], "ranking": [3, 1, 2]}
{"candidates": ["The San Diego Padres hit three home runs in the ninth inning.", "Kyle Higashioka hit a two-run home run to put San Diego ahead.", "Brandon Lockridge followed with a solo home run.", "Donovan Solano added a two-run home run, capping off a five-run final frame.", "Padres starting pitcher Randy Vasquez struck out four batters over six innings.", "The Diamondbacks were held to just two hits the entire night.", "Luis Arraez hit two doubles and a triple.", "Yu Darvish pitched 5 1/3 innings, giving up three runs on three hits, walking three, and striking out four.", "The Padres scored four runs in the first inning.", "Corbin Carroll hit a solo homer for the Diamondbacks.", "Robert Suarez secured his 36th save in 42 chances.", "The San Diego Padres scored five runs in the top of the ninth inning to defeat the Arizona Diamondbacks 5-0.", "A.J. Puk allowed a two-run home run to Kyle Higashioka and a solo home run to Brandon Lockridge in the ninth inning.", "Scott McGough gave up a two-run homer to Donovan Solano in the ninth inning.", "Randy Vasquez no-hit the Diamondbacks for five innings before Corbin Carroll's leadoff double in the sixth inning."], "ranking": [12, 8, 9, 10, 5, 4, 3, 6, 2, 7, 11, 1, 13, 14, 15]}
{"candidates": ["The Padres won 5-3 against the Diamondbacks at Chase Field.", "The Padres scored four runs in the first inning.", "Corbin Carroll hit a leadoff homer for the Diamondbacks.", "Eugenio Suárez hit an RBI single in the sixth inning.", "Merrill Kelly struck out eight batters in 5 2/3 innings."], "ranking": [3, 4, 2, 5, 1]}
{"candidates": ["The San Diego Padres play the Arizona Diamondbacks with a 1-0 series lead.", "The teams square off Saturday for the 12th time this season. The Padres are ahead 6-5 in the season series.", "PITCHING PROBABLES: Padres: Yu Darvish (7-3, 3.31 ERA, 1.06 WHIP, 78 strikeouts); Diamondbacks: Eduardo Rodriguez (3-4, 5.56 ERA, 1.52 WHIP, 44 strikeouts).", "The Padres have nothing to clinch over the weekend so they’ve called up Randy Vasquez for today.", "Padres manager Mike Schildt rested key players including Luis Arraez, Jackson Merrill, and Fernando Tatis Jr.", "Schildt emphasized the competitive spirit of his club regardless of the lineup."], "ranking": [3, 2, 5, 1, 4, 6]}
{"candidates": ["The Diamondbacks needed to win three games against the Padres to control their postseason fate.", "The Arizona Diamondbacks open a three-game series at home against the San Diego Padres on Friday.", "The season series between the Diamondbacks and Padres is tied 5-5.", "Pitching probables for the game are Martin Perez for the Padres and Merrill Kelly for the Diamondbacks.", "The Diamondbacks have hit 207 total home runs to rank third in the NL.", "The Padres are 39-21 in games when they did not allow a home run."], "ranking": [5, 2, 4, 6, 1, 3]}
{"candidates": ["Padres manager Mike Schildt congratulated Brandon Lockridge on his milestone home run.", "Schildt acknowledged the fight in his club, no matter the lineup.", "Fernando Tatis Jr. expressed excitement about the upcoming Wild Card Series at Petco Park.", "Arizona manager Torey Lovullo commented on the team's effort and the impact of the early deficit.", "A.J. Puk expressed his disappointment but remained optimistic about the next game, stating, 'I feel good. It's just one of those things, it's baseball, things happen like that. I'm looking forward to getting back out there tomorrow, trying to get that win so we can get to the playoffs.'", "Christian Walker acknowledged the Padres' strong performance, saying, 'Gotta tip your hat. It's frustrating to say but there's two sides of it. Somebody else is doing their job when they're getting you out. We had some opportunities, just couldn't execute when it mattered.'"], "ranking": [3, 5, 2, 6, 1, 4]}
{"candidates": ["D-backs manager Torey Lovullo expressed determination despite losing control of their postseason destiny.", "Ketel Marte acknowledged the team's mistakes but remained hopeful.", "Lovullo emphasized the team's readiness and determination to win the next game."], "ranking": [2, 3, 1]}
{"candidates": ["The Padres' victory kept Arizona tied for the final wild card spot heading into the final full day of the regular season.", "The Monday double-header between the New York Mets and the Atlanta Braves holds potential to shake up the wild card standings.", "The Braves hold a one-game lead over both the Mets and Diamondbacks in the wild card standings.", "The Padres secured the No. 4 spot in the National League bracket and will host a best-of-three Wild Card Series.", "The Diamondbacks are in a tight race for the final two NL wild cards, sitting just behind the Mets and Braves.", "The Padres made several excellent defensive plays, including two by Nick Ahmed and a spectacular diving stop by Manny Machado.", "Ketel Marte made several outstanding defensive plays for the Diamondbacks.", "Eduardo Rodriguez pitched 4.2 shutout innings, giving up four hits and two walks while striking out three."], "ranking": [6, 3, 5, 8, 4, 2, 7, 1]}
{"candidates": ["The Diamondbacks are in a virtual three-way tie with the Mets and Braves for the National League's No. 2 Wild Card spot.", "The D-backs lead baseball in runs scored."], "ranking": [1, 2]}
{"candidates": ["The Diamondbacks' loss made it impossible for them to clinch a playoff spot on Sunday.", "Brandon Pfaadt will start the series finale for the Diamondbacks against left-hander Martin Perez."], "ranking": [1, 2]}
{"candidates": ["The White Sox became the first team since 1900 with at least three losing streaks of 12 games in the same season.", "White Sox lost for the 109th time this season, which is likely to be the most defeats in MLB history."], "ranking": [2, 1]}
{"candidates": ["Cade Povich struck out 10 while pitching into the eighth inning.", "Grady Sizemore, Chicago’s interim manager, was ejected for the first time since taking over.", "Andrew Benintendi was ejected after arguing a strike call.", "Ryan O’Hearn and Anthony Santander hit consecutive RBI doubles in the first inning.", "Colton Cowser drew a bases-loaded walk in the second inning.", "Eloy Jiménez's popup led to three runs scoring due to a collision between Miguel Vargas and Andrew Benintendi.", "Cedric Mullins added an RBI single in the fourth inning.", "Anthony Santander hit a sacrifice fly in the fifth inning.", "Nick Nastrini walked six batters and exited trailing 7-0 in the second inning.", "A collision between Miguel Vargas and Andrew Benintendi cost the White Sox three runs.", "Cade Povich pitched 7.1 innings with 10 strikeouts and no runs allowed.", "Gunnar Henderson scored 3 runs and stole a base.", "Anthony Santander hit a double and a sacrifice fly, driving in 2 runs.", "Colton Cowser walked twice and drove in 2 runs.", "Ryan O'Hearn hit a double and drove in a run.", "Cedric Mullins had an RBI single.", "Cade Povich struck out 10 while pitching into the eighth inning.", "The Baltimore Orioles took a big early lead on their way to a 9-0 victory over the White Sox.", "Chicago White Sox suffered their 12th consecutive loss.", "Miguel Vargas collided with teammate Andrew Benintendi while trying to catch a fly ball, resulting in an error that allowed two more runs to score for the Orioles.", "The Orioles scored four runs in the second inning, extending their lead to 7-0.", "White Sox interim manager Grady Sizemore and Andrew Benintendi were ejected in the sixth inning by home plate umpire Hunter Wendelstedt."], "ranking": [14, 10, 12, 6, 11, 2, 15, 16, 5, 3, 1, 8, 9, 13, 7, 4, 18, 20, 19, 17, 21, 22]}
{"candidates": ["The Chicago White Sox head into the matchup with the Baltimore Orioles after losing 11 in a row.", "Baltimore has an 80-59 record overall and a 40-30 record in home games.", "Chicago has a 31-108 record overall and a 13-54 record on the road.", "Tuesday's game is the sixth time these teams square off this season. The Orioles have a 5-0 advantage in the season series."], "ranking": [1, 3, 4, 2]}
{"candidates": ["Cade Povich expressed comfort and confidence due to the early lead provided by the offense.", "The loss to the Orioles was the White Sox’s 109th of the season, leaving them just 11 defeats shy of tying the modern mark set by the 1962 Mets."], "ranking": [2, 1]}
{"candidates": ["The Orioles retook the AL East lead, moving a half-game ahead of the Yankees.", "Miguel Vargas was removed from the game with a bruise around his right eye after a collision.", "Eloy Jiménez was hit in the side of the head by a throw but remained in the game.", "The game was played at Oriole Park at Camden Yards with an attendance of 15,108.", "The game lasted 2 hours and 44 minutes.", "Weather conditions were 73°F, sunny, with a wind of 6 mph in from Centerfield."], "ranking": [1, 3, 2, 6, 5, 4]}
{"candidates": ["Bobby Witt Jr. became the first shortstop in the history of the Major Leagues to record multiple 30-homer, 30-stolen base seasons.", "Bobby Witt Jr.'s first career batting title is the Royals’ fifth in franchise history, and he became just the third Royal to lead the Majors in batting average, joining George Brett in 1980 (.390) and Willie Wilson in 1982 (.332).", "Reynaldo Lopez posted a historic ERA of 2.00, the seventh lowest in Braves franchise history for a season with a minimum of 130 innings pitched."], "ranking": [1, 2, 3]}
{"candidates": ["Charlie Morton gave up a three-run homer to Michael Massey in the first inning.", "Michael Massey hit a two-run home run in the first inning.", "Hunter Renfroe hit a solo homer.", "Gio Urshela homered for the Braves.", "Alec Marsh allowed one earned run over five innings for the win.", "Kris Bubic pitched a scoreless ninth for his first save.", "Michael Massey hit a three-run homer in the first inning off Braves’ righty Charlie Morton.", "Alec Marsh earned the win with five innings of two-run ball (one earned).", "The Royals’ bullpen delivered four scoreless innings to secure the victory.", "Kris Bubic earned his first career save.", "Charlie Morton gave up a three-run homer to Michael Massey in the first inning.", "The Atlanta Braves squandered a chance to clinch a postseason berth, losing to the Kansas City Royals 4-2.", "Reynaldo Lopez pitched six innings, allowing just one run on two hits, with no walks and nine strikeouts in his first start off the injured list."], "ranking": [12, 8, 10, 9, 7, 6, 1, 5, 4, 3, 11, 2, 13]}
{"candidates": ["The Atlanta Braves will try to keep their three-game home win streak alive when they face the Kansas City Royals.", "Sunday's game is the third meeting between these teams this season.", "Matt Olson has 37 doubles, a triple, 29 home runs and 98 RBI while hitting.247 for the Braves.", "Michael Harris II is 18-for-43 with a double, a triple and five home runs over the last 10 games.", "Bobby Witt Jr. leads the Royals with 32 home runs while slugging.590.", "Salvador Perez is 9-for-41 with a double and two RBI over the past 10 games.", "Braves: 7-3,.275 batting average, 2.97 ERA, outscored opponents by 20 runs in the last 10 games.", "Royals: 3-7,.174 batting average, 2.40 ERA, outscored by 13 runs in the last 10 games.", "Matt Olson and the Atlanta Braves will take on Salvador Perez and the Kansas City Royals at Truist Park in the final of a three-game series.", "The favored Braves have -214 moneyline odds to win against the underdog Royals, who are listed at +178.", "Atlanta is the favorite on the run line (-1.5).", "The over/under is 8.5 runs for this game.", "Score Prediction: Braves 5, Royals 4", "Total Prediction: Over 8.5 runs", "Win Probabilities: Braves 54%, Royals 46%"], "ranking": [1, 15, 4, 3, 5, 6, 2, 8, 9, 10, 11, 12, 13, 14, 7]}
{"candidates": ["Braves manager Brian Snitker commented on the unique situation of the season.", "Charlie Morton reflected on his performance and the support from fans.", "Matt Olson acknowledged the good pitches made by John Schreiber.", "Royals manager Matt Quatraro expressed pride in the team's success and acknowledged the team's hard work throughout the season.", "Bobby Witt Jr. expressed excitement about the team's postseason opportunity and reflected on the team's journey from 106 losses last year to the postseason this year."], "ranking": [3, 2, 5, 4, 1]}
{"candidates": ["Atlanta Braves will play a doubleheader against the New York Mets to determine playoff eligibility.", "If the Braves win either game on Monday, they advance to a Division Series matchup at San Diego.", "Bobby Witt Jr. earned the AL batting title with a.332 average.", "The Royals ended the 2024 season with 86 wins, a 30-win improvement from 2023.", "The Royals clinched the No. 5 seed in the American League and will face the No. 4-seed Orioles in a best-of-three Wild Card Series at Camden Yards."], "ranking": [5, 4, 3, 2, 1]}
{"candidates": ["Atlanta hosts doubleheader Monday against the New York Mets, a makeup of two games that were rained out last week.", "Atlanta and the Mets are both 88-72, and Arizona finished 89-73. If either team sweeps, the Diamondbacks reach the playoffs but if the doubleheader is split, the Mets and Braves advance and Arizona is out."], "ranking": [2, 1]}
{"candidates": ["Jasson Dominguez hit his second home run of the season.", "Aaron Judge hit his 55th home run of the season.", "Gleyber Torres hit a solo home run.", "Giancarlo Stanton picked up an RBI with a hard-hit double.", "Luis Gil allowed four runs on five hits while walking three and striking out five over 5.1 innings.", "Clay Holmes ran into trouble in the bottom of the eighth, but Luke Weaver got out of the inning and retired the side in order to close out the game.", "Aaron Judge, Jasson Domínguez and Gleyber Torres homered as the Yankees swept the A's in their final visit to the Oakland Coliseum."], "ranking": [7, 5, 4, 3, 2, 6, 1]}
{"candidates": ["The Oakland Athletics will face the New York Yankees in MLB action at Oakland Coliseum on Sunday, beginning at 11:07am AEST.", "JP Sears (11-11, 4.24 ERA) will start for the Athletics, pitting him against Carlos Rodón (15-9, 4.12 ERA) for the Yankees.", "Based on trusted computer power and data, Stats Insider has simulated the result of Sunday's Oakland vs NY Yankees MLB match-up 10,000 times.", "Our independent predictive analytics model gives the Yankees a 63% chance of beating the Athletics at Oakland Coliseum.", "The Athletics are 1.5-run underdogs against the Yankees, with odds of $1.90 available at TAB.", "For the favourite Yankees (-1.5) to cover the line, TAB offers odds of $1.92.", "The over/under for total runs scored is set at 8.167 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's model, the bookmakers have got it right and both the Athletics and the Yankees have a 50% chance of covering the line.", "The 8.167-run over/under is expected to go over 52% of the time.", "Stats Insider provides full coverage of the Oakland vs NY Yankees game on Sunday, including data-driven predictions and expert tips.", "The game between the Athletics and Yankees at Oakland Coliseum is scheduled to begin at 11:07am AEST on Sunday.", "Our Oakland vs NY Yankees predictions are based on 10,000 data-driven simulations of the game, carefully curated by our team of expert data scientists and analysts."], "ranking": [10, 8, 9, 7, 6, 5, 4, 3, 2, 1, 11, 12]}
{"candidates": ["Aaron Judge expressed pride in his performance, continuing to build on his American League MVP candidacy."], "ranking": [1]}
{"candidates": ["Zac Gallen struck out a season-best 11 in six innings.", "D-backs pitchers combined for a season-high 17 strikeouts."], "ranking": [1, 2]}
{"candidates": ["Zac Gallen struck out a season-high 11 in Arizona's 8-2 win over the Giants.", "Gallen allowed just two hits and one run over six innings of work.", "Zac Gallen struck out 11 in six innings.", "Pinch hitter Pavin Smith hit a three-run homer.", "The Arizona Diamondbacks ended a three-game losing streak with an 8-2 win over the San Francisco Giants.", "In the 2nd inning, Fitzgerald doubled to center, Conforto scored.", "In the 2nd inning, Gurriel Jr. singled to right, Walker scored.", "In the 2nd inning, Moreno singled to center, McCarthy scored, Suárez to second.", "In the 2nd inning, Carroll hit a sacrifice fly to right, Suárez scored.", "In the 3rd inning, Moreno walked, Walker scored, McCarthy to second, Gurriel Jr. to third.", "In the 4th inning, Walker singled to left, Marte scored, Pederson to second.", "In the 8th inning, Ramos singled to right, Yastrzemski scored, Ramos out stretching at second.", "In the 8th inning, Smith homered to right center (406 feet), Perdomo scored and Carroll scored."], "ranking": [1, 5, 3, 2, 4, 9, 10, 11, 12, 8, 6, 7, 13]}
{"candidates": ["Heliot Ramos had four hits on Tuesday in an 11-0 win over the Diamondbacks.", "The season series between the Giants and Diamondbacks is tied 6-6.", "Ketel Marte leads the Diamondbacks with a.295 batting average, and has 23 doubles, two triples, 35 home runs, 63 walks and 93 RBI.", "Eugenio Suarez is 10-for-41 with a home run and six RBI over the past 10 games.", "Ramos has a.270 batting average to lead the Giants, and has 22 doubles, three triples and 22 home runs.", "Michael Conforto is 10-for-39 with four home runs and 10 RBI over the last 10 games.", "D-backs came into the game having lost three straight games and were in desperate need of a win to stop the negative momentum.", "D-backs manager Torey Lovullo held a brief team meeting after Tuesday night's 11-0 loss to remind the team of their capabilities."], "ranking": [1, 5, 3, 6, 2, 4, 7, 8]}
{"candidates": ["Christian Walker mentioned the importance of the win to regain confidence and swagger.", "Zac Gallen expressed that it was the best he had felt in a while and credited a good game plan for his performance.", "Giants manager Bob Melvin emphasized the need to put the ball in play more.", "Mason Black acknowledged his control issues and felt out of sync mechanically."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Christian Walker emphasized the importance of the win for the team's confidence and momentum.", "Zac Gallen expressed satisfaction with his performance, noting that everything was working well.", "Torey Lovullo praised Gallen for rising to the occasion and delivering a strong performance."], "ranking": [2, 3, 1]}
{"candidates": ["The Diamondbacks are.001 behind the New York Mets for the second of three National League wild cards.", "The Braves and Mets had to postpone the final two games of their series until a Monday doubleheader due to Hurricane Helene.", "The Diamondbacks broke a three-game losing streak with an 8-2 victory over the Giants.", "The D-backs' lead over the Braves in the NL Wild Card chase was hanging by a thread.", "Gallen's final line was 6 innings, 2 hits, 2 walks, and 11 strikeouts.", "The D-backs' record improved to 88-71, while the idle Atlanta Braves are 86-71 and the Mets are 87-70."], "ranking": [4, 6, 2, 5, 1, 3]}
{"candidates": ["Arizona has an 87-71 record overall and a 42-35 record at home.", "The Diamondbacks have the best team on-base percentage in the NL at.337.", "San Francisco has a 38-42 record in road games and a 79-79 record overall.", "The Giants have gone 33-61 in games when they have allowed a home run.", "With the win, the D-backs are tied with the Mets for the second NL Wild Card spot and have a one-game lead over the Braves.", "The D-backs lead all of baseball in runs scored this year.", "The D-backs have Thursday off before starting a three-game series with the Padres, who are ahead of them in the Wild Card race."], "ranking": [5, 2, 6, 7, 1, 3, 4]}
{"candidates": ["Diamondbacks' RHP Paul Sewald threw a short bullpen session as he works his way back from a neck/shoulder issue.", "Neither the Giants nor the Diamondbacks have named a starter for their upcoming series openers on Friday."], "ranking": [2, 1]}
{"candidates": ["Gunnar Henderson tied a franchise record for shortstops with his 34th home run.", "Chicago lost its 20th straight game in which Chris Flexen started, setting a major league mark for most consecutive losses in a pitcher's starts.", "Gunnar Henderson tied a franchise record for shortstops with his 34th home run.", "Chicago lost its 20th straight game in which Chris Flexen started, setting a major league mark for most consecutive losses in a pitcher's starts.", "Gunnar Henderson tied a franchise record for shortstops with his 34th home run.", "Gunnar Henderson tied the Orioles' single-season home run record for a shortstop with his 34th home run, matching Cal Ripken Jr. and Miguel Tejada."], "ranking": [3, 1, 5, 4, 2, 6]}
{"candidates": ["Gunnar Henderson hit a home run in the 1st inning.", "Cedric Mullins hit a home run in the 8th inning.", "Austin Slater hit a double in the 3rd inning.", "Emmanuel Rivera hit a triple in the 6th inning.", "Corbin Burnes pitched 5 innings with 4 strikeouts and allowed only 1 earned run.", "Gunnar Henderson hit his 34th home run.", "Cedric Mullins homered with three RBI.", "Austin Slater and Henderson each drove in three runs.", "Baltimore’s leadoff batter reached in each of the first six innings.", "Baltimore went 7 for 23 with runners in scoring position.", "Baltimore scored six runs in the sixth inning.", "Cedric Mullins hit a two-run homer in the eighth inning.", "Orioles score six runs in the 6th inning", "Gunnar Henderson led off the first inning with a home run.", "Cedric Mullins homered with three RBIs.", "Austin Slater and Gunnar Henderson each drove in three runs for Baltimore.", "Baltimore's leadoff batter reached in each of the first six innings.", "The Orioles scored six runs in the sixth inning.", "Cedric Mullins hit a two-run homer in the eighth inning.", "Gunnar Henderson hit his 34th home run.", "Cedric Mullins hit a home run to right (362 feet), scoring Cowser.", "Gunnar Henderson hit a sacrifice fly to left, scoring Mullins.", "Adley Rutschman singled to right, scoring Slater.", "Cedric Mullins doubled to right, scoring Santander and moving Cowser to third.", "Austin Slater singled to left, scoring Cowser and Mullins.", "Ezequiel Rivera tripled to right, scoring Slater and Holliday.", "Gunnar Henderson grounded out to second, scoring Rivera.", "Gunnar Henderson hit a leadoff home run for the Baltimore Orioles against the Chicago White Sox on September 2, 2024.", "Jackson Holliday's nice backhanded stop seals the win", "Gunnar Henderson hit a home run in his first at-bat, ending a weeklong drought and scoring the Orioles' first run.", "The Orioles won the game 13-3 against the White Sox.", "Cedric Mullins hit a two-run homer in the bottom of the eighth inning.", "Each Orioles starter recorded a hit and scored a run for the first time since August 25, 2017.", "Cedric Mullins goes 3-6 with 3 RBIs as Orioles blow out White Sox in 3-game series opener", "Orioles' Gunnar Henderson smashes his 34th home run of the season, a solo shot vs. White Sox"], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}
{"candidates": ["Baltimore manager Brandon Hyde expressed hope that the game would give their hitters some confidence.", "Baltimore manager Brandon Hyde expressed hope that the game would give their hitters some confidence.", "Chris Flexen reflected on his disappointing performance.", "Gunnar Henderson expressed pride in tying the home run record and emphasized focusing on helping the team win.", "Manager Brandon Hyde praised Henderson's performance and the team's ability to regain momentum.", "Starter Corbin Burnes highlighted the team's offensive potential and hoped the game would spark continued success."], "ranking": [6, 6, 5, 1, 2, 3]}
{"candidates": ["The game had an attendance of 35,906 at Oriole Park at Camden Yards.", "The game lasted 3 hours and 14 minutes.", "Weather conditions were 81°F, sunny with wind 8mph in from left field.", "Baltimore had their most prolific offensive day since scoring a season-high 17 runs on June 20 against the Yankees.", "Baltimore's 18 hits were their most since collecting 18 at Houston on June 21.", "Chicago is on pace to finish 36-126, which would be the second-most defeats behind the 1899 Cleveland Spiders at 20-134.", "Baltimore's most prolific offensive day since scoring a season-high 17 runs on June 20 against the Yankees.", "Chicago is on pace to finish 36-126, which would be the second-most defeats behind the 1899 Cleveland Spiders at 20-134.", "The game was held at Oriole Park at Camden Yards with an attendance of 35,906.", "The game lasted 3 hours and 14 minutes.", "The Baltimore Orioles extended Chicago’s losing streak to 11 games.", "The Orioles' 12th leadoff home run of the season tied the franchise record set in 1996 and leads MLB this year."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 12]}
{"candidates": ["Baltimore selected the contract of INF/OF Nick Maton from Triple-A Norfolk and designated C David Bañuelos for assignment.", "White Sox INF Brooks Baldwin took batting practice with no restrictions.", "Orioles RHP Jacob Webb threw a scoreless inning with a walk in a rehabilitation appearance for Triple-A Norfolk.", "Baltimore selected the contract of INF/OF Nick Maton from Triple-A Norfolk and designated C David Bañuelos for assignment.", "White Sox INF Brooks Baldwin took batting practice with no restrictions.", "Orioles RHP Jacob Webb threw a scoreless inning in a rehabilitation appearance for Triple-A Norfolk.", "Chicago rookie RHP Nick Nastrini makes his second start Tuesday night since returning to the majors last week.", "Baltimore counters with rookie LHP Cade Povich, who is winless in his last six starts."], "ranking": [8, 7, 6, 8, 7, 6, 3, 1]}
{"candidates": ["Gunnar Henderson tied and then surpassed Cal Ripken Jr.'s team record for a rookie with 91 runs scored."], "ranking": [1]}
{"candidates": ["Grayson Rodriguez pitched eight outstanding innings, allowing five hits, striking out seven without a walk.", "Gunnar Henderson homered and drove in three runs.", "Henderson hit a two-run home run in the second inning.", "Henderson added an RBI single in the fourth inning.", "Adley Rutschman followed with a run-scoring single in the fourth inning.", "Cedric Mullins and Ramón Urías hit RBI singles in the fifth inning.", "The Orioles won 5-4 in 11 innings against the Rays, securing a two-game lead over the Rays for first place in the AL East."], "ranking": [5, 4, 3, 2, 6, 1, 7]}
{"candidates": ["Grayson Rodriguez commented on the team's readiness and confidence despite a recent losing streak.", "Manager Brandon Hyde expressed amazement at Gunnar Henderson's performance as a rookie.", "Rays manager Kevin Cash acknowledged the Orioles' strong offense and momentum.", "The Orioles secured their first playoff spot since 2016.", "The Orioles ended a seven-year playoff drought, making the postseason for the first time since 2016.", "The race for both the AL East and the number one seed in the AL playoff picture is still ongoing between the Orioles and Rays."], "ranking": [3, 2, 4, 1, 1, 5]}
{"candidates": ["The Orioles extended their streak to 87 consecutive series of at least two decisions without being swept.", "The Orioles snapped a four-game skid that equaled their season high.", "The Orioles clinched the season series against the Rays, securing a potentially crucial tiebreaker in the AL East.", "Tampa Bay's bullpen allowed its first earned run since Sept. 4, ending a streak of four or fewer earned runs allowed in 11 consecutive games."], "ranking": [3, 2, 1, 4]}
{"candidates": ["Tampa Bay put INF Taylor Walls on the paternity list and selected the contract of INF Tristan Gray from Triple-A Durham.", "The Rays recalled INF Greg Jones from Durham and placed him on the 60-day injured list.", "The Orioles recalled RHP Mike Baumann from Triple-A Norfolk and optioned RHP Bryan Baker to Norfolk.", "Baumann pitched the ninth inning."], "ranking": [4, 3, 2, 1]}
{"candidates": ["Brandon Nimmo has reached 800 hits in his career.", "Pete Alonso's homer was No. 221 for the first baseman, moving him ahead of Mike Piazza for third place on the franchise’s all-time list."], "ranking": [2, 1]}
{"candidates": ["Ketel Marte's player props start at 1 base hit and 1 total base for the game against the New York Mets on August 29, 2024.", "David Peterson and Ryne Nelson go head to head as we continue our MLB odds series with a Mets-Diamondbacks prediction and pick.", "David Peterson (8-1) with a 2.85 ERA, 1.32 WHIP, 85.1 innings pitched, 66K/37BB,.238 oBA", "Ryne Nelson (9-6) with a 4.29 ERA, 1.28 WHIP, 130 innings pitched, 108K/30BB,.268 oBA", "David Peterson has been good all season. He has been especially good in August, though. Peterson has thrown 31.2 innings this month, allowed just 23 hits, only one homerun, and he has a 1.71 ERA. He has also led the Mets to four straight wins in games he has started.", "Peterson is not much of a strikeout pitcher. However, one thing he does well is get the ground ball. He forces opposing teams to hit the ball on the ground more than half of the time, which is very important for him. The Diamondbacks have the fifth-highest ground ball rate in baseball, so you can expect plenty of balls on the ground this game.", "The Diamondbacks need Ryne Nelson to have one of his good starts in this game. The good news is Nelson has been very good since the beginning of July. In that span, Nelson has made 10 starts and has a record of 4-0. Along with that, Nelson has a 2.62 ERA in 62 innings pitched, 62 strikeouts, and just 47 hits allowed. The Diamondbacks are 8-2 in those 10 starts, as well.", "The Diamondbacks, as mentioned, hit a lot of ground balls. However, they are still second in the MLB in batting average. They are also fifth in the MLB in slugging percentage, ninth in home runs, second in triples, and second in wOBA. Peterson allows opposing hitters to make solid contact a lot, so the Diamondbacks should be able to take advantage of that.", "Eduardo Rodriguez (2-0, 3.94 ERA) will start on the mound for the Diamondbacks, up against Luis Severino (9-6, 3.84 ERA) for the Mets.", "Stats Insider's predictive analytics model gives the Diamondbacks a 52% chance of defeating the Mets at Chase Field.", "The Diamondbacks are 1.5-run favourites against the Mets, with odds of $2.54 available at TAB.", "For the underdog Mets (+1.5) to cover the line, TAB offers odds of $1.50.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Mets (+1.5) are predicted to cover the line 65% of the time, while the 8.5-run over/under is expected to go over 54% of the time.", "The game between the Diamondbacks and Mets at Chase Field is scheduled to start at 11:40am AEST on Thursday."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11, 12, 13, 14, 15]}
{"candidates": ["Geraldo Perdomo reflected on not trusting his instincts, which he believes contributed to the loss.", "Perdomo emphasized the importance of having fun and playing good baseball to get the win.", "Manager Torey Lovullo highlighted the importance of playing good baseball and respecting every opponent.", "Edwin Diaz commented, 'It was a tough loss today. We had it. We have got to keep playing baseball and at the end of the season we’ll see where we are.'", "Carlos Mendoza said he isn’t concerned about his closer, Edwin Diaz, despite recent performances.", "Luis Severino plans to make his next start despite undergoing X-rays on his right foot.", "Mets manager Carlos Mendoza expressed confidence in the team's performance, stating, 'I know we're good. We're up to the competition.'", "Edwin Díaz emphasized the importance of his role, saying, 'This team needs me. So I've got to be ready every single day. I've got to do my job always. Today was a good one, but I just have to keep it going now.'", "D-backs manager Torey Lovullo reflected on missed opportunities, stating, 'We had some opportunities offensively to score some runs and couldn't get the big hit. It happens in this game. We've just got to turn the page.'", "Manager Carlos Mendoza emphasized the importance of the win and the team's resilience.", "Francisco Lindor expressed pure emotion after his home run.", "David Peterson reflected on the importance of Edwin Díaz's performance.", "Edwin Díaz acknowledged the team's need for him to perform well.", "Díaz mentioned the team's proximity to their goals and the importance of upcoming games.", "David Peterson commented on the resilience of the group, emphasizing the importance of moving on from each game.", "Manager Carlos Mendoza expressed pride in the team's performance, especially after the previous night's loss.", "Manager Carlos Mendoza expressed satisfaction with the team's at-bats.", "Jose Iglesias emphasized the importance of putting the ball in play.", "Edwin Díaz highlighted the importance of his performance for the team's playoff hopes.", "Carlos Mendoza stated, 'We’re up to the competition. And now, we’ve got to get ready for another good series.'"], "ranking": [10, 14, 12, 7, 16, 18, 5, 1, 9, 3, 15, 11, 8, 4, 6, 2, 13, 17, 19, 20]}
{"candidates": ["Corbin Carroll stated he is not trying to be the hero but just trying to help the team win every day.", "D-backs manager Torey Lovullo mentioned the team was battling frustration in the middle innings.", "Mets center fielder Brandon Nimmo acknowledged Carroll's performance and noted his home runs were no-doubters.", "Edwin Díaz expressed disappointment, saying 'It’s a tough loss. We had it.'", "Brandon Nimmo acknowledged the uphill battle for the Mets in the wild-card race.", "Luis Severino mentioned he was in a lot of pain but expected to recover.", "Brandon Nimmo emphasized moving forward despite the loss.", "Manager Carlos Mendoza expressed confidence in Edwin Díaz's ability to rebound despite the loss.", "Outfielder Brandon Nimmo acknowledged the uphill battle the Mets face in the Wild Card race."], "ranking": [3, 6, 2, 1, 8, 5, 4, 7, 9]}
{"candidates": ["The D-backs have a 35-14 record since July 1, the best in the Majors in that span.", "The D-backs' 21 wins and +64 run differential since July 29 lead all of baseball."], "ranking": [1, 2]}
{"candidates": ["The game took place at Chase Field in Phoenix, Arizona, with an attendance of 18,425.", "The game lasted 2 hours and 21 minutes."], "ranking": [2, 1]}
{"candidates": ["The Mets bullpen was short-handed due to Dedniel Núñez's unavailability.", "The Mets are four games behind Atlanta in the National League wild-card race."], "ranking": [2, 1]}
{"candidates": ["Texas improved to a record 10-0 on the road this postseason.", "Rangers batters became the first team in Series history with consecutive five-run innings.", "Corey Seager is the first shortstop with three Series homers.", "Texas is the first team in World Series history to score at least five runs in consecutive innings.", "The Rangers also became the first team to score at least five runs with two outs in consecutive innings since Milwaukee accomplished the feat against Montreal in a 1999 regular-season game.", "Corey Seager's two-run homer was the hardest-hit World Series homer in the Statcast era, dating back to 2015.", "Texas Rangers are the first team in major league history to win their first nine road games in one postseason.", "Texas Rangers became the first team in Series history with consecutive five-run innings.", "Texas Rangers improved to a record 10-0 on the road this postseason.", "Corey Seager became the first shortstop with three Series homers."], "ranking": [8, 2, 5, 3, 6, 9, 1, 2, 8, 5]}
{"candidates": ["Diamondbacks second baseman Ketel Marte stretched his record postseason hitting streak to 19 games.", "Corey Seager hit the hardest-hit Fall Classic homer in the Statcast era, dating back to 2015, with a ball leaving his bat at 114.5 mph."], "ranking": [1, 2]}
{"candidates": ["The Texas Rangers hammered the Arizona Diamondbacks in Game 4 of the World Series, 11-7, taking a commanding 3-1 lead in the series.", "Marcus Semien, Corey Seager, and Jonah Heim each homered on the night, with Semien finishing with five RBI.", "The Diamondbacks' bullpen game plan backfired as four different Arizona relievers gave up a run or more.", "Marcus Semien’s two-run triple and three-run homer powered Texas to a 10-run lead by the third inning.", "Corey Seager hit another long home run.", "Jonah Heim added an eighth-inning shot.", "Lourdes Gurriel Jr. hit a three-run homer in the eighth.", "Ketel Marte extended his record postseason hitting streak to 20 games.", "The Rangers scored five runs in the second inning and five in the third inning to go up 10-0.", "The D-backs scored six runs in the final two innings.", "Christian Walker's error in the third inning ended a record run of perfect fielding at the World Series.", "Corey Seager hit a two-run home run in the second inning.", "Marcus Semien homered and had five RBIs in Game 4.", "Luis Frias uncorked a two-out, two-strike wild pitch that scored Josh Jung in the second inning.", "The Rangers scored five runs in the third inning, punctuated by Semien's three-run homer.", "Corey Seager hit a two-run homer and made a sliding stop to start a double play in the eighth inning.", "Max Scherzer combined with four relievers for a strong pitching performance.", "Adolis García threw out Christian Walker at the plate with a stellar throw from right field.", "Jon Gray replaced Scherzer and fired three shutout innings of one-hit ball.", "José Leclerc struck out two in a perfect ninth for his fourth save this postseason.", "Geraldo Perdomo hit an RBI single in the eighth inning.", "Aroldis Chapman struck out Corbin Carroll and Seager started a clutch double play to end the eighth inning threat.", "Marcus Semien's two-run triple and three-run homer powered Texas to a 10-run lead by the third inning.", "Corey Seager hit another long home run.", "Jonah Heim added an eighth-inning shot.", "Lourdes Gurriel Jr hit a three-run homer in the eighth inning for Arizona.", "Gabriel Moreno delivered a two-run single in the ninth inning for Arizona."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]}
{"candidates": ["The Arizona Diamondbacks take on the Texas Rangers in Game 3 of the World Series at Chase Field on Tuesday, commencing at 11:03am AEDT.", "The Diamondbacks will send Brandon Pfaadt (0-0, 2.70 ERA) to the mound, while the Rangers will counter with Max Scherzer (0-1, 9.45 ERA).", "Stats Insider's free betting tips for Diamondbacks vs Rangers, plus the latest betting odds in Australia, are featured in this article.", "Based on advanced machine learning and data, Stats Insider has simulated Tuesday's Arizona-Texas MLB match-up 10,000 times.", "Our leading predictive analytics model is unable to split the two teams, giving both the Diamondbacks and the Rangers an equal 50% chance of winning the game.", "The current betting odds in Australia for Tuesday's MLB game at Chase Field are listed here: Head to Head: Diamondbacks $1.95, Rangers $1.87; Line: Diamondbacks +1.5 ($1.59), Rangers -1.5 ($2.40); Total (Over/Under 9.5 Runs): Over $2.00, Under $1.83.", "According to Stats Insider's analytics model, the Diamondbacks (+1.5) have a 62% chance of covering the line, while the 9.5-run Over/Under has a 54% chance of staying Under.", "Today's Diamondbacks vs Rangers best bets are based on market-leading modelling and betting expertise to help you place better bets with your chosen online bookie.", "The game between the Diamondbacks and Rangers at Chase Field is scheduled to commence at 11:03am AEDT on Tuesday.", "Teams: Arizona Diamondbacks vs Texas Rangers; Date: Tuesday 31 October 2023; Time: 11:03am AEDT; Venue: Chase Field."], "ranking": [10, 8, 6, 5, 4, 3, 2, 9, 7, 1]}
{"candidates": ["The Rangers have been incredible on the road in October, winning 10 straight games away from home this postseason.", "This was the Rangers' sixth postseason game scoring seven or more runs.", "There was a festive mood at Chase Field, where the roof was open for the second straight night and some fans arrived in Halloween costumes.", "Rangers players gathered with their families at the team hotel at 10 a.m. About two dozen children were in costume.", "The Rangers are 10-0 on the road this postseason.", "Despite losing Adolis García to injury, the Rangers have maintained a potent offense.", "The Diamondbacks and Rangers combined for three errorless games to start this year’s World Series, the first time that’s happened.", "The teams committed the fewest errors in the big leagues during the regular season — the D-backs with 56, the Rangers 57.", "This is the first World Series in which neither team has made an error through the first three games.", "Texas rookie Evan Carter became the fourth-youngest player to hit cleanup in a World Series game at 21 years, 62 days.", "This was the first World Series game played at Chase Field since Nov. 4, 2001.", "The Diamondbacks lost for the first time in the World Series at Chase Field.", "There have been 62 previous instances when the World Series was tied 1-1 after Game 2. The Game 3 winner went on to win 41 times.", "There was a festive mood at Chase Field with fans arriving in Halloween costumes.", "The roof was open at Chase Field for the second straight night."], "ranking": [1, 5, 12, 14, 2, 8, 3, 6, 4, 9, 11, 10, 13, 15, 7]}
{"candidates": ["The Rangers remain unbeaten away from home after moving 2-1 ahead against the Arizona Diamondbacks.", "Game four of the seven-game series is in Arizona on Tuesday night.", "Texas Rangers are 9-0 this postseason when scoring first.", "The two teams combined for no errors over the first two games of the series.", "Adolis García is a Gold Glove finalist who has one of the best arms in the big leagues."], "ranking": [3, 5, 1, 4, 2]}
{"candidates": ["Andrew Heaney earned the win by allowing four hits in five innings.", "Six relievers followed, with closer José Leclerc getting the final out.", "García (left oblique) and Scherzer (back spasm) were removed from the Texas roster a day after getting hurt.", "Seager appeared to twist one or both ankles on his home run swing but said he was fine.", "Rangers rookie Evan Carter was hit on the right pinkie by a pitch in the ninth."], "ranking": [3, 5, 2, 4, 1]}
{"candidates": ["Tyler O'Neill hit his 27th home run this season and his 11th career multihomer game, his sixth this year.", "Chicago White Sox reached their 111th loss, nearing the record for most losses since 1900.", "The White Sox extended their franchise record with their 111th loss of the season.", "The White Sox clinched their 19th consecutive series loss."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Rafael Devers broke an 0-for-13 skid with two hits.", "Enmanuel Valdez’s 12-pitch at-bat in the seventh helped set up Ceddanne Rafaela, who clubbed a two-run homer to break a tie and push the Red Sox ahead."], "ranking": [2, 1]}
{"candidates": ["Andrew Vaughn and the Chicago White Sox square off against Jarren Duran and the Boston Red Sox on Saturday at 7:15 p.m. ET at Fenway Park.", "The Red Sox are -201 moneyline favorites in this matchup against the White Sox (+167).", "Boston is the run-line favorite (-1.5).", "The matchup's total is set at 8.5 runs.", "Score Prediction: Red Sox 5, White Sox 3", "Total Prediction: Under 8.5 runs", "Win Probabilities: Red Sox 62%, White Sox 38%"], "ranking": [5, 4, 3, 2, 6, 1, 7]}
{"candidates": ["The Boston Red Sox host the Chicago White Sox at Fenway Park.", "Probable starters: Garrett Crochet, Chicago (3.61 ERA) vs. Cooper Criswell, Boston (4.14 ERA).", "Chicago has had a miserable 2024 season and is on track to break the New York Mets' record for most losses in a single season (120 in 1962).", "The White Sox's struggles have continued with interim manager Grady Sizemore, going 3-20 since he's taken over.", "Crochet has been one of the better pitchers in baseball this year, surprising in his first full season as a starter.", "Boston has been in the playoff mix for much of the season yet enter the weekend on a five-game losing streak.", "A three-game set against the White Sox could help them get back on track, as Rafael Devers and Jarren Duran headline one of the best lineups in baseball.", "The Boston Red Sox will face the Chicago White Sox in MLB action at Fenway Park on Saturday, beginning at 9:10am AEST.", "The Red Sox will send Nick Pivetta (5-10, 4.53 ERA) to the mound, while the White Sox are going with Davis Martin (0-3, 3.62 ERA).", "Based on trusted machine learning and data, Stats Insider has simulated the result of Saturday's Boston vs White Sox MLB match-up 10,000 times.", "Our proven predictive analytics model currently gives the Red Sox a 69% chance of defeating the White Sox at Fenway Park.", "The Red Sox are listed as 1.5-run favourites against the White Sox, with odds of $1.74 available at TAB.", "For the underdog White Sox (+1.5) to cover the line, TAB offers odds of $2.10.", "The over/under for total runs scored is set at 8.5 with TAB, which has odds of $1.91 for the over and $1.91 for the under.", "According to Stats Insider's analytics model, the Red Sox (-1.5) are predicted to cover the line 51% of the time, while the 8.5-run over/under is expected to be an equal 50-50 chance of hitting.", "Today's Red Sox vs White Sox predictions are based on detailed modelling and betting expertise to help you place smarter bets with your chosen online bookie.", "Even though the Red Sox have a higher chance of winning the game, betting on the White Sox to win is our preferred option due to the 2.4% edge identified when comparing our data-driven probabilities to the odds currently available.", "The match-up between the Red Sox and White Sox at Fenway Park is scheduled to start at 9:10am AEST on Saturday.", "Teams: Boston Red Sox vs Chicago White Sox", "Date: Saturday 7 September 2024", "Time: 9:10am AEST", "Venue: Fenway Park"], "ranking": [14, 10, 3, 6, 9, 7, 5, 16, 11, 12, 13, 15, 4, 2, 1, 8, 17, 18, 19, 20, 21, 22]}
{"candidates": ["Manager Alex Cora referred to Trevor Story as the 'quarterback' of the team, emphasizing his importance.", "Trevor Story expressed that his return and contribution to the win meant a lot to him.", "Interim manager Grady Sizemore commented on Garrett Crochet's tough outing and the team's need to play better to stay in games.", "Andrew Vaughn emphasized the importance of showing up every day and working hard for the final stretch of the season."], "ranking": [2, 4, 3, 1]}
{"candidates": ["Alex Cora expressed happiness for Trevor Story's return, emphasizing the hard work Story put in to recover from his injury.", "Cora views Story’s return as a morale boost for the team, one he thinks can rejuvenate the club over the next 21 games.", "Cora referenced retired MLB pitcher Jim Abbott, who was born without a right hand, to highlight Luis Guerrero's achievement of making it to the majors despite physical limitations."], "ranking": [2, 3, 1]}
{"candidates": ["Boston improved to 35-13 when wearing its yellow alternate jerseys.", "The White Sox are nine defeats shy of tying the 1962 New York Mets for the most losses since 1900.", "Chicago has lost 14 of its last 15 games and 44 of 49.", "Boston clinched the season series against the White Sox for the first time since 2019."], "ranking": [2, 4, 1, 3]}
{"candidates": ["Trevor Story is expected to play shortstop moving forward, with Ceddanne Rafaela moving to second base.", "Luis Guerrero, a 2021 17th-round pick, was added to the active roster, overcoming physical limitations from knee surgery.", "Rich Hill was designated for assignment to make room for Guerrero on the roster."], "ranking": [2, 1, 3]}
{"candidates": ["White Sox 3B Miguel Vargas returned after missing two games with a right eye abrasion.", "Red Sox RHP Isaiah Campbell was recalled from Worcester and placed on the 60-day Injured list with right elbow inflammation.", "Boston optioned INF Mickey Gaspar to Triple-A Worcester to make room for Trevor Story on the active roster."], "ranking": [2, 3, 1]}
{"candidates": ["Anthony Santander hit his 42nd home run of the season."], "ranking": [1]}
{"candidates": ["Anthony Santander hit a game-ending two-run homer with two outs in the ninth inning, his 42nd longball of the season.", "Casey Schmitt tied the game at 3-all with a single off Seranthony Domínguez in the top of the ninth.", "Michael Conforto hit his 18th home run, giving San Francisco a 2-0 lead in the top half of the fourth inning.", "Adley Rutschman had an RBI double and Jackson Holliday drove in two runs with a two-out single to complete a three-run fourth for Baltimore.", "Anthony Santander hit a walk-off home run in the bottom of the ninth inning to secure a 5-3 win for the Orioles.", "Seranthony Domínguez blew the save in the top of the ninth inning, allowing the Giants to tie the game.", "Gregory Soto induced a double play to end the top of the ninth inning after replacing Domínguez.", "Jackson Holliday hit a single in the fourth inning that drove in two runs, giving the Orioles a 3-2 lead.", "Anthony Santander hit a two-run home run in the bottom of the ninth, giving the Orioles a 5-3 win.", "Anthony Santander's 42nd homer of the season saved the Orioles after Domínguez blew the save in the 9th.", "Michael Conforto had three hits, including a homer, and the San Francisco Giants frustrated the host Baltimore Orioles again, winning 5-3 on Wednesday night.", "Mike Yastrzemski hit a home run for the second consecutive night.", "Casey Schmitt drove in two runs for the Giants.", "Hayden Birdsong won for the first time in six decisions, ending a winless drought of more than 1 1/2 months.", "Tyler Rogers and Ryan Walker each worked a perfect inning in relief, with Walker notching his eighth save.", "Yastrzemski hit a leadoff home run for the second night in a row, this time his 17th long ball of the season.", "The Giants scored three runs in the fourth inning to take a 4-2 lead.", "San Francisco stretched the lead to 5-2 on Conforto’s 17th homer in the sixth.", "Ryan O’Hearn’s RBI double in the sixth closed the gap to 5-3, but Giants reliever Erik Miller came on and stranded two runners on base.", "Baltimore loaded the bases with two outs in the seventh against Sean Hjelle, but didn’t convert."], "ranking": [1, 5, 8, 10, 2, 14, 16, 11, 3, 6, 18, 12, 15, 7, 9, 13, 4, 17, 19, 20]}
{"candidates": ["The Orioles took a 5-3 loss to the Giants at Camden Yards.", "San Francisco will be seeking a three-game sweep in Thursday’s finale.", "Baltimore has lost for the ninth time in 12 games.", "Orioles starter Dean Kremer allowed five runs (four earned) on seven hits (including two home runs) over six innings.", "Ryan O’Hearn hit a two-out RBI double on the first pitch delivered by left-hander Erik Miller."], "ranking": [3, 5, 2, 4, 1]}
{"candidates": ["Logan Webb and Zach Eflin are the projected starters for the game.", "Logan Webb has a season record of 12-10 with a 3.53 ERA and 1.24 WHIP.", "Zach Eflin has a season record of 10-9 with a 3.55 ERA and 1.13 WHIP.", "Logan Webb's last start was against the San Diego Padres, where he pitched 4 innings and allowed 4 runs.", "Zach Eflin's last start was against the Detroit Tigers, where he pitched 6.2 innings and allowed 1 run.", "Logan Webb has a 4.30 ERA in 16 road starts this season.", "Zach Eflin has a 2.63 ERA in 10 home starts this season.", "Analysts predict that the Orioles will win the game.", "The projected starting pitcher for San Francisco is Logan Webb, who is 12-10 with a 3.53 ERA and a 1.24 WHIP over 193.2 innings pitched this year. Webb has allowed at least three earned runs in four straight starts.", "The projected starting pitcher for Baltimore is Zach Eflin, who is 10-9 with a 3.55 ERA and a 1.13 WHIP over 154.2 innings pitched this season. Eflin has allowed one earned run or fewer in four of his last five starts.", "The Giants have lost seven of their last eight road games against AL East opponents following a win.", "The Orioles have won four of their last five-day games against National League opponents following a loss.", "The Giants have failed to cover the run line in each of their last six-day games against AL East opponents following a win.", "The Orioles have covered the run line in four of their last five games as favorites against NL West opponents following a loss."], "ranking": [14, 10, 11, 13, 12, 8, 9, 7, 5, 6, 3, 4, 2, 1]}
{"candidates": ["Anthony Santander expressed the importance of staying positive and together as a team.", "Orioles manager Brandon Hyde highlighted the win as a needed victory and recorded his 400th career victory.", "Giants manager Bob Melvin reflected on the team's effort and noted they fell just an at-bat short.", "The Orioles' win dropped their magic number to clinch any postseason spot to 5.", "The Orioles have a five-game lead over the Tigers and Twins for the third wild card spot with nine games to play.", "The Orioles have a three-game lead over the Royals for the top wild card position."], "ranking": [5, 2, 4, 1, 3, 6]}
{"candidates": ["Rookie outfielder Colton Cowser mentioned the team will continue to take it one pitch at a time and try to stack good at-bats together.", "Manager Brandon Hyde noted that the team created more traffic and walked more, but is waiting for some breaks offensively."], "ranking": [2, 1]}
{"candidates": ["Baltimore has gone 42-35 in home games and 84-68 overall. The Orioles have the eighth-ranked team ERA in the AL at 3.96.", "San Francisco is 33-41 on the road and 74-78 overall. The Giants have a 33-60 record in games when they have given up a home run.", "Anthony Santander is second on the Orioles with 67 extra base hits (24 doubles, two triples and 41 home runs). Cedric Mullins is 7-for-34 with three home runs and six RBI over the past 10 games.", "Heliot Ramos has a.266 batting average to lead the Giants, and has 21 doubles, two triples and 21 home runs. Tyler Fitzgerald is 10-for-37 with an RBI over the last 10 games.", "LAST 10 GAMES: Orioles: 2-8,.190 batting average, 4.75 ERA, outscored by 30 runs. Giants: 5-5,.223 batting average, 3.16 ERA, outscored opponents by nine runs.", "INJURIES: Orioles: Ramon Urias: 10-Day IL (ankle), Ryan Mountcastle: 10-Day IL (wrist), Grayson Rodriguez: 15-Day IL (lat), Jordan Westburg: 10-Day IL (hand), Jorge Mateo: 60-Day IL (elbow), Danny Coulombe: 60-Day IL (elbow), Kyle Bradish: 60-Day IL (ucl sprain), Tyler Wells: 60-Day IL (elbow), John Means: 60-Day IL (elbow), Felix Bautista: 60-Day IL (elbow). Giants: Kyle Harrison: 15-Day IL (shoulder), Robbie Ray: 15-Day IL (hamstring), Wilmer Flores: 60-Day IL (knee), Randy Rodriguez: 15-Day IL (elbow), Keaton Winn: 60-Day IL (elbow), Jung Hoo Lee: 60-Day IL (labrum), Tom Murphy: 60-Day IL (head).", "The Orioles moved three games ahead of idle Kansas City for the top AL wild card and pulled within four games of the AL East-leading New York Yankees.", "The Giants were eliminated from playoff contention.", "Orioles' Cedric Mullins received medical attention but remained in the game after a collision.", "Cedric Mullins and Austin Slater collided in the outfield during the ninth inning, but Mullins stayed in the game after being checked by trainers.", "Jordan Westburg and Ramón Urías started rehab assignments at Triple-A Norfolk."], "ranking": [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 11]}
{"candidates": ["Each of the Giants' last four games against AL East opponents has gone OVER the total runs line.", "Twelve of the Orioles' last 14 home games against NL West opponents have gone OVER the total runs line.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Giants' last five road games against American League opponents.", "The 'Inning 1 OVER 0.5 runs' market has hit in each of the Orioles' last three games against National League opponents."], "ranking": [2, 1, 4, 3]}
{"candidates": ["Baltimore Orioles have now dropped 10 consecutive playoff games, moving them up an unfortunate group in baseball history. Only the 2004-2020 Minnesota Twins (18), the 1986-1995 Orioles (13), the 1915-1976 Phillies (11), the 1958-1991 Braves (10) and 1980-1985 Royals (10) have lost 10 consecutive playoff games or more.", "The Kansas City Royals became the first team to lose 100 games and then win a playoff series in a 'normal' season the following year.", "Bobby Witt Jr. became the second player in MLB history to record game-winning RBIs in each of his first two playoff games."], "ranking": [1, 3, 2]}
{"candidates": ["The Kansas City Royals earned a 2-1 victory over the Baltimore Orioles at Oriole Park at Camden Yards.", "Royals pitcher Lucas Erceg celebrated after defeating the Orioles in Game 2 of the Wild Card round.", "Royals right-hander Seth Lugo allowed one run in 4 1/3 innings, surrendering five hits and striking out six batters.", "Orioles outfielder Cedric Mullins hit a solo home run in the fifth inning.", "Royals reliever Angel Zerpa struck out Orioles rookie Colton Cowser and forced Adley Rutschman to ground out in a high-leverage situation.", "Royals regained the lead in the sixth inning when Bobby Witt Jr. legged out an infield single to drive home Kyle Isbel.", "Royals designated hitter Vinnie Pasquantino had an RBI single earlier in the game.", "Royals relievers John Schreiber, Sam Long, Kris Bubic, and Lucas Erceg protected the 2-1 lead, allowing one hit and striking out three batters combined across the final 3 2/3 innings.", "Royals outfielder MJ Melendez made a catch with a 5% catch probability, preventing a potential home run.", "Royals infielder Michael Massey made a diving catch to rob Ryan O’Hearn of a run-scoring single.", "Baltimore Orioles were eliminated from the American League playoffs after being swept by the Kansas City Royals.", "The Orioles were beaten 1-0 and 2-1 in the two games, failing to generate baserunners and/or get the big hit.", "The Royals won two one-run games, 1-0 on Tuesday and 2-1 on Wednesday, to sweep the Baltimore Orioles in the Wild Card round.", "Bobby Witt Jr. delivered the go-ahead single in both games.", "Starting pitching and closer Lucas Erceg played crucial roles in the Royals' victories.", "Bobby Witt Jr. had a significant moment in the sixth inning, hitting a sinker against Yennier Cano, which led to a crucial play.", "Five different relievers for the Royals combined to pitch 4 2/3 scoreless innings, including closer Lucas Erceg who notched his second save of the series.", "Royals outfielder MJ Melendez made a remarkable catch with a 5% catch probability, preventing a potential home run.", "Massey made a diving catch to rob Ryan O'Hearn of a run-scoring single, throwing a strike to first baseman Yuli Gurriel to record the second out of the inning.", "Bobby Witt Jr. hit a tie-breaking hit that proved to be the game winner in both games of the two-game series.", "Yennier Cano was brought in to face Bobby Witt Jr. but was unable to get the job done, resulting in a 2-1, season-ending loss for the Orioles.", "The Orioles have lost 10 straight playoff games, dating back a decade.", "The Orioles lost to the Kansas City Royals with a score of 2-1.", "The Orioles' playoff losing streak extended to 10 games.", "Colton Cowser struck out swinging at a ball that hit him with the bases loaded, missing an opportunity to take the lead."], "ranking": [14, 20, 10, 16, 12, 7, 18, 5, 11, 24, 22, 15, 9, 13, 8, 21, 19, 6, 4, 3, 2, 1, 25, 17, 23]}
{"candidates": ["Bobby Witt Jr. beat out an infield single to drive in the go-ahead run and send the Kansas City Royals into an AL Division Series with a 2-1 victory over the Baltimore Orioles.", "Witt’s RBI single Tuesday in Game 1 plated the only run in a 1-0 victory.", "The Royals left 12 runners on base and got through another close game with a razor-thin margin for error thanks to some masterful managing by Matt Quatraro.", "Orioles went 1 for 13 with runners in scoring position and 5 for 32 combined in the series."], "ranking": [1, 2, 4, 3]}
{"candidates": ["Stats Insider's model gives the Orioles a 57% chance of defeating the Royals.", "The Orioles are 1.5-run favourites against the Royals.", "The over/under for total runs scored is set at 7.5.", "The game between the Orioles and Royals is scheduled to commence at 6:38am AEST on Thursday."], "ranking": [2, 1, 3, 4]}
{"candidates": ["The Orioles' offense failed to show up in the series despite concerns about their pitching.", "Offseason questions for Baltimore include the potential departure of key players like Anthony Santander and Corbin Burnes.", "The Royals' victory was seen as emblematic of their season and showed their legitimate formula to win in the playoffs.", "The Royals are considered a real threat to the New York Yankees in the upcoming ALDS.", "Reliever John Schreiber commented on the collective performance of the bullpen, highlighting the effectiveness of their arsenals.", "Yennier Cano expressed disappointment in not being able to get the job done against Bobby Witt Jr.", "Orioles veteran catcher James McCann reflected on the difficulty of second-guessing individual pitches or swings in close games.", "Manager Brandon Hyde expressed frustration, anger, and disappointment over the loss and the missed opportunities.", "The Orioles will enter the offseason with many questions about how to move forward and address their failures, including building a starting rotation, developing young bats, and stabilizing the bullpen.", "Catcher James McCann commented on the unexpected downfall of the Orioles.", "Orioles manager Brandon Hyde reflected on the winnable nature of the games.", "First baseman Ryan Mountcastle expressed the difficulty of experiencing a similar downfall two years in a row."], "ranking": [9, 7, 1, 2, 8, 10, 6, 3, 5, 4, 11, 12]}
{"candidates": ["Second baseman Michael Massey credited the front office for bringing in experienced veterans with previous playoff experience like Tommy Pham, Yuli Gurriel, Michael Wacha, and Will Smith.", "The Orioles face numerous offseason questions, from the future of manager Brandon Hyde to the possibility of losing pending free-agent starter Corbin Burnes."], "ranking": [1, 2]}
{"candidates": ["The Royals are headed to the American League Divisional Series to face the New York Yankees.", "The Royals went 2-5 against the Yankees this season, losing two of three games in New York from Sept. 9-11.", "The Yankees hold a 9-8 all-time playoff series record against the Royals, but the Royals won the last postseason meeting in 1980.", "The Royals advanced in the playoffs for the first time since 2015.", "The Orioles' offense struggled significantly after Jordan Westburg's injury.", "The Orioles' lineup looked flummoxed and desperate during the series.", "The Orioles' front office and coaches will need to analyze the reasons behind the team's decline."], "ranking": [4, 6, 5, 2, 3, 1, 7]}
{"candidates": ["Orioles' left fielder Colton Cowser struck out despite a pitch hitting him in the left hand in the fifth inning and left the game with pain in his hand.", "The Royals will face Yankees ace Gerrit Cole in the opener of the ALDS."], "ranking": [1, 2]}
{"candidates": ["The Texas Rangers won their first World Series title in their 62-year franchise history.", "Corey Seager won his second World Series MVP award.", "Corey Seager is the first shortstop with three World Series homers.", "Texas improved to 10-0 on the road this postseason.", "Ketel Marte has the longest hitting streak in postseason history at 20 games.", "Corey Seager became just the fourth player ever to win the World Series MVP award twice, alongside hall of famers Reggie Jackson, Sandy Koufax and Bob Gibson.", "Corey Seager became just the fourth player to win multiple World Series MVPs."], "ranking": [1, 2, 3, 5, 6, 4, 7]}
{"candidates": ["Corey Seager hit a two-run homer in the ninth inning of Game 1.", "Adolis García hit a walk-off homer in the 11th inning of Game 1.", "The Rangers had a 10-0 lead after three innings in Game 4 and won 11-7.", "Zac Gallen pitched six hitless innings in Game 6 before giving up a run on three hits.", "Marcus Semien hit a two-run home run.", "Mitch Garver hit a run-scoring single.", "A pivotal ninth-inning error by the Diamondbacks contributed to the Rangers' victory.", "Josh Sborz struck out Ketel Marte to end the game and the Arizona batter's 20-game playoff hit streak.", "Nathan Eovaldi threw six scoreless innings.", "The Texas Rangers won Game 5 of the World Series against the Arizona Diamondbacks with a score of 5-0.", "Corey Seager was named the series MVP for his powerful batting performance.", "The Texas Rangers achieved a 5-0 victory over the Arizona Diamondbacks in Game 5 of the 2023 World Series.", "The Texas Rangers stormed the field to celebrate the team’s first-ever championship.", "Game 5 began as a nailbiter of a pitchers’ duel and became a coronation for the Rangers.", "The Rangers won Game 5 with a 5-0 victory at Chase Field.", "Marcus Semien scored a two-run home run.", "Diamondbacks starting pitcher Zac Gallen did not allow a single hit in the first six innings.", "Corey Seager picked up the Rangers' first hit of the night in the seventh inning.", "Jonah Heim's single in the ninth inning forced an error, allowing Josh Jung and Nathaniel Lowe to score.", "Josh Sborz struck out Ketel Marte to end the game and clinch the title for the Rangers.", "Nathan Eovaldi pitched six gritty innings.", "Mitch Garver broke a scoreless tie with an RBI single in the seventh inning.", "Marcus Semien homered in a four-run ninth inning.", "Corey Seager hit a single to break the no-hitter in the seventh inning.", "Josh Jung and Nathaniel Lowe singled off Paul Sewald to start the ninth inning.", "Jonah Heim’s single scored Jung, and Lowe came all the way around from first base when center fielder Alek Thomas let the ball get past him for an error.", "Semien’s two-run homer made it 5-0.", "Josh Sborz struck out four in 2 1/3 innings of one-hit relief for his first postseason save.", "Ketel Marte's postseason-record hitting streak ended at 20 games.", "The Rangers won the World Series in five games, capped by a 5–0 win in the clincher.", "Corey Seager hit three home runs in the series and was named MVP.", "Marcus Semien hit a home run in the ninth inning of Game 5.", "Nathan Eovaldi allowed nine baserunners but let none of them score in Game 5.", "The Rangers scored four runs in the ninth inning of Game 5."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]}
{"candidates": ["Nathan Eovaldi pitched six scoreless innings to help secure the Rangers' victory.", "Marcus Semien hit a ninth-inning home run in Game 5.", "Corey Seager broke Zac Gallen's no-hitter in the seventh inning.", "Adolis García hit a walk-off home run in Game 1.", "Zac Gallen held a no-hitter into the seventh inning.", "Paul Sewald allowed three consecutive singles in the ninth inning, leading to two runs for the Rangers.", "Corey Seager and Marcus Semien each homered early in an 11-7 rout of the Arizona Diamondbacks in Game 4.", "Christian Walker ended a record run of perfect fielding at the World Series in the third inning.", "The Rangers scored five runs in the inning, punctuated by Semien’s three-run homer that put them up 10-0.", "The Texas Rangers won game five 5-0 to clinch a 4-1 series victory over the Arizona Diamondbacks.", "Marcus Semien hit a two-run home run in the ninth inning.", "Mitch Garver’s RBI single in the seventh inning opened the scoring.", "Corey Seager claimed the Rangers' first hit of the night after six innings without one against Diamondbacks starter Zach Gallen.", "Nathan Eovaldi threw six scoreless innings and the bullpen completed the job.", "Corey Seager broke up Zac Gallen's no-hit bid with a leadoff single in the seventh inning.", "Seager scored the deciding run on a single from Mitch Garver.", "Seager hit a two-run homer off closer Paul Sewald in Game 1.", "Adolis García hit a walk-off homer in the 11th inning of Game 1.", "Seager hit a two-run homer in the third inning of Game 3."], "ranking": [10, 12, 8, 2, 9, 14, 5, 16, 1, 11, 15, 7, 6, 4, 3, 13, 17, 18, 19]}
{"candidates": ["Chris Young, the Texas general manager, emphasized the importance of recruiting the right people.", "Bruce Bochy was hired as the manager after a three-year hiatus.", "Mike Maddux was hired as the pitching coach.", "Dayton Moore was hired as the front-office consigliere.", "Nathan Eovaldi was signed after a breakfast meeting with Will Venable.", "Marcus Semien and Corey Seager were signed as free agents for a combined $500 million."], "ranking": [5, 4, 3, 2, 1, 6]}
{"candidates": ["Nathan Eovaldi expressed his desire to come out on top in critical games, reflecting on his past World Series experience.", "Nathan Eovaldi tries to close out the third all-wild card World Series on Wednesday night against Zac Gallen in a rematch of Game 1 starters.", "The Rangers are favorites to win the World Series at -1700 odds, according to FanDuel Sportsbook."], "ranking": [2, 1, 3]}
{"candidates": ["Diamondbacks manager Torey Lovullo expressed determination to continue climbing the mountain and staying at the top for a long time.", "Zac Gallen expressed his willingness to sacrifice personal accolades for the team's success.", "Christian Walker reflected on the team's effort and expressed no regrets despite the outcome.", "Marcus Semien expressed his emotions, stating everything he worked for was for this moment.", "Nathaniel Lowe highlighted the team's strong performance on the road.", "Jonah Heim expressed pride in the team's accomplishment.", "Corey Seager expressed happiness to be part of the team and their effort.", "Bruce Bochy reflected on his blessing to be part of the team and thanked the players.", "Fox EVP, Head of Strategy and Analytics Mike Mulvihill commented on the health of baseball with new pennant winners and champions.", "Bob Thompson, the retired president of Fox Sports Networks, reflected on scheduling and short series as factors in the low audience numbers.", "This year’s World Series between the Rangers and Diamondbacks has been the least-watched in MLB history, renewing concerns about the league’s ability to market itself to a broad audience.", "Manager Bruce Bochy claimed his fourth World Series crown.", "Bochy credited general manager Chris Young and the ownership for their determination to bring winning baseball back to the Texas Rangers.", "Corey Seager expressed his pride in being part of an exclusive group of multiple World Series MVP winners.", "Corey Seager expressed that it was a really special moment.", "Marcus Semien reflected on the importance of the moment and praised Gallen's performance.", "Bruce Bochy expressed his gratitude for being able to get back into baseball and win the World Series.", "Nathan Eovaldi joked about his performance and praised the team's defense.", "Torey Lovullo expressed his disappointment and determination to do better in the future.", "Marcus Semien expressed pride in winning the World Series and playing for his family.", "Damien Semien, Marcus's father, expressed his emotions and pride in his son's achievement.", "Chris Young reflected on the importance of recruiting the right people.", "Max Scherzer commented on the team's journey and their ability to get hot in October.", "Bruce Bochy reflected on his managerial style and the importance of trust."], "ranking": [14, 18, 20, 12, 16, 10, 8, 6, 4, 2, 1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 22, 23, 24]}
{"candidates": ["The Rangers fulfilled the promise they made to one another this spring, achieving their first World Series title.", "Eovaldi delivered a performance he can remember fondly, contrasting with his previous World Series experience.", "Rangers general manager Chris Young expressed empathy for Adolis García and Max Scherzer missing the rest of the World Series due to injuries.", "Bruce Bochy is trying for his fourth World Series title after winning with San Francisco in 2010, 2012 and 2014.", "The series win comes after 63 years of trying and 12 years after they were twice one strike away from winning against the St Louis Cardinals.", "It is a fourth success for manager Bruce Bochy, who won three World Series in charge of the San Francisco Giants – including victory over the Rangers in 2010.", "Corey Seager was named MVP of the 2023 World Series after Texas' 5-0 Game 5 win over the Arizona Diamondbacks.", "Seager's performance included six hits, three homers, six RBIs, and three walks over the five games."], "ranking": [1, 5, 8, 4, 2, 3, 6, 7]}
{"candidates": ["The Diamondbacks had one of baseball's best defenses during the regular season but faltered at key moments in the World Series.", "Christian Walker mishandled a ball that led to a five-run third inning in Game 4.", "Center fielder Alek Thomas overran a ball in the ninth inning of Game 5, allowing a run to score in the four-run inning.", "The Rangers went undefeated in 11 road games during the playoffs.", "The Rangers had previously reached the World Series in 2010 and 2011 but lost both times.", "Arizona pitcher Zac Gallen kept Texas hitless through six innings.", "The Rangers had missed the playoffs in six consecutive losing seasons before this year's title run.", "The 2023 World Series was the least-watched in TV history, averaging 9.11 million viewers.", "Wednesday night's game averaged 11.48 million viewers on Fox, with a peak of 14.27 million viewers for the final three outs.", "The World Series continues to outperform every entertainment program, being the most-watched event four of the five nights.", "The Texas Rangers franchise started as the Washington Senators in 1961 and moved to Texas in 1972.", "The Rangers had some American League Championship success but had never won the World Series until now.", "The Rangers will celebrate with a parade in the Arlington entertainment district near their stadium on Friday.", "The Diamondbacks had a remarkable postseason run that finally fizzled.", "Seager joined Hall of Famers Sandy Koufax, Bob Gibson, and Reggie Jackson as the only players to win two World Series MVP awards.", "Bruce Bochy became the sixth manager to win four titles, joining Casey Stengel, Joe McCarthy, Connie Mack, Walter Alston, and Joe Torre.", "Bochy’s cap, Seager’s helmet, Carter’s batting gloves, Semien’s jersey, and Eovaldi’s spikes are among the World Series memorabilia items being donated to the Hall of Fame.", "The Rangers ended a 62-year drought with their first World Series title.", "The Rangers had more blown saves than recorded saves during the season.", "The Rangers went 15–35 in one-run games last year, the worst such record in baseball.", "The Rangers won Games 4 and 5 by a combined score of 16–7 after losing Scherzer and Adolis García to injuries."], "ranking": [18, 15, 14, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 16, 17, 13, 19, 20, 21]}
{"candidates": ["The Rangers lost 102 games two years ago and 94 in 2022 before their turnaround.", "The game remained close until the top of the ninth inning.", "Games 2 and 3 were the least-watched Fall Classic games on record, according to Nielsen.", "The three-game average of 8.48 million is on pace to become the least-viewed Series ever.", "The Rangers went through the entire postseason unbeaten in 11 games on the road.", "The Texas Rangers won their first World Series championship in franchise history by defeating the Arizona Diamondbacks 4-1 in the series.", "Seager joined Hall of Famers Sandy Koufax, Bob Gibson, and Reggie Jackson as players with multiple World Series MVPs."], "ranking": [6, 2, 5, 4, 3, 1, 7]}
{"candidates": ["Rich Hill has officially pitched in each of the last 20 major-league seasons, the only player to do so."], "ranking": [1]}
{"candidates": ["Ernie Clement's RBI double in the top of the 6th inning, giving the Blue Jays a 1-0 lead with 2 outs.", "Bowden Francis held Boston hitless through 5 1/3 innings.", "Nick Sogard blooped a soft single to center, ending the no-hit bid.", "Francis allowed just one hit, striking out five and walking none before leaving in the middle of the seventh with a 2-0 lead.", "Genesis Cabrera gave up one hit in the eighth and Chad Green pitched the ninth to complete the two-hit shutout.", "The Blue Jays took the lead in the third when Brian Serven doubled and scored on Vladimir Guerrero Jr.’s double.", "They made it 2-0 in the sixth on back-to-back doubles from Addison Barger and Ernie Clement.", "The Red Sox just missed a triple play in the ninth when Leo Jimenez bunted the ball in the air with runners on first and second.", "Bowden Francis took a no-hitter into the sixth and left after allowing just one hit in seven innings.", "The Toronto Blue Jays beat the Boston Red Sox 2-0.", "Jarren Duran reached on an error in the fourth and was thrown out trying to steal second.", "Chad Green earns the save for the Blue Jays against the Red Sox on August 29, 2024.", "Bowden Francis took a no-hitter into the sixth inning.", "Bowden Francis pitched seven shutout innings with five strikeouts.", "Vladimir Guerrero Jr. hit an RBI double in the third inning.", "Ernie Clement hit an RBI double in the sixth inning.", "Bowden Francis dominated the Red Sox, allowing only two hits and striking out multiple batters.", "Kutter Crawford pitched well, allowing two runs on six hits and two walks over 6 2/3 innings.", "Rich Hill made his season debut and pitched a clean eighth inning with two groundouts and a strikeout.", "Bowden Francis held Boston hitless through 5 1/3 innings.", "Vladimir Guerrero Jr. doubled to right, scoring Serven in the 3rd inning.", "Ernie Clement doubled to left, scoring Barger in the 6th inning.", "Brayan Bello threw eight shutout innings and Tyler O'Neill cranked a two-run homer as the Boston Red Sox blanked the Toronto Blue Jays 3-0.", "Bowden Francis is coming off a near-no-hitter last Saturday against the Los Angeles Angels. His bid for the second no-hitter in franchise history was spoiled when Taylor Ward led off the ninth inning with a home run."], "ranking": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]}
{"candidates": ["Brayan Bello allowed just two hits and a walk while striking out nine over eight scoreless innings in a dominant 3-0 victory.", "Bello got an early lead thanks to Jarren Duran, who led off with a single and eventually scored on a Wilyer Abreu single.", "Tyler O'Neill crushed a two-run homer for insurance and Kenley Jansen closed it out."], "ranking": [1, 3, 2]}
{"candidates": ["Bowden Francis hopes to finish August strong when he takes the mound for the series finale against the Boston Red Sox at Fenway Park on Thursday night.", "Francis will face a stiffer test against the Red Sox, who are three games back of a wild-card spot after beating Toronto the past two games.", "The Red Sox start struggling righty Kutter Crawford, who has a 7.30 ERA in five starts in August.", "The Boston Red Sox host the Toronto Blue Jays on Thursday.", "Boston has a 69-64 record overall and a 31-37 record at home.", "The Red Sox have a 53-8 record in games when they have more hits than their opponents.", "Toronto has gone 31-37 in road games and 65-70 overall.", "Blue Jays hitters have a collective.312 on-base percentage, the seventh-ranked percentage in the AL.", "The teams meet Thursday for the 10th time this season. The Red Sox are ahead 6-3 in the season series.", "Rafael Devers leads the Red Sox with 28 home runs while slugging.571.", "Jarren Duran is 14-for-35 with five doubles, five home runs and seven RBI over the last 10 games.", "Daulton Varsho has 19 doubles, seven triples and 16 home runs for the Blue Jays.", "George Springer is 8-for-40 with a double and five home runs over the past 10 games.", "Red Sox: 4-6,.220 batting average, 4.24 ERA, outscored by 13 runs in the last 10 games.", "Blue Jays: 7-3,.251 batting average, 3.48 ERA, outscored opponents by 15 runs in the last 10 games."], "ranking": [12, 9, 8, 15, 11, 6, 10, 7, 5, 4, 3, 2, 1, 13, 14]}
{"candidates": ["Blue Jays manager John Schneider praised Bowden Francis, saying, 'He’s got such a good way about him — mentally, physically, execution-wise. His pitch mix is awesome.'", "Francis reflected on his performance, stating, 'I felt a little more fatigued warming up. It’s one of those outings where you’ve got to fight through it and be crafty.'", "Manager John Schneider praised Francis for his control and pitch mix.", "Bowden Francis reflected on his approach to pitching and his recent success.", "Brian Serven commented on Francis' efficiency and control.", "Rich Hill was extremely emotional after the game, discussing the work it took to get back to the majors and his determination to help the Red Sox in the stretch run.", "Manager Alex Cora praised Bowden Francis for his tough pitching and Rich Hill for his outstanding job."], "ranking": [6, 5, 4, 3, 2, 1, 7]}
{"candidates": ["Brayan Bello expressed his excitement and focus after realizing he would pitch the eighth inning.", "Bello emphasized the importance of winning the game to keep moving forward in their playoff push.", "Manager Alex Cora praised Bello's control and pitch selection during the game."], "ranking": [2, 1, 3]}
{"candidates": ["The game was 44-year-old Rich Hill's 2024 debut, making him the only active player to have appeared in each of the last 20 seasons.", "The Blue Jays earned a split of the four-game series against the Red Sox."], "ranking": [1, 2]}
{"candidates": ["The win helped the Red Sox pull within three games of the third wild-card spot as the Minnesota Twins lost on Wednesday."], "ranking": [1]}
{"candidates": ["Blue Jays LF Joe Loperfido was removed after colliding with the Green Monster making the catch on Triston Casas' fly ball in the seventh.", "Red Sox manager Alex Cora said INF Trevor Story will start a rehab assignment soon, perhaps next week.", "3B Rafael Devers missed his third straight game due to shoulder soreness and will DH for a couple of games before playing the field on Sunday.", "Nick Sogard was called up as David Hamilton headed to the injured list with a fractured left index finger.", "Rafael Devers is expected to return to the lineup Friday and serve as designated hitter the next two days.", "Liam Hendriks could rejoin the Red Sox as soon as next weekend with a fifth rehab outing scheduled for Friday with Triple-A Worcester.", "Pitching Probables: Blue Jays: Bowden Francis (7-3, 4.02 ERA, 1.07 WHIP, 70 strikeouts); Red Sox: Kutter Crawford (8-11, 4.19 ERA, 1.09 WHIP, 138 strikeouts).", "BETMGM SPORTSBOOK: LINE Red Sox -142, Blue Jays +120; over/under is 9 runs.", "Injuries: Red Sox: David Hamilton: day-to-day (finger), Luis Garcia: 15-Day IL (elbow), Lucas Sims: 15-Day IL (lat), James Paxton: 60-Day IL (leg), Cam Booser: 15-Day IL (elbow), Bryan Mata: 60-Day IL (hamstring), Garrett Whitlock: 60-Day IL (oblique), Trevor Story: 60-Day IL (shoulder), Liam Hendriks: 60-Day IL (elbow), Chris Murphy: 60-Day IL (elbow), Lucas Giolito: 60-Day IL (elbow).", "Injuries: Blue Jays: Alek Manoah: 60-Day IL (elbow), Jordan Romano: 60-Day IL (elbow), Bo Bichette: 10-Day IL (calf)."], "ranking": [6, 8, 5, 7, 4, 3, 2, 1, 9, 10]}
